{
  "topic": "Abraham Lincoln",
  "title": "Abraham Lincoln",
  "slug": "abraham-lincoln",
  "grokipedia_slug": "Abraham_Lincoln",
  "grokipedia_url": null,
  "source": "generated",
  "content": "# Abraham Lincoln\n\n# Abraham Lincoln\n\n## Overview\nAbraham Lincoln, the 16th President of the United States, served from March 4, 1861, until his assassination on April 15, 1865. Widely regarded as one of America's greatest leaders, Lincoln is best known for leading the nation through the American Civil War, preserving the Union, and issuing the Emancipation Proclamation, which marked a pivotal step toward the abolition of slavery. Born into poverty in a log cabin in Kentucky, Lincoln rose to prominence through self-education, a career in law, and a dedication to public service. His presidency is often associated with themes of unity, equality, and perseverance during one of the most divisive periods in American history [Biography.com](https://www.biography.com/political-figures/abraham-lincoln).\n\n## Historical Background\n### Early Life\nAbraham Lincoln was born on February 12, 1809, in a one-room log cabin near Hodgenville, Kentucky. His parents, Thomas and Nancy Hanks Lincoln, were frontier farmers, and young Abraham grew up in a life of hardship. After the death of his mother when he was nine, Lincoln's father remarried Sarah Bush Johnston, who encouraged his love for learning despite limited formal education. As a young man, Lincoln moved with his family to Indiana and later Illinois, working various jobs, including as a rail-splitter and store clerk, while educating himself through borrowed books [History.com](https://www.history.com/topics/us-presidents/abraham-lincoln).\n\n### Political Rise\nLincoln entered politics in 1832, running unsuccessfully for the Illinois General Assembly. He later won a seat in 1834 as a member of the Whig Party, serving four terms. During this time, he also studied law and was admitted to the bar in 1836, establishing a successful legal practice in Springfield, Illinois. Lincoln married Mary Todd in 1842, with whom he had four sons, though only one, Robert, survived to adulthood. His early political career focused on economic issues like infrastructure development, but his views on slavery evolved over time, becoming a central theme of his later years [National Park Service](https://www.nps.gov/liho/learn/historyculture/index.htm).\n\nIn 1846, Lincoln was elected to the U.S. House of Representatives, where he served one term and opposed the Mexican-American War, a stance that was unpopular in his district. After returning to law, he re-entered politics in the 1850s amid growing tensions over slavery. Joining the newly formed Republican Party in 1856, Lincoln gained national attention during the 1858 Lincoln-Douglas Debates, a series of seven debates against Democratic Senator Stephen A. Douglas. Though he lost the Senate race, his eloquent arguments against the expansion of slavery elevated his profile [Smithsonian Magazine](https://www.smithsonianmag.com/history/lincoln-douglas-debates-150-years-ago-180970114/).\n\n### Presidency and Civil War\nLincoln was elected president in 1860, winning with a plurality of the popular vote and a majority in the Electoral College, though he was not on the ballot in most Southern states. His victory, rooted in opposition to slavery's expansion, prompted seven Southern states to secede before his inauguration, forming the Confederate States of America. The Civil War began on April 12, 1861, with the Confederate attack on Fort Sumter [Library of Congress](https://www.loc.gov/collections/abraham-lincoln-papers/articles-and-essays/lincolns-presidency/).\n\nLincoln's primary goal was to preserve the Union, initially downplaying emancipation to avoid alienating border states. However, as the war progressed, he issued the Emancipation Proclamation on January 1, 1863, declaring enslaved people in Confederate-held territories to be free. While it did not immediately end slavery—its enforcement depended on Union military advances—it redefined the war as a fight for freedom and allowed African Americans to enlist in the Union Army [National Archives](https://www.archives.gov/exhibits/featured-documents/emancipation-proclamation).\n\nLincoln's leadership during the war was tested by military setbacks, political opposition, and personal tragedy, including the death of his son Willie in 1862. Nevertheless, key Union victories, such as the Battle of Gettysburg in 1863, bolstered his resolve. His Gettysburg Address, delivered on November 19, 1863, redefined the war's purpose as a test of democracy and a \"new birth of freedom\" [Gettysburg Foundation](https://www.gettysburgfoundation.org/gettysburg-address). Lincoln was re-elected in 1864, and in his second inaugural address, he urged reconciliation \"with malice toward none, with charity for all.\"\n\n### Assassination\nDays after the Confederate surrender at Appomattox on April 9, 1865, Lincoln was assassinated by John Wilkes Booth, a Confederate sympathizer, on April 14, 1865, while attending a play at Ford's Theatre in Washington, D.C. He died the following morning, becoming the first U.S. president to be assassinated. His death shocked the nation and cast a shadow over the early Reconstruction period [Ford's Theatre](https://www.fords.org/lincolns-assassination/).\n\n## Current Status and Relevance\nAbraham Lincoln remains a towering figure in American history, symbolizing unity, emancipation, and democratic ideals. His legacy is commemorated through numerous memorials, including the Lincoln Memorial in Washington, D.C., dedicated in 1922, which serves as a site for civil rights advocacy, most notably during Martin Luther King Jr.'s \"I Have a Dream\" speech in 1963 [National Park Service - Lincoln Memorial](https://www.nps.gov/linc/index.htm). Lincoln's image appears on the U.S. penny and the five-dollar bill, reflecting his enduring cultural significance.\n\nHis policies and writings, particularly the Emancipation Proclamation and the Gettysburg Address, continue to be studied for their impact on civil rights and governance. However, Lincoln's legacy is not without critique; some historians argue he prioritized Union over immediate abolition and note his complex views on race, including early support for colonization of freed African Americans [The Atlantic](https://www.theatlantic.com/magazine/archive/2012/02/what-lincoln-meant-to-the-slaves/308873/). Despite these debates, Lincoln's role in shaping modern America remains central to historical discourse.\n\n## Notable Facts and Details\n- **Self-Education**: Lincoln had less than one year of formal schooling but taught himself through voracious reading, mastering subjects like law and Euclidean geometry [History.com](https://www.history.com/topics/us-presidents/abraham-lincoln).\n- **Height**: At 6 feet 4 inches, Lincoln was the tallest U.S. president in history, a physical trait often noted in descriptions of his presence.\n- **Wrestling**: As a young man, Lincoln was an accomplished wrestler, reportedly losing only one match in over 300 contests [National Wrestling Hall of Fame](https://nwhof.org/hall_of_fame/bio/128).\n- **13th Amendment**: Lincoln championed the passage of the 13th Amendment, ratified after his death in 1865, which abolished slavery nationwide [National Constitution Center](https://constitutioncenter.org/the-constitution/amendments/amendment-xiii).\n- **Personal Losses**: Lincoln endured significant personal tragedy, losing three of his four children during his lifetime and struggling with bouts of depression, often referred to as \"melancholy\" by contemporaries.\n\n## Related Topics\n- **American Civil War**: The defining conflict of Lincoln's presidency, fought from 1861 to 1865 between the Union and the Confederacy over issues of slavery and states' rights.\n- **Emancipation Proclamation**: Lincoln's 1863 executive order declaring freedom for enslaved people in Confederate territories, a turning point in the war.\n- **Gettysburg Address**: A brief but profound speech delivered by Lincoln in 1863, emphasizing democracy and national unity.\n- **Reconstruction**: The post-war period Lincoln began to plan for, focusing on reintegrating Southern states and addressing the status of freed African Americans.\n- **John Wilkes Booth**: The actor and Confederate sympathizer who assassinated Lincoln, marking a tragic end to his presidency.\n\n## References\n- [Biography.com - Abraham Lincoln](https://www.biography.com/political-figures/abraham-lincoln)\n- [History.com - Abraham Lincoln](https://www.history.com/topics/us-presidents/abraham-lincoln)\n- [National Park Service - Lincoln Home](https://www.nps.gov/liho/learn/historyculture/index.htm)\n- [Smithsonian Magazine - Lincoln-Douglas Debates](https://www.smithsonianmag.com/history/lincoln-douglas-debates-150-years-ago-180970114/)\n- [Library of Congress - Lincoln's Presidency](https://www.loc.gov/collections/abraham-lincoln-papers/articles-and-essays/lincolns-presidency/)\n- [National Archives - Emancipation Proclamation](https://www.archives.gov/exhibits/featured-documents/emancipation-proclamation)\n- [Gettysburg Foundation - Gettysburg Address](https://www.gettysburgfoundation.org/gettysburg-address)\n- [Ford's Theatre - Lincoln's Assassination](https://www.fords.org/lincolns-assassination/)\n- [National Park Service - Lincoln Memorial](https://www.nps.gov/linc/index.htm)\n- [The Atlantic - Lincoln and Slavery](https://www.theatlantic.com/magazine/archive/2012/02/what-lincoln-meant-to-the-slaves/308873/)\n- [National Wrestling Hall of Fame - Lincoln's Wrestling](https://nwhof.org/hall_of_fame/bio/128)\n- [National Constitution Center - 13th Amendment](https://constitutioncenter.org/the-constitution/amendments/amendment-xiii)",
  "external_references": [],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:16:09.399553",
  "elapsed_ms": 122338
}