{
  "topic": "Buddhism",
  "title": "Buddhism",
  "slug": "buddhism",
  "grokipedia_slug": "Buddhism",
  "grokipedia_url": "https://grokipedia.com/page/Buddhism",
  "source": "grokipedia",
  "content": "# Buddhism\n\nBuddhism is a major world religion and philosophical tradition that originated in ancient India around the sixth century BCE, founded by Siddhartha Gautama, a prince of the Shakya clan who lived his early life in Kapilavastu, the capital in the Himalayan foothills around the modern India-Nepal border regions, who achieved enlightenment around the 5th century BCE in Bodh Gaya, India, at age 35 following six years of ascetic practice and became known as the Buddha (\"Enlightened One\"). It centers on the **Four Noble Truths**—that life involves suffering (dukkha), suffering arises from craving and attachment, suffering can be ended, and the path to its cessation is the **Noble Eightfold Path**—which guides ethical conduct, mental discipline, and wisdom to attain **nirvana**, the liberation from the cycle of rebirth (samsara) driven by **karma** (the law of cause and effect from one's actions). Unlike theistic religions, Buddhism is non-theistic, emphasizing personal responsibility and the Dharma (the Buddha's teachings) without reliance on a creator deity or divine intervention.\n\nThe Buddha taught for 45 years across northern India, rejecting aspects of prevailing Brahmanism such as caste distinctions and animal sacrifices, and his insights were preserved in oral traditions before being compiled into texts like the **Pali Canon** (Tipitaka), the foundational scripture for Theravada Buddhism. After his death around 80 years old, his followers formed the monastic **Sangha** community, which played a key role in disseminating the teachings. Buddhism spread rapidly through Central and Southeast Asia via merchants, pilgrims, and missionaries, reaching China by the second century CE, where it flourished during the Tang Dynasty (618–907 CE) and adapted to local cultures, influencing art, philosophy, and governance.\n\nToday, Buddhism encompasses diverse schools, including **Theravada** (prevalent in Sri Lanka, Thailand, and Myanmar, focusing on individual enlightenment), **Mahayana** (dominant in East Asia, emphasizing compassion and the bodhisattva ideal of delaying nirvana to aid others), and **Vajrayana** (in Tibet and Mongolia, incorporating tantric practices and rituals). As of 2020, there were approximately 324 million Buddhists worldwide, representing about 4% of the global population, with the largest concentrations in Asia-Pacific countries like China, Thailand, and Japan, though its influence extends globally through meditation practices and secular adaptations. Core practices include meditation, ethical precepts (such as non-violence and right livelihood), and devotion in some traditions, fostering a path to alleviate suffering through insight into impermanence, no-self (anatta), and interdependence.\n## Etymology and Definitions\n\n### Etymology\n\nThe term \"Buddha\" derives from the Sanskrit and Pali verbal root *budh*, meaning \"to awaken,\" \"to know,\" or \"to understand,\" forming a past participle that denotes one who has awakened to enlightenment. This root traces back to the Proto-Indo-European (PIE) *bʰewdʰ-*, signifying \"to be awake\" or \"to be aware,\" which also underlies cognates in other Indo-European languages, such as English \"bid\" (to offer or command, implying awareness). Closely related is \"Bodhi,\" the Sanskrit term for awakening or enlightenment, directly from the same root *budh* (or *budhi* in some forms), referring to the profound insight achieved under the Bodhi tree.\n\nIn early Buddhist texts, the tradition is often called *Buddhadharma* or \"the dharma of the Buddha,\" combining \"Buddha\" with *dharma* to signify the teachings of the awakened one, a usage that evolved from the Pali *Dhammavinaya* (the doctrine and discipline) in the Buddha's time to broader scriptural references in Sanskrit canons. As Buddhism spread beyond India, the term adapted to local languages: in Chinese, it became *Fójiào* (佛教), where *Fó* transliterates \"Buddha\" from Middle Chinese phonetic approximations introduced via Silk Road translations around the 1st century CE, and *jiào* means \"teaching.\" In Japanese, it is *Bukkyō* (仏教), derived from Sino-Japanese readings of the same Chinese characters, with *Butsu* for \"Buddha\" and *kyō* for \"teaching,\" reflecting its transmission from China in the 6th century CE. In Tibetan, the tradition is termed *sangs rgyas kyi chos*, literally \"the dharma of the fully awakened one,\" where *sangs rgyas* (Buddha) combines *sangs* (\"purified\" or \"cleared away\") and *rgyas* (\"expanded\" or \"developed\"), introduced during the 8th-century imperial adoption of Indian texts.\n\nAmong key terms, *Dharma* originates from the Sanskrit root *dhṛ*, meaning \"to hold,\" \"to uphold,\" or \"to maintain,\" evolving to denote both cosmic law and the Buddha's teachings as that which sustains truth and ethical order. This PIE root *dʰer-*, \"to hold firmly,\" connects to Indo-European concepts of support and stability, seen in Latin *firmus* (firm). *Saṃsāra*, meaning \"wandering\" or \"cyclic passage,\" derives from Sanskrit *sam* (\"together\" or \"complete\") prefixed to *sar* (\"to flow,\" \"to go,\" or \"to course\"), implying perpetual motion through realms of existence. Its PIE antecedent *ser- (\"to flow\") links to words like English \"serpent,\" evoking fluid, unending change. *Nirvāṇa* (Pali *nibbāna*) comes from Sanskrit *nir* (\"out\" or \"without\") and *vā* (\"to blow\"), literally \"blowing out\" or \"extinction,\" as of a flame, symbolizing the cessation of defilements; some interpretations tie it to *vṛ* (\"to cover\"), but the primary sense is quenching. These adaptations in non-Indic languages often preserved phonetic elements while integrating local philosophical nuances, such as emphasizing communal practice in East Asian forms.\n\n### Definitions and Scope\n\nBuddhism is a dharmic religious and philosophical tradition originating in ancient India, centered on the teachings attributed to Siddhartha Gautama, known as the Buddha, who lived around the sixth–fifth centuries BCE. It emphasizes the analysis of suffering (dukkha), its origins, cessation, and the practical paths leading to enlightenment and liberation, often framed as a systematic approach to understanding and transcending the human condition through ethical conduct, meditation, and wisdom. As one of the major world religions, it encompasses diverse schools and practices but maintains a core soteriological orientation toward ending the cycle of rebirth (saṃsāra) and attaining nirvāṇa, a state of ultimate freedom from suffering.\n\nThe scope of Buddhism is notably non-theistic, rejecting the notion of a creator deity or eternal divine intervention in worldly affairs, in contrast to many theistic traditions. Instead, it posits that reality operates through impersonal principles such as causality and interdependence, with salvation arising from individual insight and effort rather than divine grace. This distinguishes it from Hinduism, which often incorporates a creator god (Īśvara) and affirms an eternal self (ātman) that persists across rebirths; Buddhism explicitly denies such an unchanging essence, viewing all phenomena as impermanent and lacking inherent selfhood (anattā). Its doctrinal boundaries thus prioritize empirical investigation of the mind and ethical living over ritualistic worship or dependence on supernatural beings, though it acknowledges various deities and spirits within a cosmological framework subordinate to natural laws.\n\nScholars have long debated Buddhism's categorical status, questioning whether it qualifies primarily as a religion, a philosophy, or a way of life. Proponents of its religious character highlight its rituals, communal practices, and metaphysical commitments, such as the pursuit of transcendent states, arguing that it fulfills definitional criteria for religion even without a personal god. Others emphasize its philosophical dimensions, including rigorous ethical reasoning and epistemological methods akin to those in Western philosophy, positioning it as a non-dogmatic system for personal transformation. This ambiguity has fueled the rise of secular Buddhism in modern contexts, which strips away supernatural elements like rebirth to focus on mindfulness and ethics as accessible tools for well-being, thereby broadening its inclusivity for non-religious practitioners in diverse, scientifically oriented societies.\n\nIn contemporary classifications, Buddhism is recognized as one of the world's major religions, predominantly in Asia but with growing communities elsewhere. This reflects its enduring influence as a tradition that adapts to cultural contexts while preserving its foundational emphasis on alleviating universal suffering.\n\n## The Buddha and Origins\n\n### Life of Siddhartha Gautama\n\nSiddhartha Gautama, later known as the Buddha, was born c. 563 BCE according to the traditional long chronology, or c. 480 BCE according to the short chronology favored by many modern scholars, in Lumbini, in present-day Nepal, to King Śuddhodana, the ruler of the Śākya clan, a Kshatriya oligarchic republic in the Himalayan foothills. His mother, Queen Māyā, died seven days after his birth, and he was raised by her sister Mahāprajāpatī. Traditional accounts in the Pāli Canon describe his early life as sheltered within the palace in Kapilavastu, where he married Yaśodharā and fathered a son, Rāhula, enjoying a life of luxury until the age of 29. Archaeological evidence supporting his birthplace includes Emperor Aśoka's pillar at Lumbini, erected in the 3rd century BCE, which bears an inscription stating that Aśoka visited the site as the Buddha's birthplace and reduced local taxes in honor of it.\n\nAt age 29, Siddhartha encountered the \"four sights\"—an old man, a sick man, a corpse, and an ascetic—which prompted his renunciation of worldly life to seek an end to suffering. He left his palace, cut his hair, and adopted the robes of a wandering ascetic, studying under teachers such as Āḷāra Kālāma and Uddaka Rāmaputta before practicing extreme austerities for six years, including fasting and meditation in the forests near the Neranjara River. These practices, drawn from accounts in the Pāli suttas, left him emaciated but ultimately convinced him that neither indulgence nor self-mortification led to liberation, leading him to adopt the \"middle way.\" Scholarly analysis of the Pāli Canon suggests that while hagiographic elements exist, core biographical details like the renunciation and ascetic period align with the socio-religious context of 6th-century BCE northern India.\n\nFollowing his awakening at age 35 under the Bodhi tree in Bodh Gaya, Siddhartha spent the next 45 years teaching across the Ganges plain, establishing the Saṅgha monastic community and attracting followers from various social strata. He attained parinirvāṇa, or final death, at age 80 c. 483 BCE according to the traditional long chronology, or c. 400 BCE according to the short chronology favored by many modern scholars, in Kuśinagar (modern Kushinagar, India), reclining between two śāla trees after a final meal of pork or mushrooms, as recounted in the Mahāparinibbāna Sutta. His body was cremated, and the relics were divided into eight portions among various clans, republics, a kingdom, and a brahmin group to be enshrined in stūpas, with the dividing urn retained by the brahmin Doṇa, a practice corroborated by later Aśokan distributions of relics in the 3rd century BCE.\n\nThe historicity of Siddhartha's life is supported by a combination of textual and archaeological evidence, though exact dates remain debated between the \"long chronology\" (c. 566–486 BCE) and \"short chronology\" (c. 480–400 BCE), with the latter favored by many scholars based on correlations with the reigns of kings like Ajātasattu. Aśoka's pillars and inscriptions at sites like Lumbini and references to Kuśinagar in his edicts provide the earliest epigraphic confirmation of key locations from the Buddha's biography, dating to about two centuries after his death. Textual analysis of the Pāli suttas indicates that while later strata include legendary expansions, the basic outline of his life—birth in the Śākya territory, renunciation, teaching career, and death—reflects authentic historical elements preserved in oral traditions committed to writing by the 1st century BCE.\n\n### Enlightenment and Early Teachings\n\nAfter renouncing his princely life, Siddhartha Gautama practiced severe austerities for six years but found them unfruitful, leading him to adopt a middle path of moderation. He then sat in meditation under the Bodhi tree at Uruvela (modern Bodh Gaya), vowing not to rise until achieving enlightenment. During the first watch of the night, he recollected his past lives in detail; in the middle watch, he gained the divine eye, seeing the rebirth of beings according to their karma; and in the final watch, he fully realized the Four Noble Truths and dependent origination, eradicating the taints and attaining arahantship. He reflected, \"Rebirth is ended; the spiritual journey has been completed; what had to be done has been done; there is nothing further for this place.\"\n\nFollowing his awakening, the Buddha hesitated to teach, considering the Dhamma profound and difficult to grasp, but encouraged by Brahmā Sahampati, he decided to share it. He journeyed to the Deer Park at Isipatana (modern Sarnath) near Varanasi, where his former five ascetic companions resided. There, he delivered his first discourse, the *Dhammacakkappavattana Sutta* (\"Setting the Wheel of Dhamma in Motion\"), to these mendicants, condemning the extremes of indulgence and self-mortification while introducing the middle way embodied in the noble eightfold path. This teaching marked the inception of the Buddha's dissemination of the Dhamma, with two disciples, Koṇḍañña and Vappa, attaining the vision of Dhamma upon hearing it.\n\nThe first sermon catalyzed the formation of the Saṅgha, the monastic community. Soon after, at Uruvela, the Buddha ordained his first disciple beyond the five ascetics: Yasa, a wealthy young man disillusioned by sensual pleasures, who achieved arahantship and was followed by his four friends (Vimala, Subāhu, Puṇṇaji, and Gavampati), bringing the total to eleven arahants. Further ordinations of fifty young men from prominent families swelled the group to sixty-one arahants, including the Buddha. The Buddha then instructed these sixty to wander and teach the Dhamma for the welfare of many, prohibiting travel in pairs and emphasizing proclamation to gods and humans alike, thus establishing the early missionary Sangha.\n\nEarly propagation faced challenges from skeptics and rival traditions. One notable encounter occurred at Pāvārika's mango grove near Nāḷandā, where Upāli, a wealthy Jain lay follower and debater, challenged the Buddha on the relative gravity of bodily versus mental actions, defending Jain views that physical deeds were paramount. Through similes illustrating the power of intent—such as a psychic's mental destruction of a city—the Buddha demonstrated the supremacy of mental volition, leading Upāli to abandon Jainism, take refuge in the Triple Gem, and declare his allegiance publicly. As the Sangha grew, the Buddha established monastic rules incrementally in response to emerging issues, beginning with basic precepts like non-violence and truthfulness, formalized in the early Pātimokkha to maintain harmony and discipline among monks.\n\n## Core Worldview\n\n### Four Noble Truths\n\nThe Four Noble Truths (Pali: *cattāri ariyasaccāni*) constitute the core doctrinal framework of Buddhism, presenting a diagnostic analysis of human experience and its transcendence as taught by the Buddha in his first public discourse following enlightenment. These truths address the nature of suffering, its cause, its cessation, and the path leading to that cessation, functioning analogously to a medical treatise where suffering is the disease, craving its etiology, nirvana its cure, and the Noble Eightfold Path its prescribed treatment. They are termed \"noble\" because their full realization confers spiritual nobility upon the practitioner, transforming ordinary perception into liberating insight.\n\nThe first noble truth, the truth of suffering (*dukkha*), asserts that suffering pervades conditioned existence in various forms. It encompasses birth, aging, illness, death, sorrow, lamentation, pain, grief, and despair; association with the disliked and separation from the liked; and the failure to obtain what is desired. In summary, the five aggregates of clinging—form, feeling, perception, volitional formations, and consciousness—are suffering. This truth identifies three principal types of suffering: ordinary suffering (*dukkha-dukkha*), which includes overt physical and mental pains such as injury or distress; suffering due to change (*vipariṇāma-dukkha*), arising from the impermanence of pleasant experiences that inevitably alter or end; and conditioned suffering (*saṅkhāra-dukkha*), the subtle unsatisfactoriness inherent in all conditioned phenomena due to their fabricated and impermanent nature. The duty associated with this truth is comprehensive understanding.\n\nThe second noble truth, the truth of the origin of suffering (*samudaya*), identifies craving (*taṇhā*) as the root cause, which fuels the cycle of rebirth and perpetuates discontent. Craving manifests in three forms: sensual craving (*kāma-taṇhā*), desire for sensory pleasures; craving for existence (*bhava-taṇhā*), attachment to continued being or states of becoming; and craving for non-existence (*vibhava-taṇhā*), aversion leading to desires for annihilation or escape. This craving, accompanied by delight and attachment, gives rise to renewed existence and binds beings to suffering. The duty here is abandonment of this craving through insight and restraint.\n\nThe third noble truth, the truth of the cessation of suffering (*nirodha*), describes the complete fading away and extinguishing of craving, resulting in dispassion, cessation, and release without remainder. This unbinding, known as nirvana, represents the end of the influxes of craving and the termination of suffering's cycle, attainable in this very life through the eradication of its causes. The duty is direct realization of this cessation as a lived experience.\n\nThe fourth noble truth, the truth of the path leading to the cessation of suffering (*magga*), outlines the Noble Eightfold Path as the practical method for achieving liberation. This path comprises right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration, integrated as a holistic discipline of ethical conduct, mental development, and wisdom. It provides the means to cultivate the insight necessary for ending craving and realizing nirvana. The duty is diligent development of this path.\n\nThese truths were first articulated in the Dhammacakkappavattana Sutta (\"Setting the Wheel of the Dhamma in Motion\"), delivered by the Buddha at the Deer Park in Sarnath near Varanasi to his five former ascetic companions, marking the inception of the Sangha with the enlightenment of the elder Kondañña. The teaching appears consistently across early Buddhist texts, including the Saṃyukta Āgama and Madhyama Āgama parallels in Chinese translations, as well as in discourses like the Saccavibhaṅga Sutta (MN 141), with minor variations in phrasing but uniform emphasis on the truths' structure and duties. The Four Noble Truths are intertwined with dependent origination, the causal principle explaining how ignorance and craving condition suffering's arising and cessation.\n\n### Three Marks of Existence\n\nThe Three Marks of Existence, known in Pali as *tilakkhaṇa*, represent fundamental characteristics of all conditioned phenomena in early Buddhist teachings, providing insight into the nature of reality and the roots of suffering. These marks—impermanence (*anicca*), unsatisfactoriness (*dukkha*), and non-self (*anattā*)—are not abstract concepts but observable truths that underpin the universality of suffering and guide practitioners toward liberation through direct realization. They are emphasized in the Pali Canon as essential for developing wisdom, particularly in insight meditation (*vipassanā*), where contemplatives examine phenomena to see their transient, stressful, and impersonal qualities.\n\n*Anicca*, or impermanence, asserts that all conditioned things arise, persist briefly, and inevitably cease, with no eternal or unchanging entities in existence. This applies universally to physical forms, mental states, and the five aggregates (*khandhas*)—form, feeling, perception, mental formations, and consciousness—which are in constant flux due to their dependent arising. The Buddha taught this in suttas such as the *Cūḷasīhanāda Sutta* (MN 11), stating, \"All conditioned things are impermanent; when one sees this with wisdom, one turns away from suffering,\" highlighting how recognizing impermanence dispels attachment to stability. In insight practice, meditators contemplate *anicca* to undermine the illusion of permanence, fostering detachment from sensory experiences that seem enduring but are marked by origination and dissolution.\n\nBuilding on impermanence, *dukkha* denotes the inherent unsatisfactoriness or stress intrinsic to all conditioned existence, arising because nothing impermanent can provide lasting fulfillment or security. This mark encompasses both overt suffering, such as pain and loss, and subtler forms, like the unease of clinging to transient phenomena, as the five aggregates are unreliable and subject to decay. In the *Sabbāsava Sutta* (MN 2), the Buddha links *dukkha* to impermanence: \"Whatever has the nature of arising, all that has the nature of ceasing,\" implying that the ceaseless change of conditioned things generates inevitable frustration when grasped as sources of happiness. Through meditation, realizing *dukkha* reveals the pervasive stress in samsaric existence, supporting the first Noble Truth by evidencing suffering's conditioned origins without delving into its cessation.\n\n*Anattā*, or non-self, teaches that there is no permanent, independent self or soul underlying phenomena; instead, what is taken as \"self\" is merely a conventional designation for the impermanent and unsatisfactory five aggregates. None of these aggregates—form (*rūpa*), feeling (*vedanā*), perception (*saññā*), mental formations (*saṅkhāra*), or consciousness (*viññāṇa*)—can be identified as a true self, as they are uncontrollable, subject to change, and empty of inherent essence. This doctrine is central to the *Anattalakkhaṇa Sutta* (SN 22.59), the Buddha's second discourse, where he instructs his first five disciples: \"Form is not self. If form were the self, this form would not lend itself to disease. It would occur to one: 'May my form be thus. May my form be not thus.'\" Contemplating *anattā* in meditation erodes ego-clinging, exposing the aggregates as processes rather than a fixed entity, thus universalizing suffering as rooted in misidentification rather than individual fault.\n\n### Saṃsāra, Rebirth, and Karma\n\nSaṃsāra refers to the endless cycle of birth, death, and rebirth in which sentient beings are trapped due to ignorance and craving, perpetuating conditioned existence across various realms. In early Buddhist teachings, this process is described as \"wandering-on,\" an ongoing activity of creating and entering worlds, leading to repeated suffering through birth, aging, illness, and death. The cycle encompasses six realms of existence—gods (deva), demigods (asura), humans, animals, hungry ghosts (preta), and hells (naraka)—each characterized by specific forms of experience determined by prior actions.\n\nRebirth occurs not through the migration of a permanent soul but via the transfer of consciousness propelled by karmic forces, maintaining continuity of psychophysical processes without an enduring self. In the Pali Canon, this is illustrated as consciousness arising anew in a subsequent existence based on the momentum of volitional activities from previous lives, such as in the Madhupiṇḍika Sutta where unwholesome intentions lead to rebirth in lower realms. Some traditions, particularly Tibetan Buddhism, introduce the bardo as an intermediate state lasting up to 49 days between death and rebirth, during which the consciousness, influenced by unresolved karma, encounters visions and is drawn toward a new form of existence.\n\nKarma, or kamma in Pali, denotes intentional actions (cetana) of body, speech, and mind that produce corresponding results (vipāka), shaping future experiences and rebirth destinations. The Buddha emphasizes that \"intention, I tell you, is kamma. Intending, one does kamma by way of body, speech, and intellect,\" highlighting volition as the key determinant of an action's ethical quality (AN 6.63). Wholesome actions, rooted in non-greed, non-hatred, and non-delusion—such as generosity and harmlessness—yield positive vipāka like rebirth in higher realms, while unwholesome actions driven by the three poisons result in suffering and lower rebirths, as detailed in the Cūḷakammavibhaṅga Sutta (MN 135).\n\nThe six realms illustrate karmic outcomes and transitions between states. The deva realm features long-lived beings enjoying pleasures from past merits, yet impermanent and prone to attachment; asuras experience jealousy-fueled conflicts despite their power; humans balance joy and sorrow, enabling ethical practice; animals endure instinctual suffering and exploitation; pretas suffer insatiable cravings leading to torment; and naraka involves acute agony from aggression, all as vipāka of specific karmas like generosity versus killing. Transitions occur as karma ripens, with beings moving between realms until exhausted, as exemplified in the Jātaka tales, which recount the Buddha's past lives—such as rebirth as a deer fleeing hunters due to prior unskillful actions or as a king rewarding virtue—to demonstrate how intentions accumulate across existences. These narratives from the Khuddaka Nikāya underscore karma's role in causing dukkha within saṃsāra, without implying eternal punishment.\n\n### Liberation and Nirvana\n\nIn Buddhism, nirvana represents the unconditioned state of ultimate liberation from saṃsāra, the cycle of suffering and rebirth, achieved through the complete cessation of craving (taṇhā), ignorance (avijjā), and the conditions that perpetuate existence. This state is characterized as a profound peace (santi), free from the afflictions of greed, hatred, and delusion, yet it remains ineffable, beyond conventional descriptions of existence or nonexistence, as it transcends all dualities and limitations.\n\nEarly Buddhist texts in the Pāli Canon describe nirvana using vivid metaphors drawn from everyday experiences, such as the \"unbinding\" (nibbāna) of a fire that has consumed its fuel, releasing the mind from the burning aggregates of form, feeling, perception, formations, and consciousness. This extinguishing evokes a sense of coolness (sīta), symbolizing relief from the \"fires\" of passion, aversion, and delusion, as illustrated in suttas where the Buddha compares the liberated mind to embers that have cooled completely, unbound and at ease. Such imagery underscores nirvana as the resolution of all fabrications (saṅkhāra), the highest bliss without residue of suffering.\n\nThe realization of nirvana unfolds progressively through four stages of awakening, each eradicating specific fetters that bind one to saṃsāra. The sotāpanna (stream-enterer) breaks the first three fetters—self-view, doubt, and attachment to precepts—entering the irreversible stream to nirvana, destined for liberation within seven lifetimes at most. The sakadāgāmī (once-returner) further weakens sensual desire and ill will, returning to the human realm only once more. The anāgāmī (non-returner) eliminates these lower fetters entirely, attaining nirvana in the higher pure abodes without descending to lower realms. Full enlightenment as an arahant eradicates all ten fetters, including conceit and ignorance, realizing nirvana in this life; upon death, parinirvāṇa follows as the final unbinding, with no further rebirth or conditioned existence.\n\nIn Mahāyāna traditions, nirvana is reinterpreted as non-abiding (apratiṣṭhita-nirvāṇa), a dynamic state that neither rejects saṃsāra nor clings to isolated peace, enabling buddhas and advanced bodhisattvas to manifest compassionately for the welfare of all beings while abiding in ultimate freedom. This view, articulated in texts like the Diamond Sūtra, emphasizes arousing the bodhisattva aspiration without abiding in forms, sounds, or concepts of self, person, or sentient being, thus liberating others into nirvana without conceptual residue.\n\nNirvana is attained through direct insight into the Four Noble Truths, discerning the arising and cessation of suffering, which dispels ignorance and craving at their root. Far from annihilation, it is a transcendent freedom, the unborn and unmade reality beyond all conditioned phenomena, offering supreme ease and release. The Noble Eightfold Path supports this realization by integrating ethical conduct, concentration, and wisdom.\n\n### Dependent Origination\n\nDependent Origination, known in Pali as *paṭiccasamuppāda* and in Sanskrit as *pratītyasamutpāda*, refers to the Buddhist doctrine of conditioned co-arising, which describes the interdependent causal processes underlying the arising and cessation of suffering (*dukkha*). This principle posits that all phenomena arise in dependence upon multiple causes and conditions, without a singular first cause or independent creator, emphasizing the relational and impermanent nature of existence. The doctrine serves as a foundational explanation for the cycle of saṃsāra, illustrating how ignorance initiates a chain of events leading to rebirth and suffering, while its comprehension enables liberation by revealing the path to cessation.\n\nThe twelve links of Dependent Origination form a sequential chain that elucidates this process, typically presented in the forward direction to show origination and in reverse to demonstrate cessation:\n\n1. **Ignorance (*avijjā*)**: Delusion or lack of insight into the Four Noble Truths, which conditions the subsequent links by obscuring reality.\n2. **Formations (*saṅkhāra*)**: Volitional activities or karmic impulses arising from ignorance, including mental, verbal, and physical actions that propel future existence.\n3. **Consciousness (*viññāṇa*)**: Rebirth-consciousness that descends into a new existence, conditioned by prior formations and mutually dependent with the next link.\n4. **Name-and-form (*nāmarūpa*)**: The psychophysical organism comprising mentality (name) and materiality (form), which arises interdependently with consciousness to establish the basis of experience.\n5. **Six sense bases (*saḷāyatana*)**: The faculties of eye, ear, nose, tongue, body, and mind, enabling interaction with the world.\n6. **Contact (*phassa*)**: The meeting of sense base, sense object, and consciousness, generating sensory experience.\n7. **Feeling (*vedanā*)**: Pleasant, unpleasant, or neutral sensations arising from contact.\n8. **Craving (*taṇhā*)**: Thirst or desire for sensory pleasures, existence, or non-existence, triggered by feeling.\n9. **Clinging (*upādāna*)**: Attachment or grasping at objects, views, rites, or self-doctrine, fueled by craving.\n10. **Becoming (*bhava*)**: The process of existential formation or karmic preparation for rebirth.\n11. **Birth (*jāti*)**: The arising of a new psycho-physical being in a particular realm.\n12. **Aging and death (*jarāmaraṇa*)**: Decay, death, sorrow, and lamentation, culminating in the mass of suffering.\n\nIn the forward progression, ignorance conditions formations, which in turn lead through consciousness and subsequent links to birth, aging, and death, perpetuating the cycle of suffering across lifetimes. This chain lacks a primordial beginning, operating as an endless loop driven by mutual conditioning, such as the interdependence between consciousness and name-and-form. The primary textual basis appears in the *Mahānidāna Sutta* (DN 15) of the Dīgha Nikāya, where the Buddha expounds the doctrine to Ānanda, emphasizing its role in understanding transmigration and achieving freedom from it. Further elaboration occurs in the Nidāna Saṃyutta of the Saṃyutta Nikāya.\n\nAbhidharma traditions, particularly in the Theravāda school's Abhidhamma Piṭaka, provide detailed analytical interpretations, classifying the links into three lifetimes—past (ignorance and formations), present (consciousness to becoming), and future (birth and aging-death)—and exploring 24 modes of conditionality in the *Paṭṭhāna*. These texts, including Buddhaghosa's *Visuddhimagga*, underscore the doctrine's application to karmic processes without positing an eternal self.\n\nThe reverse order of Dependent Origination illustrates cessation: with the ending of ignorance, formations cease; this propagates backward, halting craving, clinging, and ultimately aging and death, leading to nirvana as the unconditioned state beyond suffering. Insight into this chain, cultivated through wisdom, reverses the process by eradicating defilements at their roots, as detailed in Abhidharma analyses where momentary extinction of links occurs via meditative discernment. This mechanism interconnects with karma and rebirth by showing how volitional formations generate the conditions for future existence, while their cessation severs the cycle.\n\n### Anattā, Emptiness, and Key Mahāyāna Concepts\n\nIn early Buddhism, the doctrine of *anattā* (not-self) teaches that there is no permanent, inherent self or soul underlying the person, but rather the individual is a transient combination of the five aggregates (*pañcakkhandhā*): form (*rūpa*), feeling (*vedanā*), perception (*saññā*), mental formations (*saṅkhāra*), and consciousness (*viññāṇa*). Each aggregate is characterized by impermanence (*anicca*), suffering (*dukkha*), and not-self, lacking any independent essence, as they arise and cease through dependent origination. Meditation on impermanence (*aniccānupassanā*) plays a central role in realizing *anattā*, as practitioners contemplate the aggregates' constant flux to dismantle attachment to a false sense of self, thereby alleviating suffering.\n\nThis foundational notion of *anattā* evolves in Mahāyāna philosophy into the more expansive doctrine of *śūnyatā* (emptiness), particularly through Nāgārjuna's Madhyamaka school, which posits that all phenomena (*dharmas*) lack inherent existence (*svabhāva*), existing only through interdependent arising (*pratītyasamutpāda*). Emptiness does not imply nihilism or mere non-existence but rather the absence of fixed, independent essence in all things, allowing for their conventional functionality while revealing their ultimate interdependence. Nāgārjuna articulates this via the two truths: the conventional truth (*saṃvṛti-satya*), which accepts everyday phenomena and social conventions as they appear, and the ultimate truth (*paramārtha-satya*), discerned through insight into emptiness, leading to liberation.\n\nKey Mahāyāna concepts build on emptiness by introducing *tathāgatagarbha* (Buddha-nature), the innate potential for enlightenment present in all sentient beings, often described as a luminous, pure essence akin to the *dharmakāya* (truth body) that underlies reality. This doctrine emphasizes non-duality (*advaya*), transcending distinctions between self and other, samsāra and nirvāṇa, as all phenomena share in this universal, empty-yet-luminous nature obscured by ignorance. Such views affirm that enlightenment is not an external acquisition but the realization of an intrinsic capacity, fostering compassion through recognition of shared Buddha-nature across beings.\n\nA significant development within Mahāyāna is the Yogācāra school's *cittamātra* (mind-only) doctrine, which asserts that all phenomena are manifestations of consciousness, with no independent external objects, structured through three natures: the imagined (*parikalpita*, illusory projections), the dependent (*paratantra*, conditioned arising of mind), and the perfected (*pariniṣpanna*, non-dual awareness of emptiness). This contrasts with Theravāda's realist Abhidharma framework, which accepts an external world of momentary *dharmas* and limits consciousness to six types without a foundational storehouse (*ālayavijñāna*) to explain karmic continuity. Yogācāra's emphasis on transforming consciousness via insight into its non-dual nature thus extends *anattā* and *śūnyatā* into a psychological idealism, prioritizing mental purification over Theravāda's direct analysis of impermanent phenomena.\n\n## Foundational Elements\n\n### The Three Jewels\n\nThe Three Jewels, also known as the Triple Gem or Ti-ratana, form the foundational refuge in Buddhism, consisting of the Buddha, the Dhamma, and the Sangha. These elements represent the awakened teacher, the teachings, and the community of practitioners, respectively, serving as the secure basis for spiritual development and liberation from suffering. Taking refuge in them marks a commitment to the Buddhist path, distinguishing adherents from non-Buddhists and guiding ethical and meditative practice.\n\nThe Buddha, as the first Jewel, refers to Siddhartha Gautama, the historical figure who attained enlightenment and became the exemplar of awakening. He is revered as the worthy one, perfectly self-awakened, consummate in knowledge and conduct, and the unexcelled trainer of individuals and gods. Traditional accounts describe the Buddha as possessing thirty-two major marks of a great man (mahāpurusa-lakkhana), physical characteristics signifying his supreme destiny, such as level soles on his feet marked with thousand-spoked wheel imprints, a golden-hued body, a lion-like jaw, and a protuberance on the crown of his head (uṣṇīṣa). These marks, enumerated in the Lakkhaṇa Sutta of the Dīgha Nikāya, arise from meritorious deeds in past lives and confirm his role either as a universal monarch or a fully enlightened Buddha.\n\nThe Dhamma, the second Jewel, encompasses both the Buddha's teachings and the universal truth or natural law (dhamma) that he realized. It is described as well-expounded by the Buddha, visible in the present life, immediately effective, inviting inspection, and leading onward, to be realized by the wise through direct experience. This eternal law includes principles like the Four Noble Truths and the law of karma, providing the practical path to end suffering by cultivating insight into reality.\n\nThe Sangha, the third Jewel, denotes the community of the Buddha's noble disciples who have attained at least the first stage of enlightenment, such as stream-enterers (sotāpanna), and are worthy of gifts, hospitality, and respect. In the Theravāda tradition, it specifically comprises the four pairs of noble persons—those on the path to and those who have attained the four stages of awakening—who practice the Dhamma well and embody its fruits. In Mahāyāna Buddhism, the Sangha extends to include the bodhisattva community, encompassing advanced practitioners who vow to attain buddhahood for the benefit of all beings, emphasizing compassion and the welfare of others alongside personal liberation.\n\nTaking refuge involves reciting the traditional formula: \"Buddhaṃ saraṇaṃ gacchāmi\" (I go for refuge to the Buddha), \"Dhammaṃ saraṇaṃ gacchāmi\" (I go for refuge to the Dhamma), and \"Saṅghaṃ saraṇaṃ gacchāmi\" (I go for refuge to the Sangha), typically repeated three times. This act signifies formal conversion to Buddhism, fostering ethical conduct by orienting one's life toward these ideals and serving as the basis for undertaking precepts. For lay practitioners, refuge is often taken recurrently, such as daily before meditation or during ceremonies, while monastics incorporate it into ordination and intensive practice, sometimes using a variant like \"I surrender myself to the Buddha, Dhamma, and Sangha.\" In Mahāyāna contexts, refuge recitation may invoke the bodhisattva Sangha, aligning with the broader aspiration to universal buddhahood.\n\n### Buddhist Cosmology\n\nBuddhist cosmology delineates a vast, cyclical universe composed of innumerable world systems, each structured around a central axis and divided into multiple realms of existence. This framework, derived from early scriptures and systematized in Abhidharma texts, portrays the cosmos not as a static creation but as an impermanent aggregation of elements subject to arising and dissolution, influencing the conditions for sentient beings' rebirths across planes. The model serves as a metaphorical and doctrinal tool to illustrate interdependence and the path to liberation, rather than a literal scientific map.\n\nAt the heart of each world system lies Mount Meru, envisioned as a colossal, golden mountain rising 84,000 yojanas (approximately 672,000 miles) high, forming the axis mundi of the universe. Surrounding Meru are concentric rings of seven golden mountains and intervening seas, culminating in a vast iron-ringed ocean that encircles the entire system. Within this ocean float four principal continents, aligned to the cardinal directions: Jambudvīpa to the south, the human abode characterized by a jambu tree (rose apple) and diverse terrains; Purvavideha to the east; Aparagodaniya to the west; and Uttarakuru to the north, where beings enjoy effortless abundance. Each continent is flanked by two sub-continents, with Jambudvīpa serving as the focal point for Buddhist teachings due to its balanced conditions for ethical practice and enlightenment.\n\nThe cosmos is hierarchically organized into three realms, totaling 31 planes of existence, where beings are reborn according to their karma and meditative attainments. The lowest is the Desire Realm (kāmaloka), encompassing 11 planes dominated by sensory pleasures and sufferings, including the four woeful states (hells, animals, hungry ghosts, and asuras), humans, and six deva heavens. Above it lies the Form Realm (rūpaloka) with 16 planes, inhabited by beings in subtle, luminous bodies derived from form-sphere jhanas, ranging from Brahma's retinue to the highest Pure Abodes reserved for non-returners. The apex is the Formless Realm (arūpaloka), comprising four planes of pure consciousness without form, such as the sphere of infinite space and neither-perception-nor-non-perception, attained through formless jhanas. Rebirth across these realms underscores the transient nature of existence, with no permanent heaven or hell.\n\nTemporal cosmology unfolds in immense cycles called kalpas, or eons, marking the universe's phases of formation (vivarta-kalpa), duration (vivarta-sthaya-kalpa), destruction (samvarta-kalpa), and emptiness (samvarta-sthaya-kalpa), each spanning billions of years in metaphorical terms like the time to erode a cubic mountain with a silk cloth. A full mahakalpa, comprising 80 intermediate kalpas, represents one complete world cycle, during which conditions for life evolve and devolve. Buddhas arise periodically within fortunate eons, such as the current bhadrakalpa, to rediscover and propagate the Dharma when it has been forgotten, with five predicted in this aeon including the historical Buddha and the future Metteyya.\n\nTheravada cosmology, rooted in Pali Abhidhamma, maintains a singular, Mount Meru-centered world system with the 31 planes as the core structure, emphasizing individual liberation within samsara. In contrast, Mahayana traditions expand this by incorporating myriad buddha-lands or pure realms, such as Sukhavati under Amitabha, where devotees can be reborn through faith and aspiration, prioritizing collective enlightenment over a unified cosmic geography. These doctrinal models profoundly shape Buddhist visual arts, notably mandalas—geometric diagrams symbolizing the universe's mandala-like structure with Mount Meru at the center, directional guardians, and layered realms—to facilitate meditation and visualization of enlightenment's path.\n\n## Paths to Liberation\n\n### Noble Eightfold Path\n\nThe Noble Eightfold Path, also known as the Middle Way, constitutes the fourth of the Four Noble Truths and serves as the practical framework for attaining liberation from suffering in Buddhism. It comprises eight interconnected factors designed to cultivate ethical conduct, mental discipline, and wisdom, guiding practitioners toward the cessation of craving and ignorance. This path was first expounded by the Buddha in his initial sermon, the Dhammacakkappavattana Sutta, where it is presented as the direct means to end dukkha, or suffering, by fostering insight into reality.\n\nThe path is organized into a threefold division, reflecting a progressive yet interdependent training: sīla (ethical discipline), samādhi (concentration), and paññā (wisdom). Under sīla fall right speech, right action, and right livelihood, which establish moral integrity by promoting harmless communication, ethical behavior, and a vocation that avoids exploitation. Samādhi encompasses right effort, right mindfulness, and right concentration, developing mental focus through diligent prevention of unwholesome states and sustained awareness of body, feelings, mind, and phenomena. Paññā includes right view and right intention, the cognitive foundation involving comprehension of the Four Noble Truths and commitment to renunciation, goodwill, and harmlessness. These categories are not strictly sequential but mutually reinforcing, with ethical foundations enabling deeper concentration, which in turn sharpens wisdom to dismantle the roots of suffering.\n\nSymbolized by the Dharma wheel (dharmachakra), whose eight spokes represent the path's factors, the Noble Eightfold Path illustrates interdependence and momentum, akin to a wheel rolling forward to propel the practitioner beyond saṃsāra. In early texts such as the Magga-vibhanga Sutta, the Buddha analyzes the path as a unified whole, emphasizing how each factor supports the others to eradicate defilements like greed, hatred, and delusion, culminating in nibbāna.\n\nIn contemporary contexts, secular adaptations of the Noble Eightfold Path have emerged, particularly in mindfulness-based programs that strip away metaphysical elements to emphasize practical well-being and ethical living in daily life. These versions reinterpret the factors—such as \"appropriate understanding\" for fostering interconnectedness and \"appropriate effort\" for reducing reactivity—focusing on psychological benefits like stress reduction and compassionate action, without reference to rebirth or enlightenment.\n\n### Ethical Precepts and Vinaya\n\nThe ethical precepts in Buddhism form the foundational moral framework for both lay practitioners and monastics, guiding conduct to foster harmony, reduce suffering, and support spiritual progress. These precepts are derived from the Buddha's teachings in the early texts and are integral to the discipline (Vinaya) that sustains the monastic community (Saṅgha). For laypeople, the precepts emphasize voluntary restraint, while for monastics, they are codified into a comprehensive disciplinary code to prevent discord and promote enlightenment.\n\nThe Five Precepts (pañca-sīla) serve as the basic ethical code for lay Buddhists, undertaking abstinence from actions that cause harm. They are: (1) refraining from killing or harming living beings; (2) refraining from taking what is not given (stealing); (3) refraining from sexual misconduct; (4) refraining from false speech; and (5) refraining from intoxicants that cloud the mind. These precepts are recited after taking refuge in the Three Jewels and are intended to cultivate a mind free from remorse, enabling progress toward higher ethical and meditative practices, as described in the Aṅguttara Nikāya (AN 8.39). By observing them, lay practitioners generate merit and protect themselves and others from the dangers of unwholesome actions.\n\nFor more intensive observance, lay Buddhists may undertake the Eight Precepts (attha-sīla), which extend the Five Precepts by prohibiting all sexual activity and adding three further restraints to support meditation. The additional precepts are: (6) refraining from eating solid food after noon; (7) refraining from entertainment, beautification, and adornments such as dancing, music, perfumes, and cosmetics; and (8) refraining from using high or luxurious beds. These are typically observed on Uposatha days—lunar observance periods falling on the eighth, fourteenth, and fifteenth days of the fortnight—to emulate monastic life and deepen mindfulness, as outlined in the Dīgha Nikāya (DN 2). Such temporary commitments allow laypeople to experience heightened restraint and accumulate conditions for insight.\n\nThe Vinaya Piṭaka, the \"Basket of Discipline,\" codifies the monastic ethical code, originating from the Buddha's responses to early Saṅgha disputes as the community expanded after his enlightenment. Rules were formulated progressively to address specific incidents of misconduct, such as conflicts arising from unskillful behavior, ensuring the Saṅgha's survival and lay support. The core of the Vinaya is the Pātimokkha, a recitation of rules chanted biweekly during Uposatha gatherings to reaffirm communal harmony. For monks (bhikkhus), it comprises 227 rules categorized into eight classes, from severe offenses like sexual intercourse (Pārājika) to minor infractions. Nuns (bhikkhunīs) follow 311 rules, incorporating all monastic ones plus additional regulations for their order, as detailed in the Bhikkhunī Pātimokkha. The Vinaya's purpose extends beyond punishment to cultivate ethical purity, fostering an environment conducive to meditation and the path to nirvana, as part of the broader Dhamma-Vinaya. These precepts integrate into the Noble Eightfold Path under right speech, action, and livelihood, providing the moral foundation for wisdom and concentration.\n\n### Meditation Practices\n\nMeditation practices in Buddhism emphasize the cultivation of mental concentration to stabilize the mind, serving as a foundational element within the Noble Eightfold Path, particularly right concentration. These techniques, collectively known as *samatha* or tranquility meditation, aim to develop attentional stability and vividness, countering mental agitation and dullness to prepare the practitioner for deeper contemplative states. Unlike analytical approaches, *samatha* focuses on serene absorption to refine awareness, drawing from ancient Indian traditions but systematically refined by the Buddha for ethical and liberating purposes.\n\nThe origins of *samatha* trace back to pre-Buddhist contemplative practices among Indian ascetics, where techniques for focusing the mind on objects like the breath were employed to achieve mental quiescence. The Buddha adapted these methods, integrating them into a structured path that emphasizes ethical conduct and insight, as evidenced by his teachings in early texts where he describes refining attention through nine progressive states, from initial placement to effortless stability. A key method within *samatha* is *ānāpānasati*, or mindfulness of breathing, taught by the Buddha as a versatile practice for developing concentration by observing the breath's length, sensations, and calming effects on body and mind.\n\nCentral to *samatha* are the *jhāna* stages, progressive absorptions that refine mental focus. The four form *jhānas* begin with the first, characterized by seclusion from sensory desires, accompanied by applied thought, sustained thought, rapture, happiness, and one-pointedness of mind. The second *jhāna* involves the subsidence of applied and sustained thought, giving rise to internal assurance, unification of mind, rapture, happiness, and concentration-born one-pointedness. In the third *jhāna*, rapture fades, leaving equanimous mindfulness, clear comprehension, bodily pleasure, and one-pointedness. The fourth *jhāna* abandons pleasure and pain, attaining purity of equanimity and mindfulness with neither-pain-nor-pleasure and one-pointedness. Beyond these, the four formless attainments extend into subtler realms: the base of boundless space, transcending perceptions of form; the base of boundless consciousness, perceiving infinite consciousness; the base of nothingness, focusing on the absence of prior perceptions; and the base of neither-perception-nor-non-perception, the subtlest state with equanimous equilibrium. These stages, initially mundane, support advanced path development in Theravāda tradition.\n\nComplementing *samatha* are the *brahmavihāras*, or divine abodes, practiced as meditative radiations to cultivate boundless positive mental qualities. *Mettā* (loving-kindness) involves radiating unconditional goodwill, starting from oneself and extending to all beings without discrimination. *Karuṇā* (compassion) focuses on empathetic response to suffering, wishing its alleviation through active orientation. *Muditā* (sympathetic joy) entails rejoicing in others' welfare and success, countering envy. *Upekkhā* (equanimity) maintains balanced impartiality, rooted in insight into impermanence. These are developed systematically—breaking down barriers between self and others, expanding spatially to encompass all directions—to achieve *jhāna*-like absorption, with *mettā*, *karuṇā*, and *muditā* leading to the first three *jhānas*, and *upekkhā* to the fourth.\n\nIn Vajrayāna traditions, tantric meditation incorporates visualization as a concentration technique, particularly in the generation stage where practitioners mentally construct and identify with a deity (*yidam*), such as a peaceful or wrathful figure within a mandala, to embody enlightened qualities like compassion and wisdom. This self-visualization, involving detailed imagery of form, attributes, and emotions, heightens arousal and attentional control, distinguishing it from sutra-based practices while building on *samatha* foundations.\n\n### Insight and Wisdom Development\n\nIn Buddhist practice, the cultivation of insight and wisdom, known as *vipassanā* and *prajñā* or *paññā*, involves developing a profound understanding of reality as it truly is (*yathābhūta*). This process penetrates the three marks of existence—impermanence (*anicca*), suffering (*dukkha*), and non-self (*anattā*)—leading to the eradication of ignorance and the realization of liberation. Building on the foundations of meditation practice, insight arises through direct experiential knowledge rather than mere intellectual assent.\n\n*Vipassanā*, or insight meditation, fosters discernment into the three marks by observing phenomena in their arising, presence, and passing away. Practitioners contemplate impermanence by noting the transient nature of sensations, such as the rise and fall of the breath, recognizing that all conditioned things lack stability. This extends to suffering, where the unsatisfactoriness of clinging to impermanent forms becomes evident, and non-self, where no enduring essence is found in body or mind. Methods include mental noting, where experiences like \"rising\" or \"falling\" are labeled to sharpen awareness, and body scanning, systematically observing sensations across the body to reveal the conditioned and empty nature of physicality. These approaches, rooted in the *Satipaṭṭhāna Sutta*, cultivate perceptual knowledges such as perception of impermanence (*aniccasaññā*), suffering (*dukkhasaññā*), and non-self (*anattasaññā*), progressively weakening attachment.\n\n*Prajñā*, the wisdom of discernment, develops through study, reflection, and meditative cultivation, enabling insight into dependent origination—the principle that all phenomena arise interdependently without inherent existence. In the Theravāda tradition, this begins with *sutamayā paññā* (wisdom from hearing the teachings), progresses to *cintamayā paññā* (wisdom from reflection on doctrines like the twelve links of dependent origination), and culminates in *bhāvanāmayā paññā* (wisdom from meditative development). Reflection involves analyzing how ignorance conditions formations, leading to birth and suffering, thus revealing the chain's empty, conditioned nature. This intellectual and contemplative discernment integrates with insight practice to dissolve misconceptions of self and permanence.\n\nThe stages of insight, or *ñāṇas*, outline the progressive deepening of wisdom in Theravāda *vipassanā*. Beginning with the knowledge of arising and passing away, meditators perceive the momentary flux of phenomena, often accompanied by lights and raptures that must be noted to avoid distraction. This evolves into dissolution, focusing on cessation to intensify impermanence; fearfulness, viewing formations as terrifying due to their instability; misery, recognizing inherent suffering; disgust, recoiling from conditioned existence; desire for deliverance, yearning for release; re-observation, renewed scrutiny amid challenges; and equanimity about formations, a balanced, effortless insight into all as impermanent, suffering, and non-self. These sixteen knowledges, detailed in the *Visuddhimagga* and *Patisambhidāmagga*, mark the path from gross to subtle understanding, preparing the mind for path attainment.\n\nInsight and wisdom development integrates with calming practices (*samatha*) for balance, though approaches vary across traditions. In Theravāda, figures like Pa-Auk Sayadaw emphasize achieving absorptions (*jhānas*) before *vipassanā* to stabilize the mind, while Mahasi Sayadaw prioritizes direct insight with minimal calm. Zen (*Chan* in East Asia), rooted in Mahāyāna, contrasts by emphasizing *zazen* (seated meditation) and koan investigation for sudden insight into emptiness and non-duality, often bypassing structured stages in favor of direct pointing to the mind's nature. Theravāda's gradual, analytical progression through marks and origination differs from Zen's non-conceptual, intuitive awakening, yet both aim at transcending delusion through wisdom.\n\n## Daily and Devotional Practices\n\n### Refuge and Devotion\n\nIn Buddhism, taking refuge is a foundational ritual that marks a practitioner's formal commitment to the path, involving the recitation of vows to seek protection in the Buddha, Dharma, and Saṅgha—the Three Jewels. The ceremony typically begins with visualization, where participants imagine the Buddha radiating light or the Dharma as sacred texts, while reciting the refuge formula three times: \"I go for refuge to the Buddha, I go for refuge to the Dharma, I go for refuge to the Saṅgha.\" This act symbolizes relinquishing reliance on worldly securities and embracing the Buddhist teachings as a guide to liberation from suffering. For lay practitioners, taking refuge signifies a lifelong dedication to ethical living and spiritual growth, often performed in a temple under the guidance of a monk or lama, and it serves as the entry point for receiving further precepts. Unlike monastic ordination, this ceremony emphasizes personal resolve without requiring full renunciation of lay life.\n\nDevotional practices in Buddhism express reverence and generate positive karma through actions that accumulate merit, aiding progress toward enlightenment. Common expressions include offerings of flowers, incense, and food placed before Buddha images, which cultivate generosity and mindfulness. Prostrations, performed by bowing fully to the ground up to 108 times, represent humility and the purification of ego, often done before altars or while circumambulating stupas. Chanting sutras or mantras, such as the refuge prayer, fosters concentration and devotion, with the merit generated dedicated to all beings to alleviate their suffering. These practices are integral to daily worship, as they not only honor the enlightened ones but also build the positive conditions necessary for deeper meditation and insight.\n\nIn Mahāyāna traditions, devotion expands to include bodhisattvas as compassionate intermediaries who vow to save all sentient beings, with Avalokiteśvara embodying ultimate compassion through practices like reciting the mantra *Om Mani Padme Hum*. Devotees invoke Avalokiteśvara for protection and aid in worldly afflictions, visualizing the bodhisattva's form during rituals to cultivate loving-kindness. Pure Land Buddhism, a prominent Mahāyāna school, centers on the devotional practice of *nianfo*, or reciting the name of Amitābha Buddha (\"Namo Amituofo\") to seek rebirth in his pure land, Sukhāvatī, where enlightenment is more readily attainable. This recitation, performed mindfully thousands of times daily, relies on faith in Amitābha's vows and is accessible to all, regardless of meditative proficiency.\n\nCultural expressions of refuge and devotion manifest in festivals and veneration of sacred objects, reinforcing communal bonds and faith. Vesak, celebrated on the full moon of the fourth lunar month, commemorates the Buddha's birth, enlightenment, and parinirvāṇa through processions, lantern releases, and collective chanting, drawing millions to temples worldwide. Relics, such as fragments of the Buddha's bones or ashes enshrined in stupas, are objects of pilgrimage and prostration, believed to embody his enduring presence and blessings. Buddha images, crafted in various regional styles from bronze statues in Thailand to painted thangkas in Tibet, serve as focal points for offerings and meditation, inspiring devotees to reflect on the qualities of enlightenment. These elements highlight how devotion integrates into lived traditions, adapting to local customs while preserving core Buddhist principles.\n\n### Renunciation and Restraint\n\nRenunciation in Buddhism entails the deliberate abandonment of attachments to sensory pleasures, material possessions, and worldly roles to foster spiritual development and liberation from suffering. It forms a foundational support for ethical living and mindfulness, distinguishing itself from mere asceticism by emphasizing a balanced detachment that aligns with the Middle Way. Practitioners, both monastic and lay, view renunciation as a path to inner freedom, reducing the pull of craving (taṇhā) that perpetuates the cycle of rebirth.\n\nMonastic renunciation manifests in vows of celibacy, voluntary poverty, and non-attachment, requiring monks and nuns to relinquish family ties, wealth, and personal adornments upon ordination. Celibacy preserves vital energy for practice and prevents entanglements that could distract from enlightenment, while poverty—embodied in owning only robes, alms bowl, and minimal requisites—cultivates contentment with little. Non-attachment extends to all phenomena, training the mind to see impermanence (anicca) in possessions and relationships. The Buddha's life illustrates this: at age 29, he renounced his princely status, leaving his palace, wife, and infant son to adopt a homeless life, shaving his head and practicing austerities until realizing their futility. This personal example underscores renunciation as an active rejection of samsaric bonds for the pursuit of awakening.\n\nA core component of renunciation is sense restraint (indriya-saṃvara), the mindful guarding of the six sense faculties—eyes, ears, nose, tongue, body, and mind—against unchecked engagement with stimuli that fuel craving. Upon encountering a sense object, one practices vigilance to avoid delight or aversion, thereby preventing the arising of unwholesome mental states like greed or anger. This discipline, detailed in early discourses, involves reflection on the impermanent nature of sensory experiences to maintain equanimity. By implementing indriya-saṃvara, practitioners weaken the roots of attachment, creating space for concentration and insight.\n\nThe primary benefits of renunciation and sense restraint lie in their role in curtailing negative karma (akusala kamma), as actions born of craving accumulate unwholesome results leading to future suffering. By diminishing desire-driven behaviors, these practices promote skillful conduct, ethical clarity, and progress toward nirvana, fulfilling conditions for immersion (samādhi), knowledge (ñāṇa), and liberation. In the Buddha's narrative, renunciation halted his prior karmic patterns of indulgence, enabling the discernment of dependent origination and the Four Noble Truths, thus exemplifying how such restraint averts new karmic burdens while purifying the mind.\n\nLay variations adapt renunciation to household life through temporary observances, such as Uposatha days—held on new and full moon phases—where adherents undertake eight precepts, including fasting from solid food after noon and embracing simplicity by forgoing luxuries like entertainment, cosmetics, and fine attire. These practices simulate monastic restraint, promoting detachment and merit accumulation without permanent withdrawal. During the three-month rains retreat (vassa), laity often intensify commitments by daily meditation, alms-giving, or additional vows, aligning seasonal discipline with monastic routines to deepen resolve. Such intermittent renunciation allows integration with family duties while tasting its fruits.\n\nIn contemporary settings, renunciation encounters critiques for appearing overly ascetic or incompatible with modern emphases on personal fulfillment and social engagement, with some viewing it as promoting nihilism or suppression of vitality. Scholars note adaptations in Western Buddhism, where internal non-clinging supplants strict external vows, addressing concerns that traditional forms marginalize lay practitioners or overlook diverse identities. Despite this, proponents affirm its enduring value in countering consumerism and fostering resilience.\n\n### Mindfulness in Daily Life\n\nMindfulness in daily life, as articulated in early Buddhist teachings, extends the practice of awareness beyond formal sitting meditation to encompass routine activities, fostering a continuous presence that counters habitual distractions. Central to this is the **Satipaṭṭhāna Sutta**, which outlines the four foundations of mindfulness—body, feelings, mind, and dharmas—applied dynamically in everyday contexts to cultivate clear awareness. Practitioners observe the body in activities such as walking, standing, sitting, or lying down, noting the sensations and movements without attachment, thereby grounding attention in the present moment. This foundation extends to feelings by recognizing pleasant, painful, or neutral tones arising during tasks like eating or speaking; to the mind by discerning states such as greed or aversion as they emerge in interactions; and to dharmas by contemplating phenomena like hindrances or sense bases in relation to daily experiences. Such application prevents the arising of covetousness and dejection, unwholesome states that obscure clarity, by maintaining ardent, clearly conscious attention to what is occurring.\n\nA key component of this practice is **clear comprehension** (sampajañña), which involves intentional, discerning awareness of one's actions and their suitability in the moment, ensuring mindfulness is not mere passive observation but actively informed by wisdom. In daily routines, sampajañña manifests as thorough understanding during postures—such as going forward or backward with awareness of bodily intentions—or in basic functions like eating, drinking, or defecating, where one reflects on the purpose and impermanent nature of the activity to avoid excess or negligence. For instance, while eating, a practitioner comprehends the food's role in sustaining the body without indulgence, observing the process of ingestion and digestion to prevent attachment or aversion, thus protecting the mind from defilements. This paired operation of mindfulness and clear comprehension, as emphasized in the Satipaṭṭhāna Sutta, supports the development of wholesome states by restraining unskillful tendencies before they take root.\n\nIn contemporary contexts, these ancient principles have informed secular adaptations, notably **Mindfulness-Based Stress Reduction (MBSR)**, developed by Jon Kabat-Zinn in 1979, which draws directly from Buddhist mindfulness traditions, including vipassanā practices rooted in suttas like the Satipaṭṭhāna. MBSR integrates body awareness, breath observation, and moment-to-moment attention into an eight-week program for stress management, emphasizing non-judgmental presence in daily activities to mitigate chronic suffering, while stripping explicit religious elements to suit medical settings. This approach echoes the suttas' role of mindfulness in averting unwholesome mental states, promoting resilience through applied awareness in work, relationships, and self-care. As part of the broader Noble Eightfold Path, such daily mindfulness cultivates right mindfulness, integrating ethical and practical dimensions of the teaching.\n\n### Dietary and Ethical Practices\n\nBuddhist dietary practices are deeply intertwined with ethical principles, particularly the commitment to non-harm, emphasizing compassion toward all sentient beings. While the foundational precept against killing underpins these practices, they manifest specifically in guidelines for food consumption that promote mindfulness and restraint. Monastics and lay practitioners alike follow rules designed to minimize suffering in the food chain, though interpretations vary across traditions.\n\nVegetarianism is not explicitly mandated in the earliest Buddhist texts, such as the Pāli Canon, where the Buddha permitted monks to eat meat if it was not killed specifically for them. However, Mahāyāna traditions place greater emphasis on abstaining from meat, influenced by the principle of ahimsa (non-violence). The Laṅkāvatāra Sūtra, a key Mahāyāna text, strongly advocates vegetarianism, with the Buddha arguing that consuming animal flesh perpetuates suffering and hinders bodhisattva aspirations by implicating practitioners in killing. This sutra outlines multiple reasons for avoidance, including the karmic bonds between eater and eaten, and has inspired widespread vegetarian observance among East Asian Mahāyāna communities.\n\nMonastic dietary rules, outlined in the Vinaya, further structure these ethics to foster discipline and detachment from sensory pleasures. Bhikkhus (monks) are prohibited from consuming solid food after noon, a rule intended to curb gluttony, enhance meditation focus, and align with the day's contemplative rhythm; this practice persists in contemporary Chinese and Theravāda monasteries despite debates over its adaptability. Alms begging, or piṇḍapāta, requires monks to accept whatever food is offered without selection or preference, reinforcing humility and equality while avoiding demands that could burden donors. These guidelines apply primarily to monastics but influence lay observance through shared ethical ideals.\n\nBuddhist animal ethics extend these principles by recognizing animals as sentient beings capable of rebirth across realms, including human, underscoring the interconnectedness of all life through karma. Killing animals generates negative karma for the perpetrator, potentially leading to rebirth in lower realms, and early texts like the Jātakas illustrate compassionate interactions with animals as models for ethical conduct. Buddhism has historically opposed animal sacrifice, viewing it as futile and cruel; the Buddha explicitly forbade such Vedic rituals, declaring them to result in hellish rebirths for participants. In modern contexts, these teachings fuel animal rights advocacy, with figures like the Dalai Lama promoting reduced animal exploitation and organizations applying Buddhist compassion to oppose factory farming and habitat destruction.\n\nRegional variations highlight environmental and cultural adaptations. In Tibetan Buddhism, meat consumption has been more common due to the harsh high-altitude climate limiting agriculture, though many lamas encourage vegetarianism where feasible and texts like the Laṅkāvatāra Sūtra are studied. By 2025, eco-Buddhism trends increasingly integrate dietary ethics with environmental concerns, promoting plant-based diets to mitigate climate change and biodiversity loss; initiatives in Asia and the West link vegetarianism to ahimsa, with growing monastic adoption of vegan practices to address global animal welfare crises.\n\n## Scriptures\n\n### Early Buddhist Texts\n\nThe early Buddhist texts originated in an oral tradition, where the Buddha's teachings were memorized and recited verbatim by his disciples to preserve their integrity. Following the Buddha's death around the fifth century BCE, the First Buddhist Council, held at Rājagṛha, involved communal recitation by 500 elders led by Mahākāśyapa to compile the teachings into structured recitations, emphasizing fixed wording to prevent alterations. This oral transmission relied on specialized reciters (bhāṇakas) who maintained the texts through repetitive, formulaic prose designed for memorization, such as standardized phrases describing ethical conduct or meditative states.\n\nThe core of these texts is the Sutta Piṭaka, a collection of discourses attributed to the Buddha and his close disciples, organized into nikāyas or divisions. Prominent examples include the Dīgha Nikāya, featuring longer discourses on cosmology and ethics, and the Majjhima Nikāya, with medium-length suttas exploring psychological and doctrinal themes. Key themes recurrent in these suttas address the nature of suffering (dukkha), its origins in craving and ignorance, and the path to liberation, prominently encapsulated in the Four Noble Truths and the Noble Eightfold Path—encompassing right view, intention, speech, action, livelihood, effort, mindfulness, and concentration—as a stepwise training to end suffering. These discourses form the doctrinal foundation of the broader Tipiṭaka structure, alongside rules and analyses.\n\nPreservation of the early texts occurred primarily through oral means until their commitment to writing, with the oldest surviving manuscripts emerging in the Gandhāran region around the first century BCE. Written in Gāndhārī, a Prakrit language, and the Kharoṣṭhī script on birch bark or palm leaves, these Gandhāran fragments include portions of suttas and vinaya rules, dating from the first century BCE to the third century CE, and illustrate early textual dissemination along trade routes. Later preservations appear in Pāli, as in the Theravāda tradition, and scattered Sanskrit fragments from various schools, with archaeological discoveries like birch bark scrolls from Afghanistan providing physical evidence of this multi-lingual transmission.\n\nDebates on authenticity center on distinguishing core teachings from potential later additions, with scholars noting that while the oral framework aimed for fidelity, variations across parallel versions in different languages suggest some fluidity or intentional adaptations. Early skeptics viewed much of the literature as mythologized, but evidence from pre-Aśokan content—lacking references to later historical figures—and consistent doctrinal elements like the absence of merit transference in core suttas support the historicity of foundational teachings, likely fixed by the first century BCE. Modern analyses prioritize archaeological and epigraphic corroboration to affirm the texts' reliability as reflections of early Buddhist thought.\n\n### Pāli Canon and Theravāda Tripiṭaka\n\nThe Pāli Canon, known as the Tipiṭaka or \"Three Baskets,\" forms the scriptural foundation of Theravāda Buddhism, comprising texts preserved in the Pāli language. It is divided into three primary divisions: the Vinaya Piṭaka, which outlines monastic discipline and rules for the Saṅgha, including origin stories to promote communal harmony; the Sutta Piṭaka, containing discourses attributed to the Buddha and his close disciples that articulate core teachings across five nikāyas; and the Abhidhamma Piṭaka, which provides a systematic philosophical analysis of mind, matter, and doctrinal principles derived from the Suttas.\n\nThe compilation of the Pāli Canon traces back to the First Buddhist Council held at Rājagṛha shortly after the Buddha's parinirvāṇa, estimated around 400 BCE, where elder monks recited and codified the teachings to preserve them orally. The texts assumed their canonical form by the Third Council circa 250 BCE, and the Pāli recension—the version used in Theravāda—was first committed to writing in Sri Lanka during the 1st century BCE under King Vaṭṭagāmiṇī, as recorded in traditional chronicles, marking a shift from oral transmission to manuscript preservation on palm leaves.\n\nProminent texts within the Canon include the Dhammapada, a collection of 423 verses in the Khuddaka Nikāya of the Sutta Piṭaka, encapsulating ethical and meditative wisdom in poetic form and widely revered as a concise guide to the Dhamma. Complementing the Canon are post-canonical commentaries, such as the Visuddhimagga (\"Path of Purification\") by Buddhaghosa in the 5th century CE, which systematizes doctrine, meditation practices, and ethical precepts drawn from the Tipiṭaka, serving as an authoritative interpretive manual in Theravāda scholarship.\n\nIn Theravāda Buddhism, the Pāli Canon holds supreme authoritative status as the closest extant record of the Buddha's words, guiding doctrine, practice, and monastic life across traditions in Sri Lanka, Thailand, and beyond. Extensive translations into English and other languages have made it accessible, with over 1,000 suttas available online; digital initiatives like SuttaCentral continue to advance this in 2025 through parallel editions, searchable databases, and new translations, including translations in multiple languages, such as French, to support global study.\n\n### Mahāyāna Sūtras\n\nThe Mahāyāna sūtras represent a vast corpus of Buddhist scriptures that emerged as foundational texts for the Mahāyāna tradition, emphasizing the bodhisattva ideal of pursuing enlightenment for the benefit of all sentient beings. Unlike the earlier Buddhist texts, these sūtras expand on doctrines such as emptiness (śūnyatā), portraying ultimate reality as devoid of inherent existence while promoting compassion and the potential for universal buddhahood. Composed anonymously over centuries, they are presented as direct teachings of the Buddha, thereby claiming authoritative status within Mahāyāna communities.\n\nAmong the most influential Mahāyāna sūtras are the Prajñāpāramitā (Perfection of Wisdom) texts, which form a extensive collection exploring the perfection of wisdom as the paramount bodhisattva virtue. The Aṣṭasāhasrikā Prajñāpāramitā Sūtra, dated to around the 1st century BCE, serves as a foundational work, introducing the concept of emptiness through dialogues where the Buddha elucidates that all phenomena lack self-nature. The Heart Sūtra (Prajñāpāramitāhṛdaya), a concise distillation of these teachings, famously declares \"form is emptiness, emptiness is form,\" encapsulating the non-dual nature of reality and influencing meditative practices across Mahāyāna lineages. The Lotus Sūtra (Saddharmapuṇḍarīkasūtra), composed between the 1st century BCE and 2nd century CE, employs parables to affirm the buddha-nature inherent in all beings and the supremacy of the ekayāna (one vehicle) path, integrating diverse teachings under the bodhisattva ideal. These sūtras, along with others like the Laṅkāvatāra Sūtra, underscore the theme of upāya (skillful means), wherein buddhas adapt teachings to suit the capacities of different practitioners to foster awakening.\n\nThe origins of the Mahāyāna sūtras trace to northern India between the 1st century BCE and 2nd century CE, during a period of doctrinal innovation within early Buddhist communities. Anonymously composed by monastic scholars or groups, these texts were not attributed to specific authors but framed as the Buddha's words to legitimize their novelty and inspire devotion. This pseudepigraphic style allowed for the integration of philosophical insights, such as the two truths (conventional and ultimate) and the bodhisattva stages (bhūmis), building briefly on elements from early sūtras while innovating toward a more inclusive soteriology.\n\nTranslations of these sūtras played a pivotal role in their dissemination, with Kumārajīva (344–413 CE), a Central Asian monk, rendering over 300 texts into Chinese, including the Lotus Sūtra and Diamond Sūtra from the Prajñāpāramitā cycle, using elegant and accessible prose that profoundly shaped East Asian Buddhism. His work, conducted under imperial patronage in the Yao and Later Qin dynasties, facilitated the rise of schools like Tiantai and Huayan in China, which drew heavily on these scriptures for their doctrines of interpenetration and buddha-nature. Later, Tibetan translations during the 8th–12th centuries CE, preserved in the Kangyur canon, integrated the sūtras into Vajrayāna practices while retaining their core Mahāyāna emphasis on emptiness and compassion, influencing traditions across the Himalayas and Central Asia.\n\n### Vajrayāna and Tantric Texts\n\nVajrayāna tantric texts, also known as Tantras, originated in India during the 7th to 12th centuries CE, emerging as an esoteric extension of Mahāyāna Buddhism that integrated ritual and meditative practices influenced by contemporaneous Hindu tantric traditions, particularly Shaivism. These scriptures emphasize rapid paths to enlightenment through symbolic and yogic methods, distinguishing them from exoteric Mahāyāna sūtras by their focus on secrecy, guru-disciple transmission, and transformative rituals.\n\nProminent among these texts is the *Guhyasamāja Tantra* (\"Tantra of the Secret Assembly\"), composed around the 8th century CE and revered as the foundational \"king of tantras\" in Vajrayāna. It outlines deity yoga, where practitioners visualize themselves as the central deity Akṣobhya to realize non-dual awareness, and employs mantras—sacred syllables like *oṃ akṣobhya hūṃ*—for invocation and empowerment during rituals. Similarly, the *Hevajra Tantra*, dated to the 8th–11th centuries CE, centers on the deity Hevajra and details advanced yogic practices, including mantra recitation and the generation of illusory bodies to transcend ordinary perception.\n\nCentral elements in these tantras include mandalas—geometric diagrams representing the enlightened mind and serving as meditative focal points for deity generation—and abhiṣeka initiations, multi-stage empowerments by a guru that purify the practitioner and grant permission to engage with the texts' practices. The texts also describe the subtle body as comprising channels (*nāḍī*), numbering around 72,000 with key ones like the central avadhūtī; winds (*prāṇa* or *rlung*), five primary types such as the life-sustaining and diffusive winds that carry consciousness; and drops (*bindu* or *thig-le*), indestructible essences at chakras like the heart and navel that generate bliss when mobilized through yoga.\n\nTransmission of these tantric texts to Tibet occurred primarily in the 8th century CE through Indian masters like Padmasambhava, who subdued local spirits and embedded teachings in the Nyingma school's framework. In the Nyingma tradition, many tantras are preserved as termas—hidden treasures concealed by Padmasambhava and later revealed by tertöns (treasure revealers) to ensure their relevance across eras.\n\n## Historical Development\n\n### Pre-Sectarian and Early Indian Buddhism\n\nFollowing the Buddha's parinirvana, the early Buddhist saṅgha, primarily based in the kingdom of Magadha with its capital at Rājagṛha, grew through the dedicated efforts of his senior disciples who undertook missionary activities to propagate the Dharma across northern India. These missions focused on establishing monastic communities and lay support networks in regions like Kosala and the Gangetic plain, fostering a communal structure that emphasized ethical conduct and meditation practice.\n\nApproximately a century later, around 383 BCE, the Second Buddhist Council convened at Vaiśālī under the patronage of King Kālāśoka to address disputes over monastic discipline raised by the Vajjian monks of the region. The council, attended by about 700 monks including notable elders like Revata, debated ten points of alleged laxity, such as storing salt in a horn, consuming undried meat, and using a higher seat—practices viewed by conservative elders as violations of the Vinaya rules established by the Buddha. The assembly ultimately rejected these innovations, reinforcing strict adherence to the monastic code and marking an early effort to preserve doctrinal and disciplinary unity, though it sowed seeds for later divisions without immediate schism.\n\nIn the pre-sectarian phase, doctrinal developments included the nascent formation of Abhidharma traditions, which systematically analyzed the Buddha's teachings into categories of dharmas—fundamental mental and physical phenomena—to aid meditative insight and philosophical clarity. This analytical approach emerged from oral catechetical methods within monastic circles shortly after the Buddha's time, prioritizing impermanent processes over a permanent self. Concurrently, stupa worship became a central devotional practice, with these hemispherical mounds serving as repositories for relics like the Buddha's ashes, enabling circumambulation (pradakshina) as a ritual to invoke his presence and contemplate the Four Noble Truths.\n\nArchaeological evidence from this era underscores the early vitality of Buddhist communities, as seen in the Piprahwa stupa site in modern Uttar Pradesh, where excavations in 1898 uncovered reliquaries containing bone fragments, ashes, and jewels inscribed in Prakrit, likely dating to the 5th–4th centuries BCE and associated with portions of the Buddha's cremated remains distributed among clans. Similarly, the Bharhut stupa in Madhya Pradesh yields sculptures from the 3rd century BCE, featuring narrative reliefs of Jātaka tales and symbolic motifs like the Dharma wheel on its railings and gateways, illustrating the integration of aniconic representation and communal veneration in early Indian Buddhism.\n\n### Aśokan Era and Early Schools\n\nEmperor Aśoka, ruling the Mauryan Empire from approximately 268 to 232 BCE, underwent a profound transformation following his conquest of Kalinga around 261 BCE, which resulted in over 100,000 deaths and widespread suffering, leading to his conversion to Buddhism. This shift marked a pivot from military expansion to ethical governance, with Aśoka embracing Buddhist principles of non-violence and compassion as recorded in his own edicts.\n\nUnder Aśoka's patronage, the Third Buddhist Council was convened around 250 BCE at Pāṭaliputra, lasting nine months and involving about 1,000 elders led by Moggaliputta Tissa, to resolve doctrinal disputes and purify the saṅgha by expelling heretical monks. The council reaffirmed orthodox teachings, contributed to the compilation of the Abhidhamma Piṭaka, and dispatched missionaries to propagate Buddhism, though its details are primarily drawn from Pāli chronicles like the Dīpavaṃsa rather than Aśoka's inscriptions.\n\nAśoka sponsored extensive missionary activities post-council, including sending his son Mahinda, accompanied by elders such as Iṭṭhiya and Uttiya, to Sri Lanka in the 18th year of his reign, where they converted King Devānampiyatissa and established the saṅgha at Mihintale. Missions also extended to regions like the Hellenistic kingdoms, as referenced in Rock Edict 13, which mentions envoys to rulers such as Antiochus II of Syria and Ptolemy II of Egypt to promote dhamma, though specific names like Sonaka and Sonutta are associated in some traditions with efforts in borderlands like Suvaṇṇabhūmi.\n\nDuring Aśoka's era, the early Buddhist community experienced its first major schism, dividing into the Sthavira (elders) school, which emphasized strict adherence to monastic discipline, and the Mahāsāṃghika school, which advocated a more inclusive interpretation of the saṅgha, occurring around 340 BCE following disputes at the Second Council in Vaiśālī. This split, rooted in disagreements over vinaya rules such as the \"ten points\" of laxity, led to further subdivisions, resulting in approximately 18 distinct schools by the 3rd century CE, including subgroups like the Ekavyavahārika and Lokottaravādin within the Mahāsāṃghikas.\n\nAśoka's rock and pillar edicts, inscribed in Prakrit using Brahmi script across his empire from about 258 BCE, explicitly promoted dhamma as a universal ethic of moral conduct, tolerance, and welfare, independent of specific religious doctrines, to foster harmony among diverse subjects. These inscriptions, such as Major Rock Edict 6, detail his efforts to instruct officials in dhamma and encourage its practice for public happiness, while archaeological evidence confirms his sponsorship of stupa construction, including the enlargement of relic mounds at sites like Sanchi and the erection of 84,000 stupas to enshrine Buddha relics, symbolizing devotion and imperial support.\n\n### Emergence of Mahāyāna\n\nThe Mahāyāna movement, often translated as the \"Great Vehicle,\" began to emerge within Indian Buddhism around the 1st century BCE, approximately four centuries after the Buddha's death, marking a significant evolution from the earlier traditions focused on individual liberation. This development occurred across various early Buddhist schools (nikāyas), reflecting a pluralistic and gradual process rather than a singular schism, with roots traceable to pre-Common Era ascetic and devotional practices. Although traditionally viewed as a lay-driven reaction to the growing scholasticism and exclusivity of monastic communities in early schools like the Sarvāstivāda and Sthaviranikāya, recent scholarship emphasizes its origins among pious monks and nuns who sought to revitalize Buddhist practice through broader inclusivity and compassion.\n\nA defining feature of Mahāyāna was the promotion of the bodhisattva ideal, in which practitioners vow to attain full Buddhahood not for personal escape from saṃsāra, but to liberate all sentient beings, contrasting sharply with the arhat ideal of the early schools that prioritized individual nirvāṇa through ethical discipline and insight. This shift emphasized universal compassion (karuṇā) and skillful means (upāya) as essential to the path, allowing for diverse expressions of devotion accessible to both monastics and laity. Key doctrinal innovations included the concept of emptiness (śūnyatā), which posits that all phenomena lack inherent existence (svabhāva) and arise dependently, challenging the substantialist ontologies of early Abhidharma traditions. Mahāyāna texts critiqued these schools for reifying dharmas as ultimately real, arguing instead for a middle way that avoids both eternalism and nihilism, thereby opening the path to buddhahood for all beings through innate buddha-nature (tathāgatagarbha).\n\nProminent figures shaped Mahāyāna's philosophical foundations in the early centuries CE. Nāgārjuna (c. 150–250 CE), active in southern India, founded the Madhyamaka school through works like the *Mūlamadhyamakakārikā*, systematically articulating emptiness and influencing Mahāyāna's critique of essentialism in prior Buddhist and non-Buddhist systems. Later, Asaṅga (c. 4th–5th century CE), along with his half-brother Vasubandhu, developed the Yogācāra school, emphasizing mind-only (cittamātra) doctrine and the bodhisattva stages outlined in texts like the *Bodhisattvabhūmi*, which integrated universal buddhahood as a transformative potential inherent in all. These thinkers bridged devotional and analytical approaches, fostering Mahāyāna's appeal beyond elite scholastic circles.\n\nMahāyāna spread rapidly from India along trade routes, including the Silk Road, reaching Central Asia and China by the 1st–2nd centuries CE, where it adapted to local cultures through merchant networks and missionary monks. Monastic universities like Nālandā, established in the 5th century CE in Bihar, became pivotal centers for Mahāyāna study, attracting scholars from across Asia and facilitating the transmission of its texts and practices until the 12th century. This expansion highlighted Mahāyāna's emphasis on inclusivity, as it critiqued the perceived limitations of early schools while promoting a vision of enlightenment as universally attainable.\n\n### Vajrayāna in Late Indian Buddhism\n\nVajrayāna Buddhism, an esoteric extension of Mahāyāna traditions, began to emerge in India around the 7th century CE, marking a shift toward tantric practices aimed at accelerating spiritual realization. This development was influenced by sociopolitical changes, including the feudalization of society and the rise of regional powers in eastern India, particularly under the Pāla dynasty (8th–12th centuries). Early tantric texts, such as the *Dhāraṇīsaṃgraha* compiled in 653/54 CE, indicate the movement's maturation by the mid-7th century, with widespread popularity noted by Chinese pilgrim Wu-hsing around 680 CE. By this period, Vajrayāna incorporated elements like mantras, mandalas, and ritual consecrations to facilitate rapid enlightenment, distinguishing it from more gradual Mahāyāna paths.\n\nKey centers of integration included the mahāvihāras of Vikramashila and Odantapuri in Bihar and Bengal, established under Pāla patronage in the late 8th century. Vikramashila, founded by Dharmapāla (r. 770–810 CE), served as a premier institution for tantric scholarship, hosting scholars like Abhayākaragupta and fostering the synthesis of yogic and ritual practices. Odantapuri, built earlier by Gopāla (r. 750–770 CE), similarly became a hub for esoteric teachings, including the Cakrasamvāra tradition, and supported networks among eastern Indian vihāras. These monasteries not only preserved and advanced tantric literature but also bridged institutional monasticism with more marginal, forest-based traditions.\n\nA pivotal aspect of Vajrayāna's evolution involved the siddha traditions, embodied by lay adepts such as Tilopa (c. 988–1069 CE) and his disciple Nāropa (ca. 1016–1100 CE), who emphasized unconventional methods for swift awakening. Tilopa, a Bengali mahāsiddha, unified diverse tantric lineages through practices like the Six Yogas, blending monastic discipline with antinomian behaviors to realize mahāmudrā (great seal) realization in one lifetime. Nāropa, initially a scholar at Nālandā, underwent rigorous trials under Tilopa before transmitting these teachings, including deity yoga, inner heat (tummo), and illusory body practices, which promised enlightenment through direct engagement with subtle energies and non-dual awareness. These siddhas exemplified Vajrayāna's focus on siddhis (accomplishments) and coded rituals, often using sexual yoga and visionary meditations to transcend conventional ethics while rooted in bodhicitta (awakened mind). Their legacies, documented in hagiographies like the *Tillopā Dadohā Kośa*, influenced later tantric compilations and highlighted the symbiosis between elite scholarship and popular yogic currents.\n\nVajrayāna's prominence in late Indian Buddhism waned amid escalating external pressures, particularly Muslim invasions from the 11th century onward, which targeted wealthy monastic complexes in the Gangetic plains. The Pāla empire's collapse around 1174 CE, coupled with raids by Turkic forces, disrupted patronage and infrastructure, leading to the abandonment of many vihāras. The destruction of Nālandā in 1193 CE by Muhammad Bakhtiyar Khilji exemplifies this turmoil; the invading army sacked the university, massacred monks, and burned its vast library, as recounted by Tibetan pilgrim Dharmasvāmin, who visited shortly after and found the site in ruins with only a handful of survivors. Similar fates befell Vikramashila and Odantapuri by 1200 CE, accelerating Buddhism's marginalization in India through loss of institutional support and dispersal of scholars.\n\nDespite its demise in India, Vajrayāna's texts and oral lineages endured through preservation in Tibet, where Indian pandits and Tibetan translators facilitated extensive transmissions from the 8th to 13th centuries. Works like the *Sarvabuddhasamayoga* and key tantras were rendered into Tibetan, forming the core of the Kangyur and Tengyur canons, while figures such as Buddhaguhya ensured the continuity of ritual and philosophical elements. This exodus safeguarded Vajrayāna's esoteric heritage, preventing its total extinction following the Indian centers' fall.\n\n### Transmission to East, Southeast, and Central Asia\n\nBuddhism's transmission beyond India began with the missionary efforts of Emperor Aśoka in the 3rd century BCE, which laid the groundwork for its diffusion to neighboring regions.\n\nIn Central Asia, the Kushan Empire (1st–3rd centuries CE) played a pivotal role in facilitating Buddhism's spread along the Silk Roads, encompassing territories in modern-day Afghanistan, Pakistan, Tajikistan, and Uzbekistan. King Kanishka (r. 144–172 CE), the empire's third ruler, converted to Buddhism and actively promoted it across his realm, expanding eastward and supporting the development of Mahāyāna doctrines. This patronage fostered the Greco-Buddhist art of Gandhara, where sculptures blended Indian Buddhist iconography with Hellenistic and Persian influences, such as realistic drapery on Buddha figures, influencing artistic traditions as far as China and beyond. Archaeological finds, including birch-bark manuscripts of sūtras from the 1st century BCE to 3rd century CE preserved in clay jars, underscore Gandhara's status as a major center for Buddhist literature and art.\n\nBuddhism reached East Asia primarily through the Silk Roads during the Han dynasty (206 BCE–220 CE), with initial encounters via Central Asian traders and missionaries in the 1st century BCE. By the mid-1st century CE, Buddhist missionaries began translating Theravāda texts into Chinese, marking the start of systematic transmission. Emperor Mingdi (r. 57/58–75/76 CE) reportedly dispatched emissaries to India to obtain Buddhist scriptures, leading to the legendary establishment of the White Horse Temple in Luoyang around 68 CE as China's first official Buddhist monastery. In the late 1st century CE, the Kushan translator Lokakṣema rendered the first Mahāyāna texts into Chinese, accelerating the religion's integration. From China, Buddhism spread to Korea in the 4th century CE, introduced to the kingdom of Koguryō (37 BCE–668 CE) via continental trade routes and monks, where it faced initial elite opposition but was adopted by rulers to consolidate power. By the 6th century CE, it reached Japan from the Korean kingdom of Baekje, arriving in 538 or 552 CE through gifts of images and scriptures to the imperial court; the Soga clan championed its adoption, leading to state support under Emperor Yōmei in 587 CE and promotion by Prince Shōtoku (r. 593–622 CE), who built key temples like Hōryū-ji.\n\nIn Southeast Asia, the religion's early foothold was established in Sri Lanka during the 3rd century BCE, when Aśoka's son Mahinda led a mission that introduced Theravāda Buddhism, embedding it deeply in the island's monastic and royal traditions. Archaeological evidence confirms Buddhist presence in Burma (modern Myanmar) from the 2nd–3rd centuries CE, but Theravāda dominance solidified in the 11th century under King Anawrahta (r. 1044–1077 CE), who unified the region and purged non-Theravāda elements with support from Sri Lankan monks. From Burma, Theravāda spread to Thailand around the same period, becoming the prevailing form through royal patronage and monastic networks.\n\nAs Buddhism took root in these regions, it underwent significant adaptations, particularly in East Asia through a process of Sinicization, blending Indian doctrines with Chinese philosophical elements like Daoism and Confucianism from the Han to Tang dynasties (206 BCE–907 CE). This culminated in the emergence of Chan Buddhism in the 6th century CE, attributed to the Indian monk Bodhidharma, which emphasized direct insight and meditation over scriptural study, evolving into distinct \"houses\" like Linji during the Tang era (618–907 CE). Chan, later transmitted to Japan as Zen, resonated with Chinese literati by affirming innate Buddha-nature through embodied practice. In Tang China, Buddhism flourished under imperial patronage, with emperors supporting monasteries and translations, effectively positioning it as a quasi-state religion despite periodic persecutions like the Huichang suppression (841–846 CE).\n\n## Major Traditions\n\n### Theravāda Tradition\n\nTheravāda Buddhism traces its origins to the Sthavira nikāya, one of the early Buddhist schools that emerged after the Second Buddhist Council in the 4th century BCE, emphasizing adherence to the elder teachings preserved in the Pāli language. This lineage developed prominently in Sri Lanka from the 3rd century BCE, where it became the dominant tradition following the introduction by Mahinda, son of Emperor Aśoka. The Pāli Canon, known as the Tipiṭaka, serves as the primary scriptural authority in Theravāda, comprising the earliest comprehensive collection of the Buddha's discourses, monastic rules, and philosophical analyses, committed to writing in Sri Lanka around the 1st century BCE. These texts preserve what are considered the most authentic early Buddhist teachings, forming the doctrinal foundation for all Theravāda practices.\n\nTheravāda remains the predominant form of Buddhism in several Southeast Asian countries, including Sri Lanka, Thailand, Myanmar, Laos, Cambodia, and parts of Vietnam, where it shapes national culture and religious life. Within these regions, Theravāda monastic communities are often divided between urban city monasteries, which emphasize scriptural study, ritual ceremonies, and community engagement, and forest monasteries, which prioritize intensive meditation and ascetic practices in remote natural settings. This distinction, particularly prominent in the Thai Forest Tradition, reflects a balance between scholarly preservation and direct experiential insight, with forest monks following a stricter vinaya discipline to foster deeper contemplation.\n\nCentral to Theravāda practice is vipassanā meditation, an insight-oriented technique that cultivates awareness of impermanence, suffering, and non-self through mindful observation of body and mind, as systematized in texts like the Satipaṭṭhāna Sutta. Merit-making activities, such as dāna (generous giving to the saṅgha), precept observance, and participation in festivals, enable lay practitioners to accumulate positive karma and support monastic endeavors, fostering ethical conduct and communal harmony. Abhidhamma studies provide a detailed philosophical framework for analyzing mental phenomena and the path to enlightenment, with the Abhidhammapiṭaka offering systematic expositions on consciousness, matter, and ultimate realities to guide advanced meditation.\n\nIn the 19th century, Theravāda underwent significant reforms across Southeast Asia, driven by colonial challenges and efforts to revitalize meditation practices, leading to the emergence of the vipassanā movement in Burma under figures like Ledi Sayadaw, who democratized insight meditation for laypeople. This movement emphasized direct experiential verification of the Dhamma over ritualism, influencing global adaptations of Theravāda. By 2025, Theravāda has established numerous international centers, such as the Insight Meditation Society in the United States and the Bhavana Society in West Virginia, offering retreats and teachings that integrate traditional practices with modern accessibility, with ongoing programs like the Sati Center's 2025-2026 ethical studies course promoting widespread engagement.\n\n### Mahāyāna Schools\n\nMahāyāna Buddhism in East Asia developed diverse schools emphasizing philosophical depth, devotional practices, and meditative insight, adapting Indian origins to local cultural contexts from the 6th century onward. These traditions, rooted in key sūtras like the Lotus Sūtra and Avataṃsaka Sūtra, prioritize the bodhisattva ideal of universal compassion and enlightenment for all beings. Unlike more conservative approaches, East Asian Mahāyāna schools integrated indigenous philosophies, fostering syncretic expressions that influenced art, ethics, and society across China, Korea, Japan, and Vietnam.\n\nThe Chan (later Zen in Japan) school emerged in China around the 6th century CE, attributed to the legendary Indian monk Bodhidharma, who emphasized direct insight into one's Buddha-nature through meditation rather than scriptural study. By the Tang dynasty (618–907 CE), Chan lineages proliferated, with the Platform Sūtra of the Sixth Patriarch Huineng (638–713 CE) articulating \"sudden enlightenment\" via zazen (seated meditation) and the rejection of dualistic thinking. Under the Song dynasty (960–1279 CE), five major houses—Linji, Caodong, Yunmen, Fayan, and Guiyang—dominated, using gong'an (kōan) dialogues to provoke non-conceptual awareness. Chan spread to Japan as Zen in the 12th century, influencing samurai culture through Rinzai and Sōtō branches focused on rigorous discipline and everyday mindfulness.\n\nPure Land Buddhism, emphasizing faith in Amitābha Buddha for rebirth in his Western Paradise (Sukhāvatī), gained prominence in China from the 4th century and flourished in Japan during the Kamakura period (1185–1333 CE). The practice centers on reciting the nembutsu (\"Namu Amida Butsu\"), invoking Amitābha's vow to save all sentient beings regardless of merit. Hōnen (1133–1212 CE) founded the Jōdo-shū school, advocating exclusive nembutsu devotion as accessible to laypeople amid societal turmoil. His disciple Shinran (1173–1263 CE) developed Jōdo Shinshū, stressing shinjin (true entrusting) to Amitābha's \"other-power\" (tariki) over self-effort (jiriki), viewing even a single recitation as sufficient for salvation. This devotional approach democratized enlightenment, appealing to commoners and integrating Mahāyāna concepts of emptiness with soteriological hope.\n\nIn China, the Tiantai school, founded by Zhiyi (538–597 CE) on Mount Tiantai, synthesized diverse Buddhist teachings into a comprehensive system based on the Lotus Sūtra. Zhiyi's doctrines include the \"threefold truth\"—emptiness (śūnyatā), provisionality (upādāya), and the middle way—unifying all phenomena in non-dual reality. Central is the \"one mind in one moment,\" where each instant encompasses the 3,000 realms of existence, interpenetrating without obstruction. Later figures like Zhanran (711–782 CE) expanded these ideas, influencing Korean and Japanese Buddhism, though Tiantai declined after the 11th century amid political upheavals.\n\nThe Huayan school, also Chinese and centered on the Avataṃsaka Sūtra, arose in the 7th century under patriarchs like Dushun (557–640 CE) and was systematized by Fazang (643–712 CE). It teaches radical interpenetration of all dharmas, encapsulated in \"one is all, all is one,\" where phenomena mutually contain and pervade each other without interference. Fazang's fourfold dharmadhātu framework—conditioned things, principle (emptiness), harmony of principle and things, and mutual non-obstruction of things—illustrates this holistic cosmology, influencing Neo-Confucianism and Chan. Huayan waned by the 10th century but shaped East Asian views of interconnected reality.\n\nNichiren Buddhism, founded in 13th-century Japan by Nichiren (1222–1282 CE), exclusively reveres the Lotus Sūtra as the ultimate teaching for the mappō (degenerate age). Nichiren, a Tendai monk, proclaimed the daimoku chant—\"Namu Myōhō Renge Kyō\"—as the essence of the sūtra, enabling ordinary people to manifest buddhahood in this lifetime through faith and practice. He criticized rival sects like Pure Land for diluting the sūtra's message, advocating social engagement to establish a land of Lotus devotees (risshō ankoku). Posthumously, his teachings inspired movements emphasizing empowerment and ethical action.\n\nSyncretism enriched these schools, blending Buddhism with local traditions. In China, Huayan and Chan incorporated Confucian ethics of harmony and filial piety, viewing enlightenment as aligning with social order, as seen in Zongmi's (780–841 CE) integration of Chan meditation with Confucian self-cultivation. In Japan, Zen and Shingon absorbed Shinto kami worship, interpreting deities as Buddhist manifestations (honji suijaku), while Pure Land and Nichiren elements fused with Shinto rituals in folk practices until the Meiji-era separation (1868). This hybridity fostered tolerant, adaptive expressions of Mahāyāna.\n\nIn the 20th century, East Asian Mahāyāna schools engaged modernity through reforms addressing secularism and nationalism. In China, Taixu (1890–1947) advocated \"Humanistic Buddhism\" (renjian fojiao), revitalizing monastic education, lay involvement, and social welfare to counter decline under Republican and Communist regimes. Japanese Zen adapted to imperialism via militaristic interpretations, while post-WWII Pure Land and Nichiren groups like Sōka Gakkai emphasized peace and democracy, expanding globally while preserving core practices. These efforts ensured Mahāyāna's relevance amid rapid change.\n\n### Vajrayāna and Tibetan Buddhism\n\nVajrayāna Buddhism, also known as the Diamond Vehicle, represents the tantric tradition that emphasizes esoteric practices for rapid enlightenment, with its roots in Indian tantric Buddhism of the late first millennium CE. In Tibet, this tradition took hold in the 8th century during the reign of King Trisong Detsen, who invited the Indian tantric master Padmasambhava to subdue local spirits and establish Buddhism. Padmasambhava, revered as Guru Rinpoche, is credited with founding the first Buddhist monastery at Samye and translating key tantric texts into Tibetan, often in collaboration with his consort and disciple Yeshe Tsogyal, who played a pivotal role in concealing and later revealing these teachings as terma (hidden treasures). Yeshe Tsogyal's efforts ensured the preservation of these lineages, making her a foundational figure in Tibetan tantric Buddhism.\n\nTibetan Buddhism developed into four major schools, each preserving distinct lineages while sharing Vajrayāna principles. The Nyingma school, the oldest, traces its origins directly to Padmasambhava and emphasizes the Dzogchen teachings of the Great Perfection. The Kagyu school, founded in the 11th century by Marpa the Translator, focuses on oral instructions and mahāmudrā meditation practices passed through a chain of gurus. The Sakya school, established around 1073 by Khön Könchok Gyalpo, is known for its scholarly approach to tantric philosophy and the Path with Its Result (lam 'bras) doctrine. The Gelug school, formalized in the 15th century by Tsongkhapa, prioritizes monastic discipline, logical debate, and the lamrim (stages of the path) teachings; it is led by the Dalai Lama lineage, with the 14th Dalai Lama as its current spiritual head.\n\nCentral to Vajrayāna practices in Tibet is deity yoga, a meditative visualization where practitioners identify with enlightened deities to transform ordinary perception into wisdom. Dzogchen, prominent in the Nyingma and Kagyu schools, involves direct recognition of the mind's innate purity beyond conceptual elaboration. Lamrim, especially emphasized in the Gelug tradition, outlines a graduated path integrating sutra and tantra for cultivating bodhicitta and realizing emptiness. The role of the guru is paramount, as devotion to a qualified teacher is seen as essential for receiving empowerments (wang) and guidance, enabling practitioners to navigate the subtle energies and commitments of tantric practice.\n\nIn the modern era, Tibetan Buddhism faced profound disruption following the 1959 Chinese invasion of Tibet, which led to the exile of the Dalai Lama and over 100,000 Tibetans to India, where they established centers like Dharamsala to preserve their traditions. From exile, the tradition has spread globally, adapting to new contexts while maintaining core practices. The Mind and Life Institute, co-founded by the Dalai Lama in 1987, has facilitated ongoing dialogues between Tibetan Buddhist scholars and Western scientists, with recent 2025 initiatives focusing on integrating contemplative practices with neuroscience to address global challenges like mental health and environmental sustainability.\n\n## Institutions and Community\n\n### The Saṅgha and Monastic Life\n\nThe Saṅgha, the monastic community of fully ordained monks (bhikkhus) and nuns (bhikkhunis), forms the institutional core of Buddhism, embodying the third Jewel alongside the Buddha and Dharma. Entry into the Saṅgha occurs through the Upasampada, the higher ordination ceremony that grants full monastic status after preliminary novice training. For bhikkhus, candidates must be at least 20 years old (from conception), free from disqualifying conditions like serious illness or criminal background, and undergo a formal community transaction involving at least 10 monks in a designated assembly area (sima), where they affirm their commitment to the Vinaya discipline. Bhikkhunis follow a more elaborate dual process: first ordination by a quorum of bhikkhunis after two years as a probationer (sikkhamana) observing six precepts, followed by a second ordination by bhikkhus, ensuring integration into both genders' communities. This structure, rooted in the Vinaya Pitaka, underscores the Saṅgha's emphasis on communal validation and ethical purity.\n\nThe bhikkhuni lineage experienced a profound historical decline, vanishing in Theravada regions by the 11th century due to invasions, economic pressures on nunneries, and the extinction of transmission lines, leaving women without full ordination options for centuries. Post-2000s revival movements, initiated in the late 1990s in India and Sri Lanka through collaborations with Mahayana nuns, have ordained over 500 women, reviving the order via \"one-sided\" procedures where bhikkhus perform the ceremony. As of 2023, Thailand had around 235 bhikkhunis, with ongoing ordinations despite resistance. These efforts ignite ongoing debates: proponents argue for gender equity aligned with the Buddha's compassionate intent and modern ethics, while traditionalists in Thailand and Myanmar insist on an unbroken dual-Sangha lineage per strict Vinaya interpretation, viewing revivals as invalid. Broader Vajrayana developments, such as the 2022 ordination of 144 nuns in Bhutan, highlight global revival efforts.\n\nMonastic daily life centers on disciplined routines that cultivate mindfulness and renunciation, briefly referencing Vinaya guidelines on conduct and interdependence. Bhikkhus often begin with pindapata, the silent alms round at dawn, walking through villages in simple robes to accept food offerings in their bowls, a practice symbolizing humility, non-attachment, and mutual support between Saṅgha and laity without verbal solicitation. The day proceeds with scriptural study, meditation sessions, and light chores, culminating in a single midday meal after which no solid food is consumed, promoting moderation and focus. During vassa, the annual three-month rains retreat from July to October, monastics remain stationary in one location to minimize harm to insects and travelers amid monsoons, dedicating the period to intensified meditation, Dhamma talks, and community reflection.\n\nMembers of the Saṅgha fulfill vital roles as teachers, instructing lay followers in the Dharma through exhortations on the Eightfold Path, precepts, and meditation techniques to foster ethical living and insight. As custodians of the Dharma, they preserve the Buddha's teachings via memorization, recitation, and textual scholarship, ensuring doctrinal continuity across generations amid societal changes. Gender dynamics within the Saṅgha historically marginalized nuns through rules like the Eight Garudhammas, mandating deference to monks even if junior, compounded by fewer resources and patronage, which accelerated their institutional decline in both Theravada and Tibetan Mahayana contexts.\n\nTraditions vary significantly in monastic expression. In the Theravada forest lineage, prevalent in Thailand and Sri Lanka, practitioners adopt an ascetic lifestyle in remote wilderness settings, prioritizing solitary meditation, strict Vinaya adherence, and renunciation of comforts to pursue direct enlightenment experiences. Conversely, Mahayana engaged Buddhism, as developed in Vietnam and the West, encourages monastics to blend contemplative practice with social action, participating in humanitarian efforts like peace advocacy and environmental protection, viewing compassion (karuna) as extending to worldly engagement for universal benefit.\n\n### Temples, Monasteries, and Lay Support\n\nBuddhist temples and monasteries serve as vital physical institutions for worship, relic veneration, and monastic residence, reflecting the tradition's emphasis on communal spiritual practice. Key architectural types include the stupa, a hemispherical mound originally designed to enshrine relics of the Buddha and later symbolizing his enlightenment and the path to nirvana. Viharas, or monastic dwellings, consist of cells arranged around a central courtyard, providing living quarters and spaces for study and meditation. In East Asian contexts, pagodas evolved as multi-storied variants of the stupa, often incorporating bells and tiers to represent cosmological layers.\n\nExemplary architectures highlight regional adaptations. Borobudur in Indonesia, constructed between the 8th and 9th centuries under the Sailendra Dynasty, forms a terraced pyramid with three levels—base, body, and stupa—encompassing over 2,600 relief panels depicting Buddhist cosmology and enclosing 72 smaller stupas. Khmer influences at Angkor in Cambodia, evident in the 12th-century Bayon temple, feature towering spires adorned with 216 faces of the bodhisattva Avalokiteshvara, blending Mahayana Buddhist iconography with local motifs in a temple-mountain layout. Tibetan gompas, such as Thubchen and Jamba in Nepal's Upper Mustang region, employ earthen construction with fortified walls, assembly halls, and extensive murals illustrating tantric deities and mandalas, embodying Vajrayana aesthetics.\n\nLay support underpins the sustainability of these sites through dana, the virtue of selfless giving, where devotees provide essentials like food, robes, shelter, and funds to monastics in exchange for spiritual merit. Festivals, such as Vesak or local alms-giving events, amplify this interdependence by fostering communal rituals and donations that reinforce social bonds. Economically, historical models relied on endowments from lay patrons, enabling temples to function as lending institutions that invested donations at interest to generate perpetual income for maintenance, as seen in premodern East Asian contexts where collateral secured loans and supported monastic operations.\n\nIn the modern era, tourism has amplified economic viability for many sites but introduced challenges like overcrowding, erosion, and cultural commodification. Recent UNESCO and international projects, such as the 2025 Cambodia-Indonesia cooperation for environmental and tourism management at Borobudur and Angkor, along with ongoing conservation efforts including visitor management at Angkor (21 projects as of 2022), address these through sustainable development initiatives to preserve structural integrity amid rising pilgrim and tourist flows.\n\n## Modern Buddhism\n\n### Colonial Impacts and Revivals\n\nDuring the 16th and 17th centuries, Portuguese colonial rule in Sri Lanka led to severe suppression of Buddhism, with missionaries destroying monasteries, looting sacred treasures, and burning libraries to impose Roman Catholicism through incentives and brutal punishments, including executions and torture. The Portuguese king Dharmapala, baptized as Don Juan, even gifted major temples like the Dalada Maligawa to the colonizers, exacerbating the decline of Buddhist institutions in coastal regions until the Dutch ousted them in 1658. Dutch rule, lasting until 1796, was less religiously zealous as Protestants focused on commerce, though they restricted civil rights and education to church affiliates, allowing Buddhism to persist covertly among Sinhalese agents while indirectly aiding revival efforts like embassies to Siam for monk ordinations.\n\nIn India, the decline of Buddhism, already underway from earlier Hindu resurgence, continued under Islamic rule from the 12th century onward, with Muslim invasions destroying key monastic centers like Nalanda and Vikramashila, leaving Buddhism vulnerable due to its weakened institutional base and loss of royal patronage. This marginalization persisted into the British colonial period (18th–20th centuries), where Buddhism remained a minority faith, confined mostly to pockets in the Himalayas and Bengal, as Islamic governance further eroded its social and economic foundations without significant revival until later missionary efforts.\n\nThe late 19th century saw a notable Buddhist revival in Sri Lanka, spearheaded by Anagarika Dharmapala (1864–1933), who founded the Maha Bodhi Society in 1891 to restore sacred sites like Bodh Gaya and promote Theravada modernism amid colonial Christian proselytization. Dharmapala's international outreach peaked at the 1893 Parliament of the World's Religions in Chicago, where he represented Southern Buddhism, emphasizing its tolerance and rationality to counter Western perceptions and inspire global Buddhist unity and anticolonial sentiment. This modernist movement blended traditional piety with social reform, including education and temperance campaigns, to reclaim Buddhism's public role.\n\nBritish colonial administrations adapted Buddhism through censuses that categorized populations by religion, formalizing \"Buddhist\" as a distinct ethnic and confessional identity in Sri Lanka and Burma, which fueled nationalist consolidations and distinguished Buddhists from Hindus or Christians. In response, Theravada purification movements emerged across Sri Lanka, Burma, and Thailand, reforming the sangha to address perceived moral declines linked to colonial disruptions, emphasizing strict vinaya observance, lay education, and anticolonial resistance to safeguard the dhamma.\n\nIn Japan, Zen Buddhism was co-opted during the Meiji era (1868 onward) and imperial expansion, with leaders like D.T. Suzuki portraying it as aligned with bushido and state loyalty, justifying militarism in wars against China (1894–95) and Russia (1904–05) by framing death in battle as enlightened self-realization. Zen sects, including Rinzai and Soto, actively supported imperialism through chaplains and propaganda, integrating Zen training into military education to foster a \"cult of death\" that glorified sacrifice for the emperor until 1945.\n\nThe Chinese Cultural Revolution (1966–1976) inflicted widespread destruction on Buddhism under Mao Zedong's campaign to eradicate traditional religion, resulting in the demolition of thousands of monasteries, the persecution and killing of monks, and the suppression of rituals as feudal remnants. Han Chinese Buddhism suffered alongside Tibetan variants, with sacred texts burned and artifacts looted, reducing the sangha to near extinction and forcing survivors into labor or secularization until post-Mao reforms allowed partial recovery.\n\n### Global Spread and Western Adaptations\n\nBuddhism's global spread accelerated in the 20th century, particularly after World War II, as colonial-era foundations in Asia transitioned into broader international dissemination through migration and missionary efforts. The religion reached new audiences in Europe, the Americas, and Oceania, evolving from an exotic import to a mainstream spiritual option. This expansion was driven by both voluntary and involuntary movements of Buddhist populations, alongside Western intellectual interest in Eastern philosophies.\n\nA pivotal factor in Buddhism's Western penetration was the immigration of Asian communities, notably following the U.S. Immigration and Nationality Act of 1965, which abolished national-origin quotas and facilitated the arrival of Buddhists from countries like Vietnam, Thailand, and Japan. This act led to the establishment of ethnic Buddhist temples in urban centers such as Los Angeles and New York, serving diaspora communities while gradually attracting non-Asian converts. By the late 20th century, these immigrant networks had grown to include over 1 million Asian Buddhists in the U.S. alone, fostering cultural bridges that popularized practices like meditation.\n\nThe 1959 Tibetan uprising and subsequent exile of the Dalai Lama and thousands of Tibetans to India marked another critical wave of dissemination, introducing Vajrayāna Buddhism to global audiences through refugee communities. These exiles established monasteries in Dharamsala and beyond, preserving Tibetan traditions while exporting them via international aid and cultural exchanges; this diaspora contributed to the founding of numerous Tibetan Buddhist centers worldwide by the late 20th century. The movement not only preserved endangered lineages but also integrated Tibetan Buddhism into Western spiritual landscapes. \n\nKey figures played instrumental roles in this propagation. D.T. Suzuki, a Japanese scholar, promoted Zen Buddhism in the West through lectures and writings from the 1920s onward, influencing intellectuals like Alan Watts and Beat Generation writers, which helped Zen gain prominence in American counterculture by the 1950s. Similarly, the Dalai Lama's global tours beginning in the 1970s, including his 1979 visit to the U.S., elevated Tibetan Buddhism's visibility, emphasizing themes of compassion and non-violence that resonated amid Cold War tensions. These efforts transformed Buddhism from an academic curiosity into a lived practice for Western seekers.\n\nWestern adaptations of Buddhism often involved secularizing core practices to align with individualistic and therapeutic cultures. The Insight Meditation Society, founded in 1975 by Jack Kornfield, Joseph Goldstein, and Sharon Salzberg in Barre, Massachusetts, exemplified this by blending Theravāda vipassanā techniques with Western psychology, attracting lay practitioners without requiring monastic commitment; it has since trained thousands and influenced global mindfulness programs. In the 21st century, this trend culminated in the proliferation of secular mindfulness applications, with a notable boom by 2025 driven by apps like Headspace and Calm, which reported over 200 million combined downloads as of 2025 and integrated Buddhist-derived meditation into daily wellness routines for non-religious users. These adaptations prioritize stress reduction and mental health, diverging from traditional soteriological goals.\n\nDespite these successes, the global spread has faced challenges, including accusations of cultural dilution as Western interpretations sometimes strip away doctrinal contexts, leading to \"McMindfulness\" critiques where commercialized practices overshadow ethical precepts. Interfaith dialogues, such as those facilitated by the Dalai Lama with Christian and Jewish leaders since the 1980s, have mitigated some tensions by fostering mutual understanding, though debates persist over authenticity in hybridized forms. These dynamics highlight Buddhism's adaptability amid globalization.\n\n### Neo-Buddhist Movements\n\nNeo-Buddhist movements represent contemporary reinterpretations of Buddhist teachings that adapt core principles to address modern social, ethical, and philosophical challenges, often diverging from traditional doctrines to emphasize activism, equality, and secular practice. These movements emerged primarily in the 20th and 21st centuries, responding to issues like caste oppression, war, and religious dogma, while drawing on the Buddha's emphasis on suffering and ethical action as a foundation. Unlike established schools, they prioritize practical application in diverse cultural contexts, fostering conversions and communities focused on justice and mindfulness without reliance on supernatural elements.\n\nNavayana Buddhism, also known as Neo-Buddhism, was founded by B.R. Ambedkar in India as a vehicle for social emancipation, particularly for Dalits facing caste-based discrimination. On October 14, 1956, Ambedkar led a mass conversion ceremony in Nagpur, where approximately 500,000 Dalits publicly renounced Hinduism and embraced Buddhism, marking a pivotal act of collective resistance against untouchability. Ambedkar reinterpreted Buddhist texts in his seminal work *The Buddha and His Dhamma* (published posthumously in 1957), framing the religion as a rational system for liberty, equality, and fraternity, with a strong emphasis on social justice over metaphysical rebirth or karma as excuses for inequality. This approach positions Navayana as the \"ninth vehicle\" of Buddhism, distinct from traditional Theravada, Mahayana, and Vajrayana paths, by integrating anti-caste activism into dharma practice.\n\nEngaged Buddhism, pioneered by Vietnamese monk Thich Nhat Hanh during the Vietnam War, integrates mindfulness and meditation with direct social and political action to alleviate suffering in the world. In the 1960s, Nhat Hanh and his School of Youth for Social Services organized relief efforts for war victims, rebuilding villages and aiding refugees, which led to his coining of the term \"engaged Buddhism\" to describe this fusion of inner peace and outer activism. Exiled from Vietnam in 1966 for opposing the conflict, Nhat Hanh advocated nonviolent resistance, influencing global peace movements through teachings that urge practitioners to \"be peace\" amid injustice. His initiatives included peace walks, such as the 2007 march in Los Angeles with thousands of participants, symbolizing collective steps toward reconciliation and environmental awareness, as detailed in his writings like *Being Peace* (1987).\n\nSecular Buddhism, advanced by scholar-practitioner Stephen Batchelor, adopts an agnostic stance toward traditional Buddhist cosmology, focusing instead on the historical Buddha's ethical and psychological insights as tools for contemporary living without doctrines of karma, rebirth, or divine realms. Batchelor, a former Tibetan Buddhist monk, articulated this in works like *Buddhism Without Beliefs* (1997) and *Secular Buddhism: Imagining the Dharma in the Age of Science and Reason* (2017), reinterpreting the Four Noble Truths as practical tasks rather than metaphysical assertions. In the 2020s, this approach has flourished through online communities, such as the Secular Buddhist Network and forums like those on Reddit's r/secularbuddhism, where participants—often in the West—discuss meditation, ethics, and doubt in accessible, non-dogmatic terms, attracting agnostics and skeptics seeking evidence-based mindfulness.\n\nSignificant conversions highlight the appeal of these movements, particularly among marginalized groups and public figures. In India, Dalit conversions to Buddhism, inspired by Ambedkar's Navayana, continue to grow, with estimates of approximately 10 million adherents as of 2025, driven by ongoing ceremonies in states like Maharashtra where nearly half of Dalits have embraced the faith as a rejection of caste hierarchy. In the West, celebrities like actor Richard Gere, who converted to Tibetan-influenced Buddhism in 1978 amid personal struggles, have amplified its visibility; Gere's advocacy for Tibetan rights through organizations like Tibet House US exemplifies how high-profile endorsements foster broader cultural engagement with Buddhist principles.\n\n### Contemporary Challenges and Reforms\n\nIn the 21st century, Buddhist communities worldwide have confronted significant challenges related to sexual misconduct by spiritual leaders, prompting widespread scrutiny and calls for accountability. In 2017, allegations of physical, emotional, and sexual abuse against Sogyal Rinpoche, founder of the Tibetan Buddhist organization Rigpa, led to his resignation following an open letter from senior students and an independent investigation that confirmed patterns of harmful behavior over decades. Similarly, in the Zen tradition, Eido Tai Shimano, abbot of the Zen Studies Society in New York, faced exposure of long-standing sexual exploitation of students, culminating in his 2010 resignation after decades of documented misconduct. These cases, among others, have fueled a broader #MeToo reckoning within Buddhist circles during the 2020s, with reports of abuse in organizations like Shambhala and Chinese monasteries highlighting systemic issues of power imbalances in teacher-student dynamics.\n\nIn response to these scandals, Buddhist institutions have pursued reforms aimed at enhancing gender equality and ethical oversight. A notable advancement occurred in 2003 when the first Thai woman, Dhammananda Bhikkhuni, received full bhikkhunī ordination in the Theravāda tradition in Sri Lanka, reviving ordination for women after a millennium-long absence and challenging patriarchal monastic structures. This revival has since expanded in Thailand, with over 200 women ordained as bhikkhunīs by 2010, fostering greater female participation in leadership roles. Complementing these efforts, organizations have adopted transparency codes, such as ethical guidelines emphasizing accountability and reporting mechanisms; for instance, the Thai Saṅgha Supreme Council issued reforms in 2015 mandating financial disclosures and prohibiting monks from handling money personally to curb corruption. These measures draw on Buddhist precepts like right speech and right livelihood to promote institutional integrity.\n\nBeyond internal ethical concerns, contemporary Buddhism grapples with external pressures, including environmental activism and political conflicts. The EcoDharma movement, emerging in the early 2000s and gaining momentum post-2010, integrates Buddhist teachings on interdependence with climate action, as seen in initiatives like One Earth Sangha, which since 2014 has mobilized practitioners for ecological advocacy through retreats and online platforms. In Myanmar, Buddhist nationalist rhetoric has exacerbated the Rohingya crisis since 2017, with monks like Ashin Wirathu promoting anti-Muslim sentiments that contributed to military violence displacing over 700,000 Rohingya to Bangladesh, drawing international condemnation for contradicting core Buddhist non-violence principles.\n\nBy 2025, technological advancements have introduced new challenges and adaptations in Buddhist practice. Concerns over AI ethics in meditation apps have arisen, with initiatives like the Buddhism \\u0026 AI Initiative, launched in August 2025, advocating for algorithms aligned with precepts such as non-harm, amid critiques of apps like \"Buddha Teachings AI\" for potentially commodifying dharma without cultural sensitivity. The COVID-19 pandemic accelerated the formation of virtual saṅghas, with platforms like Zoom enabling global communities—such as the Barre Center for Buddhist Studies' Daily Sit program—to sustain daily meditations and discussions, fostering inclusivity for remote practitioners while raising questions about the efficacy of digital interdependence compared to in-person gatherings.\n\n## Cultural Influence\n\n### Art, Architecture, and Literature\n\nBuddhist art encompasses a rich tradition of visual representations that evolved across regions and centuries, serving as aids for meditation, devotion, and teaching. In the Gandhara region of northwest Pakistan and eastern Afghanistan, from the 1st to 5th centuries CE, artists blended Greco-Roman influences with Buddhist iconography, producing some of the earliest anthropomorphic images of the Buddha. These sculptures, often carved from schist or cast in bronze, emphasized realism through naturalistic musculature, detailed drapery folds reminiscent of classical togas, and individualized facial features, as seen in a seated Buddha statue from the 1st–2nd century CE adorned with gold leaf and a serrated halo.\n\nDuring the Gupta period (c. 320–647 CE) in northern India, Buddha icons shifted toward idealization, portraying the figure as a serene, deified being with refined proportions and spiritual grace. Sculptors in centers like Sarnath and Mathura used red or yellowish sandstone to create standing Buddhas with smooth, clinging robes, ornate halos, and tight curls atop the head, symbolizing enlightenment; a notable example is the Standing Buddha from Sarnath (474 CE), which exemplifies this harmonious, classical aesthetic that influenced later Asian traditions. In Tibetan Buddhism, thangka paintings emerged as portable, scroll-like artworks on cotton or silk, using mineral pigments to depict deities, mandalas, or enlightened beings for meditative practice. These intricate compositions, dating from the 15th to 19th centuries, feature a central figure—such as a wrathful protector like Chaturmukha Mahakala or a compassionate deity like White Tara—surrounded by symbolic retinues, aiding visualization of spiritual paths and accrual of merit.\n\nBuddhist architecture manifests in monumental structures that embody cosmological and doctrinal principles, often integrating natural landscapes. The Ajanta Caves in Maharashtra, India, constructed between the 2nd century BCE and 650 CE, represent a pinnacle of rock-cut design with 30 viharas (monasteries) and chaitya halls (prayer spaces) carved into a horseshoe-shaped basalt cliff. These spaces feature vaulted ceilings, pillared halls, and central stupas, adorned with murals depicting the Buddha's life and Jataka tales; for instance, Cave 1 includes a shrine with a Bodhisattva Padmapani fresco, using dry-fresco techniques with pigments like lapis lazuli to evoke Mahayana themes of compassion. In Japan, Kyoto's temples showcase refined wooden architecture adapted from Chinese models, emphasizing harmony with nature. Temples like Kinkaku-ji (Golden Pavilion), built in the Muromachi period (14th–16th centuries), exemplify the Setchūyō style—a fusion of earlier Wayō (minimalist, Heian-era) and Zenshūyō (Zen-inspired, with curved roofs and meditative interiors)—featuring gold-leafed exteriors, multi-tiered roofs, and gardens that promote contemplation.\n\nA core symbolic element in Buddhist architecture is the stupa, a hemispherical mound originally housing relics but evolving to represent the enlightened mind of the Buddha. Its form—base for stability, dome for the body, spire for wisdom—encapsulates the path to liberation, with circumambulation fostering mindfulness and merit; as physical embodiments of ultimate reality, stupas like those at Sanchi or Borobudur serve as focal points for devotion.\n\nBuddhist literature includes diverse narrative and paradoxical forms that convey ethical and philosophical insights through storytelling. The Jataka tales, a collection of over 550 fables from the 4th century BCE to 4th century CE, recount the previous lives of the Buddha as human or animal protagonists, illustrating virtues like compassion and wisdom; for example, \"The Golden Mallard\" warns against greed through a bird's exploited generosity, while \"The Talkative Tortoise\" stresses restraint, embedding moral lessons within engaging narratives preserved in Pali canon texts. In Zen traditions, koans—paradoxical anecdotes or questions from Chinese Chan lore, compiled in works like *The Gateless Barrier* (13th century)—challenge rational thought to provoke insight, such as the query \"What is the sound of one hand clapping?\"; these dialogs, rooted in teacher-student encounters, function as meditative tools rather than linear teachings.\n\nModern Buddhist literature reflects Western adaptations, notably in Jack Kerouac's *The Dharma Bums* (1958), a semi-autobiographical novel portraying Beat Generation seekers exploring Zen through hiking, poetry, and informal study. Inspired by figures like Gary Snyder, the book popularized Buddhism among American youth, portraying it as a path to spontaneous enlightenment and influencing countercultural views of spirituality.\n\nBuddhism's artistic legacy extends to global modernism, particularly through D.T. Suzuki's mid-20th-century writings, which introduced Zen concepts like *satori* (sudden insight) and nonduality to Western intellectuals. Suzuki's interpretations, blending Eastern mysticism with Western philosophy during his U.S. residencies (1897–1909, 1949–1958), impacted avant-garde artists and thinkers, fostering a cross-cultural dialogue that reshaped perceptions of consciousness in literature and visual arts.\n\n### Philosophical and Ethical Impacts\n\nBuddhism has profoundly shaped Western philosophy, particularly through its resonance with phenomenological and process-oriented thought. Edmund Husserl, the founder of phenomenology, explicitly recognized affinities between his method of bracketing assumptions to investigate pure consciousness and Buddhist practices of introspective awareness, even classifying Buddhism as a form of transcendentalism that overcomes mundane interests akin to phenomenological reduction. Similarly, Alfred North Whitehead's process philosophy, which posits reality as a dynamic flux of events rather than static substances, mirrors Buddhist concepts of impermanence (anicca) and interdependent arising (pratītyasamutpāda), with scholars noting that Whitehead's emphasis on relational becoming aligns closely with Mahayana notions of emptiness (śūnyatā). In comparative terms, Buddhism shares existential themes with Western thinkers like Jean-Paul Sartre and Albert Camus, such as the recognition of suffering as inherent to existence and the imperative for authentic self-creation amid absurdity, though Buddhism offers liberation through ethical discipline rather than Sartre's radical freedom.\n\nBuddhist ethics, rooted in principles like non-violence (ahimsa) and compassion (karuṇā), have influenced modern moral frameworks, notably in the advocacy for non-violence and animal rights. Mahatma Gandhi drew from Buddhist teachings on ahimsa, viewing Buddhism as a progressive embodiment of non-violence that informed his satyagraha movement, integrating it with broader Indian traditions to promote peaceful resistance against oppression. Philosopher Peter Singer, a leading voice in animal ethics, has expressed affinity with Buddhist compassion for all sentient beings, citing practices like mercy release as parallels to his utilitarian arguments against speciesism in works like *Animal Liberation*, though his framework remains secular. In environmental ethics, Arne Naess's deep ecology platform, which asserts the intrinsic value of all life forms, incorporates Buddhist insights into interconnectedness and non-harm, positioning ecosophy T as a synthesis that echoes the ecological wisdom in texts like the *Lotus Sutra*.\n\nContemporary dialogues between Buddhism and science, especially neuroscience, explore consciousness and the mind, with recent conferences fostering interdisciplinary exchange. The 2025 UKABS Scholar-Practitioner Conference on \"Consciousness in Buddhism\" and the Science of Consciousness conference in Barcelona highlight how Buddhist meditation practices inform neural models of awareness, such as predictive processing and correlates of consciousness, bridging ancient insights with empirical findings on mindfulness-induced brain changes.\n\nGlobally, Buddhism's ethical teachings have gained institutional recognition and practical application in mental health. The United Nations General Assembly's Resolution 54/115 in 1999 officially recognized Vesak as an international day, honoring Buddhism's contributions to peace and non-violence observed annually at UN headquarters. In therapy, mindfulness-based interventions (MBIs) derived from Buddhist practices, such as Mindfulness-Based Cognitive Therapy (MBCT), have demonstrated moderate reductions in depression (e.g., effect size SMD ≈ -0.57), anxiety (≈ -0.5), and stress symptoms in meta-analyses of 2020s studies, with hundreds of randomized trials across the literature showing sustained benefits in clinical populations like university students and those with chronic conditions.\n\n## Demographics and Global Presence\n\n### Current Adherents and Distribution\n\nBuddhism counts approximately 324 million adherents globally as of 2020, comprising about 4% of the world's population, according to the most recent comprehensive estimates based on self-identification in censuses and surveys. This figure reflects a slight decline from 343 million in 2010, primarily due to demographic shifts in Asia. However, estimating the Buddhist population presents challenges, particularly in East Asia, where many individuals engage in Buddhist practices but do not formally self-identify as Buddhist due to syncretism with folk religions and cultural norms that view \"religion\" as organized affiliation rather than personal practice; broader estimates including cultural participants range from 500 million to over 1 billion.\n\nThe vast majority—98% or 316 million—of Buddhists reside in the Asia-Pacific region, where the faith originated and remains dominant. Theravāda Buddhism prevails in Southeast Asian countries, such as Thailand with 67.6 million adherents (94% of the population) and Myanmar with 47.2 million (89%), while Mahāyāna traditions are prominent in East Asia, including Japan (47 million, 37%) and Vietnam (22.6 million, 23%). China hosts an estimated 53.4 million self-identified Buddhists (4% of the population), though broader cultural participation may substantially increase this number. The following table summarizes key countries by adherent numbers and share:\n\n| Country   | Adherents (2020) | % of Population |\n|-----------|------------------|-----------------|\n| Thailand | 67.6 million    | 94%            |\n| China    | 53.4 million    | 4%             |\n| Myanmar  | 47.2 million    | 89%            |\n| Japan    | 47.0 million    | 37%            |\n| Vietnam  | 22.6 million    | 23%            |\n\nOutside Asia, Buddhist communities are smaller and often consist of diaspora immigrants from Asia alongside converts. In North America, the population grew to 5 million by 2020 (1.3% of the region), with the United States accounting for the majority through immigration and interest in Western adaptations. Europe has about 2.5 million adherents (0.3%), concentrated in countries like the United Kingdom and France via migrant communities from South and Southeast Asia. These figures rely on self-reported religious affiliation, which may undercount active practitioners who blend Buddhism with secular or other spiritual identities.\n\n### Growth Trends and Regional Variations\n\nIn Asia, the Buddhist population has shown relative stability in some regions but overall stagnation or slight decline amid demographic pressures, with the Asia-Pacific count dropping 6% to 316 million between 2010 and 2020, primarily due to low fertility rates and aging societies in East Asia. In contrast, Buddhism in the West has experienced growth through conversions, estimated at around 1% annually in countries like the United States, where it is noted as the fastest-growing religion by conversion rates, driven by interest in mindfulness and secular adaptations. However, Japan exemplifies regional declines, with its Buddhist population decreasing by 7 million over the same decade, exacerbated by the nation's aging population—now comprising nearly 29% over age 65—and low birth rates around 6.8 per 1,000 people in 2020.\n\nRegional variations are pronounced in the distinction between nominal and practicing adherents, particularly in East Asia; for instance, while approximately 67% of Japanese identify as Buddhist, active practitioners number only 15-20%, reflecting a cultural affiliation tied to rituals like funerals rather than daily devotion. Secularization and declining birth rates pose ongoing challenges, contributing to Buddhism's global share falling from 4.9% in 2010 to 4.1% in 2020, as low fertility in Buddhist-majority countries like Thailand and Japan fails to offset aging demographics. The overall decline of 19 million adherents from 2010 to 2020 was influenced by these long-term demographic trends, though the COVID-19 pandemic in 2020 contributed to disruptions like temple closures that affected in-person practices.\n\nAs of 2025, digital Buddhism apps and platforms have boosted youth engagement, particularly among Chinese young adults, where post-pandemic surveys show increased use of apps for meditation and virtual sanghas, fostering \"functional\" rather than institutional affiliation amid secular shifts. Older projections from 2015 suggested a slight global increase to around 511 million by 2030 based on broader estimates, but recent self-identification data indicate continued stagnation or decline due to persistent low fertility.\n\n## Criticisms and Debates\n\n### Internal Doctrinal Debates\n\nOne of the foundational doctrinal debates in Buddhism centers on the contrasting ideals of the arhat in Theravāda and the bodhisattva in Mahāyāna traditions. In Theravāda, the arhat represents the pinnacle of personal liberation, achieved through the Noble Eightfold Path, where an individual attains nirvana by eradicating defilements and realizing the truth of suffering, impermanence, and not-self, as depicted in the Pāli Nikāyas. The Buddha himself is portrayed as the foremost arhat, guiding disciples toward this self-reliant enlightenment without an emphasis on altruistic postponement of nirvana. In contrast, Mahāyāna elevates the bodhisattva path, where practitioners vow to delay full Buddhahood across countless lifetimes to cultivate the six perfections (pāramitās) and liberate all sentient beings, as elaborated in sūtras like the Lotus Sūtra. This shift, emerging around the 1st century BCE, critiques the arhat ideal as somewhat self-centered, positioning the bodhisattva as a more compassionate, universal response to suffering.\n\nInterpretations of emptiness (śūnyatā) further highlight tensions between these schools. Theravāda views emptiness primarily as a meditative insight into the insubstantiality of phenomena, akin to not-self (anattā) and impermanence (anicca), serving as a gateway to liberation through vipassanā practice, as taught in the *Mahāsutasoma Sutta* and *Cūḷasuññata Sutta*. It is not a standalone doctrine but integrated into gradual awakening, often taught only to advanced practitioners to avoid misinterpretation. Mahāyāna, particularly in Nāgārjuna's Madhyamaka, expands emptiness to denote the lack of inherent existence in all dharmas, including nirvana itself, emphasizing interdependence and the two truths (conventional and ultimate) to transcend dualistic thinking. While both traditions agree on emptiness as absence of self-nature, Mahāyāna's ontological depth has led Theravāda adherents to critique it as overly speculative, diverging from the Buddha's pragmatic focus on dukkha.\n\nWithin the Mahāyāna Chan (Zen) tradition, a significant internal debate arose over sudden versus gradual enlightenment, crystallized in the 8th-century Platform Sūtra attributed to the Sixth Patriarch Huineng. Proponents of sudden enlightenment, like Huineng's Southern School, argued that realization of one's innate Buddha-nature occurs instantaneously, bypassing stepwise cultivation, as Huineng famously declared: \"From the beginning, not a thing is.\" This contrasted with the Northern School under Shen-hsiu, which advocated gradual purification of defilements through disciplined practice, likening the mind to a mirror polished incrementally. The debate, amplified by Shen-hui's polemics, influenced later Chan orthodoxy, favoring sudden awakening followed by gradual integration, though historical accounts suggest Shen-hui may have exaggerated the schism to legitimize Huineng's lineage. This tension echoes in Tibetan debates, such as the 8th-century bSam yas council, where sudden teachings clashed with Indian gradualism but ultimately harmonized in hybrid approaches.\n\nIn modern times, debates have emerged between secular and traditional interpretations, exemplified by Stephen Batchelor's advocacy for a \"Buddhism without beliefs.\" Batchelor reinterprets core doctrines like the Four Noble Truths as practical tasks—knowing suffering, ceasing craving—rather than metaphysical assertions involving rebirth or karma, drawing on historical-critical analysis to strip away soteriological elements incompatible with secular worldviews. Orthodox proponents, such as those in Theravāda and Tibetan traditions, counter that this dilutes the Buddha's teachings, which presuppose interdependence across lives and ultimate liberation from saṃsāra, viewing secularism as a partial adaptation that risks losing ethical depth. Similarly, the revival of bhikkhunī ordination since the 2000s has sparked controversy in Theravāda countries like Sri Lanka and Thailand. In 1998, Sri Lankan nuns received ordination from Chinese Dharmaguptaka bhikkhunīs, reviving the lineage extinct for nearly a millennium, supported by Vinaya allowances for bhikkhus to ordain in the absence of a saṅgha (Vin II 257). Opponents, including figures like Bhikkhu Bodhi and Phra Payutto, argue the lineage's extinction invalidates revival without a continuous Theravāda line, citing the sixth *garudhamma* requiring dual ordination and fears of diluting monastic discipline amid modern challenges. Proponents emphasize the Buddha's support for fourfold assemblies (DN 30) and historical precedents, viewing the debate as an opportunity to fulfill the Dharma's compassionate intent. Recent progress includes Bhutan's landmark Theravada bhikkhuni ordinations in 2022 (142 nuns) and November 2025 (over 260 nuns from multiple countries), alongside growing acceptance in Thailand.\n\nEfforts to resolve these debates have involved ecumenical initiatives, such as the World Fellowship of Buddhists (WFB), founded in 1950 to unite diverse traditions. The WFB's inaugural conference in Colombo promoted harmony by affirming shared principles like the Four Noble Truths while respecting school-specific practices, fostering dialogue on issues like ordination without imposing resolutions. Regional councils, including the Sangha Council of Southern California (1980), have facilitated inter-tradition discussions in the West, addressing doctrinal variances through joint education and interfaith collaboration to emphasize unity over division. These bodies have not eliminated debates but have encouraged pragmatic accommodations, such as provisional recognitions of bhikkhunī status in some Theravāda contexts.\n\n### External Critiques and Misconduct Issues\n\nExternal critiques of Buddhism from Western philosophers have often portrayed it as promoting nihilism and passivity, undermining human vitality and engagement with the world. Friedrich Nietzsche, in particular, lambasted Buddhism as a nihilistic doctrine that negates life's affirmative forces, describing it as a \"passive nihilism\" that seeks escape from suffering through detachment rather than conquest. He contrasted this with his ideal of the will to power, viewing Buddhist emphasis on impermanence and non-attachment as a decadent resignation suited only for \"the end and fatigue of civilization.\"\n\nChristian missionary perspectives, especially from 16th-century Jesuits in Asia, frequently condemned Buddhist practices as idolatrous, equating the veneration of Buddha statues and icons with pagan worship forbidden in monotheistic traditions. These critiques framed Buddhism as a superstitious system lacking a personal creator God, with rituals seen as deceptive deviations from true faith that ensnared adherents in spiritual error. Such views persisted in missionary literature, influencing colonial-era perceptions of Buddhism as primitive and incompatible with Christian ethics.\n\nIn contemporary Western Buddhist communities, misconduct issues have centered on power abuses within teacher-student dynamics, where gurus wield unquestioned authority, leading to sexual exploitation and emotional manipulation. Students, often idealizing teachers as enlightened figures, may overlook red flags, while concepts like \"crazy wisdom\" are invoked to justify boundary violations, blaming victims' karma or samaya vows for the harm. High-profile cases include allegations against Sogyal Rinpoche of Rigpa, involving physical assaults such as punching a nun publicly, and improper relationships that prompted his 2017 resignation.\n\nA prominent example is the 2018 scandal in Shambhala International, where an independent report detailed years of sexual misconduct by leader Sakyong Mipham Rinpoche, including coerced encounters with female students and cover-ups by senior officials. The investigation, conducted by attorney Carol Merchasin, corroborated accounts from over a dozen women, leading to the mass resignation of Shambhala's governing council and Mipham's temporary withdrawal from leadership. Into the 2020s, follow-up probes and community reckonings have revealed systemic failures, with ongoing lawsuits and reforms addressing the organization's hierarchical structure as of 2024.\n\nIn response to these abuses, Buddhist organizations have implemented ethical guidelines emphasizing boundaries and accountability. The Network of Western Buddhist Teachers' 1993 open letter condemned sexual misconduct and urged confrontation of abuses, influencing later codes like the Insight Meditation Society's 1985 ethics prohibiting teacher-student relationships. The Soto Zen Buddhist Association's grievance process and code of conduct, adopted in the 2010s, bans sexual exploitation and mandates sanctions, while training programs like Shogaku Priest Ongoing Training (2006–2014) educate on power dynamics. These reforms aim to protect practitioners, though challenges remain in enforcing them across diverse traditions.\n\nBeyond internal scandals, Buddhism has faced criticism for its political misuse in nationalist contexts, notably in Myanmar during the 2010s, where monks leveraged religious rhetoric to fuel anti-Muslim violence against the Rohingya. Buddhist nationalists, including figures like Ashin Wirathu, portrayed the Rohingya as threats to Burmese Buddhist identity, pressuring the government to deny their citizenship and voting rights in 2015, exacerbating the 2017 military crackdown that displaced over 700,000. This instrumentalization of Buddhist principles for ethnic exclusion has drawn international condemnation as a perversion of the tradition's non-violent ethos.",
  "external_references": [
    {
      "text": "Siddhartha Gautama The Buddha",
      "url": "https://smarthistory.org/siddhartha-gautama-the-buddha/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "666",
      "url": "https://whc.unesco.org/en/list/666/",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "Introduction To Buddhism",
      "url": "https://spice.fsi.stanford.edu/docs/introduction_to_buddhism",
      "domain": "spice.fsi.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Buddhism3.html",
      "url": "https://library.brown.edu/cds/BuddhistTempleArt/buddhism3.html",
      "domain": "library.brown.edu",
      "type": "citation"
    },
    {
      "text": "Buddhist Population Change",
      "url": "https://www.pewresearch.org/religion/2025/06/09/buddhist-population-change/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Word Of The Month Buddha",
      "url": "https://maitripa.org/word-of-the-month-buddha/",
      "domain": "maitripa.org",
      "type": "citation"
    },
    {
      "text": "Buddha",
      "url": "https://www.etymonline.com/word/Buddha",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Bodhi",
      "url": "https://www.wisdomlib.org/definition/bodhi",
      "domain": "wisdomlib.org",
      "type": "citation"
    },
    {
      "text": "Obo 9780195393521 0059.xml",
      "url": "https://www.oxfordbibliographies.com/abstract/document/obo-9780195393521/obo-9780195393521-0059.xml",
      "domain": "oxfordbibliographies.com",
      "type": "citation"
    },
    {
      "text": "Why Fotuo Chinese Word Buddha His Birthday Celebrated Week",
      "url": "https://www.scmp.com/magazines/post-magazine/article/3134054/why-fotuo-chinese-word-buddha-his-birthday-celebrated-week",
      "domain": "scmp.com",
      "type": "citation"
    },
    {
      "text": "9781118610398.ch5",
      "url": "https://onlinelibrary.wiley.com/doi/pdf/10.1002/9781118610398.ch5",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Dharma",
      "url": "https://www.etymonline.com/word/dharma",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Samsara",
      "url": "https://www.merriam-webster.com/dictionary/samsara",
      "domain": "merriam-webster.com",
      "type": "citation"
    },
    {
      "text": "Nirvana In The Different Buddhist Systems",
      "url": "https://studybuddhism.com/en/advanced-studies/lam-rim/samsara-nirvana/nirvana-in-the-different-buddhist-systems",
      "domain": "studybuddhism.com",
      "type": "citation"
    },
    {
      "text": "Stanford Scholar Discusses Buddhism Origins",
      "url": "https://news.stanford.edu/stories/2018/08/stanford-scholar-discusses-buddhism-origins",
      "domain": "news.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Religion Without God",
      "url": "https://www.lionsroar.com/religion-without-god/",
      "domain": "lionsroar.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.andrews.edu/cgi/viewcontent.cgi?article=1249\\u0026context=jams",
      "domain": "digitalcommons.andrews.edu",
      "type": "citation"
    },
    {
      "text": "463283",
      "url": "https://www.journals.uchicago.edu/doi/pdfplus/10.1086/463283",
      "domain": "journals.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Is Buddhism A Religion",
      "url": "https://www.lionsroar.com/is-buddhism-a-religion/",
      "domain": "lionsroar.com",
      "type": "citation"
    },
    {
      "text": "A Philosophical Assessment Of Secular Buddhism",
      "url": "https://www.buddhistinquiry.org/article/a-philosophical-assessment-of-secular-buddhism/",
      "domain": "buddhistinquiry.org",
      "type": "citation"
    },
    {
      "text": "349881347 Buddha As A Historical Figure",
      "url": "https://www.researchgate.net/publication/349881347_Buddha_as_a_Historical_Figure",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "The Death Of The Buddhas Mother",
      "url": "https://bulletin.hds.harvard.edu/the-death-of-the-buddhas-mother/",
      "domain": "bulletin.hds.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Authenticity.html",
      "url": "https://www.accesstoinsight.org/lib/authors/thanissaro/authenticity.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Archaeologists Learning Buddha Legenday Nepali Hometown 180986227",
      "url": "https://www.smithsonianmag.com/history/archaeologists-learning-buddha-legenday-nepali-hometown-180986227/",
      "domain": "smithsonianmag.com",
      "type": "citation"
    },
    {
      "text": "2717",
      "url": "https://journals.ub.uni-heidelberg.de/index.php/jiabs/article/viewFile/8810/2717",
      "domain": "journals.ub.uni-heidelberg.de",
      "type": "citation"
    },
    {
      "text": "Levman The Buddha As An Historical Figure.pdf",
      "url": "https://thecjbs.org/wp-content/uploads/2019/07/Levman_The-Buddha-as-An-Historical-Figure.pdf",
      "domain": "thecjbs.org",
      "type": "citation"
    },
    {
      "text": "152025248",
      "url": "https://academic.oup.com/book/7301/chapter/152025248",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Gilad.yakir Thesis 2023 Ma Bs.pdf",
      "url": "https://ryi.org/wp-content/uploads/2023/10/Gilad.Yakir-Thesis-2023-MA-BS.pdf",
      "domain": "ryi.org",
      "type": "citation"
    },
    {
      "text": "1053",
      "url": "https://whc.unesco.org/en/news/1053",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "279750471 Lumbini Its Challenge Now And Then Lumbini Its Challenges Now And Then",
      "url": "https://www.researchgate.net/publication/279750471_Lumbini_its_challenge_now_and_then_Lumbini_its_challenges_now_and_then",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "244",
      "url": "https://jocbs.org/index.php/jocbs/article/download/193/244",
      "domain": "jocbs.org",
      "type": "citation"
    },
    {
      "text": "Awynne2005wzks.pdf",
      "url": "https://ocbs.org/wp-content/uploads/2015/09/awynne2005wzks.pdf",
      "domain": "ocbs.org",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/mn36/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/mn26/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/sn56.11/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Brahmali",
      "url": "https://suttacentral.net/pli-tv-kd1/en/brahmali",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/mn56/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.accesstoinsight.org/tipitaka/vin/index.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Bps Essay 20.html",
      "url": "https://www.accesstoinsight.org/lib/authors/bodhi/bps-essay_20.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Sn56.011.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/sn/sn56/sn56.011.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Truths.html",
      "url": "https://www.accesstoinsight.org/lib/study/truths.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Mn.141.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/mn/mn.141.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780199340378 E 180",
      "url": "https://oxfordre.com/religion/display/10.1093/acrefore/9780199340378.001.0001/acrefore-9780199340378-e-180",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Wheel186.html",
      "url": "https://www.accesstoinsight.org/lib/authors/various/wheel186.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Mn.002.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/mn/mn.002.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Sn22.059.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/sn/sn22/sn22.059.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Samsara.html",
      "url": "https://www.accesstoinsight.org/lib/authors/thanissaro/samsara.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Doc1460942.html",
      "url": "https://www.wisdomlib.org/buddhism/essay/animals-in-buddhism/d/doc1460942.html",
      "domain": "wisdomlib.org",
      "type": "citation"
    },
    {
      "text": "Karma",
      "url": "https://www.buddhanet.net/e-learning/karma/",
      "domain": "buddhanet.net",
      "type": "citation"
    },
    {
      "text": "Mn.019.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/mn/mn.019.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Death The Bardo And Rebirth In Tibetan Buddhism",
      "url": "https://rubinmuseum.org/death-the-bardo-and-rebirth-in-tibetan-buddhism/",
      "domain": "rubinmuseum.org",
      "type": "citation"
    },
    {
      "text": "Kamma.html",
      "url": "https://www.accesstoinsight.org/lib/study/kamma.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Mn.135.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/mn/mn.135.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Nibbana.html",
      "url": "https://www.accesstoinsight.org/lib/authors/thanissaro/nibbana.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Nibbana.html",
      "url": "https://www.accesstoinsight.org/ptf/dhamma/sacca/sacca3/nibbana.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.accesstoinsight.org/lib/authors/thanissaro/likefire/index.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Reflections On Nibbana",
      "url": "https://www.buddhistinquiry.org/article/reflections-on-nibbana/",
      "domain": "buddhistinquiry.org",
      "type": "citation"
    },
    {
      "text": "Into The Stream.html",
      "url": "https://www.accesstoinsight.org/lib/study/into_the_stream.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Diamond Sutra.html",
      "url": "http://www.acmuller.net/bud-canon/diamond_sutra.html",
      "domain": "acmuller.net",
      "type": "citation"
    },
    {
      "text": "Diamond Sutra Translation.pdf",
      "url": "https://www.lifelonglearningcollaborative.org/silkroads/articles/diamond-sutra-translation.pdf",
      "domain": "lifelonglearningcollaborative.org",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/dn15/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Dependentarising.pdf",
      "url": "https://www.saet.ac.uk/Buddhism/DependentArising.pdf",
      "domain": "saet.ac.uk",
      "type": "citation"
    },
    {
      "text": "Mahasi Dependent Origination.pdf",
      "url": "http://abhidhamma.com/Mahasi_Dependent_Origination.pdf",
      "domain": "abhidhamma.com",
      "type": "citation"
    },
    {
      "text": "335229447 The Doctrine Of Not Self Anatta In Early Buddhism",
      "url": "https://www.researchgate.net/publication/335229447_The_Doctrine_of_Not-self_anatta_in_Early_Buddhism",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Irsr 2019 0003.pdf",
      "url": "http://archive.sciendo.com/IRSR/irsr.2019.9.issue-1/irsr-2019-0003/irsr-2019-0003.pdf",
      "domain": "archive.sciendo.com",
      "type": "citation"
    },
    {
      "text": "Nagarjun",
      "url": "https://iep.utm.edu/nagarjun/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Tath%c4%81gatagarbha",
      "url": "https://buddhanature.tsadra.org/index.php/Key_Terms/tath%C4%81gatagarbha",
      "domain": "buddhanature.tsadra.org",
      "type": "citation"
    },
    {
      "text": "14639947.2018.1572329",
      "url": "https://www.tandfonline.com/doi/full/10.1080/14639947.2018.1572329",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Yogacara",
      "url": "https://plato.stanford.edu/entries/yogacara/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Tisarana.html",
      "url": "https://www.accesstoinsight.org/ptf/tisarana.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Refuge.html",
      "url": "https://www.accesstoinsight.org/lib/authors/thanissaro/refuge.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Wheel282.html",
      "url": "https://www.accesstoinsight.org/lib/authors/bodhi/wheel282.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Dn30",
      "url": "https://suttafriends.org/sutta/dn30/",
      "domain": "suttafriends.org",
      "type": "citation"
    },
    {
      "text": "The Meaning Of Sangha",
      "url": "https://studybuddhism.com/en/advanced-studies/lam-rim/refuge/the-meaning-of-sangha",
      "domain": "studybuddhism.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.macalester.edu/cgi/viewcontent.cgi?article=2072\\u0026context=himalaya",
      "domain": "digitalcommons.macalester.edu",
      "type": "citation"
    },
    {
      "text": "Loka.html",
      "url": "https://www.accesstoinsight.org/ptf/dhamma/sagga/loka.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Buddhistcosmolog0000sada",
      "url": "https://archive.org/details/buddhistcosmolog0000sada",
      "domain": "archive.org",
      "type": "citation"
    },
    {
      "text": "Azu Etd 18946 Sip1 M.pdf",
      "url": "https://repository.arizona.edu/bitstream/handle/10150/660124/azu_etd_18946_sip1_m.pdf?sequence=1\\u0026isAllowed=y",
      "domain": "repository.arizona.edu",
      "type": "citation"
    },
    {
      "text": "The Mandala A Guide To Transformation",
      "url": "https://rubinmuseum.org/the-mandala-a-guide-to-transformation/",
      "domain": "rubinmuseum.org",
      "type": "citation"
    },
    {
      "text": "Waytoend.html",
      "url": "https://www.accesstoinsight.org/lib/authors/bodhi/waytoend.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Bodhi",
      "url": "https://suttacentral.net/sn56.11/en/bodhi",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Sn45.008.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/sn/sn45/sn45.008.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "A Secular Reinterpretation Of The Eightfold Path",
      "url": "https://secularbuddhistnetwork.org/a-secular-reinterpretation-of-the-eightfold-path/",
      "domain": "secularbuddhistnetwork.org",
      "type": "citation"
    },
    {
      "text": "Vinaya Guide Brahmali",
      "url": "https://suttacentral.net/vinaya-guide-brahmali",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Pancasila.html",
      "url": "https://www.accesstoinsight.org/ptf/dhamma/sila/pancasila.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "An08.039.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/an/an08/an08.039.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Atthasila.html",
      "url": "https://www.accesstoinsight.org/ptf/dhamma/sila/atthasila.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Dn.02.0.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/dn/dn.02.0.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Uposatha.html",
      "url": "https://www.accesstoinsight.org/lib/authors/nanavara/uposatha.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Bhikkhuni Pati.html",
      "url": "https://www.accesstoinsight.org/tipitaka/vin/sv/bhikkhuni-pati.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.accesstoinsight.org/ptf/dhamma/sila/index.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Wallace Samatha.pdf",
      "url": "https://faculty.wcas.northwestern.edu/paller/dialogue/Wallace-Samatha.pdf",
      "domain": "faculty.wcas.northwestern.edu",
      "type": "citation"
    },
    {
      "text": "292313299 The Origin Of Buddhist Meditation",
      "url": "https://www.researchgate.net/publication/292313299_The_Origin_of_Buddhist_Meditation",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Mn.118.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/mn/mn.118.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Wheel351.html",
      "url": "https://www.accesstoinsight.org/lib/authors/gunaratana/wheel351.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Wheel006.html",
      "url": "https://www.accesstoinsight.org/lib/authors/nyanaponika/wheel006.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Pmc9559070",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9559070/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Vipassana The Three Characteristics And The First Satipatthana",
      "url": "https://www.buddhistinquiry.org/article/vipassana-the-three-characteristics-and-the-first-satipatthana/",
      "domain": "buddhistinquiry.org",
      "type": "citation"
    },
    {
      "text": "Progress.html",
      "url": "https://www.accesstoinsight.org/lib/authors/mahasi/progress.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Wh015 Piyadassi Dependent Origination.pdf",
      "url": "https://bps.lk/olib/wh/wh015_Piyadassi_Dependent-Origination.pdf",
      "domain": "bps.lk",
      "type": "citation"
    },
    {
      "text": "The Dynamics Of Theravada Insight Meditation",
      "url": "https://www.buddhistinquiry.org/article/the-dynamics-of-theravada-insight-meditation/",
      "domain": "buddhistinquiry.org",
      "type": "citation"
    },
    {
      "text": "375717214 Comparison Of Theravada Meditation And Zen Meditation",
      "url": "https://www.researchgate.net/publication/375717214_COMPARISON_OF_THERAVADA_MEDITATION_AND_ZEN_MEDITATION",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Refuge.pdf",
      "url": "https://fpmt.org/wp-content/uploads/2022/06/Refuge.pdf",
      "domain": "fpmt.org",
      "type": "citation"
    },
    {
      "text": "Taking Refuge",
      "url": "https://www.wisdomlib.org/concept/taking-refuge",
      "domain": "wisdomlib.org",
      "type": "citation"
    },
    {
      "text": "Spiritual Practice For Life",
      "url": "https://thubtenchodron.org/2007/08/spiritual-practice-for-life/",
      "domain": "thubtenchodron.org",
      "type": "citation"
    },
    {
      "text": "The Seven Branch Offering Commentary By His Holiness Penor Rinpoche",
      "url": "https://www.tibetanbuddhistaltar.org/the-seven-branch-offering-commentary-by-his-holiness-penor-rinpoche/",
      "domain": "tibetanbuddhistaltar.org",
      "type": "citation"
    },
    {
      "text": "556 Advice On How To Pray Circumambulate And Make Offering In Honouring A Stupa",
      "url": "https://pathgate.org/index.php/gateway-to-tibetan-buddhism/556-advice-on-how-to-pray-circumambulate-and-make-offering-in-honouring-a-stupa",
      "domain": "pathgate.org",
      "type": "citation"
    },
    {
      "text": "Giving Universe Merit",
      "url": "https://thubtenchodron.org/1994/06/giving-universe-merit/",
      "domain": "thubtenchodron.org",
      "type": "citation"
    },
    {
      "text": "Merit Making",
      "url": "https://www.tibetanbc.org/support-us/merit-making",
      "domain": "tibetanbc.org",
      "type": "citation"
    },
    {
      "text": "Avalokitesvara",
      "url": "https://encyclopediaofbuddhism.org/wiki/Avalokitesvara",
      "domain": "encyclopediaofbuddhism.org",
      "type": "citation"
    },
    {
      "text": "12leefinal.pdf",
      "url": "https://www.undv.org/vesak2011/panel2/12LeeFINAL.pdf",
      "domain": "undv.org",
      "type": "citation"
    },
    {
      "text": "544",
      "url": "https://www.purelandbuddhism.org/cp/4-1-1/544",
      "domain": "purelandbuddhism.org",
      "type": "citation"
    },
    {
      "text": "9789004401518 032",
      "url": "https://doi.org/10.1163/9789004401518_032",
      "domain": "doi.org",
      "type": "citation"
    },
    {
      "text": "Buddhist Holidays",
      "url": "https://www.sukhasiddhi.org/blog/buddhist-holidays",
      "domain": "sukhasiddhi.org",
      "type": "citation"
    },
    {
      "text": "Wheel402.html",
      "url": "https://www.accesstoinsight.org/lib/authors/kariyawasam/wheel402.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Buddhist Devotion",
      "url": "https://encyclopediaofbuddhism.org/wiki/Buddhist_devotion",
      "domain": "encyclopediaofbuddhism.org",
      "type": "citation"
    },
    {
      "text": "Bl036.html",
      "url": "https://www.accesstoinsight.org/lib/authors/prince/bl036.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Mn.036.than.html",
      "url": "https://www.accesstoinsight.org/tipitaka/mn/mn.036.than.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/an6.50/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "212107445",
      "url": "https://academic.oup.com/edited-volume/28081/chapter/212107445",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Wheel206.html",
      "url": "https://www.accesstoinsight.org/lib/authors/khantipalo/wheel206.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Sujato",
      "url": "https://suttacentral.net/mn10/en/sujato",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Wayof.html",
      "url": "https://www.accesstoinsight.org/lib/authors/soma/wayof.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Kabat Zinn On Mbsr Origins.pdf",
      "url": "https://miamimindfulness.com/wp-content/uploads/2018/10/kabat-zinn-on-mbsr-origins.pdf",
      "domain": "miamimindfulness.com",
      "type": "citation"
    },
    {
      "text": "Pmc8789374",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8789374/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "4e954db9782ed733ad8ebc54259442a2",
      "url": "https://www.cambridge.org/core/books/reconstructing-early-buddhism/eightfold-path/4E954DB9782ED733AD8EBC54259442A2",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Early Buddhist Manuscripts",
      "url": "https://www.neh.gov/article/early-buddhist-manuscripts",
      "domain": "neh.gov",
      "type": "citation"
    },
    {
      "text": "Tipitaka",
      "url": "https://www.accesstoinsight.org/tipitaka/",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "suttacentral.net",
      "url": "https://suttacentral.net/",
      "domain": "suttacentral.net",
      "type": "citation"
    },
    {
      "text": "Early Years And Historical Context",
      "url": "https://open.library.okstate.edu/interculturalcommunication/chapter/early-years-and-historical-context/",
      "domain": "open.library.okstate.edu",
      "type": "citation"
    },
    {
      "text": "Fieldguide.html",
      "url": "https://www.accesstoinsight.org/noncanon/fieldguide.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Dhp.intro.budd.html",
      "url": "https://www.accesstoinsight.org/tipitaka/kn/dhp/dhp.intro.budd.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Pathofpurification2011.pdf",
      "url": "https://www.accesstoinsight.org/lib/authors/nanamoli/PathofPurification2011.pdf",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Mahayana Primary Texts",
      "url": "https://research.lib.buffalo.edu/buddhism/mahayana-primary-texts",
      "domain": "research.lib.buffalo.edu",
      "type": "citation"
    },
    {
      "text": "Mahayana Sutras",
      "url": "https://encyclopediaofbuddhism.org/wiki/Mahayana_sutras",
      "domain": "encyclopediaofbuddhism.org",
      "type": "citation"
    },
    {
      "text": "Heartsutra.pdf",
      "url": "https://huntingtonarchive.org/resources/downloads/sutras/02Prajnaparamita/heartsutra.pdf",
      "domain": "huntingtonarchive.org",
      "type": "citation"
    },
    {
      "text": "Dbet T0262 Lotussutra 2007.pdf",
      "url": "https://www.bdk.or.jp/document/dgtl-dl/dBET_T0262_LotusSutra_2007.pdf",
      "domain": "bdk.or.jp",
      "type": "citation"
    },
    {
      "text": "4 2 Oneill.pdf",
      "url": "https://www.shin-ibs.edu/documents/pwj4/1/4-2-Oneill.pdf",
      "domain": "shin-ibs.edu",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://ecommons.cornell.edu/bitstreams/fa6d4318-7489-4be1-88b2-905948750af5/download",
      "domain": "ecommons.cornell.edu",
      "type": "citation"
    },
    {
      "text": "27645",
      "url": "https://hts.org.za/index.php/hts/article/view/9948/27645",
      "domain": "hts.org.za",
      "type": "citation"
    },
    {
      "text": "East Asia",
      "url": "https://www.buddhanet.net/e-learning/buddhistworld/east-asia/",
      "domain": "buddhanet.net",
      "type": "citation"
    },
    {
      "text": "Legacy And Global Impact Of Mah%25c4%2581y%25c4%2581na Sutras D544dfd4f0fb",
      "url": "https://licentiapoetica.com/legacy-and-global-impact-of-mah%25C4%2581y%25C4%2581na-sutras-d544dfd4f0fb",
      "domain": "licentiapoetica.com",
      "type": "citation"
    },
    {
      "text": "Buddhism2.html",
      "url": "https://library.brown.edu/cds/BuddhistTempleArt/buddhism2.html",
      "domain": "library.brown.edu",
      "type": "citation"
    },
    {
      "text": "365996991 The King Of Vajrayana Guhyasamaja Tantra And The Buddhist Tantrism Ways And Traditions Of The Tantra Exegesis",
      "url": "https://www.researchgate.net/publication/365996991_The_King_of_Vajrayana_Guhyasamaja_Tantra_and_the_Buddhist_Tantrism_Ways_and_Traditions_of_the_Tantra_Exegesis",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "07 Chapter 3.pdf",
      "url": "https://www.wisdomlib.org/uploads/ocr/essays/hevajratantra/07-chapter-3.pdf",
      "domain": "wisdomlib.org",
      "type": "citation"
    },
    {
      "text": "Six Yogas Of Naropa The Subtle Body Voidness And Dependent Arising",
      "url": "https://studybuddhism.com/en/advanced-studies/vajrayana/tantra-advanced/introduction-to-the-six-yogas-of-naropa/six-yogas-of-naropa-the-subtle-body-voidness-and-dependent-arising",
      "domain": "studybuddhism.com",
      "type": "citation"
    },
    {
      "text": "73418",
      "url": "https://vjol.info.vn/index.php/nctg/article/download/86290/73418/",
      "domain": "vjol.info.vn",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780190277727 E 22",
      "url": "https://oxfordre.com/asianhistory/display/10.1093/acrefore/9780190277727.001.0001/acrefore-9780190277727-e-22",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Awynne2009atijbs.pdf",
      "url": "https://ocbs.org/wp-content/uploads/2015/09/awynne2009atijbs.pdf",
      "domain": "ocbs.org",
      "type": "citation"
    },
    {
      "text": "1be534c3b4569fe4618061bb0a95432d4261a52c.pdf",
      "url": "https://ir.uwest.edu/files/original/1be534c3b4569fe4618061bb0a95432d4261a52c.pdf",
      "domain": "ir.uwest.edu",
      "type": "citation"
    },
    {
      "text": "Abhidharma",
      "url": "https://plato.stanford.edu/entries/abhidharma/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "The Stupa",
      "url": "https://www.khanacademy.org/humanities/ap-art-history/introduction-cultures-religions-apah/buddhism-apah/a/the-stupa",
      "domain": "khanacademy.org",
      "type": "citation"
    },
    {
      "text": "Relics In Transition Material Mediations In Changing Worlds",
      "url": "https://quod.lib.umich.edu/a/ars/13441566.0048.002/--relics-in-transition-material-mediations-in-changing-worlds?rgn=main%3Bview=fulltext",
      "domain": "quod.lib.umich.edu",
      "type": "citation"
    },
    {
      "text": "Bharhut Stupa Relief Sculptures",
      "url": "https://smarthistory.org/bharhut-stupa-relief-sculptures/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "Ashokas Conversion",
      "url": "https://courses.lumenlearning.com/suny-hccc-worldcivilization/chapter/ashokas-conversion/",
      "domain": "courses.lumenlearning.com",
      "type": "citation"
    },
    {
      "text": "Third Buddhist Council",
      "url": "https://www.ebsco.com/research-starters/history/third-buddhist-council",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "Asoka And The Missions.pdf",
      "url": "https://ancient-buddhist-texts.net/English-Texts/Asokan-Missions/Asoka-and-the-Missions.pdf",
      "domain": "ancient-buddhist-texts.net",
      "type": "citation"
    },
    {
      "text": "The Pillars Of Ashoka",
      "url": "https://smarthistory.org/the-pillars-of-ashoka/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "267922206.pdf",
      "url": "https://core.ac.uk/download/pdf/267922206.pdf",
      "domain": "core.ac.uk",
      "type": "citation"
    },
    {
      "text": "Article P371 3.xml",
      "url": "https://brill.com/view/journals/iij/63/4/article-p371_3.xml",
      "domain": "brill.com",
      "type": "citation"
    },
    {
      "text": "Madhyamaka",
      "url": "https://plato.stanford.edu/entries/madhyamaka/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Nagarjuna",
      "url": "https://plato.stanford.edu/entries/nagarjuna/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "14 369 150036179358 60.pdf",
      "url": "http://www.iraj.in/journal/journal_file/journal_pdf/14-369-150036179358-60.pdf",
      "domain": "iraj.in",
      "type": "citation"
    },
    {
      "text": "271899021 Looking West To India Asian Education Intra Asian Renaissance And The Nalanda Revival",
      "url": "https://www.researchgate.net/publication/271899021_Looking_West_to_India_Asian_education_intra-Asian_renaissance_and_the_Nalanda_revival",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Indian Esoteric Buddhism A Social History Of The Tantric Movement.pdf",
      "url": "http://www.tantriklaboratories.com/wp-content/uploads/2015/05/Indian-Esoteric-Buddhism-A-Social-History-of-the-Tantric-Movement.pdf",
      "domain": "tantriklaboratories.com",
      "type": "citation"
    },
    {
      "text": "390946690 Odantapuri Mahavihara An Important Buddhist Institution A Historical Review",
      "url": "https://www.researchgate.net/publication/390946690_Odantapuri_Mahavihara_-An_Important_Buddhist_Institution_A_Historical_Review",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Set.cfm",
      "url": "https://www.himalayanart.org/search/set.cfm?setID=338",
      "domain": "himalayanart.org",
      "type": "citation"
    },
    {
      "text": "The%20decline%20of%20buddhism%20in%20india.pdf",
      "url": "https://www.du.ac.in/du/uploads/departments/BuddhistStudies/Study%20Material/Susmita/The%20Decline%20of%20Buddhism%20in%20India.pdf",
      "domain": "du.ac.in",
      "type": "citation"
    },
    {
      "text": "Seasia Burma.html",
      "url": "https://www.asiasocietymuseum.org/buddhist_trade/seasia_burma.html",
      "domain": "asiasocietymuseum.org",
      "type": "citation"
    },
    {
      "text": "The Kushan Empire",
      "url": "https://idp.bl.uk/learning/buddhism-on-the-silk-roads/articles/transmission-of-buddhism/the-kushan-empire/",
      "domain": "idp.bl.uk",
      "type": "citation"
    },
    {
      "text": "Chinese Buddhism On The Silk Roads",
      "url": "https://idp.bl.uk/learning/buddhism-on-the-silk-roads/articles/transmission-of-buddhism/chinese-buddhism-on-the-silk-roads/",
      "domain": "idp.bl.uk",
      "type": "citation"
    },
    {
      "text": "Introduction Of Buddhism To Korea An Overview",
      "url": "https://spice.fsi.stanford.edu/docs/introduction_of_buddhism_to_korea_an_overview",
      "domain": "spice.fsi.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Buddhism In Ancient Japan",
      "url": "https://www.worldhistory.org/article/1080/buddhism-in-ancient-japan/",
      "domain": "worldhistory.org",
      "type": "citation"
    },
    {
      "text": "Html",
      "url": "https://www.degruyter.com/document/doi/10.1355/9789812308399-006/html",
      "domain": "degruyter.com",
      "type": "citation"
    },
    {
      "text": "Buddhism Chan",
      "url": "https://plato.stanford.edu/entries/buddhism-chan/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "9780199340378.013.561",
      "url": "https://oxfordre.com/religion/view/10.1093/acrefore/9780199340378.013.561",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Theravada Buddhism",
      "url": "https://www.newworldencyclopedia.org/entry/Theravada_Buddhism",
      "domain": "newworldencyclopedia.org",
      "type": "citation"
    },
    {
      "text": "Tdsapali",
      "url": "https://religionsmn.carleton.edu/exhibits/show/theravada-dhamma-society-ameri/tdsatheravadabuddhism/tdsapali",
      "domain": "religionsmn.carleton.edu",
      "type": "citation"
    },
    {
      "text": "Theravada.html",
      "url": "https://www.accesstoinsight.org/theravada.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Tradition",
      "url": "https://forestmonastery.org/tradition",
      "domain": "forestmonastery.org",
      "type": "citation"
    },
    {
      "text": "Buddhism In Thailand",
      "url": "https://www.watpahnanachat.org/buddhism-in-thailand",
      "domain": "watpahnanachat.org",
      "type": "citation"
    },
    {
      "text": "Wheel370.html",
      "url": "https://www.accesstoinsight.org/lib/authors/mahasi/wheel370.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Wheel367.html",
      "url": "https://www.accesstoinsight.org/lib/authors/various/wheel367.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Ebdha155.htm",
      "url": "https://www.budsas.org/ebud/ebdha155.htm",
      "domain": "budsas.org",
      "type": "citation"
    },
    {
      "text": "337657299",
      "url": "https://academic.oup.com/book/38813/chapter/337657299",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Theravada Buddhism.pdf",
      "url": "https://sk.sagepub.com/ency/edvol/download/globalreligion/chpt/theravada-buddhism.pdf",
      "domain": "sk.sagepub.com",
      "type": "citation"
    },
    {
      "text": "Theravada Spirituality In The West",
      "url": "https://www.insightmeditationcenter.org/books-articles/theravada-spirituality-in-the-west/",
      "domain": "insightmeditationcenter.org",
      "type": "citation"
    },
    {
      "text": "bhavanasociety.org",
      "url": "https://bhavanasociety.org/",
      "domain": "bhavanasociety.org",
      "type": "citation"
    },
    {
      "text": "2025 2026 Theravada Studies Offerings",
      "url": "https://sati.org/certificate-programs/2025-2026-theravada-studies-offerings/",
      "domain": "sati.org",
      "type": "citation"
    },
    {
      "text": "Japanese Pure Land",
      "url": "https://plato.stanford.edu/entries/japanese-pure-land/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Buddhism Tiantai",
      "url": "https://plato.stanford.edu/entries/buddhism-tiantai/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Buddhism Huayan",
      "url": "https://plato.stanford.edu/entries/buddhism-huayan/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Nichiren Buddhism History",
      "url": "https://tricycle.org/magazine/nichiren-buddhism-history/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780190277727 E 126",
      "url": "https://oxfordre.com/asianhistory/display/10.1093/acrefore/9780190277727.001.0001/acrefore-9780190277727-e-126",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Japanese Religions",
      "url": "http://spice.fsi.stanford.edu/docs/japanese_religions",
      "domain": "spice.fsi.stanford.edu",
      "type": "citation"
    },
    {
      "text": "8055",
      "url": "https://muse.jhu.edu/book/8055",
      "domain": "muse.jhu.edu",
      "type": "citation"
    },
    {
      "text": "What Is Buddhist Tantra",
      "url": "https://tricycle.org/beginners/buddhism/what-is-buddhist-tantra/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Set.cfm",
      "url": "https://www.himalayanart.org/search/set.cfm?setID=100",
      "domain": "himalayanart.org",
      "type": "citation"
    },
    {
      "text": "Gayley Who Was Yeshe Tsogyal.pdf",
      "url": "https://learning.tergar.org/wp-content/uploads/2020/09/Gayley-Who-Was-Yeshe-Tsogyal.pdf",
      "domain": "learning.tergar.org",
      "type": "citation"
    },
    {
      "text": "Intro",
      "url": "https://www.lotsawahouse.org/topics/guru-padmasambhava/intro",
      "domain": "lotsawahouse.org",
      "type": "citation"
    },
    {
      "text": "The Four Schools Of Tibetan Buddhism",
      "url": "https://tnp.org/the-four-schools-of-tibetan-buddhism/",
      "domain": "tnp.org",
      "type": "citation"
    },
    {
      "text": "Four Schools Of Tibetan Buddhism",
      "url": "https://www.namchak.org/community/blog/four-schools-of-tibetan-buddhism/",
      "domain": "namchak.org",
      "type": "citation"
    },
    {
      "text": "Set.cfm",
      "url": "https://www.himalayanart.org/search/set.cfm?setID=2132",
      "domain": "himalayanart.org",
      "type": "citation"
    },
    {
      "text": "Getting To Know The Four Schools Of Tibetan Buddhism",
      "url": "https://fpmt.org/mandala/archives/mandala-issues-for-2007/october/getting-to-know-the-four-schools-of-tibetan-buddhism/",
      "domain": "fpmt.org",
      "type": "citation"
    },
    {
      "text": "Deity Mantra And Wisdom.pdf",
      "url": "https://wisdomcompassion.org/wp-content/uploads/2019/10/Deity-Mantra-and-Wisdom.pdf",
      "domain": "wisdomcompassion.org",
      "type": "citation"
    },
    {
      "text": "Dzogchen",
      "url": "https://buddhanature.tsadra.org/index.php/Topics/Dzogchen",
      "domain": "buddhanature.tsadra.org",
      "type": "citation"
    },
    {
      "text": "Index.php",
      "url": "https://www.dharmadata.org/index.php?option=com_content\\u0026view=article\\u0026id=11:dzogchen\\u0026lang=en\\u0026Itemid=124",
      "domain": "dharmadata.org",
      "type": "citation"
    },
    {
      "text": "Global Nomads Emergence Tibetan Diaspora Part I",
      "url": "https://www.migrationpolicy.org/article/global-nomads-emergence-tibetan-diaspora-part-i",
      "domain": "migrationpolicy.org",
      "type": "citation"
    },
    {
      "text": "Bridging Science And Buddhism The Dalai Lamas 100 Year Vision",
      "url": "https://www.mindandlife.org/insight/bridging-science-and-buddhism-the-dalai-lamas-100-year-vision/",
      "domain": "mindandlife.org",
      "type": "citation"
    },
    {
      "text": "Bmc1.pdf",
      "url": "https://www.accesstoinsight.org/lib/authors/thanissaro/bmc1.pdf",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Revivalbhkni Final 21.pdf",
      "url": "https://sujato.wordpress.com/wp-content/uploads/2009/11/revivalbhkni-final-21.pdf",
      "domain": "sujato.wordpress.com",
      "type": "citation"
    },
    {
      "text": "Daughters Of The Buddha Progress On The Path Of Female Ordination A Conversation With Ven Dhammananda Bhikkhuni",
      "url": "https://www.buddhistdoor.net/features/daughters-of-the-buddha-progress-on-the-path-of-female-ordination-a-conversation-with-ven-dhammananda-bhikkhuni/",
      "domain": "buddhistdoor.net",
      "type": "citation"
    },
    {
      "text": "Bhikkhun%c4%ab",
      "url": "https://en.wikipedia.org/wiki/Bhikkhun%C4%AB",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Wheel073.html",
      "url": "https://www.accesstoinsight.org/lib/authors/khantipalo/wheel073.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Buddhist Rains Retreat Vassavasa A Courtesy Of Monasticism",
      "url": "https://www.academia.edu/40139598/Buddhist_Rains_retreat_vassavasa_a_courtesy_of_monasticism",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "Article1397565484 Bagde.pdf",
      "url": "https://academicjournals.org/article/article1397565484_Bagde.pdf",
      "domain": "academicjournals.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcollections.sit.edu/cgi/viewcontent.cgi?article=2592\\u0026context=isp_collection",
      "domain": "digitalcollections.sit.edu",
      "type": "citation"
    },
    {
      "text": "Karen Ferguson Birken Monastery History Paper 2.pdf",
      "url": "https://birken.ca/wp-content/uploads/2023/01/Karen-Ferguson-Birken-Monastery-History-Paper-2.pdf",
      "domain": "birken.ca",
      "type": "citation"
    },
    {
      "text": "386529064 Engaged Buddhism Its History Practice And Social Benefits",
      "url": "https://www.researchgate.net/publication/386529064_Engaged_Buddhism_its_history_practice_and_social_benefits",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Buddhist Monasteries",
      "url": "https://smarthistory.org/buddhist-monasteries/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "Asianbuddhist Web.pdf",
      "url": "https://www.iccrom.org/sites/default/files/2017-11/asianbuddhist_web.pdf",
      "domain": "iccrom.org",
      "type": "citation"
    },
    {
      "text": "592",
      "url": "https://whc.unesco.org/en/list/592/",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "668",
      "url": "https://whc.unesco.org/en/list/668/",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "Gompas Upper Mustang",
      "url": "https://www.wmf.org/monuments/gompas-upper-mustang",
      "domain": "wmf.org",
      "type": "citation"
    },
    {
      "text": "Buddhism Sangha",
      "url": "https://tricycle.org/buddhism-sangha/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Borrowing From The Buddha Buddhist Temples As Financial Centers In Premodern East Asia",
      "url": "https://www.asianstudies.org/publications/eaa/archives/borrowing-from-the-buddha-buddhist-temples-as-financial-centers-in-premodern-east-asia/",
      "domain": "asianstudies.org",
      "type": "citation"
    },
    {
      "text": "Cambodia Indonesia Cooperate Environmental Tourism Management Two World Heritage Sites 368163",
      "url": "https://www.sakshipost.com/news/cambodia-indonesia-cooperate-environmental-tourism-management-two-world-heritage-sites-368163",
      "domain": "sakshipost.com",
      "type": "citation"
    },
    {
      "text": "4521",
      "url": "https://whc.unesco.org/en/soc/4521/",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "Wheel100.html",
      "url": "https://www.accesstoinsight.org/lib/authors/perera/wheel100.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Html",
      "url": "https://www.degruyter.com/document/doi/10.1515/9783110631685-003/html",
      "domain": "degruyter.com",
      "type": "citation"
    },
    {
      "text": "Anagarika Dharmapala",
      "url": "https://tricycle.org/magazine/anagarika-dharmapala/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "J.ctv1nthd7.6",
      "url": "https://www.jstor.org/stable/j.ctv1nthd7.6",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780199340378 E 565",
      "url": "https://oxfordre.com/religion/display/10.1093/acrefore/9780199340378.001.0001/acrefore-9780199340378-e-565",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780199340378 E 968",
      "url": "https://oxfordre.com/religion/display/10.1093/acrefore/9780199340378.001.0001/acrefore-9780199340378-e-968",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://apjjf.org/2013/11/30/brian-victoria/3973/article",
      "domain": "apjjf.org",
      "type": "citation"
    },
    {
      "text": "intersections.ssrc.org",
      "url": "https://intersections.ssrc.org/?post_type=ramp_article\\u0026p=2034",
      "domain": "intersections.ssrc.org",
      "type": "citation"
    },
    {
      "text": "D T Suzuki",
      "url": "https://www.britannica.com/biography/D-T-Suzuki",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Exile To India",
      "url": "https://www.dalailama.com/the-dalai-lama/biography-and-daily-life/exile-to-india",
      "domain": "dalailama.com",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://www.dharma.org/about-us/history/",
      "domain": "dharma.org",
      "type": "citation"
    },
    {
      "text": "Headspace Statistics",
      "url": "https://www.businessofapps.com/data/headspace-statistics/",
      "domain": "businessofapps.com",
      "type": "citation"
    },
    {
      "text": "Calm Statistics",
      "url": "https://www.businessofapps.com/data/calm-statistics/",
      "domain": "businessofapps.com",
      "type": "citation"
    },
    {
      "text": "Independent Investigation Report",
      "url": "https://www.rigpa.org/independent-investigation-report",
      "domain": "rigpa.org",
      "type": "citation"
    },
    {
      "text": "Sogyal Rinpoche Dies.html",
      "url": "https://www.nytimes.com/2019/09/01/obituaries/sogyal-rinpoche-dies.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Sogyal Rinpoche Resigned Rigpa",
      "url": "https://tricycle.org/article/sogyal-rinpoche-resigned-rigpa/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Eido Shimano Buddhist Leader Who Resigned In Scandal Dies At 85.html",
      "url": "https://www.nytimes.com/2018/02/26/obituaries/eido-shimano-buddhist-leader-who-resigned-in-scandal-dies-at-85.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "383831",
      "url": "https://www.theatlantic.com/national/archive/2014/12/the-zen-predator-of-the-upper-east-side/383831/",
      "domain": "theatlantic.com",
      "type": "citation"
    },
    {
      "text": "A Look At The Metoo Movement In The Shambhala Buddhist Community",
      "url": "https://www.npr.org/2018/07/15/629282010/a-look-at-the-metoo-movement-in-the-shambhala-buddhist-community",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Metoo China Monastery.html",
      "url": "https://www.nytimes.com/2018/09/15/world/asia/metoo-china-monastery.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "10512973",
      "url": "https://www.koreaherald.com/article/10512973",
      "domain": "koreaherald.com",
      "type": "citation"
    },
    {
      "text": "8976",
      "url": "https://journals.ub.uni-heidelberg.de/index.php/jiabs/article/view/8976",
      "domain": "journals.ub.uni-heidelberg.de",
      "type": "citation"
    },
    {
      "text": "Full Ordination Women Restore",
      "url": "https://thubtenchodron.org/2007/09/full-ordination-women-restore/",
      "domain": "thubtenchodron.org",
      "type": "citation"
    },
    {
      "text": "228389227 The Thai Bhikkhuni Movement And Women%27s Empowerment",
      "url": "https://www.researchgate.net/publication/228389227_The_Thai_Bhikkhuni_Movement_and_Women%27s_Empowerment",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Sangha Elders Lay Down Law On Reforms",
      "url": "https://www.bangkokpost.com/opinion/opinion/514539/sangha-elders-lay-down-law-on-reforms",
      "domain": "bangkokpost.com",
      "type": "citation"
    },
    {
      "text": "S10551 019 04273 X",
      "url": "https://link.springer.com/article/10.1007/s10551-019-04273-x",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "One Earth Sangha Celebrating 10 Years Of Ecodharma",
      "url": "https://www.buddhistdoor.net/features/one-earth-sangha-celebrating-10-years-of-ecodharma/",
      "domain": "buddhistdoor.net",
      "type": "citation"
    },
    {
      "text": "How Buddhism Can Inform Climate Activism A Conversation With Kritee Kanko",
      "url": "https://yaleclimateconnections.org/2023/03/how-buddhism-can-inform-climate-activism-a-conversation-with-kritee-kanko/",
      "domain": "yaleclimateconnections.org",
      "type": "citation"
    },
    {
      "text": "Pmc11583061",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11583061/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "World Asia 41566561",
      "url": "https://www.bbc.com/news/world-asia-41566561",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "What Does Buddhism Have To Do With The Ethnic Cleansing In Myanmar",
      "url": "https://www.lionsroar.com/what-does-buddhism-have-to-do-with-the-ethnic-cleansing-in-myanmar/",
      "domain": "lionsroar.com",
      "type": "citation"
    },
    {
      "text": "Burma",
      "url": "https://www.state.gov/reports/2017-report-on-international-religious-freedom/burma",
      "domain": "state.gov",
      "type": "citation"
    },
    {
      "text": "Introducing The Buddhism And Ai Initiative",
      "url": "https://buddhismai.substack.com/p/introducing-the-buddhism-and-ai-initiative",
      "domain": "buddhismai.substack.com",
      "type": "citation"
    },
    {
      "text": "A New Group Of Buddhist Technologists Is Working To Shape The Future Of Ai",
      "url": "https://religionnews.com/2025/11/04/a-new-group-of-buddhist-technologists-is-working-to-shape-the-future-of-ai/",
      "domain": "religionnews.com",
      "type": "citation"
    },
    {
      "text": "Daily Sit",
      "url": "https://www.buddhistinquiry.org/resources/daily-sit/",
      "domain": "buddhistinquiry.org",
      "type": "citation"
    },
    {
      "text": "Online Sanghas",
      "url": "https://tricycle.org/article/online-sanghas/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Gandhara",
      "url": "https://www.metmuseum.org/essays/gandhara",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Gupta Period",
      "url": "https://smarthistory.org/gupta-period/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "Collecting Guide Teachings Of The Thangka 7406393fbd60477e9cd3f3b672d48e14",
      "url": "https://www.christies.com/en/stories/collecting-guide-teachings-of-the-thangka-7406393fbd60477e9cd3f3b672d48e14",
      "domain": "christies.com",
      "type": "citation"
    },
    {
      "text": "The Caves Of Ajanta",
      "url": "https://smarthistory.org/the-caves-of-ajanta/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "The Architecture Of Japanese Buddhist Temples",
      "url": "https://diluo.digital.conncoll.edu/Asianart/exhibition/the-architecture-of-japanese-buddhist-temples/",
      "domain": "diluo.digital.conncoll.edu",
      "type": "citation"
    },
    {
      "text": "Stupa The Mind Of A Buddha",
      "url": "https://fpmt.org/mandala/archives/mandala-issues-for-2002/september/stupa-the-mind-of-a-buddha/",
      "domain": "fpmt.org",
      "type": "citation"
    },
    {
      "text": "Jataka.html",
      "url": "https://sites.pitt.edu/~dash/jataka.html",
      "domain": "sites.pitt.edu",
      "type": "citation"
    },
    {
      "text": "Zen Koans",
      "url": "https://everydayzen.org/study-guide/zen-koans/",
      "domain": "everydayzen.org",
      "type": "citation"
    },
    {
      "text": "The Dharma Of Jack Kerouac",
      "url": "https://tricycle.org/article/the-dharma-of-jack-kerouac/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780199340378 E 1164",
      "url": "https://oxfordre.com/religion/display/10.1093/acrefore/9780199340378.001.0001/acrefore-9780199340378-e-1164",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "08873267.1995.9986837",
      "url": "https://doi.apa.org/doi/10.1080/08873267.1995.9986837",
      "domain": "doi.apa.org",
      "type": "citation"
    },
    {
      "text": "Whiteheadbuddhism.html",
      "url": "http://www.integralscience.org/whiteheadbuddhism.html",
      "domain": "integralscience.org",
      "type": "citation"
    },
    {
      "text": "Jetir2409182.pdf",
      "url": "https://www.jetir.org/papers/JETIR2409182.pdf",
      "domain": "jetir.org",
      "type": "citation"
    },
    {
      "text": "Buddhistethicist",
      "url": "https://www.petersinger.info/buddhistethicist",
      "domain": "petersinger.info",
      "type": "citation"
    },
    {
      "text": "Deep Ecology.pdf",
      "url": "https://www.buddhanet.net/pdf_file/deep_ecology.pdf",
      "domain": "buddhanet.net",
      "type": "citation"
    },
    {
      "text": "984598780538166",
      "url": "https://www.facebook.com/UKAssociationforBuddhistStudies/posts/984598780538166/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "tscc.thefestivalofconsciousness.org",
      "url": "https://tscc.thefestivalofconsciousness.org/",
      "domain": "tscc.thefestivalofconsciousness.org",
      "type": "citation"
    },
    {
      "text": "Vesak Day",
      "url": "https://www.un.org/en/observances/vesak-day",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "S40359 025 03348 X",
      "url": "https://bmcpsychology.biomedcentral.com/articles/10.1186/s40359-025-03348-x",
      "domain": "bmcpsychology.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc2848393",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2848393/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1003481",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "How The Global Religious Landscape Changed From 2010 To 2020",
      "url": "https://www.pewresearch.org/religion/2025/06/09/how-the-global-religious-landscape-changed-from-2010-to-2020/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Pr 2025.06.09 Global Religious Change Report.pdf",
      "url": "https://www.pewresearch.org/wp-content/uploads/sites/20/2025/06/PR_2025.06.09_global-religious-change_report.pdf",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Buddhist Countries",
      "url": "https://worldpopulationreview.com/country-rankings/buddhist-countries",
      "domain": "worldpopulationreview.com",
      "type": "citation"
    },
    {
      "text": "Buddhism Now 2nd Largest Spiritual Path 1 6 Billion 22 Worlds Population According Recent Studies",
      "url": "https://buddhaweekly.com/buddhism-now-2nd-largest-spiritual-path-1-6-billion-22-worlds-population-according-recent-studies/",
      "domain": "buddhaweekly.com",
      "type": "citation"
    },
    {
      "text": "Buddhists",
      "url": "https://www.pewresearch.org/religion/2015/04/02/buddhists/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Sppop65uptozsjpn",
      "url": "https://fred.stlouisfed.org/series/SPPOP65UPTOZSJPN",
      "domain": "fred.stlouisfed.org",
      "type": "citation"
    },
    {
      "text": "Series",
      "url": "https://alfred.stlouisfed.org/series?seid=SPDYNCBRTINJPN",
      "domain": "alfred.stlouisfed.org",
      "type": "citation"
    },
    {
      "text": "Japanese Culture Religion",
      "url": "https://culturalatlas.sbs.com.au/japanese-culture/japanese-culture-religion",
      "domain": "culturalatlas.sbs.com.au",
      "type": "citation"
    },
    {
      "text": "Religions In The World%253a Buddhism%2526rsquo%253bs Decline 63285.html",
      "url": "https://www.asianews.it/news-en/Religions-in-the-world%253A-Buddhism%2526rsquo%253Bs-decline-63285.html",
      "domain": "asianews.it",
      "type": "citation"
    },
    {
      "text": "Religions In The World Buddhisms Decline",
      "url": "https://zenit.org/2025/06/14/religions-in-the-world-buddhisms-decline/",
      "domain": "zenit.org",
      "type": "citation"
    },
    {
      "text": "1108",
      "url": "https://www.mdpi.com/2077-1444/16/9/1108",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Religious Projections 2010 2050",
      "url": "https://www.pewresearch.org/religion/2015/04/02/religious-projections-2010-2050/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Arahantsbodhisattvas.html",
      "url": "https://www.accesstoinsight.org/lib/authors/bodhi/arahantsbodhisattvas.html",
      "domain": "accesstoinsight.org",
      "type": "citation"
    },
    {
      "text": "Emptiness In Theravada Buddhism",
      "url": "https://www.insightmeditationcenter.org/books-articles/emptiness-in-theravada-buddhism/",
      "domain": "insightmeditationcenter.org",
      "type": "citation"
    },
    {
      "text": "Sudden Vs Gradual Ray.html",
      "url": "http://www.thezensite.com/ZenEssays/HistoricalZen/Sudden_vs_Gradual_Ray.html",
      "domain": "thezensite.com",
      "type": "citation"
    },
    {
      "text": "Batchelor12.pdf",
      "url": "https://www.upaya.org/uploads/pdfs/batchelor12.pdf",
      "domain": "upaya.org",
      "type": "citation"
    },
    {
      "text": "Anaalayo Bhikkhuni Revival1.pdf",
      "url": "https://blogs.dickinson.edu/buddhistethics/files/2013/06/Anaalayo-bhikkhuni-revival1.pdf",
      "domain": "blogs.dickinson.edu",
      "type": "citation"
    },
    {
      "text": "Arguments For Against Full Nun Order",
      "url": "https://thubtenchodron.org/2014/09/arguments-for-against-full-nun-order/",
      "domain": "thubtenchodron.org",
      "type": "citation"
    },
    {
      "text": "Bhutan Begins Second Historic Bhikkhuni Ordination Over 260 Nuns Take Part",
      "url": "https://www.tribuneindia.com/news/world/bhutan-begins-second-historic-bhikkhuni-ordination-over-260-nuns-take-part/",
      "domain": "tribuneindia.com",
      "type": "citation"
    },
    {
      "text": "The Growing Strength Of The Thai Bhikkhuni Sangha",
      "url": "https://tricycle.org/article/the-growing-strength-of-the-thai-bhikkhuni-sangha/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Resolution 1st.pdf",
      "url": "https://wfbhq.org/uploads/conferences/015000018/01505/Resolution-1st.pdf",
      "domain": "wfbhq.org",
      "type": "citation"
    },
    {
      "text": "Ecumenical And Interfaith Buddhism Coming Together In America 0.pdf",
      "url": "https://pluralism.org/sites/g/files/omnuum10836/files/pluralism/files/ecumenical_and_interfaith_buddhism_-_coming_together_in_america__0.pdf",
      "domain": "pluralism.org",
      "type": "citation"
    },
    {
      "text": "0225e424a41184a7323bdd7058908d93",
      "url": "https://www.cambridge.org/core/books/nietzsche-and-buddhist-philosophy/nihilism-and-buddhism/0225E424A41184A7323BDD7058908D93",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "347059429 From Idolatry To Religions The Missionary Discourses On Hinduism And Buddhism And The Invention Of Monotheistic Confucianism 1550 1700",
      "url": "https://www.researchgate.net/publication/347059429_From_Idolatry_to_Religions_the_Missionary_Discourses_on_Hinduism_and_Buddhism_and_the_Invention_of_Monotheistic_Confucianism_1550-1700",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Student Teacher Relationships Go Awry West",
      "url": "https://tricycle.org/article/student-teacher-relationships-go-awry-west/",
      "domain": "tricycle.org",
      "type": "citation"
    },
    {
      "text": "Shambhala Sexual Misconduct.html",
      "url": "https://www.nytimes.com/2018/07/11/nyregion/shambhala-sexual-misconduct.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Sexual Ethics And Healthy Boundaries In The Wake Of Teacher Abuse",
      "url": "https://www.lionsroar.com/sexual-ethics-and-healthy-boundaries-in-the-wake-of-teacher-abuse/",
      "domain": "lionsroar.com",
      "type": "citation"
    },
    {
      "text": "Rohingya Crisis",
      "url": "https://www.cfr.org/backgrounder/rohingya-crisis",
      "domain": "cfr.org",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:24:24.210765",
  "elapsed_ms": 617148
}