{
  "topic": "Carbon Dioxide",
  "title": "Carbon dioxide",
  "slug": "carbon-dioxide",
  "grokipedia_slug": "Carbon_dioxide",
  "grokipedia_url": "https://grokipedia.com/page/Carbon_dioxide",
  "source": "grokipedia",
  "content": "# Carbon dioxide\n\nCarbon dioxide is a colorless, odorless, nonflammable gas at standard temperature and pressure, with the molecular formula **CO₂**, consisting of one carbon atom double-bonded to two oxygen atoms in a linear structure. Its molecular weight is 44.01 g/mol, and it exists in equilibrium with solid dry ice below −78.5 °C at atmospheric pressure.\n\nIn Earth's atmosphere, carbon dioxide comprises about 425 parts per million (ppm) by volume as of October 2025, a trace component that has increased from pre-industrial levels of around 280 ppm primarily due to anthropogenic emissions from fossil fuel combustion, cement production, and land-use changes. Naturally, it cycles through processes like volcanic outgassing, weathering of carbonate rocks, and biological exchanges, but human activities have accelerated its accumulation.\n\nBiologically, CO₂ serves as the primary carbon source for photosynthesis, where plants and certain microorganisms fix it into organic compounds using sunlight, thereby producing oxygen and sustaining most food chains. Conversely, it is exhaled as a metabolic byproduct during aerobic respiration by animals, plants, and microbes, closing the carbon cycle. Elevated atmospheric levels can enhance plant growth rates under controlled conditions, though effects vary with nutrient availability and other factors.\n\nCarbon dioxide's role as a greenhouse gas, absorbing infrared radiation emitted from Earth's surface, contributes to the planetary energy balance that prevents extreme cooling, but rising concentrations are empirically associated with global temperature increases, fueling debates over climate sensitivity, attribution of warming, and appropriate responses—controversies amplified by institutional biases in modeling and policy advocacy. Industrially, it is utilized in applications including beverage carbonation, enhanced oil recovery, pH control in water treatment, inert atmospheres for welding, and as a supercritical fluid in extraction processes.\n\n## Chemical and Physical Properties\n\n### Molecular Structure and Bonding\n\nCarbon dioxide (CO₂) is a triatomic molecule with a linear geometry, featuring a central carbon atom double-bonded to two oxygen atoms in the arrangement O=C=O. This structure results from the sp hybridization of the carbon atom, which forms two sigma bonds using sp hybrid orbitals and two pi bonds using unhybridized p orbitals perpendicular to the molecular axis. The VSEPR theory classifies CO₂ as AX₂, predicting a bond angle of 180° due to two bonding domains and no lone pairs on the central atom.\n\nThe bonding in CO₂ is described by resonance between three Lewis structures: one with two double bonds and two equivalent forms with one single and one triple bond, leading to an actual bond order of 2 for each C-O linkage. This resonance delocalizes the pi electrons, stabilizing the molecule and resulting in identical C-O bond lengths of 116.3 pm, shorter than a typical single C-O bond (143 pm) but longer than a triple bond (110 pm). Each C-O double bond comprises one sigma bond from end-to-end orbital overlap and one pi bond from sideways p-orbital overlap.\n\nAlthough individual C-O bonds are polar due to the electronegativity difference (oxygen 3.44, carbon 2.55), the linear symmetry cancels the dipole moments, rendering the overall molecule nonpolar with zero net dipole moment. The bond dissociation energy for breaking CO₂ into CO and O is 526.07 kJ/mol, reflecting the strength of these bonds.\n\n### Physical Properties\n\nCarbon dioxide (CO₂) is a colorless, odorless, and non-flammable gas at standard temperature and pressure (STP: 0 °C, 101.325 kPa). Its molecular mass is 44.0095 g/mol. The density of gaseous CO₂ at STP is 1.977 kg/m³, approximately 1.53 times that of air.\n\nUnder atmospheric pressure, CO₂ does not liquefy upon cooling; solid CO₂ (dry ice) sublimes at -78.46 °C. The triple point, where solid, liquid, and gas phases coexist in equilibrium, occurs at -56.6 °C and 5.11 atm (518 kPa). Above this pressure, liquid CO₂ exists, with a critical point at 31.0 °C and 73.8 bar (7.38 MPa), beyond which the distinction between liquid and gas phases vanishes.\n\nCO₂ exhibits moderate solubility in water, with approximately 1.45 g/L dissolving at 25 °C and 100 kPa partial pressure, decreasing with rising temperature due to Henry's law. The gas's thermal conductivity is 16.8 mW/(m·K) at 25 °C, and its specific heat capacity at constant pressure (C_p) is 37 J/(mol·K) for the ideal gas state.\n\n| Property                  | Value                  | Conditions          |\n|---------------------------|------------------------|---------------------|\n| Sublimation point         | -78.46 °C             | 1 atm              |\n| Triple point temperature  | -56.6 °C              | 5.11 atm           |\n| Triple point pressure     | 5.11 atm (518 kPa)    | -56.6 °C           |\n| Critical temperature      | 31.0 °C               | 73.8 bar           |\n| Critical pressure         | 73.8 bar (7.38 MPa)   | 31.0 °C            |\n| Solubility in water       | 1.45 g/L              | 25 °C, 100 kPa     |\n\nThese values are derived from experimental measurements compiled in thermophysical databases.\n\n### Spectroscopic and Vibrational Characteristics\n\nCarbon dioxide (CO₂), a linear triatomic molecule, possesses four fundamental vibrational degrees of freedom, consisting of one symmetric stretching mode (ν₁), one asymmetric stretching mode (ν₃), and a pair of degenerate bending modes (ν₂). These modes arise from the 3N-5 vibrational normal modes for a linear molecule with N=3 atoms. The symmetric stretch preserves the molecule's dipole moment at zero, rendering it infrared (IR) inactive but Raman active, while the asymmetric stretch and bending modes change the dipole moment, making them IR active.\n\nThe fundamental frequencies are ν₁ ≈ 1333 cm⁻¹ (Raman active), ν₂ ≈ 667 cm⁻¹ (IR active, degenerate), and ν₃ ≈ 2349 cm⁻¹ (IR active). These values correspond to gas-phase measurements, with ν₃ exhibiting the strongest IR absorption intensity due to its significant dipole derivative. The bending mode ν₂ splits into parallel and perpendicular components in the presence of rotation, but fundamentals dominate the spectrum.\n\nIn IR spectroscopy, CO₂ displays characteristic absorption bands at 2349 cm⁻¹ (ν₃) and 667 cm⁻¹ (ν₂), with additional features from hot bands, overtones, and combination modes such as the Fermi resonance between 2ν₂ and ν₁ around 1300-1400 cm⁻¹, which perturbs the symmetric stretch intensity in Raman spectra. Raman spectroscopy reveals the symmetric stretch ν₁ prominently, along with rotational fine structure, enabling precise isotopic analysis (e.g., ¹³C¹⁶O₂ shifts ν₃ to ~2283 cm⁻¹). These spectroscopic signatures are exploited for quantitative detection in environmental monitoring and astrophysical observations.\n\nThe centrosymmetric nature enforces mutual exclusion rules: modes symmetric under inversion (like ν₁) are Raman active but IR inactive, while antisymmetric modes (ν₃, ν₂) are IR active but Raman inactive in fundamentals. Vibrational anharmonicity introduces weak overtone bands, such as 2ν₃ near 4700 cm⁻¹, observable in high-resolution spectra. Experimental data from matrix isolation and gas-phase studies confirm these assignments, with computational quantum chemistry (e.g., DFT or CCSD(T)) reproducing frequencies within 10-20 cm⁻¹ accuracy.\n\n## Chemical Reactivity\n\n### Gaseous Phase Reactions\n\nCarbon dioxide demonstrates remarkable kinetic stability in the homogeneous gas phase under ambient conditions, exhibiting negligible reactivity with prevalent atmospheric gases such as nitrogen, oxygen, or noble gases absent high-energy activation or catalysts. This inertness stems from the molecule's strong C=O bonds (bond dissociation energy approximately 799 kJ/mol per bond) and the high activation barriers for potential bimolecular pathways. Experimental surveys using techniques like selected-ion flow tube mass spectrometry confirm that neutral CO₂ engages in few exothermic gas-phase reactions at room temperature without involving ions or radicals.\n\nThe principal thermal reaction in pure CO₂ gas is endothermic dissociation into carbon monoxide and atomic oxygen, followed by recombination to molecular oxygen:\n\nCO₂ ⇌ CO + ½ O₂\n\nwith a standard enthalpy change of ΔH° = 282.98 kJ/mol at 298 K. This equilibrium favors intact CO₂ at temperatures below 2000 K, where dissociation fractions remain below 1% at atmospheric pressure due to the unfavorable entropy and enthalpy terms; significant conversion (e.g., 10-20% at 1 atm) requires temperatures exceeding 2500 K, as determined from shock tube and explosion experiments varying CO/O₂ ratios. The reaction proceeds without carbon deposition over broad pressure ranges, though kinetics are slow without initiators, limiting practical yields in thermal processes to those augmented by plasmas or catalysts.\n\nPhotodissociation represents another key gas-phase pathway, activated by ultraviolet photons with wavelengths shorter than 227 nm, corresponding to the σ → σ* transition in the far-UV spectrum. The dominant channel yields ground-state products:\n\nCO₂ + hν (λ \\u003c 227 nm) → CO (X¹Σ⁺) + O (³P)\n\nwith absorption cross-sections peaking near 200 nm (σ ≈ 10⁻¹⁷ cm²) and quantum efficiencies approaching 1.0; minor channels produce excited O (¹D) or vibrational CO. This process drives atomic oxygen production in planetary upper atmospheres, such as Mars' mesosphere, where it influences photochemistry and escape rates, though recombination and catalytic cycles (e.g., via HOx or NOx) rapidly reform CO₂ on Earth.\n\nIn reducing environments at elevated temperatures, CO₂ participates in reverse shift-like equilibria, such as with hydrogen:\n\nCO₂ + H₂ ⇌ CO + H₂O\n\n(ΔH° = +41.2 kJ/mol), which thermodynamically favors reactants below 1000 K but shifts toward products above 1500 K; uncatalyzed rates remain low, necessitating high temperatures (e.g., \\u003e2000 K) for measurable conversion in gas mixtures. Interstellar models highlight analogous radical abstractions, like CO₂ + H → HCO + O (endothermic by 25 kJ/mol with barrier), but these require non-thermal energies and contribute negligibly to terrestrial kinetics. Overall, these reactions underscore CO₂'s role as a thermodynamic sink in combustion products and high-temperature gases, with practical dissociation efficiencies enhanced in non-equilibrium conditions like microwave plasmas yielding up to 50% conversion at 1000-2000 K via vibrational excitation.\n\n### Behavior in Aqueous Solutions\n\nCarbon dioxide exhibits moderate solubility in water, governed by Henry's law, which states that the concentration of dissolved CO₂ is proportional to its partial pressure above the solution at equilibrium. The Henry's law constant for CO₂ in water at 25°C (298.15 K) is approximately 29.76 L·atm/mol, corresponding to a solubility of about 0.033 mol/L at 1 atm partial pressure. Solubility decreases with increasing temperature, as the exothermic dissolution process favors the gaseous state at higher temperatures; for instance, measurements show solubility dropping from 0.057 mol/L at 12°C to 0.024 mol/L at 40°C under 1 atm.\n\nUpon dissolution, the majority (\\u003e99%) of CO₂ exists as hydrated CO₂(aq), with only a small fraction (~0.3%) converting to true carbonic acid (H₂CO₃) via the reaction CO₂(aq) + H₂O ⇌ H₂CO₃. Carbonic acid is a diprotic weak acid that partially dissociates in two steps: H₂CO₃ ⇌ H⁺ + HCO₃⁻ (pK₁ ≈ 6.35 at 25°C) and HCO₃⁻ ⇌ H⁺ + CO₃²⁻ (pK₂ ≈ 10.33 at 25°C). However, due to the low concentration of H₂CO₃, the effective first dissociation constant for the overall process CO₂(aq) ⇌ H⁺ + HCO₃⁻ is smaller, with K₁' ≈ 4.45 × 10⁻⁷ (pK₁' ≈ 6.35). At typical atmospheric CO₂ partial pressures (~400 ppm or 4×10⁻⁴ atm), the dominant species in neutral aqueous solutions is HCO₃⁻, with dissolved CO₂(aq) comprising ~99% of total inorganic carbon and free H₂CO₃ negligible.\n\nThis speciation results in a slight acidification of pure water equilibrated with atmospheric CO₂, yielding a pH of approximately 5.7 due to the low concentration of H⁺ from dissociation. In pressurized systems, such as carbonated beverages under 2-4 atm CO₂, solubility increases proportionally, elevating [H⁺] and lowering pH to 3-4, enhancing perceived tartness. Higher pressures or temperatures above ~65°C under elevated pressure can shift equilibria, but generally, increased temperature reduces both solubility and the extent of dissociation, mitigating acidity. These reactions underpin buffering in natural waters and industrial processes, though CO₂ remains largely unreactive without catalysts or bases.\n\n### Reactions with Metals and Other Compounds\n\nCarbon dioxide undergoes reduction reactions with highly reactive metals, such as magnesium and alkali metals, wherein the metal is oxidized to its oxide or carbonate, and CO₂ is converted to carbon monoxide, elemental carbon, or carbonate species. These reactions demonstrate CO₂'s role as an oxidizing agent under conditions of high temperature or reactivity, often producing significant heat and light. For example, magnesium combusts in a stream of CO₂ gas according to the stoichiometry 2Mg + CO₂ → 2MgO + C, generating a brilliant white flame due to the exothermic formation of magnesium oxide and deposition of carbon. This process has been experimentally observed in impinging CO₂ streams, where ignition temperatures vary with metal particle size and flow rates, typically exceeding 1000°C for sustained combustion.\n\nAlkali metals, particularly in molten form, similarly reduce CO₂ through insertion and subsequent decomposition pathways. Sodium, for instance, reacts vigorously upon heating: 4Na + 3CO₂ → 2Na₂CO₃ + CO, yielding sodium carbonate and carbon monoxide as the metal donates electrons to cleave C-O bonds. Analogous reactions occur with lithium and potassium, often involving initial coordination of CO₂ to the metal atom, followed by carboxylation and reduction steps, as probed by matrix isolation spectroscopy and density functional theory calculations showing bent CO₂ ligands in intermediates. Alkaline earth metals like calcium exhibit comparable behavior at elevated temperatures, forming carbonates and releasing CO, though kinetics are influenced by surface area and pressure.\n\nBeyond elemental metals, CO₂ participates in nucleophilic addition reactions with organometallic compounds, notably Grignard reagents (RMgX), to form carboxylic acids. The mechanism involves the carbanion-like R⁻ group attacking the electrophilic carbon of CO₂, producing a magnesium carboxylate intermediate: RMgX + CO₂ → RCO₂MgX. Acidic hydrolysis then liberates the carboxylic acid: RCO₂MgX + H₃O⁺ → RCO₂H + MgX(OH) + H₂O. This carbonation extends the carbon chain by one atom and is widely employed in organic synthesis, with yields often exceeding 80% under anhydrous conditions using dry ice as the CO₂ source. Organolithium reagents (RLi) follow a parallel pathway, offering higher reactivity but requiring careful handling due to their pyrophoric nature.\n\nTransition metals can form transient CO₂ complexes that facilitate further reactivity, such as C-C bond formation or disproportionation to CO and CO₃²⁻, though these often require catalysts or high pressures. For instance, nickel-mediated insertion yields NiO + CO, highlighting CO₂'s activation via metal-oxygen bond weakening. Such processes underpin emerging reductions but are less common in stoichiometric contexts compared to main-group metal reactions.\n\n## Natural Occurrence and Global Cycles\n\n### Atmospheric Concentrations and Historical Trends\n\nAtmospheric carbon dioxide (CO₂) concentrations are currently measured at global monitoring stations, with the Mauna Loa Observatory in Hawaii providing the longest continuous record since 1958. As of October 23, 2025, the daily average at Mauna Loa reached 425.43 parts per million (ppm), reflecting a global mean that exceeded 422.8 ppm in 2024. These levels exhibit a seasonal cycle, with peaks in May due to reduced Northern Hemisphere photosynthesis and troughs in September-October, superimposed on a long-term upward trend driven by net emissions exceeding natural sinks.\n\nDirect measurements from Mauna Loa, initiated by Charles David Keeling, document an increase from approximately 315 ppm in 1958 to the current levels, with an average annual growth rate accelerating from about 0.8 ppm per year in the 1960s to over 2.5 ppm per year in recent decades. This rise aligns with global station data, confirming the trend's robustness against local influences like volcanic outgassing, as CO₂ signatures match hemispheric emission patterns rather than basaltic sources.\n\nProxy records from Antarctic ice cores, such as Vostok and EPICA Dome C, extend the timeline over 800,000 years, revealing CO₂ fluctuations between 180 ppm during glacial maxima and 300 ppm during interglacials, with pre-industrial Holocene levels stabilizing near 280 ppm for millennia prior to the mid-18th century. These data indicate the post-1750 rise to over 425 ppm represents an unprecedented excursion in the late Quaternary, exceeding prior interglacial peaks and correlating temporally with fossil fuel combustion and land-use changes. Over deeper geological time, such as the past 66 million years, CO₂ levels have varied widely—from over 1,000 ppm in the Eocene to lower values in the Pliocene—but recent increases occur against a backdrop of declining natural baselines absent comparable anthropogenic forcing.\n\n### Oceanic and Geological Reservoirs\n\nThe oceans represent the largest liquid reservoir of carbon on Earth, containing approximately 38,000 gigatons of carbon (GtC) primarily as dissolved inorganic carbon (DIC). This DIC arises from the reaction of atmospheric CO₂ with seawater, forming carbonic acid (H₂CO₃) that dissociates into bicarbonate (HCO₃⁻) and hydrogen ions, with further dissociation to carbonate (CO₃²⁻) depending on pH and alkalinity. At typical seawater pH (~8.1), speciation consists of roughly 90% HCO₃⁻, 10% CO₃²⁻, and less than 1% undissociated CO₂(aq). The total oceanic DIC vastly exceeds atmospheric carbon (~850 GtC as of 2023), underscoring the ocean's role in buffering CO₂ fluctuations through physical solubility (higher in colder, denser waters) and biological export via the \"biological pump,\" where phytoplankton fix CO₂ into organic matter that sinks to depths, remineralizing as DIC. Surface waters hold about 1,000 GtC, while the deep ocean sequesters the majority due to slow upwelling and circulation patterns on millennial timescales.\n\nGeological reservoirs store the overwhelming majority of Earth's carbon, with sedimentary rocks containing an estimated 65,000,000 to 100,000,000 GtC, primarily in carbonate minerals and organic sediments. Carbonates, such as limestone (CaCO₃) and dolomite (CaMg(CO₃)₂), account for the bulk, formed via inorganic precipitation, biogenic shell deposition, and diagenetic processes over eons, locking CO₂ equivalent through silicate weathering and ocean chemistry. These rocks represent stabilized ancient atmospheric CO₂, with release occurring slowly via tectonic uplift, metamorphism, or volcanism at rates of ~0.1 GtC per year globally. Organic geological carbon, including kerogen in shales and conventional fossil fuels (coal, oil, natural gas), comprises a smaller fraction—total resources estimated at several thousand GtC—but is concentrated and extractable; proved reserves alone equate to ~746 GtC upon combustion. Unlike oceanic reservoirs, geological stores exchange minimally with the surficial carbon cycle on human timescales, rendering them effectively inert against short-term atmospheric perturbations.\n\n### Biological Sources and Carbon Cycle Dynamics\n\nBiological sources of carbon dioxide primarily arise from aerobic respiration processes across terrestrial and marine ecosystems, where organisms oxidize organic carbon compounds, releasing CO2 as a byproduct. In terrestrial environments, this includes autotrophic respiration by plants and heterotrophic respiration by animals, fungi, and bacteria, with soil respiration—encompassing root and microbial activity—estimated at approximately 68 PgC per year globally. Microbial decomposition of dead organic matter contributes significantly to this flux, processing plant litter and soil organic carbon through enzymatic breakdown, which liberates CO2 and sustains the heterotrophic component of the biosphere's carbon turnover.\n\nThese emissions are counterbalanced within the carbon cycle by photosynthetic fixation, where autotrophs such as plants, algae, and cyanobacteria incorporate atmospheric CO2 into biomass via the Calvin cycle, achieving a global gross primary production flux of about 125 PgC annually. The net biological exchange reflects a dynamic equilibrium disrupted seasonally: in the Northern Hemisphere, enhanced photosynthesis during growing seasons exceeds respiration, creating a temporary atmospheric CO2 drawdown of roughly 5-10 ppm, as observed in Mauna Loa measurements. Heterotrophic respiration, including decomposition, responds to environmental factors like temperature and moisture, with warmer conditions accelerating microbial activity and CO2 release, as evidenced in soil incubation studies.\n\nIn oceanic systems, the biological pump modulates CO2 dynamics through phytoplankton primary production, which fixes approximately 50 PgC yearly, with a portion exported as particulate organic carbon sinking to depths below 100 meters, sequestering around 10 PgC annually and isolating it from rapid atmospheric re-exchange. Zooplankton grazing and microbial remineralization in the water column return much of this carbon as respired CO2 to surface waters, but incomplete oxidation in anoxic zones or deep burial contributes to long-term storage. Overall, biological fluxes dominate the fast carbon cycle, cycling over 200 PgC between atmosphere and biosphere annually, far exceeding anthropogenic inputs, though feedbacks like elevated CO2 enhancing photosynthesis can alter net sinks.\n\n## Biological and Physiological Roles\n\n### Photosynthesis, Plant Growth, and CO2 Fertilization\n\nCarbon dioxide serves as the primary carbon source in photosynthesis, the process by which plants, algae, and certain bacteria convert light energy into chemical energy stored in carbohydrates. In this reaction, atmospheric CO₂ diffuses through stomata into leaf mesophyll cells and is fixed by the enzyme RuBisCO in the Calvin-Benson cycle within chloroplasts, ultimately producing glucose via the overall equation 6CO₂ + 6H₂O + light energy → C₆H₁₂O₆ + 6O₂. This process fixes approximately 120 gigatons of carbon annually, sustaining global primary production.\n\nAmbient CO₂ concentrations around 400 ppm often limit photosynthesis in C3 plants, which comprise most crops and vegetation; elevating CO₂ to 800-1,000 ppm can increase net photosynthesis and yields by 40-100% under non-limiting conditions like water and nutrients. The CO₂ fertilization effect arises because higher CO₂ concentrations enhance carboxylation efficiency of RuBisCO, reducing photorespiration—a wasteful oxygenase reaction that competes with carbon fixation—and improving water-use efficiency by allowing partial stomatal closure. Free-Air CO₂ Enrichment (FACE) experiments, conducted since the 1990s at sites like Duke Forest and rice paddies in Asia, demonstrate sustained increases in net primary production of 10-35%, with rice yields rising up to 35% in high-potential cultivars at 550-600 ppm CO₂.\n\nSatellite observations from NASA's MODIS instrument reveal a global greening trend since the 1980s, with leaf area index increasing by over 5%—equivalent to more than 2 million square miles of additional green cover—attributed primarily to CO₂ fertilization, which accounts for 70% of the effect, alongside nitrogen deposition and land management. This enhancement has boosted terrestrial carbon sinks, mitigating about 17% of anthropogenic CO₂ emissions through greater biomass accumulation, though benefits diminish over time due to photosynthetic acclimation and nutrient constraints. In crops, elevated CO₂ has historically contributed to yield gains, with meta-analyses showing C3 cereals like wheat and rice experiencing 10-20% increases per 100 ppm rise, though concurrent warming can offset these in heat-sensitive varieties. While nutritional quality may decline in some staples due to diluted protein and micronutrients, the direct growth response underscores CO₂'s role as a key driver of plant productivity.\n\n### Respiration, Blood Transport, and Regulation in Animals\n\nIn animals, carbon dioxide (CO₂) is generated as a primary byproduct of aerobic cellular respiration, where glucose and oxygen are metabolized to produce energy in the form of ATP, with the overall reaction C₆H₁₂O₆ + 6O₂ → 6CO₂ + 6H₂O + energy. This process occurs in mitochondria across tissues, releasing CO₂ into interstitial fluids and subsequently into the bloodstream for elimination via the lungs. The rate of CO₂ production scales with metabolic demand, such as during exercise, where it can increase severalfold to match heightened ATP hydrolysis.\n\nCO₂ transport from tissues to lungs occurs primarily via the venous blood, employing three mechanisms: approximately 5-10% dissolves directly in plasma due to its higher solubility compared to oxygen; 5-30% binds to hemoglobin as carbaminohemoglobin, forming at the N-terminal amino groups of deoxygenated hemoglobin; and 60-90% converts to bicarbonate (HCO₃⁻) ions inside erythrocytes, catalyzed by carbonic anhydrase (CO₂ + H₂O ⇌ H₂CO₃ ⇌ H⁺ + HCO₃⁻), with chloride ions shifting via the Hamburger phenomenon to maintain electroneutrality. At the lungs, the process reverses: bicarbonate re-enters erythrocytes, reforms CO₂, and diffuses into alveoli for exhalation, facilitated by oxygenated hemoglobin's reduced affinity for CO₂. This efficient transport minimizes pH disruption, as the bicarbonate system buffers hydrogen ions produced during conversion.\n\nRegulation of CO₂ levels maintains arterial partial pressure (PaCO₂) at 35-45 mmHg in mammals, primarily through ventilatory adjustments driven by chemoreceptors sensitive to pH changes induced by CO₂. Central chemoreceptors in the brainstem medulla oblongata detect CO₂ diffusion into cerebrospinal fluid, lowering pH and stimulating respiratory centers to increase breathing rate and depth; these account for 70-80% of the ventilatory response to hypercapnia. Peripheral chemoreceptors in carotid and aortic bodies sense arterial pH, PaCO₂, and PaO₂, contributing 20-30% to the response, with rapid firing during acidosis to enhance CO₂ elimination. Hyperventilation expels excess CO₂, restoring pH, while hypoventilation allows PaCO₂ rise to suppress respiration; this feedback loop ensures homeostasis, with CO₂ acting as the dominant driver over oxygen in normal conditions. Disruptions, such as in respiratory acidosis, elevate PaCO₂ above 50 mmHg, triggering compensatory renal bicarbonate retention.\n\n### Toxicity Thresholds and Health Impacts\n\nCarbon dioxide exerts toxic effects primarily as an asphyxiant by displacing oxygen in enclosed spaces and through direct physiological impacts causing hypercapnia, which disrupts acid-base balance and central nervous system function. Unlike many gases, CO2 also stimulates respiration at moderate levels before leading to narcosis at higher concentrations. Atmospheric levels around 400 ppm pose no health risk, but occupational and acute exposure guidelines prevent adverse outcomes.\n\nRegulatory agencies define exposure thresholds to mitigate risks. The U.S. Occupational Safety and Health Administration (OSHA) permissible exposure limit (PEL) is 5,000 ppm (0.5% by volume) as an 8-hour time-weighted average, with a ceiling of 10,000 ppm for any 10-minute period. The National Institute for Occupational Safety and Health (NIOSH) recommended exposure limit (REL) matches the PEL at 5,000 ppm for 10 hours, with a short-term exposure limit (STEL) of 30,000 ppm for 15 minutes. Immediately dangerous to life or health (IDLH) concentration is 40,000 ppm (4%), beyond which rescue requires self-contained breathing apparatus due to risk of rapid incapacitation. The American Conference of Governmental Industrial Hygienists (ACGIH) threshold limit value (TLV) aligns at 5,000 ppm for 8 hours and 30,000 ppm STEL.\n\nHealth impacts vary by concentration and duration, progressing from subtle physiological changes to severe toxicity. Below 1,000 ppm, no discernible effects occur in healthy individuals. At 1,000–2,000 ppm, mild cognitive impairments and increased ventilation may emerge during prolonged exposure, though evidence remains mixed for non-occupational settings. Concentrations of 3% (30,000 ppm) induce deeper breathing, headaches, elevated blood pressure, and accelerated heart rate, with reduced auditory acuity.\n\n| Concentration (% by volume) | Duration/Effects |\n|-----------------------------|------------------|\n| 1–2% (10,000–20,000 ppm)   | Shortness of breath, mild acidosis, sweating, and restlessness upon exertion; tolerable for short periods in acclimated individuals. |\n| 3–5% (30,000–50,000 ppm)   | Headache, dizziness, drowsiness, increased heart rate, and visual disturbances; short-term exposure limit to avoid impairment. |\n| 5–10% (50,000–100,000 ppm) | Severe hypercapnia with muscle twitching, confusion, loss of consciousness within minutes, and potential convulsions. |\n| \\u003e10% (\\u003e100,000 ppm)        | Rapid unconsciousness, coma, and death due to respiratory failure and cerebral depression; acts as both asphyxiant and narcotic. |\n\nChronic low-level exposure above 5,000 ppm can exacerbate conditions like cardiovascular disease or impair cognitive performance, though acute incidents dominate toxicity cases. Hypercapnia from CO2 inhalation elevates blood PCO2, leading to respiratory acidosis, vasodilation, and narcosis; severe cases manifest as paranoia, seizures, or organ damage without prompt ventilation. Incidents, such as in submarines or dry ice storage, underscore the need for monitoring, as CO2 is odorless and heavier than air, accumulating in low areas.\n\n## Anthropogenic Production and Emissions\n\n### Fossil Fuel Combustion and Energy-Related Sources\n\nFossil fuel combustion for energy production constitutes the largest source of anthropogenic carbon dioxide emissions, accounting for approximately 75% of total global greenhouse gas emissions in recent years. In 2024, energy-related CO2 emissions from fossil fuels reached a record 37.8 gigatonnes (Gt), marking a 0.8% increase from 2023 levels despite expansions in renewable energy capacity. This growth was driven primarily by rising demand in developing economies, with coal and oil combustion offsetting declines in some advanced sectors.\n\nBy fuel type, coal combustion contributed the largest share, responsible for about 41% of global CO2 emissions from fossil fuels and cement production in 2023, with its emissions driving over 65% of the net increase that year. Oil followed at roughly 32%, mainly from transportation and industry, while natural gas accounted for around 22%, often used in power generation and heating. Emissions coefficients vary by fuel: coal emits approximately 2.25 pounds of CO2 per kilowatt-hour (kWh) generated, oil 1.43 pounds per kWh, and natural gas 0.86 pounds per kWh, reflecting differences in carbon content and combustion efficiency. Incomplete combustion and flaring add minor but notable contributions, particularly in oil and gas operations.\n\nSectorally, electricity and heat production dominate, emitting over 40% of energy-related CO2 globally due to reliance on coal- and gas-fired plants, though this share has declined slightly with hydroelectric and renewable integration. Transportation contributes about 15-20%, primarily from road vehicles using gasoline and diesel, with aviation and shipping adding specialized high-emission profiles from kerosene and heavy fuel oil. Industrial processes, including steel and cement manufacturing that incorporate fuel combustion, account for another 25-30%, while residential and commercial heating adds 10-15%, largely from natural gas and oil.\n\nTrends indicate sustained growth in emissions from emerging markets like China and India, where coal use for electricity expanded, contrasting with reductions in Europe and the US from efficiency gains and fuel switching. For instance, global coal emissions rose by nearly 900 megatonnes (Mt) since 2019, outpacing gains in gas and renewables. Empirical data from direct measurements, such as those from the Global Carbon Project, confirm these patterns, underscoring that fossil fuel combustion remains the principal driver of rising atmospheric CO2 concentrations.\n\n### Industrial Processes and By-Products\n\nIndustrial processes generate carbon dioxide primarily through non-combustion chemical reactions, such as the thermal decomposition of carbonates and carbon reduction of ores, contributing approximately 6.5% of global anthropogenic emissions. These emissions arise from sectors like cement, metals, and chemicals, where CO2 is an inherent by-product of raw material transformation rather than fuel oxidation. In 2021, such process-related outputs accounted for a notable share of the industrial sector's total greenhouse gas footprint, separate from energy use.\n\nCement manufacturing is the largest source, driven by the calcination of limestone in kilns: CaCO₃ → CaO + CO₂, which releases about 0.53 tonnes of CO₂ per tonne of clinker produced, independent of fuel combustion. Process emissions constitute 60-70% of the sector's total CO₂ output, with global totals reaching 1.45 Gt in 2016 and comprising 5-8% of worldwide anthropogenic CO₂ annually. By 2023, China's cement industry alone emitted 718 Mt of CO₂, reflecting its dominant role in global production of roughly 4 Gt of cement yearly. Efforts to mitigate include clinker substitution with lower-carbon materials, potentially reducing process CO₂ by up to 35% in optimized formulations.\n\nIn iron and steel production, CO₂ emerges as a by-product during blast furnace reduction of iron ore (Fe₂O₃ + 3C → 2Fe + 3CO₂, simplified) using coke and from limestone fluxing, accounting for roughly 70% of direct emissions in traditional basic oxygen furnace routes. The sector's direct process emissions totaled about 2.6 Gt CO₂ in 2020, equating to 7% of global totals and 1.85-1.9 tonnes per tonne of steel produced. Alternative routes like electric arc furnaces with scrap reduce process CO₂ but still rely on upstream reductions for primary steel.\n\nChemical processes, particularly ammonia synthesis via the Haber-Bosch method, produce CO₂ during natural gas reforming (CH₄ + H₂O → CO + 3H₂) and subsequent water-gas shift (CO + H₂O → CO₂ + H₂), yielding 2.4-2.86 tonnes of CO₂ per tonne of ammonia. This makes ammonia production the largest single chemical source of process CO₂, with global output of around 180 Mt ammonia annually implying over 0.4 Gt CO₂. Other contributors include lime production (similar calcination to cement, ~0.78 t CO₂/t lime) and minor sources like glassmaking and pulp/paper via carbonate decomposition, though these are smaller in scale. Capture technologies, such as solvent absorption post-shift in ammonia plants, enable by-product CO₂ recovery for uses like urea synthesis.\n\n### Land Use, Agriculture, and Deforestation Contributions\n\nDeforestation and land-use conversion for agriculture release stored carbon from vegetation and soils, contributing to anthropogenic CO2 emissions as forests, which act as carbon sinks, are cleared for cropland and pastures. This process primarily occurs in tropical regions, where expanding agricultural frontiers—driven by demand for commodities like soy, beef, and palm oil—account for the majority of global tree cover loss. Between 2001 and 2024, global tree cover loss totaled 517 million hectares, equivalent to 220 Gt of CO2 emissions, with annual rates averaging around 23 million hectares per year. Tropical primary forest loss in 2024 alone, exacerbated by fires, generated approximately 3.1 Gt of greenhouse gas emissions, much of it CO2, comparable to the annual output from the United States.\n\nNet CO2 emissions from land-use change, including deforestation and agricultural expansion, are estimated at 2.8 GtCO2 per year on average from net forest conversion between 2021 and 2025, based on FAOSTAT data, representing a decline from earlier decades due to conservation efforts in some areas. Globally, land-use change emissions constituted about 3.1 GtCO2eq in recent years, comprising roughly 19% of agrifood system emissions, though this figure encompasses some non-CO2 gases and has decreased by 30% since 2000 amid slowing deforestation rates. These emissions are smaller than those from fossil fuel combustion, typically 10-12% of total anthropogenic CO2, but exhibit high variability; bookkeeping models project a net source of around 4-6 GtCO2eq annually for agriculture, forestry, and other land uses (AFOLU) in the 2010s, with uncertainties of ±4 Gt due to differences in measurement approaches like satellite observations versus national inventories.\n\nAgricultural practices beyond direct land conversion, such as tillage and soil disturbance, can further release soil organic carbon, though quantification remains challenging and often netted against sequestration from practices like no-till farming or agroforestry. Empirical data from sources like the UN's Food and Agriculture Organization indicate that while gross emissions from deforestation have declined—tropical rates fell by about 10% in some assessments since 2010—persistent drivers like population growth and export-oriented farming in Latin America and Southeast Asia sustain the flux. Uncertainties persist, as inventory-based methods (often used in policy reporting) frequently show net LULUCF sinks from regrowth and afforestation, contrasting with bottom-up models emphasizing gross deforestation releases; the IPCC notes these discrepancies prevent clear detection of long-term trends beyond variability. One-third of deforestation-related CO2 emissions are embedded in international trade, linking consumption in developed nations to land clearance abroad.\n\n## Industrial and Commercial Applications\n\n### Chemical Precursors and Synthesis\n\nCarbon dioxide is commonly prepared in laboratories by reacting metal carbonates or bicarbonates with dilute acids, such as hydrochloric acid. A standard method involves calcium carbonate (marble chips) and hydrochloric acid, yielding the reaction: \\(\\ce{CaCO3 + 2HCl -\\u003e CaCl2 + H2O + CO2}\\). This produces a stream of CO₂ gas that can be collected over water or by displacement of air, as CO₂ is denser than air.  Sodium bicarbonate with acids like citric or tartaric acid serves as an alternative, often used in educational settings for its milder conditions: \\(\\ce{NaHCO3 + HCl -\\u003e NaCl + H2O + CO2}\\). These precursors—carbonates derived from minerals or synthesized salts—provide the carbon-oxygen framework, with acid protonation liberating CO₂.\n\nIndustrially, CO₂ is rarely synthesized de novo but recovered as a by-product from large-scale processes, with precursors including fossil fuels, biomass, and minerals. In ammonia synthesis via the Haber-Bosch process, CO₂ arises from steam reforming of methane (\\(\\ce{CH4 + H2O -\\u003e CO + 3H2}\\)) followed by the water-gas shift (\\(\\ce{CO + H2O -\\u003e CO2 + H2}\\)), where natural gas serves as the primary carbon precursor; this accounts for a significant portion of commercial CO₂. Fermentation of sugars by yeast in ethanol production (e.g., \\(\\ce{C6H12O6 -\\u003e 2C2H5OH + 2CO2}\\)) generates CO₂ from glucose or other carbohydrates, captured via absorption, adsorption, membrane separation, or cryogenic methods for purification to 99.9% purity. Calcination of limestone (\\(\\ce{CaCO3 -\\u003e CaO + CO2}\\) at 900–1000°C) in lime production uses mineral carbonates as precursors, contributing to cement manufacturing emissions but also dedicated CO₂ streams.\n\nPurification of industrial CO₂ involves compression, cooling to liquefy impurities, and distillation to remove water, hydrocarbons, and non-condensable gases like nitrogen or oxygen, achieving food- or pharmaceutical-grade standards. Direct oxidation of carbon monoxide (\\(\\ce{2CO + O2 -\\u003e 2CO2}\\)) occurs in some gasification processes but is less common for pure CO₂ production. These methods prioritize efficiency over primary synthesis, leveraging exothermic reactions or thermal decomposition inherent to precursor stability.\n\n### Food, Beverage, and Agricultural Uses\n\nCarbon dioxide is widely employed in the beverage industry for carbonation, where food-grade CO2, purified to at least 99.9% purity, is dissolved into liquids under pressure to create effervescence in soft drinks, beer, and sparkling water. The process typically occurs in carbonation tanks, where CO2 gas is injected into chilled water or syrup mixtures, achieving solubility levels of 3 to 3.5 volumes—equivalent to approximately 5.88 to 6.86 grams of CO2 per liter at standard temperature and pressure—for most commercial soft drinks like tonic water. Upon opening, the pressure release causes CO2 to form bubbles via the reaction with water to produce carbonic acid, imparting the characteristic fizz and tangy flavor.\n\nIn food preservation, CO2 serves as a key component in modified atmosphere packaging (MAP), where it is flushed into sealed packages alongside nitrogen to displace oxygen, thereby inhibiting aerobic bacteria, mold growth, and oxidation that lead to spoilage. Concentrations of 20-100% CO2 in MAP extend shelf life for perishable items such as meats, seafood, and produce by slowing microbial proliferation and enzymatic browning, with empirical studies showing reduced spoilage rates in CO2-enriched environments compared to air-packed controls. Dry ice, the solid form of CO2 sublimating at -78.5°C, is utilized in food processing and transport to maintain sub-zero temperatures without residue or moisture, preserving texture and quality in items like frozen meats, dairy, and ice cream during shipping and storage. This method complies with food safety standards as a non-toxic refrigerant, avoiding the mess of water-based ice while ensuring critical control points for temperature-sensitive goods.\n\nAgriculturally, CO2 enrichment in controlled environments like greenhouses boosts crop productivity by elevating atmospheric concentrations to 800-1,200 ppm, well above ambient levels of around 420 ppm, thereby enhancing photosynthetic rates via increased carboxylation efficiency in the Calvin cycle. Methods include direct injection of compressed CO2 gas, combustion of natural gas, or sublimation of dry ice blocks, with the latter being cost-effective for small-scale operations due to its simplicity and lack of combustion byproducts. Field trials demonstrate yield increases of 20-30% for crops such as tomatoes and cucumbers under enrichment, alongside reduced time to maturity and improved water use efficiency, as plants close stomata earlier to conserve moisture while fixing more carbon. These effects are most pronounced in C3 plants, where CO2 limitation under current ambient conditions constrains growth potential.\n\n### Fire Extinguishment, Inerting, and Safety Applications\n\nCarbon dioxide is widely employed in fire extinguishers due to its ability to displace oxygen and interrupt the combustion process by reducing the oxygen concentration below the level required for sustained burning, typically to around 15% or lower. Upon release from pressurized cylinders, CO2 expands rapidly, forming a cloud of gas and dry ice particles that also provide cooling through evaporative effects, further suppressing flames by lowering temperatures below ignition thresholds. These extinguishers are rated for Class B fires involving flammable liquids such as gasoline or oils, and Class C fires involving energized electrical equipment, as the non-conductive gas leaves no residue that could damage sensitive electronics or machinery.\n\nIn fixed fire suppression systems, CO2 is delivered automatically in enclosed spaces like server rooms, engine compartments, or industrial facilities to rapidly flood the area and achieve extinguishment concentrations of 34-50% by volume, effectively smothering fires without water or chemical residues. Such systems are particularly effective for protecting high-value assets in environments where human occupancy can be evacuated prior to discharge, given CO2's asphyxiant properties that pose risks at concentrations above 5% by volume.\n\nFor inerting applications, CO2 is injected into storage tanks, silos, and process vessels to create an oxygen-deficient atmosphere, preventing oxidative reactions, spontaneous combustion, or dust explosions in industries handling flammable powders or vapors. In coal mills and pulverized fuel systems, emergency inerting with CO2 maintains oxygen levels below 12-14% to suppress smoldering fires or explosions, a practice standardized since the early 20th century in power plants and cement facilities. Chemical processing plants use CO2 alongside nitrogen for purging reactors and pipelines, reducing explosion risks during maintenance or startups by diluting flammable gases to below their lower explosive limit.\n\nSafety protocols in CO2-based systems incorporate alarms, ventilation interlocks, and personnel training to mitigate hazards, as the gas's density causes it to settle in low-lying areas, potentially creating localized asphyxiation zones if not dispersed. In mining operations, CO2 inerting has been applied to seal off fire zones in underground coal seams, leveraging its non-flammable nature and availability from natural sources or on-site generation to contain outbreaks without introducing additional ignition risks. Overall, these applications prioritize CO2's physical properties—high density, non-reactivity with most substances, and rapid dispersion—for reliable fire prevention, though deployment requires precise concentration control to balance efficacy with occupant safety.\n\n### Supercritical CO2 in Extraction, Refrigeration, and Recovery Processes\n\nSupercritical carbon dioxide (scCO₂) exists above its critical point of 31.1 °C and 73.8 bar, where it demonstrates intermediate properties between liquids and gases, including high diffusivity, low viscosity, and tunable solvency ideal for industrial processes.  This state enables scCO₂ to penetrate matrices efficiently while dissolving target compounds selectively, without leaving solvent residues upon depressurization.\n\nIn extraction applications, scCO₂ serves as a non-toxic, environmentally benign solvent in supercritical fluid extraction (SFE) for isolating bioactive compounds from plant materials, such as essential oils, flavors, and pharmaceuticals. Commercial use began in the food industry, notably for decaffeinating coffee and tea in the late 1970s, with processes operating at pressures of 200–400 bar and temperatures of 40–80 °C to target caffeine solubility while preserving antioxidants. It has expanded to hops extraction for brewing since the 1980s, yielding isomerized alpha acids at efficiencies up to 95%, and more recently to cannabis-derived cannabinoids, where subcritical and supercritical variants control terpene retention. Advantages include reduced energy use compared to organic solvent methods and minimal thermal degradation, though equipment costs limit scalability for low-value extracts.\n\nFor refrigeration, scCO₂ functions as a working fluid (R-744) in transcritical cycles, particularly in commercial systems like supermarket cascade units, where the high-side pressure exceeds 73.8 bar, preventing condensation and requiring a gas cooler for heat rejection. Systems operate with discharge pressures up to 120 bar in warm ambient conditions above 31 °C, achieving coefficient of performance values competitive with hydrofluorocarbons in moderate climates, alongside zero ozone depletion and a global warming potential of 1. Adoption grew in Europe post-2000s under refrigerant regulations, with installations demonstrating 20–30% lower charge volumes than ammonia systems, though high pressures necessitate specialized compressors and piping, increasing initial costs by 10–20%.\n\nIn recovery processes, scCO₂ enhances oil recovery (EOR) by injecting it into depleted reservoirs, where its density (similar to liquids) and miscibility with hydrocarbons reduce oil viscosity by up to 90% and promote swelling for better displacement. Pioneered in the U.S. since the 1970s, such as at the SACROC field in Texas starting in 1972, CO₂ EOR has mobilized 10–20% additional original oil in place in mature fields, with over 200 projects worldwide by 2020 sequestering millions of tons of CO₂ annually as a byproduct. In shale formations, scCO₂ fracturing improves permeability by 15–30% over water-based methods due to lower surface tension, though challenges include corrosion and uneven sweep in heterogeneous reservoirs.\n\n## Environmental Impacts and Scientific Debates\n\n### Greenhouse Gas Physics: Radiative Forcing and Empirical Measurements\n\nCarbon dioxide (CO₂) contributes to the greenhouse effect primarily through absorption of infrared radiation in the 15 micrometer wavelength band, corresponding to its asymmetric stretching vibrational mode, which traps outgoing longwave radiation emitted from Earth's surface and lower atmosphere, reducing the flux escaping to space. This selective absorption alters the planetary energy balance, quantified as radiative forcing (ΔF), defined as the change in net downward radiative flux at the tropopause after adjusting for stratospheric temperature effects. For CO₂, the relationship is approximately logarithmic: ΔF = 5.35 ln(C/C₀) W/m², where C is the current atmospheric concentration and C₀ is the reference (typically pre-industrial 280 ppm), derived from line-by-line radiative transfer models accounting for spectral line broadening and overlap with water vapor. The logarithmic form arises from partial saturation in the band center, where optical depth is high and additional CO₂ molecules primarily enhance absorption in the band wings and at higher altitudes with colder emission temperatures, following the principles of radiative transfer where forcing diminishes per unit concentration increase but remains positive.\n\nFrom pre-industrial levels to 2023 concentrations of approximately 420 ppm, this yields a calculated ΔF of about 2.17 W/m² for CO₂ alone, representing roughly half of total anthropogenic forcing when excluding feedbacks. Claims of complete saturation, suggesting negligible additional forcing, misinterpret the band center opacity by overlooking contributions from unsaturated spectral regions and pressure-induced broadening, as confirmed by detailed spectral calculations showing continued sensitivity to CO₂ doubling even at current levels.\n\nEmpirical validation includes ground-based spectrally resolved measurements of downwelling longwave radiation at Earth's surface, which increased by 0.2 W/m² per decade from 2000 to 2010 directly attributable to rising CO₂, after isolating from water vapor and cloud effects using co-located instrumentation. Satellite observations further corroborate this: hyper-spectral data from instruments like AIRS and IASI reveal decreased outgoing longwave radiation (OLR) in CO₂ absorption bands (e.g., 667 cm⁻¹) over 2003–2020, with spectral fingerprints matching model predictions for a ~20 ppm increase, including reduced radiance at band center and wings without confounding by temperature feedbacks. Comparisons of 1970 Nimbus IRIS spectra with modern datasets show a ~2–3% OLR reduction in the 15 μm band, consistent with CO₂'s radiative influence amid overall stable or slightly increasing total OLR due to surface warming. These measurements align with the logarithmic forcing scaling, as the observed OLR changes scale with ln(C), though uncertainties persist in cloud contamination and exact kernel attributions, emphasizing the need for ongoing high-resolution monitoring.\n\n### Climate Model Predictions vs. Observed Temperature Data\n\nClimate models assembled in ensembles such as CMIP5 and CMIP6 have consistently projected global temperature increases exceeding those recorded in observational datasets, particularly since the late 1970s when satellite monitoring began. For the lower troposphere from 1979 to 2023, the University of Alabama in Huntsville (UAH) satellite record reports a linear trend of +0.14°C per decade, while the multi-model mean (MMM) from 36 CMIP ensembles averages +0.20°C per decade, representing a 43% overestimation. Similar gaps persist in surface air temperature records; for 1970–2019, the CMIP6 MMM warms 16% faster than observations across datasets like HadCRUT5 and NOAA. These discrepancies hold even after accounting for natural forcings like volcanic eruptions and solar variability, with models diverging upward post-2000 during the early 21st-century warming hiatus.\n\n| Period       | UAH Lower Troposphere Trend (°C/decade) | CMIP MMM Trend (°C/decade) | Overestimation |\n|--------------|-----------------------------------------|----------------------------|----------------|\n| 1979–2023   | +0.14                                   | +0.20                      | 43%            |\n| 1970–2019 (surface equivalent) | ~+0.18 (adjusted RSS/UAH)              | +0.20–0.22                 | 10–16%         |\n\nIndependent evaluations, including those using unadjusted rural-only surface stations, confirm CMIP6 models exceed observed warming over 63% of Earth's surface area since 1980, with tropical tropospheric amplification particularly mismatched—models predict 1.5–2 times the observed rate. The IPCC's Fifth Assessment Report acknowledged models overestimate warming of hot extremes relative to cold ones, a bias persisting into CMIP6 due to inflated equilibrium climate sensitivity (ECS) estimates averaging 3.7–5.6°C per CO2 doubling, against empirical constraints nearer 1.5–2.5°C from paleoclimate and instrumental data. Cloud feedback parameterization errors, overemphasizing positive low-cloud responses to warming, contribute substantially, as models fail to replicate observed negative feedbacks that dampen sensitivity.\n\nSurface datasets like GISS and HadCRUT exhibit upward adjustments (e.g., via homogenization algorithms) that amplify reported trends by 20–50% in some regions, narrowing but not eliminating the model-observation gap; satellite records, less prone to urban heat island contamination, provide a robust counterpoint showing half the projected amplification in the mid-troposphere. Historical projections amplify the issue: James Hansen's 1988 NASA model (Scenario B, moderate emissions) forecasted +0.45°C from 1988–2010, versus observed +0.25–0.30°C. Despite claims of overall skill from hindcast tuning, forward projections systematically run hot, as evidenced by post-1998 trends where observations track below 90% of CMIP6 members for multi-decadal periods. This pattern suggests overreliance on high-ECS models in policy-relevant assessments, where institutional pressures in academia—favoring alarmist outputs for funding and publication—may select against lower-sensitivity variants that better align with data. Empirical validation thus prioritizes datasets like UAH over model averages, underscoring unresolved physics in aerosol-cloud interactions and internal variability modes like the Atlantic Multidecadal Oscillation.\n\n### Positive Effects: Global Greening, Crop Yields, and Water Efficiency\n\nSatellite observations from 1982 to 2015 indicate a significant global greening trend, with 25% to 50% of Earth's vegetated lands exhibiting increased foliage cover, equivalent to an addition of leaf area roughly twice the size of the continental United States.  This greening is primarily driven by elevated atmospheric CO2 concentrations, which enhance photosynthesis and plant growth through the CO2 fertilization effect; modeling attributes approximately 70% of the observed trend to this factor, with nitrogen deposition, climate variations, and land-use changes contributing smaller shares of 9%, 8%, and 4%, respectively.  Empirical data from multiple global ecosystem models corroborate that rising CO2 levels from around 340 ppm in the early 1980s to over 400 ppm by the mid-2010s have been the dominant causal mechanism for the rise in global leaf area index (LAI). \n\nElevated CO2 concentrations promote higher crop yields primarily by boosting photosynthetic rates in C3 plants, which include major staples like wheat, rice, and soybeans; free-air CO2 enrichment (FACE) experiments conducted over more than 25 years demonstrate that raising CO2 from 353 ppm to 550 ppm increases C3 crop yields by an average of 19%, while effects on C4 crops like maize are smaller but still positive under field conditions.  In nutrient-sufficient scenarios without additional abiotic stresses, FACE results show yield enhancements of up to 40% across cereals, legumes, and root crops, reflecting sustained net primary production gains from CO2-driven biomass accumulation. These empirical findings from open-field trials, which avoid enclosure artifacts, indicate that historical CO2 rises have contributed to global food production increases, though concurrent factors like improved agronomy and nitrogen inputs amplify the effect. \n\nPlants exposed to higher CO2 levels exhibit improved intrinsic water use efficiency (WUE), defined as the ratio of carbon assimilation to transpiration, because elevated CO2 allows partial stomatal closure while maintaining photosynthetic uptake, thereby reducing water loss per unit of biomass produced.  Empirical studies, including greenhouse and field experiments, report that doubling CO2 concentrations can decrease transpiration by up to 34% and elevate WUE by 20-50% across various species and nitrogen regimes, enabling greater productivity in water-limited environments.  Under drought conditions, this CO2-induced WUE enhancement mitigates adverse effects on plant water relations and carbon sequestration, as observed in controlled exposures where elevated CO2 alleviated stomatal limitations and preserved growth.  Such responses suggest that rising atmospheric CO2 has contributed to vegetation resilience in arid regions, countering some water stress projections from temperature increases alone.\n\n### Ocean Acidification Claims vs. Empirical Evidence and Natural Variability\n\nClaims of ocean acidification posit that anthropogenic CO2 absorption has lowered surface seawater pH by approximately 0.1 units since pre-industrial times (from ~8.2 to ~8.1), increasing hydrogen ion concentration by 26-30% and threatening calcifying organisms like corals, shellfish, and pteropods through reduced carbonate saturation states (Ω). These assertions often extrapolate from laboratory experiments exposing organisms to elevated pCO2 levels far exceeding current atmospheric concentrations, predicting widespread dissolution of shells and skeletons, impaired larval development, and ecosystem collapse. However, such projections frequently overlook field observations and natural pH dynamics, with sources like mainstream climate reports amplifying risks despite limited empirical corroboration in open-ocean settings.\n\nEmpirical measurements reveal that the long-term pH decline is dwarfed by natural variability, which dominates short-term fluctuations and regional patterns. Diurnal cycles in coastal and reef waters can span 0.1-0.3 pH units due to photosynthesis and respiration, while seasonal variations reach 0.5-1 unit in productive areas influenced by upwelling, stratification, and biological activity. Open-ocean surface pH exhibits lower variability (~0.02-0.05 units annually), but even here, decadal trends are confounded by instrumental uncertainties and sparse historical data prior to the 1980s, with no direct pre-industrial proxy records confirming the alleged uniform drop. Studies detecting anthropogenic signals acknowledge that natural processes, such as El Niño-Southern Oscillation, can produce pH swings exceeding the century-scale trend in equatorial regions. This variability implies that alarmist thresholds for \"undersaturation\" (Ω \\u003c 1) occur episodically in coastal zones without anthropogenic forcing, challenging claims of unprecedented acidification.\n\nField evidence on marine calcifiers contrasts with lab-induced sensitivities. Coral reefs, which formed extensively during periods of higher atmospheric CO2 (e.g., \\u003e1000 ppm in the Eocene), show no global calcification decline attributable to pH alone; in situ experiments at natural CO2 vents reveal community adaptation via species shifts toward resilient calcifiers, with net ecosystem calcification persisting under elevated pCO2. Bleaching events correlate more strongly with thermal stress than pH, and reef-building continues in variable-pH environments like the Great Barrier Reef, where recent surveys indicate recovery potential absent other stressors. For shellfish, Pacific oyster (Crassostrea gigas) die-offs in Washington State hatcheries (2005-2008) were linked to natural upwelling of low-pH, high-pCO2 deep waters during spring, not direct atmospheric invasion; affected larvae exhibited delayed shell formation in lab tests, but field adaptations—including genetic selection for tolerant strains and buffering—have restored production without evidence of ongoing collapse. Broader surveys find oyster populations thriving in estuaries with pH swings exceeding projected end-century declines, underscoring resilience overlooked in controlled high-CO2 exposures.\n\nCritiques highlight methodological flaws in acidification narratives, including reliance on short-term lab acidosis ignoring multi-stressor interactions and evolutionary adaptability. Sources questioning the paradigm, such as analyses from CO2 Science and geochemists, note that ocean buffering capacity—via bicarbonate systems—limits pH sensitivity to CO2, with empirical aragonite saturation data showing no basin-wide undersaturation despite rising emissions. Institutions promoting alarm, often tied to climate advocacy, have faced scrutiny for inflating percentages (e.g., \"30% more acidic\" via antilog misinterpretation) while downplaying historical analogs where calcifiers flourished amid comparable chemistry. Overall, while CO2-driven pH modulation occurs, natural variability and biological plasticity mitigate projected harms, with empirical data favoring contextual over catastrophic interpretations.\n\n### Controversies in Attribution: Natural vs. Anthropogenic Drivers and Alarmism Critiques\n\nCritics of dominant anthropogenic attribution argue that natural forcings, such as solar variability and multi-decadal ocean cycles, account for a substantial portion of observed 20th-century warming, challenging the IPCC's claim of over 100% human responsibility after adjusting for natural factors.  Solar activity, varying by up to 1 W/m² over 11-year cycles, influences global temperatures through direct irradiance and indirect mechanisms like ultraviolet-driven stratospheric heating and cosmic ray-cloud interactions, with empirical reconstructions showing correlations to past climate shifts exceeding model-estimated effects.  Ocean oscillations, including the Pacific Decadal Oscillation (PDO) and Atlantic Multidecadal Oscillation (AMO), exhibit 60-70 year cycles that align with warming phases from the 1920s-1940s and 1970s-1990s, periods predating significant post-1950 CO2 increases, suggesting internal variability drives much of the trend without requiring amplified greenhouse forcing.\n\nAttribution methodologies employed by the IPCC, such as optimal fingerprinting and detection-attribution studies, have been critiqued for circular reasoning: they scale model-simulated patterns to observations, assuming pre-defined climate sensitivities that lack independent empirical confirmation, leading to overestimation of CO2's role while underweighting unmodeled natural amplifiers.  Raw, unadjusted temperature datasets reveal slower warming rates than homogenized series used in mainstream analyses, better matching solar and oceanic drivers; for example, the 1998-2013 \"hiatus\" in surface warming despite rising CO2 was later attributed to internal variability in revised models, highlighting reliance on post-hoc adjustments.  A 2025 U.S. Department of Energy review substantiates that IPCC assessments inadequately incorporate such natural variability, with alternative forcings explaining observed patterns more parsimoniously than anthropogenic dominance.\n\nAlarmism critiques emphasize discrepancies between model projections and empirical outcomes, including overpredicted warming from 1998-2014, where observed temperatures fell short of ensemble means by 0.2-0.3°C, and unchanged frequencies of U.S. hurricanes since comprehensive records began in 1851 despite forecasts of intensification.  The IPCC's 2007 projection of Himalayan glaciers vanishing by 2035, derived from gray literature rather than peer-reviewed data, exemplifies unsubstantiated claims that erode credibility; similarly, assertions of imminent Arctic ice-free summers by 2013 or 2030 have not materialized, with September extents stabilizing around 4-5 million km² post-2007 minimum.  These failures, often from advocacy-aligned sources, contrast with empirical stability in metrics like drought indices and crop yields, which have risen globally amid CO2 fertilization, underscoring a pattern where alarmist narratives prioritize worst-case scenarios over median outcomes. Institutions producing such projections frequently exhibit systemic biases favoring policy-driven conclusions, as evidenced by funding dependencies and ideological homogeneity in climate academia.\n\n## Historical Development\n\n### Discovery and Early Characterization\n\nIn 1754, Scottish chemist Joseph Black isolated carbon dioxide, which he termed \"fixed air,\" during experiments on magnesia alba (magnesium carbonate). By heating the substance, he observed a loss of weight corresponding to the release of a gas that differed from common air, as it was absorbed by limewater to form a precipitate and did not support combustion or respiration. Black presented these findings in 1756 to the Philosophical Society of Edinburgh, demonstrating that fixed air was produced in processes such as animal respiration, fermentation, and the calcination of limestone, and that it was approximately 1.5 times denser than atmospheric air. His work established fixed air as a distinct component of the atmosphere, separate from \"common air\" or \"dephlogisticated air,\" marking the first systematic characterization of the gas.\n\nBuilding on Black's observations, English chemist Henry Cavendish conducted precise measurements in 1766, confirming fixed air's density at about 1.98 times that of air and showing it could be generated by reacting alkalis with acids. Cavendish also noted its solubility in water, producing an acidic solution with a sharp taste, and its inability to dissolve metals, distinguishing it from other gases like hydrogen. Concurrently, Joseph Priestley in 1767 devised a method to infuse water with fixed air under pressure, creating effervescent \"soda water,\" which highlighted the gas's role in natural carbonation processes observed in mineral springs and fermented beverages. These experiments further revealed fixed air's asphyxiating effects in confined spaces and its extinguishing property on flames, due to displacement of oxygen.\n\nFrench chemist Antoine Lavoisier advanced the understanding in the 1780s by decomposing fixed air through combustion and analysis, confirming its composition as a compound of carbon and oxygen—specifically, one part carbon to two parts oxygen by volume. Lavoisier termed it \"acide carbonique\" (carbonic acid), reflecting its acidic properties in solution, and integrated it into his oxygen-based theory of combustion, rejecting phlogiston. This compositional insight, formalized in his 1789 *Traité élémentaire de chimie*, paved the way for the modern name \"carbon dioxide,\" adopted in chemical nomenclature reforms around 1787 by collaborators like Guyton de Morveau. Early characterizations consistently emphasized its chemical inertness in the pure state, reactivity with bases to form carbonates, and physiological toxicity at elevated concentrations, as evidenced by experiments showing rapid loss of consciousness in enclosed volumes.\n\n### 19th-20th Century Industrial and Scientific Advances\n\nIn the mid-19th century, scientific investigations advanced the understanding of carbon dioxide's role in atmospheric heat retention. In 1856, American scientist Eunice Newton Foote conducted experiments using glass cylinders filled with different gases exposed to sunlight, demonstrating that carbon dioxide trapped more heat than air or oxygen, with thermometers inside CO2-filled tubes rising to 125°F compared to 107°F in air-filled controls. This preceded similar work by John Tyndall, who in 1859–1860 quantitatively measured the infrared absorption properties of CO2 and water vapor using a differential thermopile, establishing that these gases selectively absorb radiant heat, a foundational mechanism for the greenhouse effect.\n\nIndustrial applications of CO2 emerged alongside these discoveries, particularly in carbonation processes. By the early 19th century, CO2 was introduced into beverages under pressure, with commercial scalability achieved following Humphry Davy's advancements in gas handling techniques around 1800, enabling widespread production of aerated waters by mid-century through fermentation or limestone calcination methods. CO2 also found early use as a refrigerant in vapor-compression systems starting in the 1870s, leveraging its non-flammability and high-pressure stability for marine and industrial cooling, with systems operational by the 1880s in Europe and the United States.\n\nToward the century's end, quantitative modeling integrated these findings. In 1896, Swedish chemist Svante Arrhenius published calculations estimating that halving atmospheric CO2 would lower global temperatures by 4–5°C, while doubling it could raise them by 5–6°C over millennia, based on radiative forcing principles and empirical absorption data, framing fossil fuel combustion as a potential climate influencer. These models assumed logarithmic CO2-temperature sensitivity, derived from first-principles energy balance equations incorporating observed solar and terrestrial radiation spectra.\n\nIn the 20th century, empirical atmospheric measurements refined these theories amid rising industrial emissions. By 1938, British engineer Guy Stewart Callendar analyzed data from 147 global weather stations, documenting a 0.005°C per decade land surface warming since the late 19th century and correlating it with a 10% CO2 increase from anthropogenic sources like coal burning, estimating future warming at 0.003°C annually if emissions continued. Callendar's work utilized chemical analysis of air samples and combustion statistics, attributing about half the observed 0.3–0.5°C rise from 1880–1935 to CO2, though contemporaries debated natural variability and urban heat effects. Industrial production scaled further, with CO2 recovered from brewery fermentation and lime kilns for fire suppression systems introduced commercially in the 1920s, using pressurized cylinders to displace oxygen in blazes. These advances highlighted CO2's dual role as both an atmospheric tracer and a versatile industrial gas, predating modern monitoring networks.\n\n### Modern Measurements and Policy Influences\n\nModern measurements of atmospheric carbon dioxide concentrations began systematically in 1958 with Charles David Keeling's establishment of a monitoring station at Mauna Loa Observatory in Hawaii, yielding the iconic Keeling Curve that documents a steady rise from approximately 315 parts per million (ppm) that year to 425.43 ppm as of October 23, 2025. This site was selected for its remote location, minimizing local influences, and employs non-dispersive infrared spectroscopy to measure CO2 with precision better than 0.2 ppm. Validation comes from parallel measurements at other global sites, including flask sampling and satellite observations from instruments like NASA's Orbiting Carbon Observatory-2, which confirm the Mauna Loa trend's representativeness for broader Northern Hemisphere and global averages.\n\nThe global network, expanded by NOAA's Global Monitoring Laboratory since the 1970s, now includes over 100 stations, revealing annual mean CO2 growth rates of about 2-3 ppm per year, accelerating to 3.5 ppm between 2023 and 2024, reaching a global average of 423.9 ppm in 2024. Isotopic analysis of carbon-13 depletion in atmospheric CO2 further attributes roughly 100% of the post-1850 increase to fossil fuel combustion and land-use changes, distinguishing it from natural sources. Despite this, empirical data show seasonal cycles driven by Northern Hemisphere vegetation, with peaks in May and troughs in September, and interannual variability linked to events like El Niño, which temporarily boosts atmospheric CO2 via reduced terrestrial uptake.\n\nThese measurements profoundly shaped international policy, as rising levels documented by Keeling and subsequent data underscored anthropogenic contributions in early IPCC assessments starting in 1990, prompting the 1992 United Nations Framework Convention on Climate Change (UNFCCC). The 1997 Kyoto Protocol set binding emission reduction targets for developed nations, influenced directly by IPCC summaries highlighting CO2's radiative forcing, though compliance was limited, with global emissions continuing to climb. The 2015 Paris Agreement, ratified by 195 parties, built on this foundation by committing nations to nationally determined contributions (NDCs) aimed at peaking emissions and pursuing net-zero by mid-century, explicitly referencing observed CO2 trends to justify limits on warming to well below 2°C above pre-industrial levels.\n\nPolicy responses, including carbon pricing mechanisms like the EU Emissions Trading System (established 2005) and subsidies for low-carbon technologies, have been predicated on projections extrapolating from measurement trends, yet critiques note that atmospheric CO2 has risen unabated— from 400 ppm in 2013 to over 425 ppm in 2025—despite trillions in global investments, questioning marginal efficacy amid developing economies' growth. Some analyses argue policies over-rely on high-emission scenarios like RCP8.5, which diverge from observed trends and foster alarmism, as actual emissions have tracked lower pathways while CO2 levels reflect persistent fossil fuel dependence. Empirical measurement networks continue to inform adaptive strategies, such as enhanced carbon capture mandates, but debates persist on balancing economic costs against uncertain long-term feedbacks not fully captured in direct observations.",
  "external_references": [
    {
      "text": "Carbon Dioxide",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/Carbon-Dioxide",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Cbook.cgi",
      "url": "https://webbook.nist.gov/cgi/cbook.cgi?ID=124-38-9",
      "domain": "webbook.nist.gov",
      "type": "citation"
    },
    {
      "text": "Monthly.html",
      "url": "https://gml.noaa.gov/ccgg/trends/monthly.html",
      "domain": "gml.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Carboncycle",
      "url": "https://earthobservatory.nasa.gov/features/CarbonCycle",
      "domain": "earthobservatory.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Doe Explainsthe Carbon Cycle",
      "url": "https://www.energy.gov/science/doe-explainsthe-carbon-cycle",
      "domain": "energy.gov",
      "type": "citation"
    },
    {
      "text": "Carbon Cycle",
      "url": "https://www.noaa.gov/education/resource-collections/climate/carbon-cycle",
      "domain": "noaa.gov",
      "type": "citation"
    },
    {
      "text": "Connecting Cellular Respiration And Photosynthesis Ms Ls",
      "url": "https://flexbooks.ck12.org/cbook/ck-12-middle-school-life-science-2.0/section/2.17/primary/lesson/connecting-cellular-respiration-and-photosynthesis-ms-ls/",
      "domain": "flexbooks.ck12.org",
      "type": "citation"
    },
    {
      "text": "Pmc4242210",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4242210/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Uses",
      "url": "https://www.atlascopco.com/en-us/compressors/wiki/compressed-air-articles/carbon-dioxide-uses",
      "domain": "atlascopco.com",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Uses",
      "url": "https://westairgases.com/blog/carbon-dioxide-uses/",
      "domain": "westairgases.com",
      "type": "citation"
    },
    {
      "text": "Hybridization Of Carbon In Co2",
      "url": "https://chemistry.stackexchange.com/questions/50630/hybridization-of-carbon-in-co2",
      "domain": "chemistry.stackexchange.com",
      "type": "citation"
    },
    {
      "text": "Hybridization Of Co2",
      "url": "https://byjus.com/jee/hybridization-of-co2/",
      "domain": "byjus.com",
      "type": "citation"
    },
    {
      "text": "Co2 Molecular Geometry And Bond Angles",
      "url": "https://unacademy.com/content/jee/study-material/chemistry/co2-molecular-geometry-and-bond-angles/",
      "domain": "unacademy.com",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide",
      "url": "https://www.sciencedirect.com/topics/chemical-engineering/carbon-dioxide",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Resonance Co2 Ans.html",
      "url": "https://www.chemteam.info/Bonding/Resonance-CO2-Ans.html",
      "domain": "chemteam.info",
      "type": "citation"
    },
    {
      "text": "Bond Order And Lengths",
      "url": "https://chem.libretexts.org/Bookshelves/Physical_and_Theoretical_Chemistry_Textbook_Maps/Supplemental_Modules_%28Physical_and_Theoretical_Chemistry%29/Chemical_Bonding/Fundamentals_of_Chemical_Bonding/Bond_Order_and_Lengths",
      "domain": "chem.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Co2 Polar Or Nonpolar",
      "url": "https://general.chemistrysteps.com/co2-polar-or-nonpolar/",
      "domain": "general.chemistrysteps.com",
      "type": "citation"
    },
    {
      "text": "39436376",
      "url": "https://pubmed.ncbi.nlm.nih.gov/39436376/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "8.1.06%253a Phase Diagrams",
      "url": "https://chem.libretexts.org/Courses/City_College_of_San_Francisco/Chemistry_101A/08%253A_Topic_H-_Condensed_States_and_Attractive_Forces_Between_Particles/8.01%253A_Condensed_States_and_Intermolecular_Forces/8.1.06%253A_Phase_Diagrams",
      "domain": "chem.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Co2 Phase Diagram",
      "url": "https://separeco.com/co2-extraction-physics/co2-phase-diagram/",
      "domain": "separeco.com",
      "type": "citation"
    },
    {
      "text": "Je200991x",
      "url": "https://pubs.acs.org/doi/10.1021/je200991x",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "Fluid",
      "url": "https://webbook.nist.gov/chemistry/fluid/",
      "domain": "webbook.nist.gov",
      "type": "citation"
    },
    {
      "text": "Is Carbon Dioxide Ir Inactive",
      "url": "https://chemistry.stackexchange.com/questions/19119/is-carbon-dioxide-ir-inactive",
      "domain": "chemistry.stackexchange.com",
      "type": "citation"
    },
    {
      "text": "Pmc8653698",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8653698/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Exp2x.asp",
      "url": "https://cccbdb.nist.gov/exp2x.asp?casno=124389",
      "domain": "cccbdb.nist.gov",
      "type": "citation"
    },
    {
      "text": "Cbook.cgi",
      "url": "https://webbook.nist.gov/cgi/cbook.cgi?ID=C124389\\u0026Type=IR-SPEC\\u0026Index=1",
      "domain": "webbook.nist.gov",
      "type": "citation"
    },
    {
      "text": "Carbon Oxide",
      "url": "https://ramanlife.com/library/carbon-oxide/",
      "domain": "ramanlife.com",
      "type": "citation"
    },
    {
      "text": "Co2.html",
      "url": "https://www.chem.purdue.edu/gchelp/vibs/co2.html",
      "domain": "chem.purdue.edu",
      "type": "citation"
    },
    {
      "text": "Jp0526602",
      "url": "https://pubs.acs.org/doi/10.1021/jp0526602",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "16435784",
      "url": "https://pubmed.ncbi.nlm.nih.gov/16435784/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pdf",
      "url": "https://www.sciencedirect.com/science/article/pii/0022190281803818/pdf",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Rspa.1927.0095",
      "url": "https://royalsocietypublishing.org/doi/pdf/10.1098/rspa.1927.0095",
      "domain": "royalsocietypublishing.org",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://ui.adsabs.harvard.edu/abs/2002A\\u0026A...386.1139T/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "416 1 Online.pdf",
      "url": "https://pubs.aip.org/aip/jcp/article-pdf/36/2/416/18823851/416_1_online.pdf",
      "domain": "pubs.aip.org",
      "type": "citation"
    },
    {
      "text": "Gasification Chemistry",
      "url": "https://www.netl.doe.gov/research/coal/energy-systems/gasification/gasifipedia/gasification-chemistry",
      "domain": "netl.doe.gov",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "http://ui.adsabs.harvard.edu/abs/2002A\\u0026A...386.1139T/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "S1385894723070584",
      "url": "https://www.sciencedirect.com/science/article/pii/S1385894723070584",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Cbook.cgi",
      "url": "https://webbook.nist.gov/cgi/cbook.cgi?ID=C124389\\u0026Mask=10",
      "domain": "webbook.nist.gov",
      "type": "citation"
    },
    {
      "text": "124 38 9",
      "url": "https://henrys-law.org/henry/casrn/124-38-9",
      "domain": "henrys-law.org",
      "type": "citation"
    },
    {
      "text": "Ja01861a033",
      "url": "https://pubs.acs.org/doi/10.1021/ja01861a033",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "978 3 642 67572 0 1",
      "url": "https://link.springer.com/chapter/10.1007/978-3-642-67572-0_1",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Carbonic Acid Kinetics",
      "url": "https://www.aqion.de/site/carbonic-acid-kinetics",
      "domain": "aqion.de",
      "type": "citation"
    },
    {
      "text": "Aqueous Co2 Solutions.html",
      "url": "http://scifun.org/ClimateWorkbook/aqueous-CO2-solutions.html",
      "domain": "scifun.org",
      "type": "citation"
    },
    {
      "text": "Co2 And Ph Henrys Law",
      "url": "https://blog.orendatech.com/co2-and-ph-henrys-law",
      "domain": "blog.orendatech.com",
      "type": "citation"
    },
    {
      "text": "S2212982023000744",
      "url": "https://www.sciencedirect.com/science/article/pii/S2212982023000744",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Energy Fundamental Geochemical Processes Co2 Water Minerals.pdf",
      "url": "https://www.alberta.ca/system/files/custom_downloaded_images/energy-fundamental-geochemical-processes-co2-water-minerals.pdf",
      "domain": "alberta.ca",
      "type": "citation"
    },
    {
      "text": "18.2.html",
      "url": "https://chemed.chem.purdue.edu/demos/demosheets/18.2.html",
      "domain": "chemed.chem.purdue.edu",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.ilpi.com/genchem/demo/co2mg/index.html",
      "domain": "ilpi.com",
      "type": "citation"
    },
    {
      "text": "S0082078489801754",
      "url": "https://www.sciencedirect.com/science/article/pii/S0082078489801754",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Ic00170a013",
      "url": "https://pubs.acs.org/doi/10.1021/ic00170a013",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "35816036",
      "url": "https://pubmed.ncbi.nlm.nih.gov/35816036/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://ui.adsabs.harvard.edu/abs/2021AGUFMMR25A0062S/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "20.13 Reaction Of Organometallic Reagents With Co2",
      "url": "https://chem.libretexts.org/Courses/University_of_Illinois_Springfield/UIS%253A_CHE_269_%28Morsch_and_Andrews%29/Chapters/Chapter_20%253A_Introduction_to_Carbonyl_Chemistry/20.13_Reaction_of_Organometallic_Reagents_with_CO2",
      "domain": "chem.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Reactions Of Grignard Reagents",
      "url": "https://www.masterorganicchemistry.com/2015/12/10/reactions-of-grignard-reagents/",
      "domain": "masterorganicchemistry.com",
      "type": "citation"
    },
    {
      "text": "Grignard Rmgx Organolithium Rli Carbon Dioxide Co2",
      "url": "https://www.chemistrysteps.com/grignard-rmgx-organolithium-rli-carbon-dioxide-co2/",
      "domain": "chemistrysteps.com",
      "type": "citation"
    },
    {
      "text": "Cr00087a003",
      "url": "https://pubs.acs.org/doi/10.1021/cr00087a003",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "co2.earth",
      "url": "https://www.co2.earth/",
      "domain": "co2.earth",
      "type": "citation"
    },
    {
      "text": "Climate Change Atmospheric Carbon Dioxide",
      "url": "https://www.climate.gov/news-features/understanding-climate/climate-change-atmospheric-carbon-dioxide",
      "domain": "climate.gov",
      "type": "citation"
    },
    {
      "text": "Trends",
      "url": "https://gml.noaa.gov/ccgg/trends/",
      "domain": "gml.noaa.gov",
      "type": "citation"
    },
    {
      "text": "keelingcurve.ucsd.edu",
      "url": "https://keelingcurve.ucsd.edu/",
      "domain": "keelingcurve.ucsd.edu",
      "type": "citation"
    },
    {
      "text": "How Do We Know Mauna Loa Carbon Dioxide Measurements Dont Include Volcanic Gases",
      "url": "https://science.nasa.gov/earth/natural-disasters/volcanoes/how-do-we-know-mauna-loa-carbon-dioxide-measurements-dont-include-volcanic-gases/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "17975",
      "url": "https://www.ncei.noaa.gov/access/paleo-search/study/17975",
      "domain": "ncei.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Co2 Ice Core Data",
      "url": "https://www.co2.earth/co2-ice-core-data",
      "domain": "co2.earth",
      "type": "citation"
    },
    {
      "text": "A New 66 Million Year History Of Carbon Dioxide Offers Little Comfort For Today",
      "url": "https://news.climate.columbia.edu/2023/12/07/a-new-66-million-year-history-of-carbon-dioxide-offers-little-comfort-for-today/",
      "domain": "news.climate.columbia.edu",
      "type": "citation"
    },
    {
      "text": "Backgr045.html",
      "url": "https://www.ncei.noaa.gov/access/ocean-carbon-acidification-data-system/oceans/ndp_045/backgr045.html",
      "domain": "ncei.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Co2 Reservoir",
      "url": "https://worldoceanreview.com/en/wor-1/ocean-chemistry/co2-reservoir/",
      "domain": "worldoceanreview.com",
      "type": "citation"
    },
    {
      "text": "Dickson Thecarbondioxidesysteminseawater Equilibriumchemistryandmeasurementspp17 40.pdf",
      "url": "https://www.pmel.noaa.gov/co2/files/dickson_thecarbondioxidesysteminseawater_equilibriumchemistryandmeasurementspp17-40.pdf",
      "domain": "pmel.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Dic Storage In Oceans",
      "url": "https://registry.isometric.com/module/dic-storage-in-oceans",
      "domain": "registry.isometric.com",
      "type": "citation"
    },
    {
      "text": "525",
      "url": "https://www.e-education.psu.edu/earth103/node/525",
      "domain": "e-education.psu.edu",
      "type": "citation"
    },
    {
      "text": "Follow The Carbon",
      "url": "https://www.exploratorium.edu/snacks/follow-the-carbon",
      "domain": "exploratorium.edu",
      "type": "citation"
    },
    {
      "text": "Stores Of Carbon.php",
      "url": "https://www.coolgeography.co.uk/advanced/Stores_of_Carbon.php",
      "domain": "coolgeography.co.uk",
      "type": "citation"
    },
    {
      "text": "Global Carbon Cycle",
      "url": "https://www.sciencedirect.com/topics/earth-and-planetary-sciences/global-carbon-cycle",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Tbi The Carbon Budget.pdf",
      "url": "https://gml.noaa.gov/education/info_activities/pdfs/TBI_the_carbon_budget.pdf",
      "domain": "gml.noaa.gov",
      "type": "citation"
    },
    {
      "text": "S0959378015300637",
      "url": "https://www.sciencedirect.com/science/article/pii/S0959378015300637",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Tellusb.v44i2.15428",
      "url": "https://b.tellusjournals.se/articles/10.3402/tellusb.v44i2.15428",
      "domain": "b.tellusjournals.se",
      "type": "citation"
    },
    {
      "text": "Pmc4283042",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4283042/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9292898",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9292898/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Ismej200858",
      "url": "https://www.nature.com/articles/ismej200858",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Biological Carbon Pump Ocean Topic",
      "url": "https://www.whoi.edu/ocean-learning-hub/ocean-topics/how-the-ocean-works/cycles/biological-carbon-pump-ocean-topic/",
      "domain": "whoi.edu",
      "type": "citation"
    },
    {
      "text": "36070554",
      "url": "https://pubmed.ncbi.nlm.nih.gov/36070554/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41558 023 01867 2",
      "url": "https://www.nature.com/articles/s41558-023-01867-2",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Calvin Cycle",
      "url": "https://www.khanacademy.org/science/biology/photosynthesis-in-plants/the-calvin-cycle-reactions/a/calvin-cycle",
      "domain": "khanacademy.org",
      "type": "citation"
    },
    {
      "text": "J.1469 8137.2004.01224.x",
      "url": "https://nph.onlinelibrary.wiley.com/doi/10.1111/j.1469-8137.2004.01224.x",
      "domain": "nph.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Greenhouse Carbon Dioxide Supplementation.html",
      "url": "https://extension.okstate.edu/fact-sheets/greenhouse-carbon-dioxide-supplementation.html",
      "domain": "extension.okstate.edu",
      "type": "citation"
    },
    {
      "text": "Face",
      "url": "https://ess.science.energy.gov/face/",
      "domain": "ess.science.energy.gov",
      "type": "citation"
    },
    {
      "text": "Gcb 15375 Final.pdf",
      "url": "https://lab.igb.illinois.edu/long/sites/lab.igb.illinois.edu.long/files/2020-11/GCB_15375_Final.pdf",
      "domain": "lab.igb.illinois.edu",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Fertilization Greening Earth Study Finds",
      "url": "https://www.nasa.gov/centers-and-facilities/goddard/carbon-dioxide-fertilization-greening-earth-study-finds/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Modis Shows Earth Is Greener",
      "url": "https://terra.nasa.gov/news/modis-shows-earth-is-greener",
      "domain": "terra.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12121383",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12121383/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Less Nutritious Crops Another Result Rising Co2",
      "url": "https://magazine.publichealth.jhu.edu/2024/less-nutritious-crops-another-result-rising-co2",
      "domain": "magazine.publichealth.jhu.edu",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/lanplh/article/PIIS2542-5196%2819%2930108-1/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Cellular Respiration",
      "url": "https://www.khanacademy.org/science/ms-biology/x0c5bb03129646fd6:matter-and-energy-in-organisms/x0c5bb03129646fd6:food-and-energy-in-organisms/a/cellular-respiration",
      "domain": "khanacademy.org",
      "type": "citation"
    },
    {
      "text": "Gas Exchange In Animals",
      "url": "https://organismalbio.biosci.gatech.edu/nutrition-transport-and-homeostasis/gas-exchange-in-animals/",
      "domain": "organismalbio.biosci.gatech.edu",
      "type": "citation"
    },
    {
      "text": "20372066",
      "url": "https://pubmed.ncbi.nlm.nih.gov/20372066/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk532988",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK532988/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Transport Of Carbon Dioxide In The Blood",
      "url": "https://courses.lumenlearning.com/wm-biology2/chapter/transport-of-carbon-dioxide-in-the-blood/",
      "domain": "courses.lumenlearning.com",
      "type": "citation"
    },
    {
      "text": "Transport Carbon Dioxide Blood",
      "url": "https://derangedphysiology.com/main/cicm-primary-exam/respiratory-system/Chapter-114/transport-carbon-dioxide-blood",
      "domain": "derangedphysiology.com",
      "type": "citation"
    },
    {
      "text": "Transport Of Co2 In The Blood",
      "url": "https://geekymedics.com/transport-of-co2-in-the-blood/",
      "domain": "geekymedics.com",
      "type": "citation"
    },
    {
      "text": "Content.aspx",
      "url": "https://accessanesthesiology.mhmedical.com/content.aspx?bookid=974\\u0026sectionid=61590003",
      "domain": "accessanesthesiology.mhmedical.com",
      "type": "citation"
    },
    {
      "text": "10501632",
      "url": "https://pubmed.ncbi.nlm.nih.gov/10501632/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "19253",
      "url": "https://agencia.fapesp.br/study-confirms-how-the-body-regulates-high-levels-of-co2-in-the-blood/19253",
      "domain": "agencia.fapesp.br",
      "type": "citation"
    },
    {
      "text": "Pmc4515048",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4515048/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Respiration Control",
      "url": "https://university.pressbooks.pub/test456/chapter/respiration-control/",
      "domain": "university.pressbooks.pub",
      "type": "citation"
    },
    {
      "text": "Physrev.00003.2019",
      "url": "https://journals.physiology.org/doi/abs/10.1152/physrev.00003.2019",
      "domain": "journals.physiology.org",
      "type": "citation"
    },
    {
      "text": "08086",
      "url": "https://elifesciences.org/articles/08086",
      "domain": "elifesciences.org",
      "type": "citation"
    },
    {
      "text": "Pmc5380556",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5380556/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk551620",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK551620/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "124389.html",
      "url": "https://www.cdc.gov/niosh/idlh/124389.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "183",
      "url": "https://www.osha.gov/chemicaldata/183",
      "domain": "osha.gov",
      "type": "citation"
    },
    {
      "text": "Npgd0103.html",
      "url": "https://www.cdc.gov/niosh/npg/npgd0103.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "0343.pdf",
      "url": "https://nj.gov/health/eoh/rtkweb/documents/fs/0343.pdf",
      "domain": "nj.gov",
      "type": "citation"
    },
    {
      "text": "S0160412018312807",
      "url": "https://www.sciencedirect.com/science/article/pii/S0160412018312807",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Uploadsproductmediadocumentbest Practice For Handling R 744 En Bd.pdf",
      "url": "https://climalife.com/wp-content/uploads/2022/09/uploadsproductmediadocumentbest-practice-for-handling-r-744-en-bd.pdf",
      "domain": "climalife.com",
      "type": "citation"
    },
    {
      "text": "Co2appendixb.pdf",
      "url": "https://www.epa.gov/sites/default/files/2015-06/documents/co2appendixb.pdf",
      "domain": "epa.gov",
      "type": "citation"
    },
    {
      "text": "Dangers Of Co2 What You Need To Know",
      "url": "https://www.co2meter.com/blogs/news/dangers-of-co2-what-you-need-to-know",
      "domain": "co2meter.com",
      "type": "citation"
    },
    {
      "text": "Module 2 Handout Co2 Adverse Health Effects Fact Sheet.pdf",
      "url": "https://ethanolrfa.org/file/348/Module-2-Handout-CO2-Adverse-Health-Effects-Fact-Sheet.pdf",
      "domain": "ethanolrfa.org",
      "type": "citation"
    },
    {
      "text": "J.jchas.2008.06.003",
      "url": "https://pubs.acs.org/doi/10.1016/j.jchas.2008.06.003",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "24808 Hypercapnia",
      "url": "https://my.clevelandclinic.org/health/diseases/24808-hypercapnia",
      "domain": "my.clevelandclinic.org",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Toxicity Symptoms",
      "url": "https://blog.sscor.com/carbon-dioxide-toxicity-symptoms",
      "domain": "blog.sscor.com",
      "type": "citation"
    },
    {
      "text": "Co2 Emissions",
      "url": "https://www.iea.org/reports/global-energy-review-2025/co2-emissions",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "Fossil Fuel Co2 Emissions Increase Again In 2024",
      "url": "https://globalcarbonbudget.org/fossil-fuel-co2-emissions-increase-again-in-2024/",
      "domain": "globalcarbonbudget.org",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Emissions Share Worldwide By Fuel",
      "url": "https://www.statista.com/statistics/500817/carbon-dioxide-emissions-share-worldwide-by-fuel/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Executive Summary",
      "url": "https://www.iea.org/reports/co2-emissions-in-2023/executive-summary",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "Carbon Footprint Factsheet",
      "url": "https://css.umich.edu/publications/factsheets/sustainability-indicators/carbon-footprint-factsheet",
      "domain": "css.umich.edu",
      "type": "citation"
    },
    {
      "text": "Emissions By Sector",
      "url": "https://ourworldindata.org/emissions-by-sector",
      "domain": "ourworldindata.org",
      "type": "citation"
    },
    {
      "text": "Co2emissionsin2023.pdf",
      "url": "https://iea.blob.core.windows.net/assets/33e2badc-b839-4c18-84ce-f6387b3c008f/CO2Emissionsin2023.pdf",
      "domain": "iea.blob.core.windows.net",
      "type": "citation"
    },
    {
      "text": "4 Charts Explain Greenhouse Gas Emissions Countries And Sectors",
      "url": "https://www.wri.org/insights/4-charts-explain-greenhouse-gas-emissions-countries-and-sectors",
      "domain": "wri.org",
      "type": "citation"
    },
    {
      "text": "Global Energy Review Co2 Emissions In 2021",
      "url": "https://www.iea.org/reports/global-energy-review-co2-emissions-in-2021",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "195",
      "url": "https://essd.copernicus.org/articles/10/195/",
      "domain": "essd.copernicus.org",
      "type": "citation"
    },
    {
      "text": "S41467 023 43660 X",
      "url": "https://www.nature.com/articles/s41467-023-43660-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Emissions Global Cement Manufacturing",
      "url": "https://www.statista.com/statistics/1091672/carbon-dioxide-emissions-global-cement-manufacturing/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Acs.iecr.4c01885",
      "url": "https://pubs.acs.org/doi/10.1021/acs.iecr.4c01885",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "Steel Emissions Reporting Guidance.pdf",
      "url": "https://rmi.org/wp-content/uploads/2022/09/steel_emissions_reporting_guidance.pdf",
      "domain": "rmi.org",
      "type": "citation"
    },
    {
      "text": "Steel Co2 Emissions",
      "url": "https://www.carbonclean.com/insights/steel-co2-emissions",
      "domain": "carbonclean.com",
      "type": "citation"
    },
    {
      "text": "Cutting The Carbon Intensity Of Steel Using Hydrogen And Renewables",
      "url": "https://www.ief.org/news/cutting-the-carbon-intensity-of-steel-using-hydrogen-and-renewables",
      "domain": "ief.org",
      "type": "citation"
    },
    {
      "text": "Steel Climate Impact International Benchmarking Energy Co2 Intensities",
      "url": "https://www.globalefficiencyintel.com/steel-climate-impact-international-benchmarking-energy-co2-intensities",
      "domain": "globalefficiencyintel.com",
      "type": "citation"
    },
    {
      "text": "S0196890425010581",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0196890425010581",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Ammonia",
      "url": "https://risestjames.org/education/chemical-of-the-month/ammonia/",
      "domain": "risestjames.org",
      "type": "citation"
    },
    {
      "text": "I24",
      "url": "https://cen.acs.org/environment/green-chemistry/Industrial-ammonia-production-emits-CO2/97/i24",
      "domain": "cen.acs.org",
      "type": "citation"
    },
    {
      "text": "S0306261915014464",
      "url": "https://www.sciencedirect.com/science/article/pii/S0306261915014464",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Ammonia Technical Brief June2022.pdf",
      "url": "https://www.c-thru.org/wp-content/uploads/2022/12/Ammonia-Technical-Brief-June2022.pdf",
      "domain": "c-thru.org",
      "type": "citation"
    },
    {
      "text": "Global",
      "url": "https://www.globalforestwatch.org/dashboards/global/",
      "domain": "globalforestwatch.org",
      "type": "citation"
    },
    {
      "text": "Latest Analysis Deforestation Trends",
      "url": "https://gfr.wri.org/latest-analysis-deforestation-trends",
      "domain": "gfr.wri.org",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://openknowledge.fao.org/bitstreams/8748db31-0199-433a-ac84-26e4d2568517/download",
      "domain": "openknowledge.fao.org",
      "type": "citation"
    },
    {
      "text": "En",
      "url": "https://www.fao.org/statistics/highlights-archive/highlights-detail/greenhouse-gas-emissions-from-agrifood-systems.-global--regional-and-country-trends--2000-2022/en",
      "domain": "fao.org",
      "type": "citation"
    },
    {
      "text": "Land Use Land Use Change And Forestry Lulucf",
      "url": "https://unfccc.int/topics/land-use/workstreams/land-use--land-use-change-and-forestry-lulucf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Chapter 7",
      "url": "https://www.ipcc.ch/report/ar6/wg3/chapter/chapter-7/",
      "domain": "ipcc.ch",
      "type": "citation"
    },
    {
      "text": "Un Report Five Charts Showing How Global Deforestation Is Declining",
      "url": "https://www.carbonbrief.org/un-report-five-charts-showing-how-global-deforestation-is-declining/",
      "domain": "carbonbrief.org",
      "type": "citation"
    },
    {
      "text": "Chapter 2",
      "url": "https://www.ipcc.ch/report/ar6/wg3/chapter/chapter-2/",
      "domain": "ipcc.ch",
      "type": "citation"
    },
    {
      "text": "Deforestation",
      "url": "https://ourworldindata.org/deforestation",
      "domain": "ourworldindata.org",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Prepcarbon Gas 607544",
      "url": "https://www.thoughtco.com/carbon-dioxide-prepcarbon-gas-607544",
      "domain": "thoughtco.com",
      "type": "citation"
    },
    {
      "text": "Prepare Carbon Dioxide Gas In The Laboratory",
      "url": "https://sajhanotes.com/chemistry-lab/prepare-carbon-dioxide-gas-in-the-laboratory/",
      "domain": "sajhanotes.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=Du8Exmj9sW4",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "How Is Co2 Obtained And Placed In Tanks",
      "url": "https://www.reddit.com/r/chemistry/comments/yb2zwq/how_is_co2_obtained_and_placed_in_tanks/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Capturing Co2 From Fermentation",
      "url": "https://atlas-scientific.com/blog/capturing-co2-from-fermentation/",
      "domain": "atlas-scientific.com",
      "type": "citation"
    },
    {
      "text": "How Is Carbon Dioxide Produced Commercially For Industrial Use",
      "url": "https://www.quora.com/How-is-carbon-dioxide-produced-commercially-for-industrial-use",
      "domain": "quora.com",
      "type": "citation"
    },
    {
      "text": "Industrial Carbon Dioxide",
      "url": "https://www.oxygenservicecompany.com/gases/industrial/industrial-carbon-dioxide/",
      "domain": "oxygenservicecompany.com",
      "type": "citation"
    },
    {
      "text": "Production Process Of Beverage Grade Co2",
      "url": "https://ramdon.com/production-process-of-beverage-grade-co2/",
      "domain": "ramdon.com",
      "type": "citation"
    },
    {
      "text": "Fs379",
      "url": "https://edis.ifas.ufl.edu/publication/FS379",
      "domain": "edis.ifas.ufl.edu",
      "type": "citation"
    },
    {
      "text": "A Brief Look Into The Carbonation Process",
      "url": "https://vscarbonics.com/blog/a-brief-look-into-the-carbonation-process",
      "domain": "vscarbonics.com",
      "type": "citation"
    },
    {
      "text": "S0924224416302278",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0924224416302278",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "1324 Naturally Preserving Food With Gases",
      "url": "https://www.food-safety.com/articles/1324-naturally-preserving-food-with-gases",
      "domain": "food-safety.com",
      "type": "citation"
    },
    {
      "text": "Dry Ice For Temperature Controlled Distribution In The Food Industry",
      "url": "https://www.nexair.com/learning-center/dry-ice-for-temperature-controlled-distribution-in-the-food-industry/",
      "domain": "nexair.com",
      "type": "citation"
    },
    {
      "text": "Food Processing Cooling",
      "url": "https://www.coldjet.com/dry-ice-production/applications/food-processing-cooling/",
      "domain": "coldjet.com",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Enrichment Greenhouse Production.htm",
      "url": "https://www.greenhouse-management.com/greenhouse_management/carbon_dioxide_greenhouses/carbon_dioxide_enrichment_greenhouse_production.htm",
      "domain": "greenhouse-management.com",
      "type": "citation"
    },
    {
      "text": "Carbondioxide Crops.pdf",
      "url": "https://www.ams.usda.gov/sites/default/files/media/CarbonDioxide_Crops.pdf",
      "domain": "ams.usda.gov",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Enrichment Greenhouses",
      "url": "https://ucanr.edu/blog/nursery-and-flower-grower/article/carbon-dioxide-enrichment-greenhouses",
      "domain": "ucanr.edu",
      "type": "citation"
    },
    {
      "text": "Pmc9634482",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9634482/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Co2 Fire Extinguishers",
      "url": "https://surreyfire.co.uk/co2-fire-extinguishers/",
      "domain": "surreyfire.co.uk",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Fire Suppressant Examining Risks",
      "url": "https://www.epa.gov/snap/carbon-dioxide-fire-suppressant-examining-risks",
      "domain": "epa.gov",
      "type": "citation"
    },
    {
      "text": "Fire Extinguisher Types",
      "url": "https://www.nfpa.org/news-blogs-and-articles/blogs/2023/08/01/fire-extinguisher-types",
      "domain": "nfpa.org",
      "type": "citation"
    },
    {
      "text": "Co2 Fire Suppression System",
      "url": "https://www.co2meter.com/blogs/news/co2-fire-suppression-system",
      "domain": "co2meter.com",
      "type": "citation"
    },
    {
      "text": "Are Fire Suppression Systems Harmful To Humans",
      "url": "https://resources.impactfireservices.com/are-fire-suppression-systems-harmful-to-humans",
      "domain": "resources.impactfireservices.com",
      "type": "citation"
    },
    {
      "text": "Co2 N2 Inerting Systems Robecco Inert",
      "url": "https://robecco.net/en/co2-n2-inerting-systems-robecco-inert/",
      "domain": "robecco.net",
      "type": "citation"
    },
    {
      "text": "591 Emergency Inerting Systems For Coal Grinding Applications",
      "url": "https://www.globalcement.com/magazine/articles/591-emergency-inerting-systems-for-coal-grinding-applications",
      "domain": "globalcement.com",
      "type": "citation"
    },
    {
      "text": "Inerting In The Chemical Industry A5 Booklet Tcm310 393623.pdf",
      "url": "https://static.prd.echannel.linde.com/wcsstore/PT_RES_Industrial_Gas_Store/Attachment/Inerting-in-the-chemical-industry-A5-booklet_tcm310-393623.pdf",
      "domain": "static.prd.echannel.linde.com",
      "type": "citation"
    },
    {
      "text": "353",
      "url": "https://www.mdpi.com/2571-6255/7/10/353",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Inertization.html",
      "url": "https://www.ssgaslab.com/application/inertization.html",
      "domain": "ssgaslab.com",
      "type": "citation"
    },
    {
      "text": "Co2 Carbon Dioxide Properties D 2017.html",
      "url": "https://www.engineeringtoolbox.com/CO2-carbon-dioxide-properties-d_2017.html",
      "domain": "engineeringtoolbox.com",
      "type": "citation"
    },
    {
      "text": "Pmc11171758",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11171758/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Introduction",
      "url": "https://www.superex.com.tr/en/supercritical-extraction/introduction/",
      "domain": "superex.com.tr",
      "type": "citation"
    },
    {
      "text": "Supercritical Co2 Extraction Cannabis Oil Guide",
      "url": "https://www.rootsciences.com/blog/supercritical-co2-extraction-cannabis-oil-guide/",
      "domain": "rootsciences.com",
      "type": "citation"
    },
    {
      "text": "Article.aspx",
      "url": "https://www.azom.com/article.aspx?ArticleID=20458",
      "domain": "azom.com",
      "type": "citation"
    },
    {
      "text": "Demystifying Co2 Refrigeration",
      "url": "https://hvacinsider.com/demystifying-co2-refrigeration/",
      "domain": "hvacinsider.com",
      "type": "citation"
    },
    {
      "text": "Commercial Co%25e2%2582%2582 Refrigeration Systems En Us 181472.pdf",
      "url": "https://www.emerson.com/documents/commercial-residential/commercial-co%25E2%2582%2582-refrigeration-systems-en-us-181472.pdf",
      "domain": "emerson.com",
      "type": "citation"
    },
    {
      "text": "Transcritical And Subcritical Co2 Systems Explained",
      "url": "https://www.scmfrigo.com/en/blog/transcritical-and-subcritical-co2-systems-explained/",
      "domain": "scmfrigo.com",
      "type": "citation"
    },
    {
      "text": "Co2 Eor Primer.pdf",
      "url": "https://www.netl.doe.gov/sites/default/files/netl-file/CO2_EOR_Primer.pdf",
      "domain": "netl.doe.gov",
      "type": "citation"
    },
    {
      "text": "Science.224.4649.563",
      "url": "https://www.science.org/doi/10.1126/science.224.4649.563",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S2212982023000902",
      "url": "https://www.sciencedirect.com/science/article/pii/S2212982023000902",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2024",
      "url": "https://acp.copernicus.org/articles/24/6375/2024/",
      "domain": "acp.copernicus.org",
      "type": "citation"
    },
    {
      "text": "2016gl071930",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2016GL071930",
      "domain": "agupubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Zhong Haigh 2013.pdf",
      "url": "https://courses.seas.harvard.edu/climate/eli/Courses/global-change-debates/Sources/CO2-saturation/more/Zhong-Haigh-2013.pdf",
      "domain": "courses.seas.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Nature14240",
      "url": "https://www.nature.com/articles/nature14240",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Empirical Evidence For Co2 Enhanced Greenhouse Effect.htm",
      "url": "https://skepticalscience.com/empirical-evidence-for-co2-enhanced-greenhouse-effect.htm",
      "domain": "skepticalscience.com",
      "type": "citation"
    },
    {
      "text": "2020gl091585",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2020GL091585",
      "domain": "agupubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "2016 04 Co2 Fertilization Greening Earth.html",
      "url": "https://phys.org/news/2016-04-co2-fertilization-greening-earth.html",
      "domain": "phys.org",
      "type": "citation"
    },
    {
      "text": "Zhu Greening Earth Ncc 2016.pdf",
      "url": "https://sites.bu.edu/cliveg/files/2016/04/zhu-greening-earth-ncc-2016.pdf",
      "domain": "sites.bu.edu",
      "type": "citation"
    },
    {
      "text": "1328357",
      "url": "https://www.osti.gov/servlets/purl/1328357",
      "domain": "osti.gov",
      "type": "citation"
    },
    {
      "text": "W29320.pdf",
      "url": "https://www.nber.org/system/files/working_papers/w29320/w29320.pdf",
      "domain": "nber.org",
      "type": "citation"
    },
    {
      "text": "Prior 11a.pdf",
      "url": "https://www.ars.usda.gov/ARSUserFiles/60100500/csr/ResearchPubs/prior/prior_11a.pdf",
      "domain": "ars.usda.gov",
      "type": "citation"
    },
    {
      "text": "0378377483900756",
      "url": "https://www.sciencedirect.com/science/article/pii/0378377483900756",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Wateruse.php",
      "url": "https://www.co2science.org/subject/w/summaries/wateruse.php",
      "domain": "co2science.org",
      "type": "citation"
    },
    {
      "text": "1365 2745.13988",
      "url": "https://besjournals.onlinelibrary.wiley.com/doi/abs/10.1111/1365-2745.13988",
      "domain": "besjournals.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc4217402",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4217402/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/marine-science/articles/10.3389/fmars.2021.642372/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Monitoring Ocean Carbon And Ocean Acidification",
      "url": "https://wmo.int/media/magazine-article/monitoring-ocean-carbon-and-ocean-acidification",
      "domain": "wmo.int",
      "type": "citation"
    },
    {
      "text": "Ocean Acidification Global Warming Intermediate.htm",
      "url": "https://skepticalscience.com/ocean-acidification-global-warming-intermediate.htm",
      "domain": "skepticalscience.com",
      "type": "citation"
    },
    {
      "text": "335763698 The Hoax Of Ocean Acidification",
      "url": "https://www.researchgate.net/publication/335763698_The_hoax_of_ocean_acidification",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Fa227",
      "url": "https://edis.ifas.ufl.edu/publication/FA227",
      "domain": "edis.ifas.ufl.edu",
      "type": "citation"
    },
    {
      "text": "2016",
      "url": "https://bg.copernicus.org/articles/13/5065/2016/",
      "domain": "bg.copernicus.org",
      "type": "citation"
    },
    {
      "text": "P2ch1.php",
      "url": "https://www.co2science.org/education/reports/corals/p2ch1.php",
      "domain": "co2science.org",
      "type": "citation"
    },
    {
      "text": "2013gb004679",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2013GB004679",
      "domain": "agupubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Quageo 2019 0029.pdf",
      "url": "https://qg.web.amu.edu.pl/qg/archives/2019/quageo-2019-0029.pdf",
      "domain": "qg.web.amu.edu.pl",
      "type": "citation"
    },
    {
      "text": "29539634",
      "url": "https://pubmed.ncbi.nlm.nih.gov/29539634/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Acidification Alarmists Forced To Fake Findings",
      "url": "https://rclutz.com/2024/09/08/acidification-alarmists-forced-to-fake-findings/",
      "domain": "rclutz.com",
      "type": "citation"
    },
    {
      "text": "Ocean%2bacidification%2527s%2bimpact%2bon%2boysters%2band%2bother%2bshellfish",
      "url": "https://www.pmel.noaa.gov/co2/story/Ocean%2BAcidification%2527s%2Bimpact%2Bon%2Boysters%2Band%2Bother%2Bshellfish",
      "domain": "pmel.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Grl.50449",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/grl.50449",
      "domain": "agupubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Two Views Of Ocean Acidification Which Is Fatally Flawed",
      "url": "https://news-oceanacidification-icc.org/2016/08/25/two-views-of-ocean-acidification-which-is-fatally-flawed/",
      "domain": "news-oceanacidification-icc.org",
      "type": "citation"
    },
    {
      "text": "Analysis Why Scientists Think 100 Of Global Warming Is Due To Humans",
      "url": "https://www.carbonbrief.org/analysis-why-scientists-think-100-of-global-warming-is-due-to-humans/",
      "domain": "carbonbrief.org",
      "type": "citation"
    },
    {
      "text": "Scc Grok 3 Review V5 1.pdf",
      "url": "https://scienceofclimatechange.org/wp-content/uploads/SCC-Grok-3-Review-V5-1.pdf",
      "domain": "scienceofclimatechange.org",
      "type": "citation"
    },
    {
      "text": "Climate Change Incoming Sunlight",
      "url": "https://www.climate.gov/news-features/understanding-climate/climate-change-incoming-sunlight",
      "domain": "climate.gov",
      "type": "citation"
    },
    {
      "text": "S1674987123001172",
      "url": "https://www.sciencedirect.com/science/article/pii/S1674987123001172",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "The Ipccs Attribution Methodology Is Fundamentally Flawed",
      "url": "https://judithcurry.com/2021/08/18/the-ipccs-attribution-methodology-is-fundamentally-flawed/",
      "domain": "judithcurry.com",
      "type": "citation"
    },
    {
      "text": "Doe Critical Review Of Impacts Of Ghg Emissions On The Us Climate July 2025.pdf",
      "url": "https://www.energy.gov/sites/default/files/2025-07/DOE_Critical_Review_of_Impacts_of_GHG_Emissions_on_the_US_Climate_July_2025.pdf",
      "domain": "energy.gov",
      "type": "citation"
    },
    {
      "text": "Flawed Climate Models",
      "url": "https://www.hoover.org/research/flawed-climate-models",
      "domain": "hoover.org",
      "type": "citation"
    },
    {
      "text": "7e90482a76c15a7b2d2473e6edc911c0.refuting 12 Claims Made By Climate Alarmists.pdf",
      "url": "https://www.epw.senate.gov/public/_cache/files/4/a/4a86454f-4287-4d1c-ae5f-85a01b8c78b8/7E90482A76C15A7B2D2473E6EDC911C0.refuting-12-claims-made-by-climate-alarmists.pdf",
      "domain": "epw.senate.gov",
      "type": "citation"
    },
    {
      "text": "3 Apocalyptic Climate Change Predictions That Failed To Come True",
      "url": "https://reason.com/2025/04/16/3-apocalyptic-climate-change-predictions-that-failed-to-come-true/",
      "domain": "reason.com",
      "type": "citation"
    },
    {
      "text": "Ajplung.00020.2014",
      "url": "https://journals.physiology.org/doi/10.1152/ajplung.00020.2014",
      "domain": "journals.physiology.org",
      "type": "citation"
    },
    {
      "text": "Joseph Black",
      "url": "https://www.lindahall.org/about/news/scientist-of-the-day/joseph-black/",
      "domain": "lindahall.org",
      "type": "citation"
    },
    {
      "text": "Josephblack",
      "url": "https://www.gla.ac.uk/schools/chemistry/abouttheschool/history/josephblack/",
      "domain": "gla.ac.uk",
      "type": "citation"
    },
    {
      "text": "Ajplung.00067.2014",
      "url": "https://journals.physiology.org/doi/10.1152/ajplung.00067.2014",
      "domain": "journals.physiology.org",
      "type": "citation"
    },
    {
      "text": "Josephpriestleyoxygen.html",
      "url": "https://www.acs.org/education/whatischemistry/landmarks/josephpriestleyoxygen.html",
      "domain": "acs.org",
      "type": "citation"
    },
    {
      "text": "Pmc4360083",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4360083/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Lavoisiers Legacy.html",
      "url": "https://cen.acs.org/articles/83/i38/Lavoisiers-Legacy.html",
      "domain": "cen.acs.org",
      "type": "citation"
    },
    {
      "text": "398202252",
      "url": "https://academic.oup.com/book/45740/chapter/398202252",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide Atmosphere Eunice Foote",
      "url": "https://www.aps.org/apsnews/2023/07/carbon-dioxide-atmosphere-eunice-foote",
      "domain": "aps.org",
      "type": "citation"
    },
    {
      "text": "Co2.htm",
      "url": "https://history.aip.org/climate/co2.htm",
      "domain": "history.aip.org",
      "type": "citation"
    },
    {
      "text": "Cssc.200900169",
      "url": "https://chemistry-europe.onlinelibrary.wiley.com/doi/10.1002/cssc.200900169",
      "domain": "chemistry-europe.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "S0140700705001660",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0140700705001660",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Arrhenius",
      "url": "https://earthobservatory.nasa.gov/features/Arrhenius",
      "domain": "earthobservatory.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Qj.49706427503",
      "url": "https://rmets.onlinelibrary.wiley.com/doi/abs/10.1002/qj.49706427503",
      "domain": "rmets.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "A Brief History Of Carbon Dioxide Measurements",
      "url": "https://airs.jpl.nasa.gov/news/111/a-brief-history-of-carbon-dioxide-measurements/",
      "domain": "airs.jpl.nasa.gov",
      "type": "citation"
    },
    {
      "text": "The History Of Co2 From Industrial Waste To Valuable Resource",
      "url": "https://www.ascoco2.com/en/about-us/asco-blog/the-history-of-co2-from-industrial-waste-to-valuable-resource",
      "domain": "ascoco2.com",
      "type": "citation"
    },
    {
      "text": "Carbon Dioxide",
      "url": "https://science.nasa.gov/earth/explore/earth-indicators/carbon-dioxide/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "2500100 Co2 Levels In Earths Atmosphere Jumped By A Record Amount In 2024",
      "url": "https://www.newscientist.com/article/2500100-co2-levels-in-earths-atmosphere-jumped-by-a-record-amount-in-2024/",
      "domain": "newscientist.com",
      "type": "citation"
    },
    {
      "text": "Global.html",
      "url": "https://gml.noaa.gov/ccgg/trends/global.html",
      "domain": "gml.noaa.gov",
      "type": "citation"
    },
    {
      "text": "The Paris Agreement",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Paris Global Climate Change Agreements",
      "url": "https://www.cfr.org/backgrounder/paris-global-climate-change-agreements",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "The True Cost Of Reducing Greenhouse Gas Emissions Gillingham",
      "url": "https://www.imf.org/en/Publications/fandd/issues/2019/12/the-true-cost-of-reducing-greenhouse-gas-emissions-gillingham",
      "domain": "imf.org",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "Henry Cavendish",
      "page": "Henry_Cavendish"
    },
    {
      "text": "Cavendish",
      "page": "Cavendish"
    },
    {
      "text": "hydrogen",
      "page": "Hydrogen"
    },
    {
      "text": "Joseph Priestley",
      "page": "Joseph_Priestley"
    },
    {
      "text": "Svante Arrhenius",
      "page": "Svante_Arrhenius"
    },
    {
      "text": "industrial",
      "page": "Industrial"
    },
    {
      "text": "1938",
      "page": "1938"
    },
    {
      "text": "British",
      "page": "British"
    },
    {
      "text": "engineer",
      "page": "Engineer"
    },
    {
      "text": "Guy Stewart Callendar",
      "page": "Guy_Stewart_Callendar"
    },
    {
      "text": "data",
      "page": "Data"
    },
    {
      "text": "global",
      "page": "Global"
    },
    {
      "text": "weather",
      "page": "Weather"
    },
    {
      "text": "decade",
      "page": "Decade"
    },
    {
      "text": "19th century",
      "page": "19th_century"
    },
    {
      "text": "anthropogenic",
      "page": "Anthropogenic"
    },
    {
      "text": "burning",
      "page": "The_Burning"
    },
    {
      "text": "future",
      "page": "Future"
    },
    {
      "text": "Mauna Loa Observatory",
      "page": "Mauna_Loa_Observatory"
    },
    {
      "text": "Hawaii",
      "page": "Hawaii"
    },
    {
      "text": "Keeling Curve",
      "page": "Keeling_Curve"
    }
  ],
  "fetched_at": "2025-12-07T07:23:27.015461",
  "elapsed_ms": 559953
}