{
  "topic": "Dallas Cowboys",
  "title": "Dallas Cowboys",
  "slug": "dallas-cowboys",
  "grokipedia_slug": "Dallas_Cowboys",
  "grokipedia_url": "https://grokipedia.com/page/Dallas_Cowboys",
  "source": "grokipedia",
  "content": "# Dallas Cowboys\n\nThe Dallas Cowboys are a professional American football team based in the Dallas–Fort Worth metroplex in Texas, competing in the National Football League (NFL) as a member of the National Football Conference (NFC) East division. Founded on January 28, 1960, as an expansion franchise by original owner Clint Murchison Jr. for $600,000, the team initially played home games at the Cotton Bowl before moving to Texas Stadium in 1971 and AT\\u0026T Stadium in Arlington since 2009. Dubbed **\"America's Team\"** for their widespread popularity and extensive media coverage, the Cowboys are the world's most valuable sports franchise (and thus the NFL's most valuable), valued at $13 billion in 2025.\n\nUnder founding head coach Tom Landry, who led the team from 1960 to 1988 and compiled a 250-162-6 record, the Cowboys achieved their first winning season in 1966 and established a dynasty in the 1970s, winning Super Bowls VI (1971) and XII (1977). The franchise holds the NFL record for the most consecutive winning seasons at 20, from 1966 to 1985, during which they made 18 playoff appearances. Ownership transitioned in 1989 when Jerry Jones purchased the team for $140 million and fired Landry, later hiring Jimmy Johnson as coach; this era produced three more Super Bowl victories—XXVII (1992), XXVIII (1993), and XXX (1995)—tying the Cowboys with five total championships, second only to the New England Patriots' six.\n\nAs of November 19, 2025, during their 66th season, the Cowboys have an all-time regular-season record of 573-428-7, 36 playoff appearances, and a postseason record of 36-31, including 25 division titles. Notable figures include Hall of Famers like quarterback Roger Staubach and running back Emmitt Smith (NFL's all-time leading rusher with 18,355 career yards), alongside other notable players such as defensive end Ed \"Too Tall\" Jones and modern stars such as quarterback Dak Prescott. The team plays at the 80,000-seat AT\\u0026T Stadium, known for its retractable roof and the world's largest video board, and maintains a global fanbase bolstered by high television ratings and merchandising revenue exceeding $1.2 billion annually. Despite recent playoff struggles, including no Super Bowl appearance since 1995, the Cowboys remain a cornerstone of NFL culture, with Jones serving as owner, general manager, and president, and currently coached by Brian Schottenheimer since 2025.\n## History\n\n### Origins\n\nThe Dallas Cowboys were established as an expansion franchise in the National Football League (NFL) on January 28, 1960, when the league's owners unanimously approved the addition of a team in Dallas, Texas. The franchise was spearheaded by Texas oilman Clint Murchison Jr., who paid $600,000 to secure the rights, marking the NFL's first successful expansion since the collapse of the All-America Football Conference a decade earlier. This move was partly motivated by competition from the newly formed American Football League (AFL), which had announced the Dallas Texans (later the Kansas City Chiefs) just weeks prior, prompting the NFL to accelerate its southward expansion to protect its market share.\n\nMurchison's bid faced initial resistance, particularly from Washington Redskins owner George Preston Marshall, whose vote was crucial for approval. To win Marshall's support, Murchison relinquished the rights to the Redskins' fight song, \"Hail to the Redskins,\" which his family had controlled through a publishing company. The franchise was formally announced in October 1959, with Murchison assembling a front office that included Tex Schramm as general manager and vice president, hired at an annual salary of $36,500 plus stock options, and Gil Brandt as director of player personnel, recruited from a baby photography business. Tom Landry was appointed as the first head coach on December 28, 1959, signing a three-year contract for $34,500 per year, bringing his experience as a defensive coordinator with the New York Giants.\n\nOriginally named the Dallas Rangers, the team changed its moniker to the Cowboys in mid-March 1960 to avoid confusion with the local minor league baseball team of the same name. The roster was built through the NFL's expansion draft on March 13, 1960, where each of the league's 12 existing teams protected 25 players, leaving 36 available for selection by the new franchise. Notable early signings included quarterback Don Meredith via a personal services contract before the college draft. The Cowboys played their inaugural season at the Cotton Bowl, finishing with a 0-11-1 record amid challenges from entrenched college football popularity in Texas and a roster of journeyman players. Despite the struggles, the foundational hires of Schramm, Landry, and Brandt laid the groundwork for future success, establishing a professional scouting and management system that became a model for the league.\n\n### Tom Landry era (1960–1988)\n\nTom Landry served as the first head coach of the Dallas Cowboys from the franchise's inception in 1960 until 1988, compiling a regular-season record of 250 wins, 162 losses, and 6 ties over 29 seasons. Under his leadership, the Cowboys transformed from an expansion team into one of the NFL's premier franchises, earning the nickname \"America's Team\" for their widespread popularity and on-field success. Landry, who also coordinated both offensive and defensive schemes, emphasized discipline, innovation, and a professional approach, often using early computer analytics to scout opponents.\n\nThe early years were marked by struggles, with the Cowboys posting a 0-11-1 record in their debut 1960 season and enduring five straight losing campaigns through 1964. Landry's persistence paid off in 1966, when the team achieved its first winning record (10-3-1) and captured the NFL Eastern Conference title, launching an NFL-record streak of 20 consecutive winning seasons that lasted until 1985. During this period, the Cowboys made 18 playoff appearances, secured 13 division titles, and won five NFC championships in 1970, 1971, 1975, 1977, and 1978. Landry's playoff record stood at 20 wins and 16 losses, ranking third all-time at the time of his departure.\n\nLandry's tactical innovations revolutionized the game, particularly on defense. He pioneered the 4-3 alignment as a defensive coordinator with the New York Giants in the 1950s and refined it with the Cowboys, evolving it into the \"Flex\" defense in the 1970s to counter power-running schemes like Vince Lombardi's. This scheme featured a flexible linebacker who could shift to stop runs or cover passes, forming the backbone of the \"Doomsday Defense\" that held opponents to an average of 16.5 points per game during the 1970s. Offensively, Landry reintroduced the shotgun formation in 1975 to aid quarterback Roger Staubach against aggressive blitzes, spreading the field and enhancing passing efficiency; this setup became a staple in modern NFL offenses. He also implemented \"multiple\" offensive packages and situation-specific substitutions, adapting to game flow in the 1980s.\n\nThe pinnacle of the Landry era came in the 1970s, with the Cowboys reaching five Super Bowls. They lost Super Bowl V to the Baltimore Colts 16-13 in 1971 but rebounded to win Super Bowl VI over the Miami Dolphins 24-3 later that year, behind Staubach's MVP performance and a stifling defense led by Bob Lilly. Following losses in Super Bowl X (21-17 to Pittsburgh) and Super Bowl XIII (35-31 to Pittsburgh), Dallas claimed its second title in Super Bowl XII, defeating the Denver Broncos 27-10 in 1978 with Randy White and Harvey Martin sharing MVP honors for their defensive dominance. These victories cemented the Cowboys' status as a dynasty, with Landry's teams averaging over 10 wins per season from 1966 to 1979.\n\nIn the 1980s, the Cowboys remained competitive, winning division titles in 1981 and 1985 and reaching the NFC Championship Game in 1981 and 1982, but aging rosters and injuries led to a decline, culminating in a 3-13 finish in 1988. Landry was fired by new owner Jerry Jones that offseason, ending his tenure with an overall record of 270-178-6 including playoffs—the fifth-most wins in NFL history at the time. His emphasis on preparation and adaptability left a lasting impact, influencing generations of coaches and establishing the Cowboys as a model franchise.\n\n### Jimmy Johnson era (1989–1993)\n\nJimmy Johnson was hired as head coach of the Dallas Cowboys on February 26, 1989, by new owner Jerry Jones, a longtime friend and former college teammate at the University of Arkansas, shortly after Jones purchased the franchise for $140 million and fired longtime coach Tom Landry. Johnson, who had recently led the University of Miami to a national championship in 1987, signed a 10-year contract on April 6, 1989, and immediately focused on rebuilding a team that had gone 3-13 in 1988. His first season in 1989 was dismal, finishing 1-15 with the league's worst record, but it laid the groundwork for aggressive roster changes.\n\nA pivotal move came on October 12, 1989, when Johnson orchestrated the Herschel Walker trade, sending the star running back to the Minnesota Vikings in exchange for five players—linebackers Jesse Solomon and David Howard, defensive end Alex Stewart, running back Darrin Nelson, and cornerback Issiac Holt—along with Minnesota's first-, second-, and sixth-round picks in the 1990 NFL Draft and additional conditional picks. These assets fueled the Cowboys' resurgence; the 1990 first-round pick became running back Emmitt Smith (17th overall), who earned Offensive Rookie of the Year honors with 1,373 rushing yards, while later picks from the trade netted defensive tackle Russell Maryland (first round, 1991) and safety Darren Woodson (second round, 1992). Johnson's 1989 draft also stocked the roster with franchise cornerstones, including quarterback Troy Aikman (first overall), fullback Daryl \"Moose\" Johnston (second round), center Mark Stepnoski (third round), and defensive end Tony Tolbert (fourth round). The 1991 draft added further depth with Maryland, wide receiver Alvin Harper (first round, 12th overall), and offensive tackle Erik Williams (fourth round), who became a five-time Pro Bowler.\n\nUnder Johnson, the Cowboys improved to 7-9 in 1990 before breaking through in 1991 with an 11-5 record, winning the NFC East and reaching the NFC Championship Game, where they lost to the Detroit Lions 38-6. The 1992 season marked the pinnacle, as Dallas posted a franchise-record 13-3 mark, dominated the playoffs with wins over the Philadelphia Eagles (34-0), Green Bay Packers (27-17), and San Francisco 49ers (30-20) in the NFC Championship, then routed the Buffalo Bills 52-17 in Super Bowl XXVII on January 31, 1993, at the Rose Bowl in Pasadena, California. Emmitt Smith was named Super Bowl MVP after rushing for 108 yards and a touchdown. In 1993, the team went 12-4, again claiming the NFC East, and advanced through the postseason by defeating the Green Bay Packers (27-17), San Francisco 49ers (38-21), and Buffalo Bills 30-13 in Super Bowl XXVIII on January 30, 1994, at the Georgia Dome in Atlanta, securing back-to-back championships—the first such feat since the 1970s Pittsburgh Steelers. This victory tied the Cowboys with the Steelers and San Francisco 49ers for the most Super Bowl wins at the time (four).\n\nJohnson's tenure ended acrimoniously on March 29, 1994, when he and Jones mutually agreed to part ways amid growing tensions over personnel control, despite the Cowboys' 44-36 regular-season record (7-1 postseason) and two Lombardi Trophies in five years. His innovative draft strategies and trade acumen transformed a moribund franchise into a dynasty, earning him induction into the Pro Football Hall of Fame in 2020 and the Cowboys Ring of Honor in 2023.\n\n### Barry Switzer era (1994–1997)\n\nBarry Switzer, a former University of Oklahoma head coach who led the Sooners to three national championships between 1974 and 1985, was hired by Dallas Cowboys owner Jerry Jones on March 30, 1994, as the team's third head coach in five years. Jones, who had played offensive tackle under Switzer at the University of Arkansas in 1964, selected him a day after Jimmy Johnson's resignation, citing Switzer's leadership, charisma, and proven winning record as key factors. Switzer inherited a talented roster built by Johnson, including quarterback Troy Aikman, running back Emmitt Smith, and wide receiver Michael Irvin, but adopted a more relaxed, player-friendly coaching style compared to his predecessor's intense regimen.\n\nIn Switzer's debut season of 1994, the Cowboys achieved a 12–4 regular-season record, securing the NFC East title for the third consecutive year. The team started strong with a 10-game winning streak before losses to the Atlanta Falcons and Detroit Lions, but clinched the division with a 20–17 victory over the New York Giants in Week 16. In the playoffs, Dallas defeated the Green Bay Packers 35–9 in the divisional round, but fell to the San Francisco 49ers 38–28 in the NFC Championship Game, ending their bid for a third straight Super Bowl appearance. Key contributors included Smith, who rushed for 1,484 yards and 21 touchdowns, earning NFL MVP honors.\n\nThe 1995 season saw the Cowboys repeat as NFC East champions with another 12–4 mark, powered by a dominant offense that ranked second in the NFL in points scored (42.7 per game). Emmitt Smith broke the single-season rushing touchdown record with 25, while the defense, led by Charles Haley and Deion Sanders, forced 34 turnovers. Dallas advanced through the playoffs undefeated, beating the Philadelphia Eagles 30–11 in the divisional round, the Green Bay Packers 38–27 in the NFC Championship, and capping the run with a 27–17 victory over the Pittsburgh Steelers in Super Bowl XXX on January 28, 1996, at Sun Devil Stadium in Tempe, Arizona. Linebacker Larry Brown earned MVP honors with two interceptions, including one returned 35 yards for a touchdown; the win marked the Cowboys' fifth Super Bowl title and made Switzer the second coach, after Barry Sanders' predecessor at Oklahoma, to claim both a college national championship and an NFL Super Bowl.\n\nIn 1996, injuries began to affect the roster, but the Cowboys still posted a 10–6 record and won the NFC East for the fourth straight year. They routed the Minnesota Vikings 40–15 in the wild-card round before losing 26–17 to the Carolina Panthers in the divisional playoffs, hampered by Aikman's season-ending back injury and a defense that allowed 20.4 points per game. Michael Irvin led the receiving corps with 1,102 yards, but the team's reliance on backup quarterback Jason Garrett exposed vulnerabilities.\n\nThe 1997 season marked a sharp decline, with the Cowboys finishing 6–10 and missing the playoffs for the first time since 1990, placing fourth in the NFC East. Persistent injuries to stars like Aikman (who missed 11 games with a fractured clavicle) and Smith, combined with offensive struggles (22nd in scoring at 19.0 points per game), led to a frustrating campaign. Switzer's tenure was further complicated by off-field issues, including his August 4 arrest at Dallas-Fort Worth International Airport for carrying a loaded unlicensed .38-caliber revolver in his carry-on luggage, which he claimed was to protect it from his grandchildren; he pleaded guilty to a misdemeanor charge in December, receiving a $3,500 fine and deferred adjudication. Jones fined Switzer $75,000 for the incident, and amid mounting pressure from the team's poor performance and internal tensions, Switzer resigned on January 9, 1998, ending his Cowboys career with a 40–24 regular-season record and a 5–2 playoff mark.\n\n### Post-dynasty struggles (1998–2006)\n\nFollowing the three Super Bowl victories of the early 1990s, the Dallas Cowboys entered a prolonged period of mediocrity and inconsistency from 1998 to 2006, characterized by coaching turnover, the departure of franchise icons, and an inability to advance beyond the wild-card round in the playoffs. The team's offensive firepower diminished as Hall of Famers Michael Irvin retired after the 1999 season due to neck injuries sustained over his career, while quarterback Troy Aikman stepped away after the 2000 campaign, citing chronic back problems that limited him to just three starts that year. Running back Emmitt Smith, the NFL's all-time leading rusher at the time, continued with Dallas through 2002 before signing with the Arizona Cardinals in free agency, leaving a void in the backfield. These losses, combined with defensive lapses and quarterback instability, contributed to the Cowboys' struggles to recapture their dynasty-era dominance.\n\nChan Gailey was hired as head coach in 1998, bringing an offensive-minded approach that initially stabilized the team. In his first season, the Cowboys finished 10-6, clinched the NFC East title for the first time since 1995, and earned a home wild-card playoff game, though they fell 20-7 to the Arizona Cardinals amid turnovers and defensive breakdowns. The following year, Dallas regressed to 8-8, securing another wild-card spot but suffering a 27-10 loss to the Minnesota Vikings, where the Vikings' high-powered offense overwhelmed the Cowboys' secondary. Gailey's tenure ended after the season, as owner Jerry Jones sought a new direction; the team ranked mid-pack in scoring during both years but struggled with consistency in the run game and pass protection.\n\nWith Gailey's dismissal, defensive coordinator Dave Campo was promoted to head coach in 2000, a move that signaled a shift toward defensive emphasis but ultimately proved disastrous. The Cowboys posted identical 5-11 records over Campo's three seasons, finishing last or near the bottom of the NFC East each year and missing the playoffs entirely. Offensive production plummeted, with the team averaging fewer than 20 points per game in 2002—their lowest since 1980—and ranking among the league's worst in total yards. Quarterback woes exacerbated the issues, as Aikman's successors, including Jason Garrett and rookie Quincy Carter, failed to provide steady leadership; the 2002 squad set a franchise low with 217 points scored. Campo was fired after the 2002 season, capping a dismal stretch that saw Dallas go 15-33 under his watch and endure fan frustration amid a perception of mismanagement in player acquisitions.\n\nHoping to revive the franchise, Jones hired legendary coach Bill Parcells in 2003, who brought a no-nonsense culture and emphasis on discipline. Parcells guided the Cowboys to a 10-6 record that year, earning a wild-card berth despite a porous defense that allowed 405 points the prior season; however, they lost 29-10 at home to the Carolina Panthers in the playoffs, hampered by injuries to key defenders. The 2004 season brought regression to 6-10, marred by a league-worst 28.4 points allowed per game and further quarterback experimentation with Vinny Testaverde and Drew Henson. Dallas rebounded to 9-7 in 2005, showing improvement in the run defense, but missed the playoffs due to tiebreakers with the New York Giants and Philadelphia Eagles. In 2006, another 9-7 finish secured a wild-card spot, powered by a resurgent offense led by rookie quarterback Tony Romo, who took over midseason after an injury to Drew Bledsoe; yet, the team fell 21-20 to the Seattle Seahawks in Seattle, undone by a late interception. Parcells' era yielded 34 wins in four years but no divisional round appearances, highlighting persistent issues with depth and clutch performance.\n\n| Season | Record | NFC East Finish | Playoff Result | Head Coach | Notes |\n|--------|--------|-----------------|---------------|------------|-------|\n| 1998  | 10-6  | 1st            | Lost WC (20-7 vs. Arizona) | Chan Gailey | Division champions; Troy Aikman threw for 2,773 yards |\n| 1999  | 8-8   | 2nd            | Lost WC (27-10 vs. Minnesota) | Chan Gailey | Michael Irvin's final season (33 receptions) |\n| 2000  | 5-11  | 4th            | None         | Dave Campo | Aikman's retirement; offense ranked 28th in points |\n| 2001  | 5-11  | 5th            | None         | Dave Campo | Emmitt Smith rushed for 1,021 yards |\n| 2002  | 5-11  | 4th            | None         | Dave Campo | Franchise-low 217 points scored; Smith's last year in Dallas |\n| 2003  | 10-6  | 2nd            | Lost WC (29-10 vs. Carolina) | Bill Parcells | Parcells' debut; Quincy Carter started 15 games |\n| 2004  | 6-10  | 3rd            | None         | Bill Parcells | Defense allowed NFL-high 405 points |\n| 2005  | 9-7   | 3rd            | None         | Bill Parcells | Missed playoffs on tiebreakers; Terrell Owens joined via trade |\n| 2006  | 9-7   | 2nd            | Lost WC (21-20 vs. Seattle) | Bill Parcells | Tony Romo debuted as starter; led NFL in total offense (397.8 ypg) |\n\nOverall, the 1998–2006 stretch saw the Cowboys compile a 67-61 regular-season record (.523 winning percentage) but go 0-5 in playoff games, underscoring a failure to translate regular-season competence into postseason success. Draft classes yielded talents like safety Roy Williams (2002) and tackle Flozell Adams (1998), but the team often prioritized high-profile free agents over sustainable building, contributing to the era's frustrations. This period, often dubbed the Cowboys' \"lost years,\" tested Jones' dual role as owner and executive, setting the stage for further changes in the late 2000s.\n\n### Wade Phillips and Jason Garrett eras (2007–2019)\n\nThe Wade Phillips era began in 2007 when Phillips, a veteran defensive coordinator, was promoted to head coach following Bill Parcells' resignation, bringing his emphasis on aggressive 3-4 defenses to a talented Cowboys roster. In his first season, the team achieved a franchise-best 13-3 regular-season record, clinching the NFC East with a dramatic 28-27 win over the Detroit Lions in Week 14, led by quarterback Tony Romo, running back Marion Barber III, and wide receiver Terrell Owens. However, the season ended in disappointment with a 21-17 upset loss to the New York Giants in the NFC Divisional Round, despite Dallas holding home-field advantage throughout the playoffs.\n\nThe 2008 campaign saw regression, as the Cowboys finished 9-7 and missed the playoffs amid a late-season collapse, including a 44-6 rout by the Philadelphia Eagles in the finale that eliminated them from contention. Phillips' defenses remained strong, ranking among the league's top units with stars like linebacker DeMarcus Ware (who led the NFL with 20 sacks) and nose tackle Jay Ratliff, but offensive inconsistencies and injuries hampered progress. Rebounding in 2009, Dallas posted an 11-5 record to win the NFC East again, highlighted by a 24-17 upset over the undefeated New Orleans Saints and a 24-0 shutout of Philadelphia. They advanced with a 34-14 wild-card victory over the Eagles—the franchise's first playoff win since 1996—but fell 34-3 to the Minnesota Vikings in the Divisional Round.\n\nPhillips' tenure unraveled in 2010 amid a 1-7 start, marked by a humiliating 45-7 home loss to the Green Bay Packers and Romo's fractured clavicle in a 41-35 defeat to the Giants. He was fired on November 8, 2010, after compiling a 34-22 regular-season record but only 1-2 in the playoffs, leaving the team with a defense that ranked first in points allowed in 2009 but unable to overcome offensive woes and coaching scrutiny. Offensive coordinator Jason Garrett, who had stabilized the team with a 5-3 finish as interim coach after Phillips' dismissal, was promoted to head coach on January 6, 2011, ushering in an era of continuity and player development.\n\nGarrett's nine seasons emphasized discipline, quarterback development, and building through the draft, with tight end Jason Witten serving as a consistent leader across both eras. The 2011 and 2012 seasons ended at 8-8, plagued by late collapses, including NFC East title losses in Week 17 to the Giants and Redskins, respectively, despite strong performances from Romo and emerging wide receiver Dez Bryant. In 2013, another 8-8 finish highlighted defensive improvements under coordinator Monte Kiffin but was undermined by Romo's back injury in the season finale against Washington. Garrett prioritized the offensive line, drafting All-Pro tackles Tyron Smith (2011) and La'el Collins (undrafted 2015) alongside guard Zack Martin (2014), creating one of the NFL's best units that supported running back DeMarco Murray's 1,845-yard rushing title in 2014.\n\nThe 2014 season marked a high point with a 12-4 record and NFC East crown, driven by Murray, Romo, and Bryant, though a 26-21 Divisional Round loss to Green Bay ended the run. A injury-riddled 2015 led to a 4-12 drop, prompting Garrett to hire defensive coordinator Rod Marinelli for a scheme overhaul. Recovery came in 2016 with rookies Dak Prescott at quarterback and Ezekiel Elliott at running back leading a 13-3 campaign and NFC East title, featuring linebacker Sean Lee's defensive leadership; however, a 36-31 upset by the Packers in the Divisional Round followed. The 2017 and 2019 seasons both finished 9-7 and 8-8, respectively, missing playoffs due to Week 17 losses, while 2018's 10-6 division-winning year ended with a 30-22 Divisional defeat to the Los Angeles Rams.\n\nOver his tenure, Garrett compiled an 85-67 regular-season record with three division titles but no conference championship appearances, often criticized for clock management and conservative play-calling despite fostering a culture of resilience. The era saw the Cowboys transition from Romo's veteran precision to Prescott's dual-threat potential, amassing 10 winning seasons but struggling in high-stakes moments, culminating in Garrett's departure after the 2019 season.\n\n### Mike McCarthy era (2020–2024)\n\nMike McCarthy was hired as the ninth head coach in Dallas Cowboys history on January 7, 2020, signing a five-year contract after a 13-year tenure with the Green Bay Packers that included a Super Bowl victory. The Cowboys, coming off a 8-8 season under Jason Garrett, sought McCarthy's offensive expertise to elevate quarterback Dak Prescott and the roster. McCarthy retained offensive coordinator Kellen Moore initially and hired Mike Nolan as defensive coordinator, aiming to install a balanced scheme emphasizing run-pass balance and play-action.\n\nThe 2020 season proved challenging, finishing with a 6-10 record amid the COVID-19 pandemic's disruptions, including delayed preparations and limited fan attendance. Prescott suffered a season-ending ankle fracture in Week 5 against the New York Giants, forcing backups Andy Dalton and Ben DiNucci into action, which contributed to a midseason skid. Despite the struggles, McCarthy's arrival fostered a renewed team culture, with the Cowboys showing resilience in close games but missing the playoffs for the first time since 2015.\n\nMcCarthy's tenure peaked from 2021 to 2023, marked by three consecutive 12-5 seasons and NFC East titles in 2021 and 2023—the first repeat division wins in the NFC East since 2004. In 2021, the Cowboys earned the No. 3 seed, leading the NFL in scoring at 31.2 points per game, driven by Prescott's return and a potent passing attack featuring wide receiver CeeDee Lamb's emergence. Their playoff run ended in a 23-17 wild-card loss to the San Francisco 49ers, hampered by defensive lapses. The 2022 campaign saw another 12-5 mark and the No. 2 seed, with a dominant 31-14 wild-card victory over the Tampa Bay Buccaneers—Dallas's first road playoff win since 1992—before a 19-12 divisional defeat to the 49ers, where offensive execution faltered in the second half.\n\nThe 2023 season replicated the 12-5 record and No. 2 seed, with the defense, led by Defensive Rookie of the Year Micah Parsons, ranking first in points allowed at 18.5 per game. McCarthy assumed play-calling duties after firing Moore post-2022, implementing a more aggressive scheme that propelled the offense to No. 2 in total yards. However, the playoffs brought disappointment with a stunning 48-32 wild-card home loss to McCarthy's former team, the Green Bay Packers, exposing vulnerabilities in run defense and late-game management.\n\nThe 2024 season marked a sharp decline, ending at 7-10 and out of the playoffs for the first time since 2020, plagued by injuries to key players like Parsons and edge rusher DeMarcus Lawrence. The offense, once elite, dropped to 20th in scoring amid Prescott's hamstring injury that sidelined him for 11 games, with backup Cooper Rush unable to sustain momentum. A five-game losing streak midseason highlighted execution issues, though the team showed fight in late wins against division rivals.\n\nOver five seasons, McCarthy compiled a 49-35 regular-season record (.583 winning percentage), the highest among Cowboys coaches with at least 50 games since Tom Landry, along with two division titles and three playoff berths but only one postseason victory (1-3 overall). His era revitalized the Cowboys' offense, developing stars like Lamb (three Pro Bowls) and Parsons (three Pro Bowls, 2021 Defensive Rookie of the Year), but postseason shortcomings—averaging just 20 points in losses—drew criticism for failing to advance beyond the divisional round. McCarthy's emphasis on culture and player development laid groundwork for contention, though the lack of deep playoff success defined the period's legacy.\n### Brian Schottenheimer era (2025–present)\n\nBrian Schottenheimer was hired as the 10th head coach in Dallas Cowboys franchise history on January 24, 2025, succeeding Mike McCarthy following the team's disappointing 2024 campaign. Prior to the promotion, Schottenheimer had served as the Cowboys' offensive coordinator for two seasons, where he implemented a balanced scheme that emphasized play-action passes and a strong rushing attack led by running back Ezekiel Elliott. The hiring, which came after a limited search interviewing only four candidates, drew mixed reactions due to Schottenheimer's lack of prior head coaching experience at the professional level, though his pedigree as the son of legendary NFL coach Marty Schottenheimer and his tenure with teams like the New York Jets and Seattle Seahawks factored into owner Jerry Jones's decision.\n\nA significant pre-season roster change occurred on August 28, 2025, when the Cowboys traded star edge rusher Micah Parsons to the Green Bay Packers in exchange for two first-round draft picks (2026 and 2027) and a veteran defensive tackle, amid a contract dispute. This move severely impacted the defense, contributing to early-season struggles.\n\nSchottenheimer quickly assembled a staff blending veteran coordinators with young position coaches, including defensive coordinator Matt Eberflus, to address defensive shortcomings from the previous year. Entering his first training camp in July 2025, he emphasized discipline and consistency, drawing on lessons from his father's successful tenures with the Cleveland Browns and Kansas City Chiefs. The preseason saw promising offensive performances, with quarterback Dak Prescott throwing for over 300 yards in two of three exhibition games, but early regular-season signs pointed to ongoing challenges in protecting leads and avoiding penalties.\n\nThe 2025 season has been marked by offensive firepower tempered by defensive lapses and disciplinary issues, leaving the Cowboys with a 4-5-1 record through ten games as of November 19, placing them second in the NFC East. The offense ranks second league-wide in scoring at 29.6 points per game, driven by Prescott's efficient passing (over 2,200 yards and 18 touchdowns) and a resurgent ground game averaging 140 rushing yards per contest. However, the defense has struggled significantly, allowing 29.3 points per game and ranking 31st, exacerbated by the loss of Parsons and other injuries. Criticism has mounted toward defensive coordinator Eberflus, though no changes have been made to the staff.\n\nKey highlights include a 44-22 road victory over the Washington Commanders in Week 7, where the Cowboys' offense exploded for 512 total yards, showcasing Schottenheimer's play-calling in a balanced attack that featured three rushing touchdowns from Elliott. Conversely, a 44-24 loss to the Denver Broncos in Week 8 exposed vulnerabilities, with 12 penalties for 105 yards contributing to an early deficit that the team could not overcome. The most recent setback before the bye was a 27-17 defeat to the Arizona Cardinals in Week 9 on November 3, where turnovers and poor third-down efficiency (3-of-12) stalled drives despite a strong start. Following the Week 10 bye, the Cowboys honored late defensive end Marshawn Kneeland, who died on November 6, 2025, from an apparent suicide, with a tribute during their 33-16 win over the Las Vegas Raiders on November 17.\n\nAmid the inconsistencies, Schottenheimer has faced scrutiny for the team's inability to close out close games, including a 20-20 tie against the New York Giants in Week 4 that highlighted special teams miscues. Schottenheimer has publicly stressed accountability, noting post-bye week preparations could see returns of injured stars like wide receiver CeeDee Lamb and cornerback DaRon Bland, potentially bolstering the playoff push. Despite the slow start, the coach remains optimistic, citing the offense's potential as a foundation for improvement in the season's second half.\n\n## Championships and accomplishments\n\n### Super Bowl VI (1971)\n\nSuper Bowl VI marked the Dallas Cowboys' first NFL championship victory, defeating the Miami Dolphins 24-3 on January 16, 1972, at Tulane Stadium in New Orleans, Louisiana. The Cowboys, coached by Tom Landry, entered the game with an 11-3 regular-season record, having won their final 10 games after a 1-3 start, and advanced through the playoffs by beating the San Francisco 49ers 30-28 in the divisional round and the Minnesota Vikings 20-12 in the NFC Championship. Their defense was particularly dominant in the postseason, allowing just 18 total points across those two games, while the offense led the NFL in scoring during the regular season with 29.0 points per game. This triumph came a year after a heartbreaking 16-13 loss to the Baltimore Colts in Super Bowl V, erasing the lingering label of the Cowboys as \"next year's champions.\"\n\nThe game showcased the Cowboys' balanced attack and stifling defense against Don Shula's Dolphins, who had finished the regular season at 10-3-1 and were seeking their first Super Bowl title. Dallas struck first with a 9-yard field goal by Mike Clark in the opening quarter, followed by a 7-yard touchdown pass from quarterback Roger Staubach to wide receiver Lance Alworth early in the second, extending the lead to 10-0. Miami responded with a 31-yard field goal by Garo Yepremian, but the Cowboys pulled away in the second half, with running back Duane Thomas scoring on a 3-yard rush in the third quarter and tight end Mike Ditka catching a 7-yard touchdown pass from Staubach in the fourth to seal the rout. The Cowboys amassed 23 first downs and 352 total yards, including a commanding 252 rushing yards on 48 carries, while limiting Miami to just 3 points and forcing key turnovers.\n\nStaubach earned Super Bowl MVP honors, completing 12 of 19 passes for 119 yards and two touchdowns without an interception, while Thomas rushed for 95 yards and a score, highlighting the ground game's effectiveness. The defensive front, led by Hall of Famer Bob Lilly, pressured Dolphins quarterback Bob Griese into inefficiency, sacking him multiple times and holding Miami to 126 total yards. This victory not only validated Landry's innovative 4-3 defense and the team's resilience but also propelled the Cowboys into a dynasty era, with Staubach establishing himself as a clutch leader en route to four Super Bowl appearances in the 1970s.\n\n### Super Bowl XII (1977)\n\nSuper Bowl XII, played on January 15, 1978, at the Louisiana Superdome in New Orleans, pitted the Dallas Cowboys against the Denver Broncos, marking the Cowboys' fourth appearance in the NFL's championship game. The Cowboys entered the contest as the NFC's top seed after a dominant 12-2 regular season, where they led the league in both total offense and total defense, a feat not achieved by any team since the 1972 Miami Dolphins. Under head coach Tom Landry, Dallas advanced through the playoffs with a 37-7 divisional victory over the Chicago Bears on December 26, 1977, followed by a 23-6 win in the NFC Championship against the Minnesota Vikings on January 1, 1978.\n\nThe Cowboys secured their second Super Bowl title with a 27-10 victory, showcasing a balanced attack led by quarterback Roger Staubach and a stifling defense known as \"Doomsday II.\" Staubach completed 17 of 25 passes for 183 yards and one touchdown, while rookie running back Tony Dorsett rushed for 66 yards and a score before exiting with a knee injury in the first half. The offense struck first with Dorsett's 3-yard touchdown run midway through the first quarter, followed by kicker Efren Herrera's 35-yard field goal to make it 10-0. Herrera added a 43-yard field goal in the second quarter for a 13-0 halftime lead. In the third, wide receiver Butch Johnson hauled in a 45-yard touchdown pass from Staubach, extending the advantage to 20-3 after Denver's Jim Turner kicked a 47-yard field goal. Fullback Robert Newhouse capped the scoring with a trick-play 29-yard touchdown pass to Golden Richards in the fourth quarter.\n\nDefensively, the Cowboys forced eight Denver turnovers—four interceptions and four fumbles—while limiting the Broncos to just 156 total yards. Defensive ends Randy White and Harvey Martin, who shared Super Bowl MVP honors as the first co-recipients in league history, spearheaded the pressure on Broncos quarterback Craig Morton, sacking him multiple times and contributing to his four interceptions in the first half alone, a Super Bowl record at the time. Martin later quipped about Denver's \"Orange Crush\" defense, saying, “Orange Crush is soda water, baby. You drink it. It don’t win football games.” The win avenged Dallas's 14-10 loss to Pittsburgh in Super Bowl X and solidified the Cowboys' status as an NFL powerhouse during the Landry era.\n\n### Super Bowl XXVII (1992)\n\nSuper Bowl XXVII was played on January 31, 1993, at the Rose Bowl in Pasadena, California, where the Dallas Cowboys defeated the Buffalo Bills by a score of 52–17 to claim their third NFL championship in franchise history. This victory marked the Cowboys' first Super Bowl title since 1978 and the beginning of a dominant three-year run under head coach Jimmy Johnson. The Bills, appearing in their third consecutive Super Bowl, suffered their third straight loss in the game, extending a streak of futility despite a strong regular season.\n\nThe Cowboys entered the contest as 6.5-point favorites after a 13–3 regular season and a 38–21 playoff win over the San Francisco 49ers in the NFC Championship Game. Key contributors included quarterback Troy Aikman, running back Emmitt Smith, and wide receiver Michael Irvin, who formed the core of an offense that ranked first in the NFL in total yards. Defensively, Dallas boasted the league's top-ranked unit, allowing just 226.7 yards per game and featuring pass rushers Charles Haley and Ken Norton Jr. In contrast, the Bills relied on quarterback Jim Kelly, running back Thurman Thomas, and wide receiver Andre Reed, but their defense struggled against dynamic offenses.\n\nThe game began competitively, with Buffalo striking first on a 2-yard touchdown run by Thomas, giving the Bills a 7–0 lead midway through the first quarter. Dallas responded quickly, as Aikman connected with tight end Jay Novacek for a 23-yard touchdown pass to tie the score at 7–7. Moments later, Bills quarterback Jim Kelly's fumble was recovered by Cowboys defensive end Jimmie Jones, who returned it 2 yards for a touchdown, putting Dallas ahead 14–7. In the second quarter, Buffalo's Steve Christie kicked a 21-yard field goal to narrow the gap to 14–10, but Dallas exploded for 18 unanswered points: Aikman threw touchdown passes of 19 and 18 yards to Irvin, extending the lead to 28–10 at halftime.\n\nDallas's defense dominated the second half, forcing a Super Bowl-record nine turnovers from Buffalo, including four interceptions and five lost fumbles, which the Cowboys converted into 35 points. Kicker Lin Elliott added a 20-yard field goal early in the third quarter to make it 31–10. Backup quarterback Frank Reich replaced an injured Kelly and led Buffalo to their only second-half score, a 40-yard touchdown pass to Don Beebe, cutting the deficit to 31–17. In the fourth quarter, Aikman connected with Alvin Harper for a 45-yard touchdown, followed by Smith's 10-yard rushing score and a 9-yard fumble return touchdown by Norton, sealing the 52–17 rout. A notable late-game moment came when Cowboys defensive tackle Leon Lett recovered a blocked field goal attempt but prematurely celebrated, allowing Beebe to strip the ball at the 1-yard line; Buffalo recovered for a touchdown on the next play, though it did not affect the outcome.\n\nAikman earned Super Bowl MVP honors, completing 22 of 30 passes for 273 yards and four touchdowns without an interception, distributing scores to four different receivers. Smith rushed for 108 yards on 22 carries and caught six passes for 27 yards, becoming the first player to gain 100 rushing yards in a Super Bowl while leading the NFL that season. Irvin hauled in six receptions for 114 yards and two touchdowns, showcasing his speed and route-running. Defensively, Dallas limited Buffalo to 108 rushing yards while generating relentless pressure, with Haley recording two sacks. For the Bills, Reed caught eight passes for 152 yards, but the turnovers proved insurmountable.\n\nThe win solidified the Cowboys' resurgence, validating Johnson's roster rebuild through the 1989 draft and trades, and set the stage for back-to-back titles. Attendance was 98,374, with the game broadcast on NBC to 114.5 million viewers, the highest-rated Super Bowl up to that point.\n\n### Super Bowl XXVIII (1993)\n\nThe Dallas Cowboys entered Super Bowl XXVIII as the defending champions from the previous season, having finished the 1993 regular season with a 12-4 record and clinching the NFC East division title despite starting 0-2 amid a contract holdout by running back Emmitt Smith. The team rebounded strongly, winning 12 of their final 14 games, with Smith leading the NFL in rushing yards (1,486) and earning league MVP honors. In the playoffs, the Cowboys dominated with double-digit victories: a 27-17 win over the Green Bay Packers in the divisional round and a 38-21 triumph against the San Francisco 49ers in the NFC Championship, setting up a rematch with the Buffalo Bills.\n\nSuper Bowl XXVIII took place on January 30, 1994, at the Georgia Dome in Atlanta, Georgia, where the Cowboys faced the Bills in a repeat of the previous year's matchup. Dallas, favored by 7 points, trailed 13-6 at halftime after kicker Eddie Murray's two field goals (41 and 24 yards) were countered by a 4-yard touchdown run by Bills running back Thurman Thomas and two field goals from Steve Christie (54 and 28 yards). The second half marked a decisive turnaround, as the Cowboys' defense forced three turnovers—including a fumble by Thomas recovered and returned 48 yards for a touchdown by cornerback James Washington early in the third quarter—while shutting out Buffalo for the remainder of the game.\n\nEmmitt Smith anchored the Cowboys' offensive resurgence, rushing for 132 yards on 30 carries and scoring two touchdowns on short runs (15 yards in the third quarter and 1 yard in the fourth), earning him Super Bowl MVP honors for the second straight postseason. Quarterback Troy Aikman completed 17 of 23 passes for 207 yards with one interception, efficiently distributing to receivers like Michael Irvin (5 receptions, 90 yards), while the offensive line provided solid protection against Buffalo's pass rush. Dallas outgained the Bills 341-314 in total yards and controlled possession for 34:29, adding a final 20-yard field goal by Murray to seal the 30-13 victory and secure their fourth Super Bowl title in franchise history.\n\nThe win capped the Jimmy Johnson era's back-to-back championships, highlighting the Cowboys' balanced attack and opportunistic defense, with key contributors like linebacker Ken Norton Jr. and safety Thomas Everett earning Pro Bowl nods during the season. This victory solidified Dallas as the NFL's premier team entering 1994, though it also marked Johnson's final season as head coach before his departure.\n\n### Super Bowl XXX (1995)\n\nSuper Bowl XXX was played on January 28, 1996, at Sun Devil Stadium in Tempe, Arizona, where the Dallas Cowboys defeated the Pittsburgh Steelers 27-17 to claim their fifth NFL championship. The Cowboys, entering as the NFC champions with a 12-4 regular-season record, aimed to become the first team in league history to win three Super Bowls in four years following victories in 1992 and 1993. This rematch against the Steelers, who had previously beaten Dallas in Super Bowl XIII, highlighted the Cowboys' defensive resurgence under coordinator Dave Wannstedt.\n\nThe game began with Dallas asserting early dominance, building a 10-0 lead in the first quarter through a 34-yard field goal by Chris Boniol and a 3-yard touchdown pass from Troy Aikman to Jay Novacek. Pittsburgh responded in the second quarter with a 6-yard touchdown pass from Neil O'Donnell to Yancy Thigpen, narrowing the gap to 10-7 at halftime. The third quarter proved pivotal, as cornerback Larry Brown intercepted O'Donnell at the Steelers' 6-yard line, setting up Emmitt Smith's 2-yard touchdown run to extend the lead to 17-7. Dallas added a 45-yard field goal by Boniol late in the period, making it 20-7.\n\nIn the fourth quarter, the Steelers mounted a comeback, closing to 20-17 with a 46-yard field goal by Norm Johnson and a 1-yard touchdown run by Bam Morris. However, Brown's second interception of O'Donnell near midfield allowed Aikman to connect with Novacek for a 7-yard touchdown pass, sealing the 27-17 victory with 2:37 remaining. The Cowboys' defense forced three turnovers in total, limiting Pittsburgh to 310 total yards while holding possession for 26:11.\n\nOffensively, Aikman completed 15 of 23 passes for 209 yards and one touchdown with no interceptions, while Smith rushed 18 times for 49 yards and one score. Michael Irvin led receivers with five catches for 76 yards, and the offensive line protected Aikman effectively against Pittsburgh's vaunted Steel Curtain defense. Brown's two interceptions for 77 return yards earned him Super Bowl MVP honors, marking the fourth time a Cowboys defender received the award. The win solidified Dallas's status as the NFC's premier dynasty of the era, tying them with the San Francisco 49ers for the most Super Bowl titles at that point.\n\n### Other major achievements\n\nThe Dallas Cowboys hold the NFL record for the most consecutive winning seasons, achieving 20 straight from 1966 to 1985, during which they qualified for the playoffs 18 times. This streak, the longest in league history, underscores the team's consistency under head coach Tom Landry, who led the franchise to 13 division titles during his 29-year tenure from 1960 to 1988.\n\nAs of the 2025 season, the Cowboys have compiled the fifth-most regular-season victories in NFL history with 573 wins, trailing only the Chicago Bears, Green Bay Packers, New York Giants, and Pittsburgh Steelers. They share the league record for most playoff appearances with 36, tied with the Packers, and rank fourth all-time in playoff victories with 36. The franchise has secured 25 division championships, the most in the NFC East and second-most in the NFL behind the Packers' 27. These accomplishments include a league-leading 10 NFC Championship Game appearances.\n\nThe Cowboys boast 32 Pro Football Hall of Famers, more than any other NFL franchise, including players like Emmitt Smith, who set the all-time rushing record with 18,355 yards from 1990 to 2004, and Tony Dorsett, who holds the longest rushing touchdown from scrimmage at 99 yards. Running back Emmitt Smith also established the NFL mark for consecutive 1,000-yard rushing seasons with 11 from 1991 to 2001.\n\nOff the field, the Cowboys have been recognized as the world's most valuable sports franchise for nine consecutive years as of 2024, valued at $10.1 billion by Forbes, and escalating to $13 billion in their 2025 valuation—the first team to surpass $10 billion. This financial dominance stems from high revenue streams, including sold-out home games for over 190 consecutive contests since 2002, the longest streak in North American professional sports.\n\n## Facilities\n\n### Stadiums\n\nThe Dallas Cowboys began playing home games at the Cotton Bowl in Dallas, Texas, upon the franchise's inception in 1960, remaining there through the 1970 season. The stadium, originally constructed in 1930, had a capacity of approximately 72,000 spectators and was already renowned for hosting the annual Cotton Bowl Classic college football game. The Cowboys' inaugural home game occurred on September 24, 1960, against the New York Giants, marking the start of an 11-year tenure at the venue where the team compiled a regular-season record of 43 wins, 31 losses, and 4 ties, along with a 2-2 playoff mark. This period encompassed the team's early struggles and gradual rise, including their first winning season in 1966.\n\nIn 1971, the Cowboys relocated to the newly built Texas Stadium in Irving, Texas, which served as their home until the end of the 2008 season. The stadium opened on October 24, 1971, with an initial seating capacity of 65,000, later expanded over the years to accommodate larger crowds. Designed with a distinctive partial roof featuring a large opening above the field—intended to allow divine oversight, as quipped by owner Clint Murchison—it became an iconic symbol of the franchise during its golden eras, including three Super Bowl victories in the 1970s and 1990s. Over 38 seasons, the Cowboys achieved a home record of 213 wins in 313 games at Texas Stadium, underscoring its role in fostering a strong home-field advantage.\n\nThe team moved to AT\\u0026T Stadium in Arlington, Texas, starting with the 2009 season, marking a shift to a state-of-the-art facility that has remained their home as of 2025. Completed in May 2009 at a cost of $1.2 billion, the stadium features a retractable roof and end-zone windows for natural light, with a base seating capacity of 80,000 that can expand to over 100,000 through standing-room configurations. Originally named Cowboys Stadium from 2009 to 2012, it adopted the AT\\u0026T Stadium moniker in 2013 following a naming rights deal. Notable for its engineering marvels, including the world's largest center-hung video board measuring 160 feet by 72 feet, the venue has hosted not only Cowboys games but also major events like the Cotton Bowl Classic since 2010 and the 2011 Super Bowl.\n\n| Stadium | Location | Years Used | Capacity | Notable Features |\n|---------|----------|------------|----------|------------------|\n| Cotton Bowl | Dallas, TX | 1960–1970 | ~72,000 | Hosted annual Cotton Bowl Classic; site of Cowboys' first winning season in 1966. |\n| Texas Stadium | Irving, TX | 1971–2008 | 65,000 (initial; expanded later) | Iconic partial roof opening; 213 home wins over 38 seasons. |\n| AT\\u0026T Stadium | Arlington, TX | 2009–present | 80,000 (expandable to 100,000+) | Retractable roof; largest video board in the world; $1.2 billion construction cost. |\n\n### Training camp sites\n\nThe Dallas Cowboys have held their annual training camps at various locations since the team's inception in 1960, often selecting sites that offer favorable weather, dedicated facilities, and opportunities for team bonding away from their home base in Texas. Early camps were hosted at colleges in the Midwest and West, reflecting the league's tradition of using academic institutions for summer practices. This practice allowed the team to focus on conditioning in controlled environments, away from distractions and the Texas heat.\n\nFrom 1963 to 1989, the Cowboys established a long-term partnership with California Lutheran University in Thousand Oaks, California, where they conducted 27 consecutive training camps. The mild coastal climate and expansive campus facilities, including dormitories and playing fields, made it an ideal spot for rigorous preparations during the Tom Landry era, contributing to the team's success in multiple Super Bowl appearances. This extended stay fostered a sense of tradition, with players and coaches appreciating the change of scenery for building chemistry.\n\nIn the 1990s, the team shifted closer to home, holding camps at St. Edward's University in Austin, Texas, from 1990 to 1997. The move aligned with the Jimmy Johnson and Barry Switzer coaching tenures, emphasizing proximity to Dallas for easier logistics while still providing a college atmosphere for focused training. Subsequent years saw brief stints at Midwestern State University in Wichita Falls, Texas (1998–2001), before transitioning to more varied sites amid ownership changes and facility upgrades.\n\nThe early 2000s marked a period of alternation between Texas and California locations. The Cowboys practiced at the Alamodome in San Antonio, Texas, in 2002–2003, 2007, 2009, and 2011, drawn by the indoor venue's protection from weather and its capacity for fan events. Concurrently, they began utilizing River Ridge Playing Fields in Oxnard, California, starting in 2001, 2004–2006, 2008, 2010, and consistently from 2012 to 2019 and 2021 to 2025. Oxnard's coastal setting offers cooler temperatures ideal for padded practices, and the site has hosted joint sessions with local high school teams, enhancing community engagement. The 2020 camp was an exception, held entirely at The Star headquarters in Frisco, Texas, due to COVID-19 protocols that limited travel.\n\n| Years | Location | Key Details |\n|-------|----------|-------------|\n| 1960 | St. John's Military Academy (Delafield, WI); Pacific University (Forest Grove, OR) | Initial camps at military and liberal arts colleges for basic team formation. |\n| 1961 | St. Olaf College (Northfield, MN) | Short-term use of a Minnesota liberal arts school. |\n| 1962 | Northern Michigan University (Marquette, MI) | Transition to a public university in the Upper Peninsula. |\n| 1963–1989 | California Lutheran University (Thousand Oaks, CA) | Longest tenure; supported three Super Bowl wins with optimal weather and facilities. |\n| 1990–1997 | St. Edward's University (Austin, TX) | Return to Texas; aligned with 1990s dynasty era. |\n| 1998–2001 | Midwestern State University (Wichita Falls, TX) | Regional state university; partial overlap with Oxnard trial in 2001. |\n| 2002–2003, 2007, 2009, 2011 | Alamodome (San Antonio, TX) | Indoor dome for weather-proof practices and large crowds. |\n| 2001, 2004–2006, 2008, 2010, 2012–2019, 2021–2025 | River Ridge Playing Fields (Oxnard, CA) | Current primary site; 19th stint in 2025, emphasizing fan access and mild climate. |\n| 2020 | The Star (Frisco, TX) | COVID-19 adaptation at team headquarters. |\n\nThis table summarizes the chronological history based on verified records. The Cowboys' choice of Oxnard for most recent camps underscores a preference for California's training advantages, with the 2025 session scheduled from July 22 to August 14 at River Ridge, open to fans for select practices.\n\n## Identity\n\n### Logos\n\nThe Dallas Cowboys' primary logo features a five-pointed star in navy blue, outlined in white, set against a silver or white background, symbolizing Texas as the \"Lone Star State.\" Introduced in 1960 upon the team's founding, the original version was a solid navy blue star without outlines, reflecting the franchise's early identity tied to regional pride. This design remained in use through the 1963 season.\n\nIn 1964, the logo underwent a refinement by Jack Eskridge, the Cowboys' first equipment manager, who added a white border around the star to create a subtle three-dimensional effect. This updated version has served as the team's enduring primary logo since, appearing on helmets, uniforms, and official branding without further major alterations. The navy blue color (Pantone 661 C) evokes stability and tradition, while the white outline enhances visibility and depth.\n\nThe logo's evolution parallels changes to the team's helmets, which shifted from white with a solid blue star (1960–1963) to metallic silver with the outlined blue star (1964–present), occasionally incorporating minor tweaks like a darker blue fill and refined outlines in 1967 for better contrast. Beyond the primary emblem, the Cowboys have introduced alternate and commemorative logos for special occasions, such as the 25th anniversary in 1985 (featuring three stars and \"Silver Season\" text) and the 50th in 2010 (a silver star with celebratory ribbons). These variants maintain the core star motif but add thematic elements to mark milestones.\n\nThe star's simplicity and iconic status have made it one of the most recognizable symbols in professional sports, embodying themes of excellence, ambition, and Texan heritage. It appears consistently across merchandise, stadium signage, and digital media, underscoring the franchise's emphasis on timeless branding.\n\n### Uniforms\n\nThe Dallas Cowboys' uniforms are among the most recognizable in professional sports, featuring a primary color scheme of silver, royal blue, and white. The design emphasizes simplicity and elegance, with the iconic blue star logo serving as the central element on helmets and jerseys. This scheme was established by team founder and general manager Tex Schramm, who drew inspiration from the Southwestern United States' cultural motifs, including the state of Texas' lone star symbol. The uniforms have remained largely consistent since the mid-1960s, with minimal alterations to maintain their timeless appeal.\n\nUpon the team's inception in 1960, the Cowboys debuted with white helmets featuring a solid royal blue star on each side and two blue stripes running from front to back. Jerseys included white home versions paired with blue pants and royal blue road jerseys with white pants. In 1964, under Schramm's direction, the Cowboys began wearing white jerseys at home games—a tradition that persists today and was intended to highlight opponents' darker uniforms for fan visibility and to avoid repetitive color clashes. This made Dallas one of the first NFL teams to buck the convention of colored home jerseys. The helmet transitioned to metallic silver in 1965, adopting a blue star outlined in white, which has become synonymous with the franchise and remains unchanged in core design.\n\nThe pants for home games evolved into a unique turquoise-gray shade, reportedly inspired by the interior of a luxury car Schramm admired in the early 1960s; this color, often described as \"Cowboys Star Blue,\" contrasts with the silver road pants to create the team's distinctive mismatched look. Road uniforms feature royal blue jerseys with silver pants. A notable variation occurred in 1976 for the U.S. Bicentennial, when the helmets added a red, white, and blue stripe down the center, worn for the entire season under Schramm's initiative to honor American history. The design was briefly revived in select modern games, such as a 2023 matchup against the New York Giants.\n\nThe royal blue road jerseys acquired a superstitious reputation in the 1970s and 1980s, dubbed the \"blue jersey jinx\" after several high-profile losses, including playoff defeats in 1968, 1971, and the 1980 NFC Championship. In response, Schramm announced a redesign before the 1981 season, shifting to a darker shade of blue and introducing silver pants exclusively for road games to break the perceived curse. This version persisted until 1994, with subsequent manufacturers like Nike refining the fabric and numbering while preserving the core aesthetics. The team has occasionally worn throwback white helmets and uniforms from the 1960-1964 era, most recently in 2024 for a Thanksgiving Day game against the New York Giants, marking the first alternate helmet allowed under updated NFL rules.\n\n### Thanksgiving Day traditions\n\nThe Dallas Cowboys' Thanksgiving Day tradition began in 1966 when team president and general manager Tex Schramm agreed to NFL Commissioner Pete Rozelle's request to host a second annual Thanksgiving game, complementing the Detroit Lions' longstanding holiday fixture that dated back to 1934. This move was partly a publicity effort to elevate the young franchise's national profile, as the Cowboys had only been established in 1960. The inaugural game on November 24, 1966, against the Cleveland Browns drew a record crowd of 80,259 to the Cotton Bowl, marking the start of an annual home game tradition that has continued every Thanksgiving since, with exceptions in 1975 and 1977 when the team did not host. As of the 2024 season, the Cowboys hold an all-time Thanksgiving record of 34-22-1, reflecting their historical success in these high-profile matchups.\n\nThe games, played at home in Arlington's AT\\u0026T Stadium since 2009, are nationally televised and serve as a centerpiece of the NFL's Thanksgiving slate, typically scheduled for the afternoon slot to allow families to gather around the broadcast. This visibility has amplified the Cowboys' \"America's Team\" moniker, turning the contest into a cultural ritual that blends sports with holiday festivities, often featuring pre-game tailgating and fan events that emphasize community and gratitude. On the field, memorable moments include dramatic victories like the 1993 overtime win against the New York Giants and upsets such as the 2012 loss to the Washington Redskins, which have added to the tradition's lore.\n\nA key element of the Cowboys' Thanksgiving games is the halftime show, which has evolved into a major entertainment spectacle since its formal inception in 1997 with country star Reba McEntire's performance. Subsequent shows have featured a roster of prominent artists, particularly in the country genre, including Faith Hill in 1998, LeAnn Rimes in 1999, Kenny Chesney in 2012, and Lainey Wilson in 2024, often drawing millions of additional viewers. Since 2014, the halftime production has partnered with The Salvation Army to launch their annual Red Kettle Campaign, a nationwide holiday fundraising effort that supports 27 million people in need, with performers like Thomas Rhett in 2017 and Jelly Roll alongside Wilson in 2024 using the platform to promote charitable giving.\n\nComplementing the halftime focus on philanthropy, the Cowboys organization upholds a tradition of community service by having players, along with their families, serve early Thanksgiving meals at Salvation Army facilities in the Dallas area, a practice that dates back decades and reinforces themes of gratitude and support for underserved communities. On game day, players have popularized a lighthearted on-field ritual involving the Salvation Army's iconic red kettles placed near the end zone, where scoring players like Ezekiel Elliott and Dak Prescott have celebrated touchdowns by attempting trick shots such as kicking footballs into the kettles, occasionally resulting in NFL fines that the team matches with donations to the charity. These elements collectively transform the Cowboys' Thanksgiving game into more than a sporting event, embedding it as a multifaceted holiday tradition that promotes family, entertainment, and goodwill.\n\n## Culture and fanbase\n\n### Nationwide popularity\n\nThe Dallas Cowboys earned the enduring nickname \"America's Team\" in 1978, when NFL Films producer Bob Ryan coined the term in a highlight reel narrated by John Facenda, highlighting the team's widespread fan support at road games during their successful 1977 season. This moniker, inspired by the Cowboys' national appeal amid their five Super Bowl appearances in the 1970s, has since symbolized their broad popularity across the United States, transcending regional boundaries and contributing to their status as one of the NFL's most recognized franchises.\n\nThe Cowboys' nationwide popularity is reflected in their dominant fan base metrics. According to ticketing data from Vivid Seats spanning 2024 to 2025, the Cowboys are the most popular NFL team in 290 U.S. counties, surpassing all other franchises and showing strong support in states like Texas, Oklahoma, and Arkansas. Their social media presence further underscores this reach, with over 8 million Facebook followers, 5 million on Instagram, and 4.42 million on X (formerly Twitter) as of late 2024, totaling nearly 20 million across platforms and ranking them among the top NFL teams in digital engagement.\n\nThis popularity drives exceptional media and financial performance. In the 2025 NFL season, Cowboys games have accounted for two of the three most-watched broadcasts, including 28.3 million viewers for their opener against the Philadelphia Eagles and 26.9 million for a matchup with the Green Bay Packers. Forbes valued the franchise at $13 billion in August 2025, the highest among all sports teams worldwide for the 19th consecutive year, attributing much of this to their $1.2 billion in 2024 revenue—fueled by national merchandising, broadcasting deals, and a brand worth $3.0 billion. These figures highlight how the Cowboys' cultural footprint sustains their position as a premier national sports entity, even without a Super Bowl win since 1995.\n\n### Fan support and criticism\n\nThe Dallas Cowboys boast one of the largest and most loyal fanbases in professional sports, often referred to as \"America's Team\" due to their widespread national and international appeal. A 2021 Pickswise study ranked Cowboys fans as the most loyal in the NFL based on average stadium attendance exceeding 112.70% of capacity over the previous decade, outpacing all other teams despite only three playoff appearances in that span. This loyalty is reflected in high turnout at home games, with an average home attendance of 92,849 in the 2025 season, the highest in the league. The franchise's value, estimated at $13 billion in 2025, underscores the economic impact of this dedicated following, driven by strong merchandise sales and television viewership.\n\nCowboys fans demonstrate robust support through consistent engagement, including packed training camps in Oxnard and Frisco, where public practices draw thousands annually. Internationally, the team ranks fourth in search interest outside the U.S. over the past year (as of November 2025), behind the Kansas City Chiefs, Philadelphia Eagles, and Buffalo Bills, highlighting their global reach amid rising interest in NFL apparel and events abroad. This fervor contributes to the Cowboys leading the NFL in social media mentions and fan-driven revenue, with games frequently topping viewership charts, such as their 2025 matchup against the Green Bay Packers averaging 26.9 million viewers.\n\nDespite this strong backing, the Cowboys fanbase faces significant criticism from media personalities and analysts for being overly emotional and unrealistic in expectations. Hall of Famer Emmitt Smith, in a 2024 interview, described fans as \"misguided\" and prone to overhyping the team's potential after early successes, such as against weaker opponents, while urging more measured concern about overall performance. ESPN's Stephen A. Smith has repeatedly labeled them \"delusional,\" \"nauseating,\" and \"disgusting,\" attributing this to their intense reactions to losses and perceived entitlement stemming from the franchise's storied history.\n\nSurveys and rankings often portray Cowboys supporters as among the most annoying or cringeworthy in sports, with a 2023 Yardbarker poll placing them atop the list of irritating fanbases across all major leagues due to vocal bravado and bandwagon perceptions. A 2022 USA Today ranking deemed them the second-worst fanbase in all of sports, citing excessive complaining and hype. Internally, a 2020 CBS DFW survey identified Cowboys fans as the NFL's biggest complainers, reflecting frustration with prolonged playoff droughts and management decisions. This self-criticism within the fanbase underscores a passionate but sometimes divisive loyalty, where supporters demand excellence amid the team's high-profile status.\n\n### Fight song\n\nThe Dallas Cowboys' official fight song is the \"Cowboys Stampede March,\" a brass band march composed by Dallas jingle writer Tom Merriman in 1961 specifically for the team's early radio broadcasts on KLIF-AM. Originally performed by the Tom Merriman Big Band, possibly with contributions from the Dallas Civic Chorus, the instrumental track quickly became synonymous with the franchise, serving as its primary anthem during the 1960s and 1970s, including the Tom Landry era and key games like the 1967 Ice Bowl. It was widely used in television and radio promotions, commercials, and stadium entrances, helping to build the team's identity as \"America's Team\" amid their rise to prominence. By the 1990s, however, its regular use diminished in favor of more contemporary music and hype videos, though it remains a nostalgic staple occasionally revived for historical tributes or special events.\n\nThe song's structure blends a trumpet \"charge\" fanfare with marching rhythms, evoking the imagery of a cattle drive to symbolize the team's aggressive play style. Lyrics, added to the instrumental base, emphasize offensive dominance and victory, with verses such as: \"Dallas Cowboys stampede down the field / See the defense reel and watch 'em fall, / Blockers out in front to clear the way, / Show 'em how to win 'em all.\" The chorus rallies fans with calls like \"Go! Go! Dallas! Cowboys! / Charge! Fight! Dallas Cowboys win!\" These words, sung in a choral style during broadcasts, reinforced the Cowboys' pioneering spirit during their inaugural decade, when the franchise was establishing itself in the NFL after joining as an expansion team in 1960.\n\nRecordings of the march, such as the 1961 single by the Tom Merriman Big Band, continue to be available on platforms like Spotify and Apple Music, preserving its legacy for new generations of fans. While not as ubiquitous today as team-specific hype tracks, the \"Cowboys Stampede March\" endures as a cultural artifact of the franchise's formative years, symbolizing the blend of Texas heritage and professional football ambition that defined early Cowboys success.\n\n## Rivalries\n\n### Divisional rivals\n\nThe Dallas Cowboys compete in the NFC East division alongside the Philadelphia Eagles, New York Giants, and Washington Commanders, forming some of the NFL's most storied and intense rivalries that date back to the league's early expansion era. These matchups often feature high stakes for divisional standings and playoff positioning, characterized by physical play, memorable controversies, and shifts in dominance over decades.\n\nThe Cowboys-Eagles rivalry, one of the league's fiercest, originated on September 30, 1960, when the Eagles defeated the expansion Cowboys 27-25 in Dallas. The Cowboys quickly asserted control, winning 11 consecutive games from 1967 to 1972 and another eight straight from 1974 to 1978, fueled by stars like Bob Lilly and Roger Staubach. The Eagles responded with their own dominance, securing eight straight victories from 1987 to 1991 amid the \"Bounty Bowl\" scandals in 1989, where the Eagles were fined for alleged bounties on Cowboys players including kicker Raul Allegre. In postseason play, the teams have met four times, with the Eagles earning a 20-7 upset in the 1980 NFC Championship Game to advance to their first Super Bowl, while the Cowboys prevailed in the other three encounters: 34-10 in the 1992 NFC Divisional Round, 30-11 in 1996, and 34-14 in the 2009 Wild Card Round. Iconic moments include the Eagles' 33-14 \"Pickle Juice Game\" victory on September 3, 2000, where Philadelphia's dehydration strategy during a heatwave propelled them to a rout, and a 44-6 Eagles win on December 28, 2008, that clinched their playoff berth while eliminating Dallas. The series has seen frequent prime-time scheduling, with 23 standalone games since 2000, underscoring its national appeal.\n\nThe Cowboys-Giants rivalry, rooted in the Cowboys' inaugural 1960 season, has been marked by dramatic playoff implications and ownership banter, with Dallas holding a commanding recent edge. The teams played to a 0-0 tie in their first meeting on November 20, 1960, Dallas's initial non-loss as an expansion franchise. New York dominated a 12-game stretch starting after Week 9 of 1986, coinciding with their Super Bowl XXI run, including a 17-14 win where linebacker Carl Banks sacked quarterback Danny White, contributing to a season-ending injury. Playoff clashes include the Giants' 21-17 upset of the top-seeded Cowboys in the 2007 NFC Divisional Round, propelling New York to Super Bowl XLII victory. Dallas has since won 13 of the last 14 regular-season meetings as of November 2025, including the 40-37 victory on September 14, 2025, and holds a 14th victory in 15 overall matchups. Memorable games feature Eli Manning's debut win on December 19, 2004 (31-21), Tony Romo's error-plagued debut on October 23, 2006 (Cowboys still won 36-31 after trailing), and Jason Pierre-Paul's blocked field goal sealing a 37-34 Giants victory on December 11, 2011. The all-time regular-season series stands at 78-46-2 in favor of Dallas as of November 2025.\n\nThe Cowboys-Commanders rivalry, once defined by off-field pranks and NFC Championship intensity, has evolved into a more lopsided affair in recent years but retains historical bite from the 1970s and 1980s. Early antics included a foiled 1961 Cowboys fan plan to release 50 chickens at RFK Stadium labeled \"Redskins,\" and a 1979 funeral wreath sent to Cowboys defensive end Harvey Martin before a dramatic 35-34 Dallas Thanksgiving Day win. Washington (then the Redskins) claimed a pivotal 31-17 victory in the 1982 NFC Championship Game (played after the 1983 season due to a strike-shortened year), advancing to Super Bowl XVII. The Cowboys responded with a 44-14 rout on December 22, 1985, during which fans mockingly sang \"Happy Birthday\" to injured Redskins quarterback Joe Theismann. Dallas has dominated lately, including a 38-10 clincher for the 2023 NFC East title, a 34-26 wild win on November 24, 2024 snapping a skid at the time, a 23-19 loss to Washington on January 5, 2025 (week 18, 2024 season), and a 44-22 win on October 19, 2025. The series has featured 17 Monday Night Football games, more than any other divisional matchup, emphasizing its enduring drama.\n\n### NFC rivals\n\nThe Dallas Cowboys' most prominent rivalries within the National Football Conference outside their division have historically centered on the San Francisco 49ers and Green Bay Packers, stemming from intense playoff confrontations and battles for NFC supremacy during the league's expansion era and the 1990s dynasty periods. These matchups have produced memorable moments that defined eras of dominance, with the Cowboys often emerging as a counterpoint to the West Coast and Midwest powerhouses.\n\nThe Cowboys-49ers rivalry traces its roots to the 1970s, when Dallas defeated San Francisco in the playoffs three consecutive years from 1970 to 1972, including a 17-10 win in the 1970 NFC Divisional round that propelled the Cowboys to their first Super Bowl appearance. The intensity peaked in the early 1990s, as the teams clashed in the NFC Championship Game annually from 1992 to 1994, with the winner advancing to and claiming the Super Bowl each time—Dallas triumphed in 1992 (30-20) and 1994 (38-28), while San Francisco prevailed in 1993 (38-21). Overall, the 49ers hold a slight all-time edge at 21-19-1, including a 15-13-1 regular-season record, but the Cowboys lead in postseason meetings at 6-2 across eight playoff encounters, where the victor has represented the NFC in the Super Bowl seven times, winning six. Recent playoff meetings include the Cowboys' 19-12 Divisional win in 2022 and the 49ers' 19-12 Championship win in 2023. This rivalry symbolizes the clash between two perennial contenders, marked by star quarterbacks like Joe Montana and Steve Young against Troy Aikman, and has waned without a Super Bowl title for either since the 1990s.\n\nSimilarly, the Cowboys-Packers rivalry originated in the 1960s amid the NFL's early championship clashes, including Green Bay's victories in the 1966 (34-27) and 1967 (21-17) NFL Championship Games, the latter famously known as the \"Ice Bowl\" at Lambeau Field. Dallas reversed the tide in the 1990s, winning nine of ten encounters, including three playoff triumphs: the 1993 NFC Divisional (27-17), 1995 NFC Divisional (35-9), and 1996 NFC Championship (38-27), which fueled the Cowboys' back-to-back Super Bowl wins. The Packers snapped this streak with a 45-17 rout in 1997, but the decade's dominance underscored Dallas's defensive prowess against Brett Favre's offense. All-time, Green Bay leads 22-17-1, with a 17-13-1 regular-season edge, across 40 meetings including nine postseason games where the Packers hold a 5-4 advantage. This matchup highlights generational shifts, from Vince Lombardi's Packers to Jimmy Johnson's Cowboys, and remains a staple of NFC playoff lore despite fewer recent high-stakes clashes.\n\n### AFC rivals\n\nThe Dallas Cowboys' encounters with AFC opponents have produced fewer sustained rivalries than their NFC matchups, given the infrequency of inter-conference games outside of playoffs and scheduled contests. Nonetheless, the team's most prominent AFC rivalries stem from high-stakes historical clashes and regional competition, particularly with the Pittsburgh Steelers and Houston Texans. These relationships underscore themes of early NFL expansion struggles, Super Bowl showdowns, and intrastate pride.\n\nThe rivalry with the Pittsburgh Steelers originated on September 24, 1960, when the expansion Cowboys hosted their first-ever NFL game and suffered a 27-0 shutout loss to Pittsburgh at the Cotton Bowl. This matchup set the tone for a competitive series that has spanned over six decades, with the teams meeting 34 times in total, including three postseason games; Dallas holds an 18-16 all-time advantage. The Steelers and Cowboys have clashed in three Super Bowls, emblematic of their dominance in the 1970s and 1990s: Pittsburgh won Super Bowl X on January 18, 1976, by a score of 21-17, thanks to a late touchdown pass from Terry Bradshaw to John Stallworth; the Steelers followed with a 35-31 victory in Super Bowl XIII on January 21, 1979, overcoming a late Cowboys rally led by Roger Staubach; Dallas finally prevailed in Super Bowl XXX on January 28, 1996, defeating Pittsburgh 27-17 behind Larry Brown's two interceptions for touchdowns. These Super Bowl meetings, where Pittsburgh leads 2-1, cemented the rivalry as a cornerstone of NFL lore, pitting two of the league's most successful franchises against each other during eras of multiple championships.\n\nAnother key AFC rivalry emerged with the Houston Texans following their 2002 expansion entry into the league, fostering the intrastate Governor's Cup series also known as the Battle of Texas. The Texans claimed the inaugural game on October 6, 2002, upsetting Dallas 19-10 in a nationally televised contest that highlighted Houston's arrival as a challenger to the Cowboys' Texas dominance. Through seven meetings as of November 2025, the Cowboys lead the series 4-3, though the Texans secured the most recent victory on November 18, 2024, with a decisive 34-10 win driven by C.J. Stroud's passing and a stout defense that forced three turnovers. This rivalry, played irregularly based on NFL scheduling rotations, intensifies regional tensions between the two Texas cities and draws significant local attention, despite the Cowboys' historical edge in the state.\n\nHistorically, the Cowboys faced the Baltimore Colts in Super Bowl V on January 17, 1971, falling 16-13 on a last-second field goal by Jim O'Brien after a turnover-plagued game that featured 11 combined turnovers. This matchup represented Dallas' first Super Bowl appearance but did not develop into a lasting rivalry, especially after the Colts relocated to Indianapolis in 1984 and became the AFC South's Indianapolis Colts, with whom the Cowboys now hold a 10-4 all-time record in less contentious games.\n\n## Records and statistics\n\n### Season-by-season records\n\nThe Dallas Cowboys, founded in 1960 as an expansion team in the National Football League (NFL), have compiled a regular-season record of 569 wins, 423 losses, and 6 ties through the 2024 season, the second-most wins in NFL history behind only the Chicago Bears. This performance includes 36 playoff appearances, a 36-31 postseason record, and five Super Bowl victories (after the 1970, 1977, 1992, 1993, and 1995 seasons). Their success is marked by distinct eras of dominance, including an unprecedented streak of 20 consecutive winning seasons from 1966 to 1985, during which they qualified for the playoffs 18 times.\n\nIn their inaugural decade (1960–1969), the Cowboys struggled initially, posting a 0-11-1 record in 1960 and a 4-9-1 mark in 1961, but showed steady improvement under head coach Tom Landry. By 1966, they achieved their first winning season at 10-3-1, followed by a 9-5 record in 1967 and a 12-2 finish in 1968 that secured their first divisional title and an Eastern Conference Championship appearance. The 1969 season culminated in a 11-2-1 record and their first NFC Championship win, though they lost Super Bowl V to the Baltimore Colts. These early years laid the foundation for sustained excellence, with the team never finishing worse than third in the Capitol Division after 1965.\n\nThe 1970s represented a pinnacle of consistency, highlighted by the 20-year winning streak mentioned earlier. Notable seasons included 1970 (10-4, NFC Championship loss), 1971 (11-3, Super Bowl VI victory over the Miami Dolphins 24-3), 1975 (10-4, divisional playoff win), and 1977 (12-2, Super Bowl XII victory over the Denver Broncos 27-10). The Cowboys reached the playoffs in nine straight seasons from 1970 to 1978, winning three NFC titles, though they endured setbacks like the infamous \"Hail Mary\" loss to the Minnesota Vikings in 1975. This era established the Cowboys as \"America's Team,\" with a focus on defensive prowess and quarterback Roger Staubach's leadership.\n\nThe 1980s continued the streak until its end in 1985 (10-6), but included only two playoff berths amid increasing competition. The 1982 season, shortened by a players' strike to nine games, saw a 6-3 record and a wild-card appearance. Post-streak, the team endured a down period in the late 1980s, with records like 1-15 in 1989, marking their worst finish since 1960.\n\nUnder owner Jerry Jones and new head coach Jimmy Johnson, the 1990s ushered in a dynasty. The Cowboys posted 12-4 records in both 1991 and 1992, winning Super Bowl XXVII in 1993 over the Buffalo Bills 52-17. They repeated with 12-4 marks in 1993 and 1994, claiming Super Bowl XXVIII (30-13 over the Bills) and Super Bowl XXX (27-17 over the Pittsburgh Steelers). The 1995 season (12-4) added another Super Bowl win, followed by a 10-6 record in 1996 that secured a playoff berth (wild-card win over Minnesota and divisional loss to Carolina), before missing playoffs in 1997 and 1998, and returning in 1999 (8-8). This four-year run from 1992 to 1995 yielded an NFL-record 16 consecutive divisional game wins.\n\nThe 2000s and 2010s featured intermittent success amid high expectations. Under Bill Parcells (2003–2006), the team reached 10-6 in 2006 but lost in the wild card. Jason Garrett's tenure (2007–2019) included strong regular seasons like 13-3 in 2007 (divisional loss), 12-4 in 2014 (wild-card win over Detroit and divisional loss to Green Bay), and 13-3 in 2016 (divisional loss), but only two playoff wins total. The decade ended with 10-6 in 2018 (wild-card win over Seattle and divisional loss to Los Angeles).\n\nIn the 2020s, the Cowboys under Mike McCarthy showed resurgence but struggled in the postseason, with a transition to Brian Schottenheimer as head coach in 2025. Recent seasons include 6-10 in 2020, 12-5 in 2021 (wild-card loss to San Francisco), 12-5 in 2022 (divisional loss to San Francisco), 12-5 in 2023 (wild-card loss to Green Bay), and a disappointing 7-10 in 2024, missing the playoffs for the first time since 2020. As of November 19, 2025, the 2025 season is ongoing with a 4-5-1 record through ten games. These performances reflect a potent offense led by quarterback Dak Prescott but persistent playoff shortcomings.\n\n| Era/Decade | Notable Seasons | Key Achievements |\n|------------|-----------------|------------------|\n| 1960s     | 1966 (10-3-1), 1968 (12-2), 1969 (11-2-1) | First playoffs, NFC Championship |\n| 1970s     | 1971 (11-3), 1977 (12-2) | Two Super Bowls, nine straight playoff appearances |\n| 1980s     | 1982 (6-3), 1985 (10-6) | End of winning streak, limited success |\n| 1990s     | 1992–1995 (12-4 each) | Three Super Bowls, dynasty era |\n| 2000s–2010s | 2007 (13-3), 2014 (12-4), 2016 (13-3) | Consistent contenders, three divisional titles |\n| 2020s     | 2021–2023 (12-5 each), 2024 (7-10) | Four straight playoff berths, no deep runs |\n\nOverall, the Cowboys' records underscore their status as one of the NFL's most successful franchises, with 20 seasons of at least 12 wins and only 11 losing seasons in 65 years.\n\n### Career and single-season leaders\n\nThe Dallas Cowboys' career statistical leaders reflect the franchise's storied history of offensive dominance, particularly in the running and passing games, with legendary figures like Emmitt Smith and Tony Romo setting benchmarks that have endured for decades. Emmitt Smith holds the rushing crown with 17,162 yards and 153 touchdowns from 1990 to 2002, a testament to his role in three Super Bowl victories and consistent productivity over 201 games. In passing, Tony Romo leads with 34,183 yards and 248 touchdowns across 156 games from 2004 to 2016, showcasing the team's evolution toward high-volume aerial attacks in the modern era. Receiving records are topped by Jason Witten's 12,977 yards and 1,215 receptions from 2003 to 2019, highlighting the tight end's pivotal role in the Cowboys' balanced offenses.\n\nDefensively, the Cowboys' leaders underscore a legacy of opportunistic play, though sack totals from pre-1982 eras are unofficial. Mel Renfro amassed 52 career interceptions from 1964 to 1977, contributing to multiple championship runs with his ball-hawking skills at cornerback. For sacks, DeMarcus Ware recorded 117.0 from 2005 to 2013, establishing him as the modern-era benchmark for edge-rushing pressure. Scoring leadership is dominated by running backs and kickers, with Smith's 986 points (all from rushing) leading Rafael Septien's 874 points (primarily field goals) from 1978 to 1986.\n\nThe following table summarizes select career leaders across key categories:\n\n| Category          | Leader              | Stat Value | Years     |\n|-------------------|---------------------|------------|-----------|\n| Rushing Yards     | Emmitt Smith       | 17,162    | 1990–2002 |\n| Rushing TDs       | Emmitt Smith       | 153       | 1990–2002 |\n| Passing Yards     | Tony Romo          | 34,183    | 2004–2016 |\n| Passing TDs       | Tony Romo          | 248       | 2004–2016 |\n| Receiving Yards   | Jason Witten       | 12,977    | 2003–2019 |\n| Receiving Receptions | Jason Witten    | 1,215     | 2003–2019 |\n| Interceptions     | Mel Renfro         | 52        | 1964–1977 |\n| Sacks             | DeMarcus Ware      | 117.0     | 2005–2013 |\n| Points Scored     | Emmitt Smith       | 986       | 1990–2002 |\n\nSingle-season records often capture peak performances during playoff-contending years, emphasizing explosive output. DeMarco Murray's 1,845 rushing yards in 2014 set the franchise mark, powering a 12-win campaign and earning him Offensive Player of the Year honors. Emmitt Smith tied the NFL single-season rushing touchdown record with 25 in 1995, a feat that propelled the Cowboys to a Super Bowl title. In passing, Tony Romo's 4,903 yards in 2012 highlighted the team's shift to a pass-heavy scheme, though injuries limited postseason impact. Dak Prescott's 37 touchdown passes in 2021 underscored his rapid ascent, leading to a 12-5 record. Receiving peaks include CeeDee Lamb's 1,749 yards and 135 receptions in 2023, marking a breakout year in a high-octane offense. Kicker Brandon Aubrey set the scoring record with 157 points in 2023, driven by near-perfect field goal accuracy.\n\nKey single-season leaders are outlined below:\n\n| Category             | Leader              | Stat Value | Year |\n|----------------------|---------------------|------------|------|\n| Rushing Yards        | DeMarco Murray     | 1,845     | 2014 |\n| Rushing TDs          | Emmitt Smith       | 25        | 1995 |\n| Passing Yards        | Tony Romo          | 4,903     | 2012 |\n| Passing TDs          | Dak Prescott       | 37        | 2021 |\n| Receiving Yards      | CeeDee Lamb        | 1,749     | 2023 |\n| Receiving Receptions | CeeDee Lamb        | 135       | 2023 |\n| Points Scored        | Brandon Aubrey     | 157       | 2023 |\n\n## Personnel\n\n### Ownership and management\n\nThe Dallas Cowboys were founded in 1960 by Clint Murchison Jr., who served as the team's principal owner until 1983. Under Murchison, the franchise hired Tex Schramm as president and general manager, a role he held from 1960 to 1988, overseeing the team's early expansion and operations. In 1984, H.R. \"Bum\" Bright acquired the team as principal owner, maintaining control until 1988 amid financial challenges.\n\nJerry Jones purchased the Cowboys from Bright in 1989 for $140 million, becoming the principal owner, president, and general manager—a position he has held continuously since, serving as the de facto general manager without a separate title for that role. Jones' acquisition marked a pivotal shift, as he fired longtime coach Tom Landry and general manager Tex Schramm shortly after taking over, installing Jimmy Johnson as head coach and assuming direct control over personnel decisions. Under Jones' leadership, the Cowboys achieved three Super Bowl victories in the 1990s and have consistently ranked as one of the NFL's most valuable franchises, valued at $13 billion as of August 2025.\n\nThe current management structure is family-oriented, with Jones' children serving as co-owners and executives in key roles. Stephen Jones, Jerry's eldest son, is the chief operating officer and co-owner, playing a central role in football operations including roster building, draft preparation, and contract negotiations. Charlotte Jones Anderson, his daughter, serves as chief brand officer and co-owner, overseeing marketing initiatives such as the Dallas Cowboys Cheerleaders and the team's annual Thanksgiving halftime show. Jerry Jones Jr., another son, is the chief sales and marketing officer and co-owner, managing sales, merchandising, and digital media strategies. This hierarchical setup centralizes decision-making within the Jones family, blending business acumen with football oversight to drive the organization's operations.\n\n### Head coaches\n\nThe Dallas Cowboys have had ten head coaches since the franchise's founding in 1960. Tom Landry, the inaugural coach, holds the distinction of the longest tenure at 29 seasons and the most regular-season victories with 250, while leading the team to five Super Bowl appearances and two championships. The team's head coaching history is marked by eras of dominance under Landry and the Jerry Jones ownership starting in 1989, with three Super Bowl wins in the 1970s and 1990s, followed by a period of postseason contention but no additional titles under later coaches.\n\nLandry, who also served as defensive coordinator for the New York Giants before joining the expansion Cowboys, is credited with pioneering the 4-3 defense—a formation with four linemen and three linebackers that revolutionized NFL defensive schemes by emphasizing speed and coverage—and implementing the \"Flex\" defense to counter mobile quarterbacks. Under his leadership from 1960 to 1988, the Cowboys achieved 20 consecutive winning seasons from 1966 to 1985, 18 playoff berths, and victories in Super Bowl VI (1972 season) and Super Bowl XII (1978 season), earning him NFL Coach of the Year honors in 1966. His regular-season record stood at 250–162–6, with a 20–16 playoff mark.\n\nAfter Jones purchased the team and fired Landry in 1989, Jimmy Johnson, a college coaching standout at the University of Miami, assumed the role and engineered a rapid turnaround through aggressive drafting and trades, including selecting quarterback Troy Aikman first overall in 1989. Johnson's five-year stint from 1989 to 1993 yielded a 44–36 regular-season record and a dominant 7–1 playoff performance, culminating in consecutive Super Bowl wins in XXVII (1993) and XXVIII (1994), the first such feat in the NFL's modern era; he was named NFL Coach of the Year in 1990.\n\nBarry Switzer, a former University of Oklahoma head coach, replaced Johnson in 1994 and maintained the momentum with a roster rich in talent from Johnson's drafts, posting a 40–24 regular-season record over four years. His tenure included a 5–2 playoff run, highlighted by a 27–17 victory over the Pittsburgh Steelers in Super Bowl XXX (1996 season), bringing the Cowboys' total to five Lombardi Trophies.\n\nThe post-Switzer era saw more turnover, with no coach lasting beyond seven seasons. Chan Gailey (1998–1999) compiled an 18–14 regular-season record but went 0–2 in the playoffs. Dave Campo (2000–2002) managed only a 15–33 mark without postseason play. Bill Parcells (2003–2006), a two-time Super Bowl winner with other teams, posted 34–30 in the regular season and reached the playoffs twice but lost both games (0–2). Wade Phillips (2007–2010) achieved a strong 34–22 regular-season record, including three playoff appearances, though his team went 1–2 in the postseason.\n\nJason Garrett, who began as interim coach in 2008 before taking the full role from 2011 to 2019 (overall 2010–2019), led the Cowboys to a 85–67 regular-season record and five playoff berths, earning NFL Coach of the Year in 2016 for guiding the team to a 13–3 mark; however, his playoff record was 2–3. Mike McCarthy (2020–2024), previously a Super Bowl winner with the Green Bay Packers, recorded 49–35 in the regular season with one playoff victory (1–3 overall), including a 12–5 campaign in 2021.\n\nBrian Schottenheimer became the tenth head coach on January 24, 2025, promoted from offensive coordinator after McCarthy's dismissal following a 7–10 season in 2024. With 26 years of NFL coaching experience, including prior head coaching stints with the St. Louis Rams and New York Jets, Schottenheimer's Cowboys entered the 2025 season aiming to rebound; as of December 3, 2025, the team stands at 6–5–1, placing second in the NFC East.\n\n| Head Coach          | Tenure      | Regular Season (W–L–T) | Playoff (W–L) | Super Bowls Won |\n|---------------------|-------------|------------------------|---------------|-----------------|\n| Tom Landry         | 1960–1988  | 250–162–6             | 20–16        | 2              |\n| Jimmy Johnson      | 1989–1993  | 44–36                 | 7–1          | 2              |\n| Barry Switzer      | 1994–1997  | 40–24                 | 5–2          | 1              |\n| Chan Gailey        | 1998–1999  | 18–14                 | 0–2          | 0              |\n| Dave Campo         | 2000–2002  | 15–33                 | 0–0          | 0              |\n| Bill Parcells      | 2003–2006  | 34–30                 | 0–2          | 0              |\n| Wade Phillips      | 2007–2010  | 34–22                 | 1–2          | 0              |\n| Jason Garrett      | 2010–2019  | 85–67                 | 2–3          | 0              |\n| Mike McCarthy      | 2020–2024  | 49–35                 | 1–3          | 0              |\n| Brian Schottenheimer | 2025–present | 6–5–1             | 0–0          | 0              |\n\n*Note: Records sourced from historical data through 2024; 2025 regular-season record as of December 3. Playoff and Super Bowl data reflect completed tenures.*\n### Current roster\n\nAs of November 19, 2025, the Dallas Cowboys' active 53-man roster features a mix of established veterans, recent draft picks, and key acquisitions, reflecting general manager Jerry Jones' strategy to rebuild the defense after trading star linebacker Micah Parsons to the Green Bay Packers in August 2025 for defensive tackle Kenny Clark and draft picks. The team has made several moves, including trades for wide receiver George Pickens and linebacker Kenneth Murray, to address offensive and defensive needs during the 2025 season. Below is the current active roster, organized by position group.\n\n### Quarterbacks\nThe quarterback position is led by franchise cornerstone Dak Prescott, supported by backup Joe Milton III, acquired via trade.\n\n| Player          | Number | Notes                  |\n|-----------------|--------|------------------------|\n| Dak Prescott   | 4     | Starter               |\n| Joe Milton III | 10    | Backup                |\n\n### Running Backs\nThe running back room emphasizes versatility, with Javonte Williams as a lead back alongside rookie Jaydon Blue.\n\n| Player          | Number | Notes                  |\n|-----------------|--------|------------------------|\n| Javonte Williams| 33    | Veteran lead back     |\n| Jaydon Blue    | 23    | Rookie                |\n| Hunter Luepke  | 40    | Fullback/special teams|\n\n### Wide Receivers\nCeeDee Lamb remains the focal point of the passing attack, complemented by trade acquisition George Pickens for added explosiveness.\n\n| Player         | Number | Notes                     |\n|---------------|--------|---------------------------|\n| CeeDee Lamb   | 88    | All-Pro primary receiver |\n| George Pickens| 3     | Trade acquisition        |\n| Jalen Tolbert | 1     | Depth                    |\n| Ryan Flournoy | 19    | Developmental            |\n| KaVontae Turpin| 9    | Returner/gadget player   |\n\n### Tight Ends\nJake Ferguson anchors the position with his blocking and receiving skills, supported by depth pieces.\n\n| Player          | Number | Notes                  |\n|-----------------|--------|------------------------|\n| Jake Ferguson  | 87    | Starting tight end    |\n| Luke Schoonmaker| 86  | Depth                 |\n| Brevyn Spann-Ford| 89  | Rookie depth          |\n\n### Offensive Line\nThe offensive line provides protection for Prescott, with tackles Terence Steele and Tyler Guyton forming key parts, though injuries have tested depth throughout 2025.\n\n| Player         | Position | Number | Notes                  |\n|---------------|----------|--------|------------------------|\n| Terence Steele| OT      | 78    | Right tackle starter   |\n| Tyler Guyton  | OT      | 60    | Rookie left tackle     |\n| Tyler Smith   | G       | 73    | Versatile guard        |\n| Hakeem Adeniji| OT      | 75    | Swing tackle           |\n| Cooper Beebe  | C       | 56    | Center starter         |\n| T.J. Bass     | G       | 66    | Guard depth            |\n| Brock Hoffman | C       | 67    | Center/guard           |\n| Nathan Thomas | OT      | 71    | Tackle depth           |\n| Tyler Booker  | OG      | 52    | Rookie guard           |\n\n### Defensive Line\nThe defensive line was revamped post-Parsons trade, with Kenny Clark providing elite interior disruption alongside Osa Odighizuwa and edge rushers like Jadeveon Clowney.\n\n| Player            | Position | Number | Notes                       |\n|-------------------|----------|--------|-----------------------------|\n| Kenny Clark      | DT      | 95    | Trade acquisition, All-Pro |\n| Osa Odighizuwa   | DT      | 97    | Starting defensive tackle  |\n| Solomon Thomas   | DT      | 90    | Interior rotation          |\n| Jay Toia         | DT      | 93    | Depth                      |\n| Jadeveon Clowney | DE      | -     | Veteran edge rusher        |\n| Dante Fowler Jr. | DE      | 13    | Rotational pass rusher     |\n| James Houston    | DE      | 53    | Depth                      |\n| Sam Williams     | DE      | 54    | Young pass rusher          |\n| Donovan Ezeiruaku| DE      | 41    | Rookie                     |\n\n### Linebackers\nThe linebacker group features veteran Kenneth Murray for coverage and run defense, with rookies providing depth in the post-Parsons era.\n\n| Player        | Number | Notes                       |\n|---------------|--------|-----------------------------|\n| Kenneth Murray| 59    | Veteran middle linebacker  |\n| DeMarvion Overshown| 0  | Sam linebacker             |\n| Shemar James  | 50    | Rookie coverage specialist |\n| Marist Liufau | 35    | Rotational                 |\n\n### Defensive Backs\nThe secondary is led by cornerback DaRon Bland and safety Malik Hooker, with trade acquisition Kaiir Elam adding depth at corner.\n\n| Player                | Position | Number | Notes                       |\n|-----------------------|----------|--------|-----------------------------|\n| DaRon Bland          | CB      | 26    | Interception leader        |\n| Kaiir Elam           | CB      | 20    | Trade acquisition          |\n| Caelen Carson        | CB      | 21    | Slot corner                |\n| Trikweze Bridges     | CB      | 25    | Depth                      |\n| C.J. Goodwin         | CB      | 29    | Rotational veteran         |\n| Malik Hooker         | S       | 28    | Starting free safety       |\n| Donovan Wilson       | S       | 6     | Strong safety              |\n| Markquese Bell       | S       | 14    | Depth                      |\n| Reddy Steward        | CB      | 27    | Special teams              |\n\n### Special Teams\nThe unit remains stable, with kicker Brandon Aubrey continuing his accuracy streak and punter Bryan Anger providing consistent field position.\n\n| Player        | Position | Number | Notes                  |\n|---------------|----------|--------|------------------------|\n| Brandon Aubrey| K       | 17    | Pro Bowl kicker       |\n| Bryan Anger   | P       | 5     | Veteran punter        |\n| Trent Sieg    | LS      | 44    | Long snapper          |\n\n### Hall of Famers and honorees\n\nThe Dallas Cowboys franchise has produced a remarkable number of inductees into the Pro Football Hall of Fame, with 32 members as of 2025, tying the franchise for the most in NFL history. These inductees include players, coaches, and executives who contributed significantly during their tenures with the team, though some had brief stints that were pivotal to their overall legacies. Notable examples include defensive tackle Bob Lilly, inducted in 1980 after anchoring the Cowboys' \"Doomsday Defense\" from 1961 to 1974, and quarterback Roger Staubach, a 1985 inductee known for leading the team to two Super Bowl victories in the 1970s. Other prominent figures encompass running back Emmitt Smith, the NFL's all-time leading rusher inducted in 2010 after amassing 17,162 yards primarily with Dallas from 1990 to 2002, and head coach Tom Landry, a 1990 inductee who guided the Cowboys to 20 consecutive winning seasons from 1966 to 1985.\n\nThe complete list of Cowboys-affiliated Pro Football Hall of Famers, sorted by induction year, highlights the team's sustained excellence across eras:\n\n| Name              | Position              | Years with Cowboys | Induction Year |\n|-------------------|-----------------------|--------------------|----------------|\n| Forrest Gregg     | Tackle/Guard          | 1971              | 1977           |\n| Lance Alworth     | Wide Receiver         | 1971–1972         | 1978           |\n| Herb Adderley     | Cornerback            | 1970–1972         | 1980           |\n| Bob Lilly         | Defensive Tackle      | 1961–1974         | 1980           |\n| Mike Ditka        | Tight End             | 1969              | 1988           |\n| Roger Staubach    | Quarterback           | 1969–1979         | 1985           |\n| Tom Landry        | Head Coach            | 1960–1988         | 1990           |\n| Tex Schramm       | General Manager       | 1960–1989         | 1991           |\n| Tony Dorsett      | Running Back          | 1977–1987         | 1994           |\n| Randy White       | Defensive Tackle      | 1975–1988         | 1994           |\n| Jackie Smith      | Tight End             | 1973–1978         | 1994           |\n| Tommy McDonald    | Wide Receiver         | 1964              | 1998           |\n| Mel Renfro        | Cornerback            | 1964–1977         | 1996           |\n| Troy Aikman       | Quarterback           | 1989–2000         | 2006           |\n| Rayfield Wright   | Offensive Tackle      | 1967–1979         | 2006           |\n| Michael Irvin     | Wide Receiver         | 1988–1999         | 2007           |\n| Bob Hayes         | Wide Receiver         | 1965–1974         | 2009           |\n| Emmitt Smith      | Running Back          | 1990–2002         | 2010           |\n| Deion Sanders     | Cornerback            | 1995–1999         | 2011           |\n| Charles Haley     | Defensive End         | 1992–1996         | 2015           |\n| Larry Allen       | Guard/Tackle          | 1994–2005         | 2013           |\n| Bill Parcells     | Head Coach            | 2003–2006         | 2013           |\n| Jerry Jones       | Owner/General Manager | 1989–present      | 2017           |\n| Terrell Owens     | Wide Receiver         | 2006–2008         | 2018           |\n| Gil Brandt        | Personnel Director    | 1960–1989         | 2019           |\n| Cliff Harris      | Safety                | 1970–1979         | 2020           |\n| Jimmy Johnson     | Head Coach            | 1989–1993         | 2020           |\n| Drew Pearson      | Wide Receiver         | 1973–1983         | 2021           |\n| Chuck Howley      | Linebacker            | 1961–1973         | 2023           |\n| DeMarcus Ware     | Linebacker            | 2005–2013         | 2023           |\n| Zach Thomas       | Linebacker            | 2007–2008         | 2023           |\n| Harold Carmichael | Wide Receiver         | 1984              | 2020           |\n\nIn addition to the Pro Football Hall of Fame, the Cowboys maintain their own Ring of Honor at AT\\u0026T Stadium, established in 1975 to recognize individuals who made outstanding contributions to the franchise. As of 2025, the Ring includes 24 members, with 16 also enshrined in the Pro Football Hall of Fame, underscoring the overlap between team-specific accolades and league-wide recognition. The Ring honors players, coaches, and executives, with inductions often occurring during home games to celebrate their impact on the team's five Super Bowl championships and storied history. Recent additions include head coach Jimmy Johnson in 2023, credited with building the roster that won three Super Bowls in four years (1992–1995), and linebacker DeMarcus Ware in 2023, who recorded 117 sacks for Dallas from 2005 to 2013.\n\nThe full Ring of Honor membership, listed by induction year, reflects the Cowboys' emphasis on defensive prowess, quarterback leadership, and front-office innovation:\n\n| Name              | Position                  | Years Active    | Induction Year |\n|-------------------|---------------------------|-----------------|----------------|\n| Bob Lilly         | DT                        | 1961–1974      | 1975           |\n| Don Meredith      | QB                        | 1960–1968      | 1976           |\n| Don Perkins       | RB                        | 1961–1968      | 1976           |\n| Chuck Howley      | LB                        | 1961–1973      | 1977           |\n| Mel Renfro        | CB                        | 1964–1977      | 1981           |\n| Roger Staubach    | QB                        | 1969–1979      | 1983           |\n| Lee Roy Jordan    | LB                        | 1963–1976      | 1989           |\n| Tom Landry        | Head Coach                | 1960–1988      | 1993           |\n| Tony Dorsett      | RB                        | 1977–1987      | 1994           |\n| Randy White       | DT                        | 1975–1988      | 1994           |\n| Bob Hayes         | WR                        | 1965–1974      | 2001           |\n| Tex Schramm       | General Manager           | 1959–1989      | 2003           |\n| Cliff Harris      | S                         | 1970–1979      | 2004           |\n| Rayfield Wright   | OT                        | 1967–1979      | 2004           |\n| Troy Aikman       | QB                        | 1989–2000      | 2005           |\n| Michael Irvin     | WR                        | 1988–1999      | 2005           |\n| Emmitt Smith      | RB                        | 1990–2002      | 2005           |\n| Drew Pearson      | WR                        | 1973–1983      | 2011           |\n| Charles Haley     | DE                        | 1992–1996      | 2011           |\n| Larry Allen       | OL                        | 1994–2005      | 2013           |\n| Darren Woodson    | S                         | 1992–2004      | 2015           |\n| Gil Brandt        | VP of Player Personnel    | 1960–1988      | 2018           |\n| DeMarcus Ware     | LB                        | 2005–2013      | 2023           |\n| Jimmy Johnson     | Head Coach                | 1989–1993      | 2023           |\n\nThese honors collectively illustrate the Cowboys' legacy as \"America's Team,\" with inductees spanning from the franchise's inaugural 1960 season to modern eras, emphasizing durability, innovation, and championship success.\n\n## Media\n\n### Radio and television broadcasts\n\nThe Dallas Cowboys' radio broadcasts are primarily handled by the Dallas Cowboys Radio Network, a regional syndicate that covers games across multiple states. The flagship station is KRLD-FM (105.3 The Fan) in the Dallas-Fort Worth area, which has aired Cowboys games since 2009 under an agreement with Audacy. Play-by-play announcer Brad Sham has served as the lead voice since 1985, following his start as a color analyst in 1976 alongside Verne Lundquist; Sham's calls have become synonymous with key moments in franchise history, earning him induction into the Texas Sports Hall of Fame. Color commentary is provided by former Cowboys quarterback Babe Laufenberg, while sideline reporting is handled by Kristi Scales. The network includes over 70 affiliate stations, primarily in Texas, but extending to parts of Arkansas, Louisiana, New Mexico, Oklahoma, and beyond through a partnership with Compass Media Networks for expanded coverage. Preseason and regular-season games are broadcast live, with Westwood One handling national primetime and postseason distributions.\n\nSpanish-language radio broadcasts are available through select affiliates, including KMVK 107.5 FM in the Dallas-Fort Worth area as the flagship for the market. These simulcasts feature dedicated announcers and reach Hispanic audiences in Texas and neighboring states. Additionally, games can be streamed via the NFL+ app, SiriusXM NFL Radio, and the official Cowboys app for in-market listeners.\n\nTelevision broadcasts of Cowboys games follow the NFL's national television agreements, with the team appearing frequently on major networks due to its popularity and primetime scheduling. As an NFC East member, most regular-season Sunday afternoon games air on FOX, which holds rights to NFC matchups; in the Dallas-Fort Worth market, these are carried on KDFW (FOX 4). Interconference games against AFC opponents are typically on CBS, broadcast locally on KTVT (CBS 11), the team's longstanding flagship station since 1999. Primetime games include Sunday Night Football on NBC (local affiliate KXAS-TV, NBC 5), Monday Night Football on ESPN/ABC (WFAA, ABC 8), and Thursday Night Football on Amazon Prime Video or NFL Network. The 2025 season featured seven FOX games, three on NBC, two each on CBS and ESPN, one on Prime Video, and one on Netflix, highlighting the team's high visibility. Preseason games are often simulcast on local FOX and CBS affiliates, with national coverage on NFL Network.\n\nThe Dallas Cowboys Television Network extends coverage through a syndicate of more than 30 affiliates across Texas, Oklahoma, Arkansas, Louisiana, and New Mexico, providing English-language broadcasts on NBC, FOX, ABC, and CBS stations, as well as CW affiliates for select games. Spanish-language telecasts, known as the Cadena de Plata, air on 20 Telemundo and UniMás affiliates, including KXTX (Telemundo 39) in Dallas. Streaming options include Paramount+ for CBS games, Peacock for NBC, YouTube TV and Fubo for FOX, and the NFL+ app for mobile access, subject to local blackout restrictions. Historically, the Cowboys' broadcasts have evolved with NFL media rights expansions, notably influenced by owner Jerry Jones's role in negotiating lucrative deals that boosted the league's television revenue starting in the 1990s.",
  "external_references": [
    {
      "text": "Dallas Cowboys",
      "url": "https://operations.nfl.com/learn-the-game/nfl-basics/team-histories/national-football-conference/east/dallas-cowboys/",
      "domain": "operations.nfl.com",
      "type": "citation"
    },
    {
      "text": "How The Dallas Cowboys Were Born In 1960",
      "url": "https://www.dallascowboys.com/news/how-the-dallas-cowboys-were-born-in-1960",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "attstadium.com",
      "url": "https://attstadium.com/",
      "domain": "attstadium.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys",
      "url": "https://www.forbes.com/teams/dallas-cowboys/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Index.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/index.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Brian Schottenheimer",
      "url": "https://www.dallascowboys.com/team/coaches-roster/brian-schottenheimer",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Team History",
      "url": "https://www.profootballhof.com/teams/dallas-cowboys/team-history/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "80088196007",
      "url": "https://cowboyswire.usatoday.com/story/sports/nfl/cowboys/2020/01/27/dallas-cowboys-60th-anniversary-story-of-the-franchise-history1960/80088196007/",
      "domain": "cowboyswire.usatoday.com",
      "type": "citation"
    },
    {
      "text": "Landto0.htm",
      "url": "https://www.pro-football-reference.com/coaches/LandTo0.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Tom Landry",
      "url": "https://www.profootballhof.com/players/tom-landry/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "Jaworski.html",
      "url": "http://www.espn.com/nfl/landry/jaworski.html",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Roh Tom Landry",
      "url": "https://www.dallascowboys.com/team/roh-tom-landry",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Pro Football Cowboys Buyer Hires A New Coach.html",
      "url": "https://www.nytimes.com/1989/02/26/sports/pro-football-cowboys-buyer-hires-a-new-coach.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "9437607838400",
      "url": "https://www.upi.com/Archives/1989/04/06/Cowboys-sign-Johnson-to-10-year-contract/9437607838400/",
      "domain": "upi.com",
      "type": "citation"
    },
    {
      "text": "Jimmy Johnson Bio",
      "url": "https://pro-football-history.com/coach/206/jimmy-johnson-bio",
      "domain": "pro-football-history.com",
      "type": "citation"
    },
    {
      "text": "Herschel Walker Trade 25th Anniversary Run Birthed Dallas Cowboys Dynasty",
      "url": "https://www.espn.com/nfl/story/_/id/11659891/herschel-walker-trade-25th-anniversary-run-birthed-dallas-cowboys-dynasty",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Game Changers 39",
      "url": "https://www.nfl.com/100/originals/100-greatest/game-changers-39",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "How 1989 Draft Shaped The Cowboys Dynasty",
      "url": "https://www.dallascowboys.com/news/how-1989-draft-shaped-the-cowboys-dynasty",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Drafted The Foundations For A Dynasty In 1991",
      "url": "https://playactionpast.wordpress.com/2021/04/27/dallas-cowboys-drafted-the-foundations-for-a-dynasty-in-1991/",
      "domain": "playactionpast.wordpress.com",
      "type": "citation"
    },
    {
      "text": "Bills Cowboys",
      "url": "https://www.espn.com/nfl/game/_/gameId/130131006/bills-cowboys",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "News The Nfl S Largest Trade",
      "url": "https://www.profootballhof.com/news/2009/10/news-the-nfl-s-largest-trade/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Bills",
      "url": "https://www.espn.com/nfl/game/_/gameId/140130002/cowboys-bills",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "199401300buf.htm",
      "url": "https://www.pro-football-reference.com/boxscores/199401300buf.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Still Wonder What If As Jimmy Johnson Enters Hof",
      "url": "https://www.espn.com/blog/dallas-cowboys/post/_/id/4773853/dallas-cowboys-still-wonder-what-if-as-jimmy-johnson-enters-hof",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Roh Jimmy Johnson",
      "url": "https://www.dallascowboys.com/team/roh-jimmy-johnson",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 1994 03 31 Sp 40419 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-1994-03-31-sp-40419-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Entry",
      "url": "https://www.okhistory.org/publications/enc/entry?entry=SW006",
      "domain": "okhistory.org",
      "type": "citation"
    },
    {
      "text": "1994.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/1994.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Switba0.htm",
      "url": "https://www.pro-football-reference.com/coaches/SwitBa0.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Rank 1995 Team Wins Unprecedented Third Super Bowl In Four Years",
      "url": "https://www.espn.com/blog/dallas-cowboys/post/_/id/4749292/cowboys-rank-1995-team-wins-unprecedented-third-super-bowl-in-four-years",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "1995.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/1995.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Specialdelivery The Steelers Handed The Cowboys Two Ugly Interceptions And A 27 17 Victory That Kept The Nfcs Super Bowl Streak Alive",
      "url": "https://vault.si.com/vault/1996/02/05/specialdelivery-the-steelers-handed-the-cowboys-two-ugly-interceptions-and-a-27-17-victory-that-kept-the-nfcs-super-bowl-streak-alive",
      "domain": "vault.si.com",
      "type": "citation"
    },
    {
      "text": "1996.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/1996.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "1997.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/1997.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Switzer Arrested On Gun Charge.html",
      "url": "https://www.nytimes.com/1997/08/05/sports/switzer-arrested-on-gun-charge.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "5dc16e09 Fcfb 41eb Bc1c 109a01ed69c3",
      "url": "https://www.washingtonpost.com/archive/sports/1997/08/07/jones-fines-switzer-75000/5dc16e09-fcfb-41eb-bc1c-109a01ed69c3/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "50577788007",
      "url": "https://www.southcoasttoday.com/story/sports/1998/01/10/switzer-era-ends-in-dallas/50577788007/",
      "domain": "southcoasttoday.com",
      "type": "citation"
    },
    {
      "text": "Coaches.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/coaches.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "2003.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/2003.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Dal",
      "url": "https://www.pro-football-reference.com/teams/dal/",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Draft.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/draft.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Highs Lows Of Wade Phillips Era",
      "url": "https://www.espn.com/blog/dallas/cowboys/post/_/id/4674207/highs-lows-of-wade-phillips-era",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "As Jason Garrett Heads To The Giants Lets Close Out His Cowboys Era",
      "url": "https://www.espn.com/blog/dallas/cowboys/post/_/id/4770766/as-jason-garrett-heads-to-the-giants-lets-close-out-his-cowboys-era",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Mike Mccarthy Officially Hired As Head Coach",
      "url": "https://www.dallascowboys.com/news/mike-mccarthy-officially-hired-as-head-coach",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Source Cowboys Hire Mike Mccarthy New Coach Mike Nolan Defensive Coordinator",
      "url": "https://www.espn.com/nfl/story/_/id/28433429/source-cowboys-hire-mike-mccarthy-new-coach-mike-nolan-defensive-coordinator",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Mike Mccarthy Signs Five Year Deal To Be Cowboys Hc 0ap3000001094867",
      "url": "https://www.nfl.com/news/mike-mccarthy-signs-five-year-deal-to-be-cowboys-hc-0ap3000001094867",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "2021.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/2021.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "2022.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/2022.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Mccami0.htm",
      "url": "https://www.pro-football-reference.com/coaches/McCaMi0.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "5 What Is Mike Mccarthy S Biggest Challenge",
      "url": "https://www.dallascowboys.com/news/5-what-is-mike-mccarthy-s-biggest-challenge",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Hire Coordinator Brian Schottenheimer Head Coach",
      "url": "https://www.espn.com/nfl/story/_/id/43552501/cowboys-hire-coordinator-brian-schottenheimer-head-coach",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Hire Offensive Coordinator Brian Schottenheimer As Next Head Coach",
      "url": "https://www.nfl.com/news/cowboys-hire-offensive-coordinator-brian-schottenheimer-as-next-head-coach",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=Yi3iyl09B10",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "85977348007",
      "url": "https://www.usatoday.com/story/sports/nfl/2025/09/04/brian-schottenheimer-coaching-timeline-history-cowboys/85977348007/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Sources Micah Parsons Traded Packers Gets Record Contract",
      "url": "https://www.espn.com/nfl/story/_/id/46098144/sources-micah-parsons-traded-packers-gets-record-contract",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2015 Coaching Staff Finalized Brian Schottenheimer Builds Impressive Staff With Mix Of Experience And Potential",
      "url": "https://www.dallascowboys.com/news/2015-coaching-staff-finalized-brian-schottenheimer-builds-impressive-staff-with-mix-of-experience-and-potential",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Coach Brian Schottenheimer Nfl Training Camp",
      "url": "https://www.nytimes.com/athletic/6502460/2025/07/22/dallas-cowboys-coach-brian-schottenheimer-nfl-training-camp/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Nfl Dallas Cowboys Brian Marty Schottenheimer",
      "url": "https://www.espn.com/nfl/story/_/id/46147004/nfl-dallas-cowboys-brian-marty-schottenheimer",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2025.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/2025.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=QlS4qdCZyks",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "86927068007",
      "url": "https://cowboyswire.usatoday.com/story/sports/nfl/cowboys/2025/10/27/schottenheimer-on-cowboys-loss-discipline-and-consistency-issues/86927068007/",
      "domain": "cowboyswire.usatoday.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Second Year De Marshawn Kneeland Dies 24",
      "url": "https://www.espn.com/nfl/story/_/id/46869849/cowboys-second-year-de-marshawn-kneeland-dies-24",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Schedule",
      "url": "https://www.dallascowboys.com/schedule/",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Brian Schottenheimer Displeased With 3 4 1 Start Can Take Stats On Offense And Shove Em",
      "url": "https://www.nfl.com/news/cowboys-brian-schottenheimer-displeased-with-3-4-1-start-can-take-stats-on-offense-and-shove-em",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Brian Schottenheimer Reveals Team Two Major Returns After Bye",
      "url": "https://www.si.com/nfl/cowboys/onsi/news/cowboys-brian-schottenheimer-reveals-team-two-major-returns-after-bye",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Brian Schottenheimer This Week Is Very Important For Us",
      "url": "https://www.dallascowboys.com/video/brian-schottenheimer-this-week-is-very-important-for-us",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Brian Schottenheiemer Matt Eberflus Playoffs Nfc Broncos Game",
      "url": "https://www.bloggingtheboys.com/dallas-cowboys-roster/185887/brian-schottenheiemer-matt-eberflus-playoffs-nfc-broncos-game",
      "domain": "bloggingtheboys.com",
      "type": "citation"
    },
    {
      "text": "197201160dal.htm",
      "url": "https://www.pro-football-reference.com/boxscores/197201160dal.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Super Bowl Vi Rematch 71 Cowboys Among Greatest Teams Ever 0ap3000000584209",
      "url": "https://www.nfl.com/news/super-bowl-vi-rematch-71-cowboys-among-greatest-teams-ever-0ap3000000584209",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Teams 34",
      "url": "https://www.nfl.com/100/originals/100-greatest/teams-34",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Moments Shaped 60 Years Dallas Cowboys Football",
      "url": "https://www.espn.com/espn/feature/story/_/id/28837985/moments-shaped-60-years-dallas-cowboys-football",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "1977",
      "url": "https://www.dallascowboys.com/schedule/1977/",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Superbowl12 A.htm",
      "url": "https://goldenrankings.com/SuperBowl12-A.htm",
      "domain": "goldenrankings.com",
      "type": "citation"
    },
    {
      "text": "Gamelog",
      "url": "https://www.pro-football-reference.com/teams/dal/1977/gamelog",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "197801150dal.htm",
      "url": "https://www.pro-football-reference.com/boxscores/197801150dal.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Doomsday In The Dome That Ferocious Dallas Defense Forced And Recovered Four Denver Fumbles And Intercepted Four Passes As The Cowboys Belted The Broncos In The Super Bowl",
      "url": "https://vault.si.com/vault/1978/01/23/doomsday-in-the-dome-that-ferocious-dallas-defense-forced-and-recovered-four-denver-fumbles-and-intercepted-four-passes-as-the-cowboys-belted-the-broncos-in-the-super-bowl",
      "domain": "vault.si.com",
      "type": "citation"
    },
    {
      "text": "199301310buf.htm",
      "url": "https://www.pro-football-reference.com/boxscores/199301310buf.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Super Bowl Xxvii Xxvii Marks The Spot Dallas Is Back On Top.html",
      "url": "https://www.nytimes.com/1993/02/01/sports/super-bowl-xxvii-xxvii-marks-the-spot-dallas-is-back-on-top.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Teams 23",
      "url": "https://www.nfl.com/100/originals/100-greatest/teams-23",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "199601280dal.htm",
      "url": "https://www.pro-football-reference.com/boxscores/199601280dal.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "This Date In History Cowboys Fight Off Steelers To Win Third Super Bowl I 371381",
      "url": "https://www.dallascowboys.com/news/this-date-in-history-cowboys-fight-off-steelers-to-win-third-super-bowl-i-371381",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "The Pittsburgh Steelers History Vs The Dallas Cowboys",
      "url": "https://www.profootballhof.com/news/2020/03/the-pittsburgh-steelers-history-vs-the-dallas-cowboys/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "Playoffs.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/playoffs.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Team Greats",
      "url": "https://www.profootballhof.com/teams/dallas-cowboys/team-greats/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "Mind Blowing Stats For The Dallas Cowboys 0ap3000000504098",
      "url": "https://www.nfl.com/photos/mind-blowing-stats-for-the-dallas-cowboys-0ap3000000504098",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "The Worlds 50 Most Valuable Sports Teams 2024",
      "url": "https://www.forbes.com/sites/brettknight/2024/12/12/the-worlds-50-most-valuable-sports-teams-2024/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Cotton Bowl",
      "url": "https://www.stadiumsofprofootball.com/stadiums/cotton-bowl/",
      "domain": "stadiumsofprofootball.com",
      "type": "citation"
    },
    {
      "text": "Cotton Bowl",
      "url": "https://www.tshaonline.org/handbook/entries/cotton-bowl",
      "domain": "tshaonline.org",
      "type": "citation"
    },
    {
      "text": "Dal98.htm",
      "url": "https://www.pro-football-reference.com/stadiums/DAL98.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Stadium",
      "url": "https://www.dallascowboys.com/stadium/",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Texas Stadium",
      "url": "https://www.stadiumsofprofootball.com/stadiums/texas-stadium/",
      "domain": "stadiumsofprofootball.com",
      "type": "citation"
    },
    {
      "text": "Dal00.htm",
      "url": "https://www.pro-football-reference.com/stadiums/DAL00.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "At T Stadium",
      "url": "https://www.dallassports.org/directory/at-t-stadium/",
      "domain": "dallassports.org",
      "type": "citation"
    },
    {
      "text": "7 Things You Probably Didnt Know About The Dallas Cowboys Att Stadium",
      "url": "https://www.hksinc.com/our-news/articles/7-things-you-probably-didnt-know-about-the-dallas-cowboys-att-stadium/",
      "domain": "hksinc.com",
      "type": "citation"
    },
    {
      "text": "Training Camps.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/training-camps.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Training Camp Through The Years 407896",
      "url": "https://www.dallascowboys.com/photos/training-camp-through-the-years-407896",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "History Of Dallas Cowboys Training Camp Locations",
      "url": "https://1063thebuzz.com/history-of-dallas-cowboys-training-camp-locations/",
      "domain": "1063thebuzz.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Announce Return To Oxnard For Training Camp",
      "url": "https://www.nfl.com/news/cowboys-announce-return-to-oxnard-for-training-camp",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Training Camp",
      "url": "https://visitoxnard.com/dallas-cowboys-training-camp/",
      "domain": "visitoxnard.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Training Camp 2025",
      "url": "https://www.oxnard.gov/event/dallas-cowboys-training-camp-2025",
      "domain": "oxnard.gov",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Logo",
      "url": "https://1000logos.net/dallas-cowboys-logo/",
      "domain": "1000logos.net",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Logo History Dallas Cowboys Star And Slogan",
      "url": "https://fabrikbrands.com/branding-matters/logofile/dallas-cowboys-logo-history-dallas-cowboys-star-and-slogan/",
      "domain": "fabrikbrands.com",
      "type": "citation"
    },
    {
      "text": "Cowboys First Equip Manager Creator Of Star Passes Away 334971",
      "url": "https://www.dallascowboys.com/news/cowboys-first-equip-manager-creator-of-star-passes-away-334971",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Logos",
      "url": "https://www.sportslogos.net/logos/list_by_team/165/Dallas-Cowboys-Logos/",
      "domain": "sportslogos.net",
      "type": "citation"
    },
    {
      "text": "Heres The Real Reason Behind The Dallas Cowboys Mismatched Uniform Colors",
      "url": "https://www.foxsports.com/stories/nfl/heres-the-real-reason-behind-the-dallas-cowboys-mismatched-uniform-colors",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Bringing Back Throwback Uniforms White Helmets Thanksgiving Day Game",
      "url": "https://www.espn.com/nfl/story/_/id/34275962/dallas-cowboys-bringing-back-throwback-uniforms-white-helmets-thanksgiving-day-game",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "The Surprising Reason The Dallas Cowboys Almost Never Wear Blue N",
      "url": "https://en.as.com/nfl/the-surprising-reason-the-dallas-cowboys-almost-never-wear-blue-n/",
      "domain": "en.as.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Bicentennial Helmet Red White Blue History",
      "url": "https://www.si.com/nfl/cowboys/onsi/news/dallas-cowboys-bicentennial-helmet-red-white-blue-history",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Why Do The Dallas Cowboys Have A Red Stripe On Their Helmet Against New York Giants.html",
      "url": "https://www.pennlive.com/sports/2023/11/why-do-the-dallas-cowboys-have-a-red-stripe-on-their-helmet-against-new-york-giants.html",
      "domain": "pennlive.com",
      "type": "citation"
    },
    {
      "text": "Cowboys To Wash Out Blue.html",
      "url": "https://www.nytimes.com/1981/01/15/sports/cowboys-to-wash-out-blue.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Uniform Schedule 2024 Nfl Season",
      "url": "https://www.si.com/nfl/cowboys/onsi/news/dallas-cowboys-uniform-schedule-2024-nfl-season",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "146o1kch215gx1q57og4dlqqvs",
      "url": "https://www.sportingnews.com/us/nfl/news/dallas-cowboys-thanksgiving-explained/146o1kch215gx1q57og4dlqqvs",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "5 Thanksgiving Day Games We Ll Never Forget",
      "url": "https://www.dallascowboys.com/news/5-thanksgiving-day-games-we-ll-never-forget",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Nfl Thanksgiving Day Games History Lions Cowboys Play Every Year Moments Traditions Records",
      "url": "https://www.espn.com/nfl/story/_/id/32646037/nfl-thanksgiving-day-games-history-lions-cowboys-play-every-year-moments-traditions-records",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Thanksgiving Record",
      "url": "https://champsorchumps.us/team/nfl/dallas-cowboys/thanksgiving-record",
      "domain": "champsorchumps.us",
      "type": "citation"
    },
    {
      "text": "Lions Cowboys Thanksgiving Game Nfl.html",
      "url": "https://www.nytimes.com/2024/11/27/sports/football/lions-cowboys-thanksgiving-game-nfl.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Rank Em 25 Years Of Thanksgiving Halftime Shows",
      "url": "https://www.dallascowboys.com/photos/rank-em-25-years-of-thanksgiving-halftime-shows",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Thanksgiving Shows",
      "url": "https://klaq.com/dallas-cowboys-thanksgiving-shows/",
      "domain": "klaq.com",
      "type": "citation"
    },
    {
      "text": "Red Kettle Kickoff 2024",
      "url": "https://www.salvationarmyusa.org/events/red-kettle-kickoff-2024/",
      "domain": "salvationarmyusa.org",
      "type": "citation"
    },
    {
      "text": "The Salvation Armys Annual Red Kettle Campaign Launches With The Help Of The Dallas Cowboys Country Star Lainey Wilson And Special Guest 302317802.html",
      "url": "https://www.prnewswire.com/news-releases/the-salvation-armys-annual-red-kettle-campaign-launches-with-the-help-of-the-dallas-cowboys-country-star-lainey-wilson-and-special-guest-302317802.html",
      "domain": "prnewswire.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Serve Annual Early Thanksgiving Meal",
      "url": "https://www.dallascowboys.com/photos/cowboys-serve-annual-early-thanksgiving-meal",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "8755947002",
      "url": "https://www.usatoday.com/story/sports/nfl/cowboys/2021/11/25/cowboys-ezekiel-elliott-dak-prescott-salvation-army-red-kettle-celebration/8755947002/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "3695610",
      "url": "https://www.nbcdfw.com/video/news/local/dallas-cowboys-partnering-with-the-salvation-army-is-a-thanksgiving-tradition/3695610/",
      "domain": "nbcdfw.com",
      "type": "citation"
    },
    {
      "text": "Why Are The Dallas Cowboys Known As Americas Team",
      "url": "https://www.nbc.com/nbc-insider/why-are-the-dallas-cowboys-known-as-americas-team",
      "domain": "nbc.com",
      "type": "citation"
    },
    {
      "text": "Most Popular Nfl Teams By State County",
      "url": "https://www.vividseats.com/blog/most-popular-nfl-teams-by-state-county",
      "domain": "vividseats.com",
      "type": "citation"
    },
    {
      "text": "Facebook Fans Of National Football League Teams",
      "url": "https://www.statista.com/statistics/240028/facebook-fans-of-national-football-league-teams/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Twitter Followers Of National Football League Teams",
      "url": "https://www.statista.com/statistics/240036/twitter-followers-of-national-football-league-teams/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Dallascowboys",
      "url": "https://www.instagram.com/dallascowboys/",
      "domain": "instagram.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Already Responsible For 2 Of 3 Most Watched Games Nfl 2025",
      "url": "https://www.si.com/nfl/cowboys/news/dallas-cowboys-already-responsible-for-2-of-3-most-watched-games-nfl-2025",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "The Dallas Cowboys Dominate As The Nfls Leading Brand",
      "url": "https://brandfinance.com/press-releases/the-dallas-cowboys-dominate-as-the-nfls-leading-brand",
      "domain": "brandfinance.com",
      "type": "citation"
    },
    {
      "text": "11vecsey.html",
      "url": "https://www.nytimes.com/2007/11/11/sports/football/11vecsey.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Fan Base Most Loyal Nfl",
      "url": "https://www.si.com/nfl/cowboys/news/dallas-cowboys-fan-base-most-loyal-nfl",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Attendance",
      "url": "http://www.espn.com/nfl/attendance",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "The Nfls Most Valuable Teams 2025",
      "url": "https://www.forbes.com/sites/justinteitelbaum/2025/08/28/the-nfls-most-valuable-teams-2025/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Nfl International Search Interest 2025 Trends Know",
      "url": "https://www.espn.com/nfl/story/_/id/45812150/nfl-international-search-interest-2025-trends-know",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Emmitt Smith Dallas Cowboys Fan Base Criticism",
      "url": "https://www.si.com/nfl/cowboys/news/emmitt-smith-dallas-cowboys-fan-base-criticism",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Delusional Dallas Cowboys Lovers Get Unusual Review From Espn Stephen A Smith Greatest Fan Base In The World",
      "url": "https://www.si.com/nfl/cowboys/onsi/news/delusional-dallas-cowboys-lovers-get-unusual-review-from-espn-stephen-a-smith-greatest-fan-base-in-the-world",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Stephen A Smith Admits Wanting See Disgusting Nauseating Cowboys Fans Suffer",
      "url": "https://www.si.com/nfl/stephen-a-smith-admits-wanting-see-disgusting-nauseating-cowboys-fans-suffer",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Most Annoying Fanbase Sports Preseason Jerry Jones Tom Landry Rank",
      "url": "https://www.si.com/nfl/cowboys/news/dallas-cowboys-most-annoying-fanbase-sports-preseason-jerry-jones-tom-landry-rank",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Dallas Fanbase Ranks Usatoday Worst Sports Philadelphia Eagles Jerry Jones",
      "url": "https://www.si.com/nfl/cowboys/news/dallas-fanbase-ranks-usatoday-worst-sports-philadelphia-eagles-jerry-jones",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Fans Nfl Worst Complainers",
      "url": "https://dfw.cbslocal.com/2020/10/20/dallas-cowboys-fans-nfl-worst-complainers/",
      "domain": "dfw.cbslocal.com",
      "type": "citation"
    },
    {
      "text": "Article5790426.html",
      "url": "https://www.star-telegram.com/opinion/bud-kennedy/article5790426.html",
      "domain": "star-telegram.com",
      "type": "citation"
    },
    {
      "text": "8052088 Tom Merriman Cowboy Stampede March",
      "url": "https://www.discogs.com/release/8052088-Tom-Merriman-Cowboy-Stampede-March",
      "domain": "discogs.com",
      "type": "citation"
    },
    {
      "text": "Out Of The Kbox And Into The Past Was This The Very First Dallas Cowboys Theme Song 7126011",
      "url": "https://www.dallasobserver.com/news/out-of-the-kbox-and-into-the-past-was-this-the-very-first-dallas-cowboys-theme-song-7126011/",
      "domain": "dallasobserver.com",
      "type": "citation"
    },
    {
      "text": "Mick Shots Cowboys Stampede",
      "url": "https://www.dallascowboys.com/video/mick-shots-cowboys-stampede",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "The Nfls Most Famous Entrance Anthems",
      "url": "https://renownedforsound.com/the-nfls-most-famous-entrance-anthems/",
      "domain": "renownedforsound.com",
      "type": "citation"
    },
    {
      "text": "2gxv4gbup4fdvc6nu1wvog",
      "url": "https://open.spotify.com/track/2Gxv4GBUP4FDVc6Nu1wVOg",
      "domain": "open.spotify.com",
      "type": "citation"
    },
    {
      "text": "196009300dal.htm",
      "url": "https://www.pro-football-reference.com/boxscores/196009300dal.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Didinger The Bounty Bowl 25 Years Later 14420910",
      "url": "https://www.philadelphiaeagles.com/news/didinger-the-bounty-bowl-25-years-later-14420910",
      "domain": "philadelphiaeagles.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Vs Eagles The 10 Greatest Moments In The History Of A Rivalry That Began Nearly 60 Years Ago",
      "url": "https://www.cbssports.com/nfl/news/cowboys-vs-eagles-the-10-greatest-moments-in-the-history-of-a-rivalry-that-began-nearly-60-years-ago/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Giants Cowboys",
      "url": "https://www.espn.com/nfl/game/_/gameId/401772834/giants-cowboys",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Cowboys%e2%80%93giants Rivalry",
      "url": "https://en.wikipedia.org/wiki/Cowboys%E2%80%93Giants_rivalry",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "The Top 10 Moments Between The Giants And Cowboys 09000d5d82b5d564",
      "url": "https://www.nfl.com/photos/the-top-10-moments-between-the-giants-and-cowboys-09000d5d82b5d564",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Daniel Jones On Giants Six Game Skid Versus Cowboys We Don T Like Losing To Anybody",
      "url": "https://www.nfl.com/news/daniel-jones-on-giants-six-game-skid-versus-cowboys-we-don-t-like-losing-to-anybody",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Qmklbj8j5qjwpnrunck0",
      "url": "https://static.clubs.nfl.com/image/upload/cowboys/qmklbj8j5qjwpnrunck0",
      "domain": "static.clubs.nfl.com",
      "type": "citation"
    },
    {
      "text": "Commanders Cowboys",
      "url": "https://www.espn.com/nfl/game/_/gameId/401772864/commanders-cowboys",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Commanders Cowboys",
      "url": "https://www.espn.com/nfl/game/_/gameId/401671840/commanders-cowboys",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Redskins Cowboys Rivalry Fueled By More Than Just The Games",
      "url": "https://www.espn.com/blog/nfceast/post/_/id/71098/redskins-cowboys-rivalry-fueled-by-more-than-just-the-games",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Cowboys Win Second Nfc East Title In Three Seasons With Win Over Commanders",
      "url": "https://www.nfl.com/news/cowboys-win-second-nfc-east-title-in-three-seasons-with-win-over-commanders",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Biggest Nfl Rivalries Cowboys 49ers Packers Bears More",
      "url": "https://www.espn.com/nfl/story/_/id/41223314/biggest-nfl-rivalries-cowboys-49ers-packers-bears-more",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "197101030sfo.htm",
      "url": "https://www.pro-football-reference.com/boxscores/197101030sfo.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Playoffs",
      "url": "https://www.pro-football-reference.com/playoffs/",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Nfl Wild Card Playoffs Key Moments Dallas Cowboys San Francisco 49ers Rivalry",
      "url": "https://www.espn.com/nfl/story/_/id/33059732/nfl-wild-card-playoffs-key-moments-dallas-cowboys-san-francisco-49ers-rivalry",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Rivalry Recap Cowboys Vs 49ers 0ap3000000864310",
      "url": "https://www.nfl.com/photos/rivalry-recap-cowboys-vs-49ers-0ap3000000864310",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Teamvsteam",
      "url": "https://www.footballdb.com/teams/nfl/dallas-cowboys/teamvsteam?opp=27",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Dominance Over Packers Fuled Dallas Dynasty",
      "url": "https://www.dallascowboys.com/news/dominance-over-packers-fuled-dallas-dynasty",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Teamvsteam",
      "url": "https://www.footballdb.com/teams/nfl/green-bay-packers/teamvsteam?opp=9",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys Vs Green Bay Packers Series",
      "url": "https://blog.ticketmaster.com/dallas-cowboys-vs-green-bay-packers-series/",
      "domain": "blog.ticketmaster.com",
      "type": "citation"
    },
    {
      "text": "Teamvsteam",
      "url": "https://www.footballdb.com/teams/nfl/dallas-cowboys/teamvsteam?opp=13",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Cowboys",
      "url": "https://www.jt-sw.com/football/pro/teams.nsf/histories/cowboys",
      "domain": "jt-sw.com",
      "type": "citation"
    },
    {
      "text": "Seasons",
      "url": "https://www.footballdb.com/teams/nfl/dallas-cowboys/seasons",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Career Rushing.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/career-rushing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Career Passing.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/career-passing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Career Receiving.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/career-receiving.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Career Defense.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/career-defense.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Career Scoring.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/career-scoring.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Single Season Rushing.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/single-season-rushing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Single Season Passing.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/single-season-passing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Single Season Receiving.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/single-season-receiving.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Single Season Scoring.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/single-season-scoring.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "2025 Roster.htm",
      "url": "https://www.pro-football-reference.com/teams/dal/2025_roster.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Radio Broadcast Information",
      "url": "https://www.dallascowboys.com/podcast/radio-broadcast-information",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Brad Sham.html",
      "url": "https://www.tshof.org/store/p449/Brad_Sham.html",
      "domain": "tshof.org",
      "type": "citation"
    },
    {
      "text": "1053thefan",
      "url": "https://www.audacy.com/1053thefan",
      "domain": "audacy.com",
      "type": "citation"
    },
    {
      "text": "Tv Network Information",
      "url": "https://www.dallascowboys.com/video/tv-network-information",
      "domain": "dallascowboys.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys",
      "url": "https://www.sportsmediawatch.com/tv-schedules/nfl-tv-schedule/dallas-cowboys/",
      "domain": "sportsmediawatch.com",
      "type": "citation"
    },
    {
      "text": "Dallas Cowboys How To Watch 2025 Tv Schedule",
      "url": "https://www.nytimes.com/athletic/6531397/2025/09/02/dallas-cowboys-how-to-watch-2025-tv-schedule/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Jerry Jones Changed Tv Landscape For Nfl",
      "url": "https://www.espn.com/blog/dallas-cowboys/post/_/id/4758018/jerry-jones-changed-tv-landscape-for-nfl",
      "domain": "espn.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "Tom Landry",
      "page": "Tom_Landry"
    },
    {
      "text": "dynasty",
      "page": "Dynasty"
    },
    {
      "text": "Super Bowls",
      "page": "Super_Bowl"
    },
    {
      "text": "NFL",
      "page": "NFL+"
    },
    {
      "text": "Jerry Jones",
      "page": "Jerry_Jones"
    },
    {
      "text": "Jimmy Johnson",
      "page": "Jimmy_Johnson"
    },
    {
      "text": "New England Patriots",
      "page": "New_England_Patriots"
    },
    {
      "text": "quarterback",
      "page": "Quarterback"
    },
    {
      "text": "Roger Staubach",
      "page": "Roger_Staubach"
    },
    {
      "text": "running back",
      "page": "Running_back"
    },
    {
      "text": "Emmitt Smith",
      "page": "Emmitt_Smith"
    },
    {
      "text": "Ed \"Too Tall\" Jones",
      "page": "Ed_%22Too_Tall%22_Jones"
    },
    {
      "text": "Dak Prescott",
      "page": "Dak_Prescott"
    },
    {
      "text": "AT\\u0026T Stadium",
      "page": "AT\\u0026T_Stadium"
    },
    {
      "text": "retractable roof",
      "page": "Retractable_roof"
    },
    {
      "text": "general manager",
      "page": "General_manager"
    },
    {
      "text": "Brian Schottenheimer",
      "page": "Brian_Schottenheimer"
    },
    {
      "text": "franchise",
      "page": "Franchise"
    },
    {
      "text": "National Football League",
      "page": "National_Football_League"
    },
    {
      "text": "Dallas",
      "page": "Dallas"
    },
    {
      "text": "Texas",
      "page": "Texas"
    },
    {
      "text": "All-America Football Conference",
      "page": "All-America_Football_Conference"
    },
    {
      "text": "American Football League",
      "page": "American_Football_League"
    },
    {
      "text": "AFL",
      "page": "AFL"
    },
    {
      "text": "Kansas City Chiefs",
      "page": "Kansas_City_Chiefs"
    },
    {
      "text": "George Preston Marshall",
      "page": "George_Preston_Marshall"
    },
    {
      "text": "fight song",
      "page": "Fight_song"
    },
    {
      "text": "Hail",
      "page": "Hail"
    },
    {
      "text": "front office",
      "page": "Front_office"
    },
    {
      "text": "Tex Schramm",
      "page": "Tex_Schramm"
    },
    {
      "text": "Gil Brandt",
      "page": "Gil_Brandt"
    },
    {
      "text": "photography",
      "page": "Photography"
    },
    {
      "text": "head coach",
      "page": "Head_coach"
    },
    {
      "text": "December 28",
      "page": "December_28"
    },
    {
      "text": "contract",
      "page": "Contract"
    },
    {
      "text": "defensive coordinator",
      "page": "Defensive_coordinator"
    },
    {
      "text": "New York Giants",
      "page": "New_York_Giants"
    },
    {
      "text": "Dallas Rangers",
      "page": "Dallas_Rangers"
    },
    {
      "text": "minor league baseball",
      "page": "Minor_League_Baseball"
    },
    {
      "text": "expansion draft",
      "page": "Expansion_draft"
    },
    {
      "text": "Don Meredith",
      "page": "Don_Meredith"
    },
    {
      "text": "draft",
      "page": "College_football"
    },
    {
      "text": "expansion team",
      "page": "Expansion_team"
    },
    {
      "text": "America's Team",
      "page": "America's_Team"
    },
    {
      "text": "analytics",
      "page": "Analytics"
    },
    {
      "text": "Landry's",
      "page": "Landry's"
    },
    {
      "text": "1966",
      "page": "1966"
    },
    {
      "text": "NFC",
      "page": "NFC"
    },
    {
      "text": "defense",
      "page": "Defense"
    },
    {
      "text": "1970s",
      "page": "1970s"
    },
    {
      "text": "counter",
      "page": "Counter"
    },
    {
      "text": "Doomsday Defense",
      "page": "Doomsday_Defense"
    },
    {
      "text": "shotgun formation",
      "page": "Shotgun_formation"
    },
    {
      "text": "Super Bowl V",
      "page": "Super_Bowl_V"
    },
    {
      "text": "Baltimore Colts",
      "page": "Baltimore_Colts"
    },
    {
      "text": "Super Bowl VI",
      "page": "Super_Bowl_VI"
    },
    {
      "text": "Miami Dolphins",
      "page": "Miami_Dolphins"
    },
    {
      "text": "MVP",
      "page": "MVP"
    },
    {
      "text": "Bob Lilly",
      "page": "Bob_Lilly"
    },
    {
      "text": "Super Bowl X",
      "page": "Super_Bowl_X"
    },
    {
      "text": "Pittsburgh",
      "page": "Pittsburgh"
    },
    {
      "text": "Super Bowl XIII",
      "page": "Super_Bowl_XIII"
    },
    {
      "text": "Super Bowl XII",
      "page": "Super_Bowl_XII"
    },
    {
      "text": "Denver Broncos",
      "page": "Denver_Broncos"
    },
    {
      "text": "Harvey Martin",
      "page": "Harvey_Martin"
    },
    {
      "text": "NFC Championship Game",
      "page": "NFC_Championship_Game"
    },
    {
      "text": "Herschel Walker trade",
      "page": "Herschel_Walker_trade"
    },
    {
      "text": "defensive end",
      "page": "Defensive_end"
    },
    {
      "text": "Issiac Holt",
      "page": "Issiac_Holt"
    },
    {
      "text": "1990 NFL Draft",
      "page": "1990_NFL_draft"
    },
    {
      "text": "Russell Maryland",
      "page": "Russell_Maryland"
    },
    {
      "text": "Darren Woodson",
      "page": "Darren_Woodson"
    },
    {
      "text": "Troy Aikman",
      "page": "Troy_Aikman"
    },
    {
      "text": "Mark Stepnoski",
      "page": "Mark_Stepnoski"
    },
    {
      "text": "Alvin Harper",
      "page": "Alvin_Harper"
    },
    {
      "text": "Erik Williams",
      "page": "Erik_Williams"
    },
    {
      "text": "NFC East",
      "page": "NFC_East"
    },
    {
      "text": "Detroit Lions",
      "page": "Detroit_Lions"
    },
    {
      "text": "Philadelphia Eagles",
      "page": "Philadelphia_Eagles"
    },
    {
      "text": "Green Bay Packers",
      "page": "Green_Bay_Packers"
    },
    {
      "text": "San Francisco 49ers",
      "page": "San_Francisco_49ers"
    },
    {
      "text": "Buffalo Bills",
      "page": "Buffalo_Bills"
    },
    {
      "text": "Super Bowl XXVII",
      "page": "Super_Bowl_XXVII"
    },
    {
      "text": "Rose Bowl",
      "page": "Rose_Bowl"
    },
    {
      "text": "Pasadena, California",
      "page": "Pasadena,_California"
    },
    {
      "text": "touchdown",
      "page": "Touchdown"
    },
    {
      "text": "Super Bowl XXVIII",
      "page": "Super_Bowl_XXVIII"
    },
    {
      "text": "Georgia Dome",
      "page": "Georgia_Dome"
    },
    {
      "text": "Atlanta",
      "page": "Atlanta"
    },
    {
      "text": "Pittsburgh Steelers",
      "page": "Pittsburgh_Steelers"
    },
    {
      "text": "Pro Football Hall of Fame",
      "page": "Pro_Football_Hall_of_Fame"
    },
    {
      "text": "Ring of Honor",
      "page": "Ring_of_Honor"
    },
    {
      "text": "Barry Switzer",
      "page": "Barry_Switzer"
    },
    {
      "text": "University of Oklahoma",
      "page": "University_of_Oklahoma"
    },
    {
      "text": "Sooners",
      "page": "Sooners"
    },
    {
      "text": "University of Arkansas",
      "page": "University_of_Arkansas"
    },
    {
      "text": "Michael Irvin",
      "page": "Michael_Irvin"
    },
    {
      "text": "Atlanta Falcons",
      "page": "Atlanta_Falcons"
    },
    {
      "text": "playoffs",
      "page": "Playoffs"
    },
    {
      "text": "Smith",
      "page": "Smith"
    },
    {
      "text": "Charles Haley",
      "page": "Charles_Haley"
    },
    {
      "text": "Deion Sanders",
      "page": "Deion_Smith"
    },
    {
      "text": "Championship",
      "page": "Championship"
    },
    {
      "text": "Super Bowl XXX",
      "page": "Super_Bowl_XXX"
    },
    {
      "text": "Tempe, Arizona",
      "page": "Tempe,_Arizona"
    },
    {
      "text": "Barry Sanders",
      "page": "Barry_Sanders"
    },
    {
      "text": "Oklahoma",
      "page": "Oklahoma"
    },
    {
      "text": "college",
      "page": "College"
    },
    {
      "text": "national championship",
      "page": "national_championship"
    },
    {
      "text": "Carolina Panthers",
      "page": "Carolina_Panthers"
    },
    {
      "text": "Jason Garrett",
      "page": "Jason_Garrett"
    },
    {
      "text": "clavicle",
      "page": "Clavicle"
    },
    {
      "text": "points per game",
      "page": "Points_per_game"
    },
    {
      "text": "arrest",
      "page": "Arrest"
    },
    {
      "text": "revolver",
      "page": "Revolver"
    },
    {
      "text": "misdemeanor",
      "page": "Misdemeanor"
    },
    {
      "text": "deferred adjudication",
      "page": "Deferred_adjudication"
    },
    {
      "text": "1990s",
      "page": "1990s"
    },
    {
      "text": "Arizona Cardinals",
      "page": "Arizona_Cardinals"
    },
    {
      "text": "Quincy Carter",
      "page": "Quincy_Carter"
    },
    {
      "text": "Bill Parcells",
      "page": "Bill_Parcells"
    },
    {
      "text": "Vinny Testaverde",
      "page": "Vinny_Testaverde"
    },
    {
      "text": "Drew Henson",
      "page": "Drew_Henson"
    },
    {
      "text": "Tony Romo",
      "page": "Tony_Romo"
    },
    {
      "text": "Drew Bledsoe",
      "page": "Drew_Bledsoe"
    },
    {
      "text": "Seattle Seahawks",
      "page": "Seattle_Seahawks"
    },
    {
      "text": "Flozell Adams",
      "page": "Flozell_Adams"
    },
    {
      "text": "Wade Phillips",
      "page": "Wade_Phillips"
    },
    {
      "text": "veteran",
      "page": "Veteran"
    },
    {
      "text": "Marion Barber III",
      "page": "Marion_Barber_III"
    },
    {
      "text": "Terrell Owens",
      "page": "Terrell_Owens"
    },
    {
      "text": "DeMarcus Ware",
      "page": "DeMarcus_Ware"
    },
    {
      "text": "New Orleans Saints",
      "page": "New_Orleans_Saints"
    },
    {
      "text": "victory",
      "page": "Victory"
    },
    {
      "text": "Offensive coordinator",
      "page": "Offensive_coordinator"
    },
    {
      "text": "tight end",
      "page": "Tight_end"
    },
    {
      "text": "Redskins",
      "page": "The_Redskins"
    },
    {
      "text": "Dez Bryant",
      "page": "Dez_Bryant"
    },
    {
      "text": "Monte Kiffin",
      "page": "Monte_Kiffin"
    },
    {
      "text": "Washington",
      "page": "Washington"
    },
    {
      "text": "Tyron Smith",
      "page": "Tyron_Smith"
    },
    {
      "text": "La'el Collins",
      "page": "La'el_Collins"
    },
    {
      "text": "Zack Martin",
      "page": "Zack_Martin"
    },
    {
      "text": "Rod Marinelli",
      "page": "Rod_Marinelli"
    },
    {
      "text": "Ezekiel Elliott",
      "page": "Ezekiel_Elliott"
    },
    {
      "text": "Los Angeles Rams",
      "page": "Los_Angeles_Rams"
    },
    {
      "text": "clock management",
      "page": "Clock_management"
    },
    {
      "text": "Mike McCarthy",
      "page": "Mike_McCarthy"
    },
    {
      "text": "Kellen Moore",
      "page": "Kellen_Moore"
    },
    {
      "text": "Mike Nolan",
      "page": "Mike_Nolan"
    },
    {
      "text": "COVID-19",
      "page": "COVID-19"
    },
    {
      "text": "Andy Dalton",
      "page": "Andy_Dalton"
    },
    {
      "text": "Ben DiNucci",
      "page": "Ben DiNucci"
    },
    {
      "text": "wide receiver",
      "page": "Wide_receiver"
    },
    {
      "text": "Tampa Bay Buccaneers",
      "page": "Tampa_Bay_Buccaneers"
    },
    {
      "text": "Micah Parsons",
      "page": "Micah_Parsons"
    },
    {
      "text": "Moore",
      "page": "Moore"
    },
    {
      "text": "management",
      "page": "Management"
    },
    {
      "text": "edge rusher",
      "page": "Edge_rusher"
    },
    {
      "text": "Cooper Rush",
      "page": "Cooper_Rush"
    },
    {
      "text": "losing streak",
      "page": "Losing_streak"
    },
    {
      "text": "defensive tackle",
      "page": "Defensive_tackle"
    },
    {
      "text": "Matt Eberflus",
      "page": "Matt_Eberflus"
    },
    {
      "text": "training camp",
      "page": "Training_camp"
    },
    {
      "text": "discipline",
      "page": "Discipline"
    },
    {
      "text": "consistency",
      "page": "Consistency"
    },
    {
      "text": "Cleveland Browns",
      "page": "Cleveland_Browns"
    },
    {
      "text": "exhibition",
      "page": "Exhibition"
    },
    {
      "text": "Washington Commanders",
      "page": "Washington_Commanders"
    },
    {
      "text": "suicide",
      "page": "Suicide"
    },
    {
      "text": "tribute",
      "page": "Tribute"
    },
    {
      "text": "CeeDee Lamb",
      "page": "CeeDee_Lamb"
    },
    {
      "text": "DaRon Bland",
      "page": "DaRon_Bland"
    },
    {
      "text": "Tulane Stadium",
      "page": "Tulane_Stadium"
    },
    {
      "text": "Louisiana",
      "page": "Louisiana"
    },
    {
      "text": "field goal",
      "page": "Field_goal"
    },
    {
      "text": "Lance Alworth",
      "page": "Lance_Alworth"
    },
    {
      "text": "Garo Yepremian",
      "page": "Garo_Yepremian"
    },
    {
      "text": "interception",
      "page": "Interception"
    },
    {
      "text": "Bob Griese",
      "page": "Bob_Griese"
    },
    {
      "text": "attack",
      "page": "Attack"
    },
    {
      "text": "Tony Dorsett",
      "page": "Tony_Dorsett"
    },
    {
      "text": "halftime",
      "page": "Half-time"
    },
    {
      "text": "pass",
      "page": "Pass"
    },
    {
      "text": "Fullback",
      "page": "Fullback"
    },
    {
      "text": "Robert Newhouse",
      "page": "Robert_Newhouse"
    },
    {
      "text": "Golden Richards",
      "page": "Golden_Richards"
    },
    {
      "text": "Morton",
      "page": "Craig_Morton"
    },
    {
      "text": "Buffalo",
      "page": "Buffalo"
    },
    {
      "text": "Reed",
      "page": "Reed"
    },
    {
      "text": "NBC",
      "page": "NBC"
    },
    {
      "text": "Thomas Everett",
      "page": "Thomas_Everett"
    },
    {
      "text": "Pro Bowl",
      "page": "Pro_Bowl"
    },
    {
      "text": "Dave Wannstedt",
      "page": "Dave_Wannstedt"
    },
    {
      "text": "Chris Boniol",
      "page": "Chris_Boniol"
    },
    {
      "text": "Jay Novacek",
      "page": "Jay_Novacek"
    },
    {
      "text": "Neil O'Donnell",
      "page": "Neil_O'Donnell"
    },
    {
      "text": "cornerback",
      "page": "Cornerback"
    },
    {
      "text": "Norm Johnson",
      "page": "Norm_Johnson"
    },
    {
      "text": "Bam Morris",
      "page": "Bam_Morris"
    },
    {
      "text": "Steel Curtain",
      "page": "Steel_Curtain"
    },
    {
      "text": "Chicago Bears",
      "page": "Chicago_Bears"
    },
    {
      "text": "2024",
      "page": "2024"
    },
    {
      "text": "Forbes",
      "page": "Forbes"
    },
    {
      "text": "professional sports",
      "page": "Professional_sports"
    },
    {
      "text": "Cotton Bowl Classic",
      "page": "Cotton_Bowl_Classic"
    },
    {
      "text": "Texas Stadium",
      "page": "Texas_Stadium"
    },
    {
      "text": "Irving, Texas",
      "page": "Irving,_Texas"
    },
    {
      "text": "Arlington, Texas",
      "page": "Arlington,_Texas"
    },
    {
      "text": "natural light",
      "page": "Natural_light"
    },
    {
      "text": "2013",
      "page": "2013"
    },
    {
      "text": "naming rights",
      "page": "Naming_rights"
    },
    {
      "text": "inception",
      "page": "Inception"
    },
    {
      "text": "West",
      "page": "West"
    },
    {
      "text": "California Lutheran University",
      "page": "California_Lutheran_University"
    },
    {
      "text": "Thousand Oaks, California",
      "page": "Thousand_Oaks,_California"
    },
    {
      "text": "St. Edward's University",
      "page": "St._Edward's_University"
    },
    {
      "text": "Austin, Texas",
      "page": "Austin,_Texas"
    },
    {
      "text": "Midwestern State University",
      "page": "Midwestern_State_University"
    },
    {
      "text": "Wichita Falls, Texas",
      "page": "Wichita_Falls,_Texas"
    },
    {
      "text": "California",
      "page": "California"
    },
    {
      "text": "Alamodome",
      "page": "Alamodome"
    },
    {
      "text": "San Antonio, Texas",
      "page": "San_Antonio"
    },
    {
      "text": "Oxnard, California",
      "page": "Oxnard,_California"
    },
    {
      "text": "Frisco, Texas",
      "page": "Frisco,_Texas"
    },
    {
      "text": "five-pointed star",
      "page": "Five-pointed_star"
    },
    {
      "text": "navy blue",
      "page": "Navy_blue"
    },
    {
      "text": "white",
      "page": "White"
    },
    {
      "text": "equipment manager",
      "page": "Equipment_manager"
    },
    {
      "text": "blue star",
      "page": "Blue_star"
    },
    {
      "text": "blue",
      "page": "Blue"
    },
    {
      "text": "contrast",
      "page": "Contrast"
    },
    {
      "text": "stars",
      "page": "Stars!"
    },
    {
      "text": "digital media",
      "page": "Digital_media"
    },
    {
      "text": "royal blue",
      "page": "Royal_blue"
    },
    {
      "text": "simplicity",
      "page": "Simplicity"
    },
    {
      "text": "logo",
      "page": "Logo"
    },
    {
      "text": "Southwestern United States",
      "page": "Southwestern_United_States"
    },
    {
      "text": "lone star",
      "page": "Lone_Star"
    },
    {
      "text": "luxury car",
      "page": "Luxury_car"
    },
    {
      "text": "1960s",
      "page": "1960s"
    },
    {
      "text": "red, white, and blue",
      "page": "Red_White_and_Blue"
    },
    {
      "text": "road",
      "page": "Road"
    },
    {
      "text": "reputation",
      "page": "Reputation"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "jinx",
      "page": "Jinx"
    },
    {
      "text": "Nike",
      "page": "Nike"
    },
    {
      "text": "Thanksgiving",
      "page": "Thanksgiving"
    },
    {
      "text": "record",
      "page": "Record"
    },
    {
      "text": "tailgating",
      "page": "Tailgating"
    },
    {
      "text": "community",
      "page": "Community"
    },
    {
      "text": "philanthropy",
      "page": "Philanthropy"
    },
    {
      "text": "Salvation Army",
      "page": "The_Salvation_Army"
    },
    {
      "text": "NFL Films",
      "page": "NFL_Films"
    },
    {
      "text": "Bob Ryan",
      "page": "Bob_Ryan"
    },
    {
      "text": "John Facenda",
      "page": "John_Facenda"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "stadium",
      "page": "Stadium"
    },
    {
      "text": "attendance",
      "page": "Attendance"
    },
    {
      "text": "decade",
      "page": "Decade"
    },
    {
      "text": "loyalty",
      "page": "Loyalty"
    },
    {
      "text": "the league",
      "page": "The_League"
    },
    {
      "text": "Stephen A. Smith",
      "page": "Stephen_A._Smith"
    },
    {
      "text": "Spotify",
      "page": "Spotify"
    },
    {
      "text": "Apple Music",
      "page": "Apple_Music"
    },
    {
      "text": "cultural artifact",
      "page": "Cultural_artifact"
    },
    {
      "text": "New York",
      "page": "New_York"
    },
    {
      "text": "Super Bowl XXI",
      "page": "Super_Bowl_XXI"
    },
    {
      "text": "Carl Banks",
      "page": "Carl_Banks"
    },
    {
      "text": "Danny White",
      "page": "Danny_White"
    },
    {
      "text": "injury",
      "page": "Injury"
    },
    {
      "text": "Super Bowl XLII",
      "page": "Super_Bowl_XLII"
    },
    {
      "text": "National Football Conference",
      "page": "National_Football_Conference"
    },
    {
      "text": "eras",
      "page": "Eras"
    },
    {
      "text": "Joe Montana",
      "page": "Joe_Montana"
    },
    {
      "text": "Steve Young",
      "page": "Steve_Young"
    },
    {
      "text": "Cowboys",
      "page": "The_Cowboys"
    },
    {
      "text": "shutout",
      "page": "Shutout"
    },
    {
      "text": "Terry Bradshaw",
      "page": "Terry_Bradshaw"
    },
    {
      "text": "John Stallworth",
      "page": "John_Stallworth"
    },
    {
      "text": "2002",
      "page": "2002"
    },
    {
      "text": "rivalry",
      "page": "Rivalry"
    },
    {
      "text": "Indianapolis",
      "page": "Indianapolis"
    },
    {
      "text": "Indianapolis Colts",
      "page": "Indianapolis_Colts"
    },
    {
      "text": "Hail Mary",
      "page": "Hail_Mary"
    },
    {
      "text": "Carolina",
      "page": "Carolina"
    },
    {
      "text": "Detroit",
      "page": "Detroit"
    },
    {
      "text": "Seattle",
      "page": "Seattle"
    },
    {
      "text": "Los Angeles",
      "page": "Los_Angeles"
    },
    {
      "text": "San Francisco",
      "page": "San_Francisco"
    },
    {
      "text": "Super",
      "page": "Super"
    },
    {
      "text": "modern era",
      "page": "Modern_Era"
    },
    {
      "text": "Mel Renfro",
      "page": "Mel_Renfro"
    },
    {
      "text": "Jason Witten",
      "page": "Jason_Witten"
    },
    {
      "text": "2014",
      "page": "2014"
    },
    {
      "text": "Brandon Aubrey",
      "page": "Brandon_Aubrey"
    },
    {
      "text": "DeMarco Murray",
      "page": "DeMarco_Murray"
    },
    {
      "text": "Clint Murchison Jr.",
      "page": "Clint_Murchison_Jr."
    },
    {
      "text": "de facto",
      "page": "De_facto"
    },
    {
      "text": "chief operating officer",
      "page": "Chief_operating_officer"
    },
    {
      "text": "Dallas Cowboys Cheerleaders",
      "page": "Dallas_Cowboys_Cheerleaders"
    },
    {
      "text": "business acumen",
      "page": "Business_acumen"
    },
    {
      "text": "University of Miami",
      "page": "University_of_Miami"
    },
    {
      "text": "Chan Gailey",
      "page": "Chan_Gailey"
    },
    {
      "text": "Dave Campo",
      "page": "Dave_Campo"
    },
    {
      "text": "2016",
      "page": "2016"
    },
    {
      "text": "St. Louis Rams",
      "page": "St._Louis_Rams"
    },
    {
      "text": "New York Jets",
      "page": "New_York_Jets"
    },
    {
      "text": "George Pickens",
      "page": "George_Pickens"
    },
    {
      "text": "Joe Milton",
      "page": "Joe_Milton"
    },
    {
      "text": "Javonte Williams",
      "page": "Javonte_Williams"
    },
    {
      "text": "Hunter Luepke",
      "page": "Hunter_Luepke"
    },
    {
      "text": "Ferguson",
      "page": "Jake_Ferguson"
    },
    {
      "text": "Schoonmaker",
      "page": "Luke_Schoonmaker"
    },
    {
      "text": "Terence Steele",
      "page": "Terence_Steele"
    },
    {
      "text": "OT",
      "page": "OT"
    },
    {
      "text": "guard",
      "page": "Guard"
    },
    {
      "text": "C",
      "page": "C"
    },
    {
      "text": "Rookie",
      "page": "Rookie"
    },
    {
      "text": "Osa Odighizuwa",
      "page": "Osa_Odighizuwa"
    },
    {
      "text": "Jadeveon Clowney",
      "page": "Jadeveon_Clowney"
    },
    {
      "text": "Solomon Thomas",
      "page": "Solomon_Thomas"
    },
    {
      "text": "Dante Fowler",
      "page": "Dante_Fowler"
    },
    {
      "text": "DeMarvion Overshown",
      "page": "DeMarvion_Overshown"
    },
    {
      "text": "safety",
      "page": "Safety"
    },
    {
      "text": "Malik Hooker",
      "page": "Malik_Hooker"
    },
    {
      "text": "Kaiir Elam",
      "page": "Kaiir_Elam"
    },
    {
      "text": "C.J. Goodwin",
      "page": "C._J._Goodwin"
    },
    {
      "text": "Markquese Bell",
      "page": "Markquese_Bell"
    },
    {
      "text": "Dallas Cowboys Radio Network",
      "page": "Dallas_Cowboys_Radio_Network"
    },
    {
      "text": "KRLD-FM",
      "page": "KRLD-FM"
    },
    {
      "text": "Audacy",
      "page": "Audacy"
    },
    {
      "text": "Brad Sham",
      "page": "Brad_Sham"
    },
    {
      "text": "analyst",
      "page": "Analyst"
    },
    {
      "text": "Verne Lundquist",
      "page": "Verne_Lundquist"
    },
    {
      "text": "Arkansas",
      "page": "Arkansas"
    },
    {
      "text": "New Mexico",
      "page": "New_Mexico"
    },
    {
      "text": "Compass Media Networks",
      "page": "Compass_Media_Networks"
    },
    {
      "text": "Westwood One",
      "page": "Westwood_One"
    },
    {
      "text": "flagship",
      "page": "Flagship"
    },
    {
      "text": "simulcast",
      "page": "Simulcast"
    },
    {
      "text": "SiriusXM",
      "page": "Sirius_XM"
    },
    {
      "text": "FOX",
      "page": "Fox"
    },
    {
      "text": "KDFW",
      "page": "KDFW"
    },
    {
      "text": "AFC",
      "page": "AFC"
    },
    {
      "text": "CBS",
      "page": "CBS"
    },
    {
      "text": "KTVT",
      "page": "KTVT"
    },
    {
      "text": "KXAS-TV",
      "page": "KXAS-TV"
    },
    {
      "text": "Monday Night Football",
      "page": "Monday_Night_Football"
    },
    {
      "text": "ESPN",
      "page": "ESPN"
    },
    {
      "text": "ABC",
      "page": "ABC"
    },
    {
      "text": "WFAA",
      "page": "WFAA"
    },
    {
      "text": "Thursday Night Football",
      "page": "Thursday_Night_Football"
    },
    {
      "text": "NFL Network",
      "page": "NFL_Network"
    },
    {
      "text": "Netflix",
      "page": "Netflix"
    },
    {
      "text": "Telemundo",
      "page": "Telemundo"
    },
    {
      "text": "UniMás",
      "page": "UniMás"
    }
  ],
  "fetched_at": "2025-12-07T07:25:37.024741",
  "elapsed_ms": 689962
}