{
  "topic": "Dark Energy",
  "title": "Dark energy",
  "slug": "dark-energy",
  "grokipedia_slug": "Dark_energy",
  "grokipedia_url": "https://grokipedia.com/page/Dark_energy",
  "source": "grokipedia",
  "content": "# Dark energy\n\nDark energy is a proposed form of energy that permeates all of space and drives the accelerated expansion of the universe, counteracting the gravitational attraction that would otherwise slow it down. First identified in 1998 through observations of type Ia supernovae by independent teams led by Saul Perlmutter, Brian Schmidt, and Adam Riess—which earned them the 2011 Nobel Prize in Physics—dark energy revealed that the universe's expansion, which began with the Big Bang approximately 13.8 billion years ago, began accelerating about 9 billion years later. According to the standard Lambda-CDM model of cosmology, dark energy accounts for roughly 68% of the universe's total energy density, with dark matter comprising about 27% and ordinary baryonic matter making up the remaining 5%.\n\nThe nature of dark energy remains one of the greatest unsolved mysteries in modern physics, as it behaves like a repulsive force with negative pressure, unlike the attractive gravity of matter. In Einstein's general theory of relativity, it is most simply explained as the **cosmological constant** (Λ), representing the intrinsic energy of empty space or vacuum energy, a concept Einstein initially introduced and later discarded before the discovery of expansion. Alternative theories propose dynamic fields such as **quintessence**, where dark energy varies over time and space, or modifications to gravity itself, though observations have been consistent with a constant value, recent data suggest it may evolve over time. Evidence for dark energy extends beyond supernovae to include measurements of the cosmic microwave background (CMB) radiation, baryon acoustic oscillations in galaxy distributions, and the large-scale structure of the universe, all of which consistently indicate an accelerating cosmos.\n\nOngoing research aims to probe dark energy's properties more precisely, potentially revealing whether it is constant or evolving, which could reshape our understanding of the universe's fate—whether it expands forever, recollapses, or reaches a steady state. Recent results from the DESI survey (2024-2025) and Euclid's early data releases (2025) have provided hints that dark energy may be evolving, potentially weakening over cosmic time. Missions like the European Space Agency's Euclid telescope (launched in 2023), NASA's Nancy Grace Roman Space Telescope (planned for 2027), and the James Webb Space Telescope are mapping cosmic structures and supernovae at greater distances to test these models. These efforts build on datasets from the Planck satellite, which in 2018 refined cosmological parameters and confirmed dark energy's dominance with high precision. Despite its elusiveness, dark energy underscores the incompleteness of our cosmological framework, highlighting the interplay between quantum field theory and gravity.\n\n## Historical Context\n\n### Early Theoretical Foundations\n\nThe concept of dark energy finds its earliest theoretical roots in the efforts of early 20th-century physicists to reconcile general relativity with a static universe, amid prevailing philosophical assumptions of cosmic stability. In 1917, Albert Einstein introduced the cosmological constant, denoted as \\(\\Lambda\\), into the field equations of general relativity to permit a static, finite, and closed universe model filled with uniform matter density. This modification took the form\n\n\\[\nR_{\\mu\\\nu} - \\frac{1}{2} R g_{\\mu\\\nu} + \\Lambda g_{\\mu\\\nu} = \\frac{8\\pi G}{c^4} T_{\\mu\\\nu},\n\\]\n\nwhere \\(R_{\\mu\\\nu}\\) is the Ricci tensor, \\(R\\) the scalar curvature, \\(g_{\\mu\\\nu}\\) the metric tensor, \\(G\\) the gravitational constant, \\(c\\) the speed of light, and \\(T_{\\mu\\\nu}\\) the stress-energy tensor. Einstein's motivation stemmed from the desire to avoid an unstable, dynamically evolving cosmos, estimating the cosmic radius at approximately \\(10^7\\) light-years based on the observed matter density. However, this addition was provisional, as Einstein later viewed it as an unnecessary artifact once empirical evidence emerged.\n\nShortly thereafter, in July 1917, Willem de Sitter proposed an alternative solution using the same modified equations, describing an empty universe (\\(\\rho = 0\\)) sustained by a positive \\(\\Lambda = 3/R^2\\), where \\(R\\) is the radius of curvature. This model implied a hyperbolic geometry with inherent expansion, though de Sitter emphasized its static nature in the absence of matter. While de Sitter did not explicitly frame \\(\\Lambda\\) as vacuum energy, his solution prefigured later interpretations linking the cosmological constant to the energy density of empty space, as articulated by Georges Lemaître in 1934, who equated \\(\\Lambda\\) to a vacuum energy contributing negative pressure. De Sitter's work thus provided a foundational precursor to notions of vacuum-dominated cosmic dynamics.\n\nIn 1922, Alexander Friedmann derived dynamic solutions to Einstein's original field equations (without \\(\\Lambda\\)), demonstrating that a homogeneous, isotropic universe could expand or contract depending on initial conditions and matter content. Friedmann's equations, such as\n\n\\[\n\\left( \\frac{\\dot{a}}{a} \\right)^2 = \\frac{8\\pi G}{3} \\rho - \\frac{k c^2}{a^2},\n\\]\n\nwhere \\(a(t)\\) is the scale factor, \\(\\dot{a}\\) its time derivative, \\(\\rho\\) the density, and \\(k\\) the curvature parameter, revealed possibilities for an evolving cosmos, challenging the static paradigm. Einstein initially critiqued these solutions as mathematical curiosities but later acknowledged their validity in 1923. The 1929 observations of galactic redshifts by Edwin Hubble confirmed expansion, prompting Einstein to abandon \\(\\Lambda\\) and famously regret its introduction as his \"biggest blunder.\"\n\nA significant theoretical advancement came in the 1980s with the development of cosmic inflation, which posited a brief epoch of exponential expansion driven by a temporary component akin to dark energy. In 1981, Alan Guth proposed that a scalar field, the inflaton \\(\\phi\\), with a suitable potential \\(V(\\phi)\\), could dominate the early universe's energy density, leading to rapid growth via the modified Friedmann equation\n\n\\[\nH^2 = \\frac{8\\pi G}{3} \\left( \\frac{1}{2} \\dot{\\phi}^2 + V(\\phi) \\right),\n\\]\n\nwhere \\(H = \\dot{a}/a\\) is the Hubble parameter. During slow-roll inflation, the potential energy \\(V(\\phi)\\) acts like a cosmological constant, resolving issues like the horizon and flatness problems while mimicking vacuum energy effects on short timescales. This framework highlighted how scalar fields could transiently accelerate expansion, laying groundwork for modern dark energy models without relying on permanent \\(\\Lambda\\).\n\n### Discovery and Initial Observations\n\nThe discovery of dark energy emerged from independent observations of distant Type Ia supernovae conducted by two rival teams in the late 1990s. The Supernova Cosmology Project (SCP), led by Saul Perlmutter at Lawrence Berkeley National Laboratory, began surveying high-redshift supernovae in the early 1990s using telescopes such as the 4-meter Nicholas U. Mayall Telescope at Kitt Peak and the Keck telescopes. Meanwhile, the High-Z Supernova Search Team (HZT), led by Brian Schmidt and including Adam Riess, utilized similar instruments, including the Las Campanas Observatory and the Hubble Space Telescope, to measure the brightness and redshifts of these events. Both teams anticipated finding evidence for cosmic deceleration due to gravitational attraction, but their analyses of data from approximately 50 distant supernovae revealed an unexpected acceleration in the universe's expansion rate.\n\nThe pivotal evidence came from comparisons of supernova apparent magnitudes—expressed as distance moduli—against their redshifts, which serve as proxies for distance in an expanding universe. Plots of these distance moduli versus redshift for the observed supernovae deviated from expectations in a matter-dominated, decelerating model, appearing fainter than predicted and indicating that the expansion had begun accelerating around 5-6 billion years ago. This dimming implied a positive cosmological constant term, with \\(\\Omega_\\Lambda \\u003e 0\\), challenging the prevailing Einstein-de Sitter model where \\(\\Omega_m \\approx 1\\) and no acceleration occurs. The HZT's initial dataset of 16 high-redshift supernovae, combined with 34 nearby ones, yielded a deceleration parameter \\(q_0 \\u003c 0\\), confirming acceleration at high confidence.\n\nTo interpret these results, both teams fitted their supernova data to the Friedmann equation governing cosmic expansion:\n\n\\[\n\\left( \\frac{\\dot{a}}{a} \\right)^2 = \\frac{8\\pi G}{3} \\rho - \\frac{k c^2}{a^2} + \\frac{\\Lambda c^2}{3},\n\\]\n\nwhere \\(a\\) is the scale factor, \\(\\rho\\) is the total energy density, \\(k\\) is the curvature parameter, and \\(\\Lambda\\) represents the cosmological constant. The fits, assuming a flat universe (\\(k=0\\)), produced \\(\\Omega_m + \\Omega_\\Lambda \\approx 1\\) with \\(\\Omega_m \\approx 0.3\\) and \\(\\Omega_\\Lambda \\approx 0.7\\), suggesting that a dark energy component dominates the universe's energy budget today. These parameters aligned with a revived interpretation of Einstein's 1917 cosmological constant, originally introduced to stabilize a static universe and later discarded.\n\nThe breakthroughs were publicly announced on January 8, 1998, at the American Astronomical Society meeting, with key publications following: the HZT's results in the Astronomical Journal and an SCP report on a single distant supernova in Nature, both in 1998, and the SCP's comprehensive analysis of 42 supernovae in the Astrophysical Journal in 1999. Early integration of these supernova constraints with cosmic microwave background (CMB) measurements from the COBE satellite, which in 1992 provided the first detection of CMB anisotropies, offered preliminary hints of a flat geometry requiring non-baryonic contributions beyond matter alone. The profound impact of these findings was recognized with the 2011 Nobel Prize in Physics awarded to Perlmutter, Schmidt, and Riess for the discovery of the accelerating expansion of the universe.\n\n## Conceptual Framework\n\n### Technical Definition\n\nDark energy is postulated as a hypothetical form of energy that fills the fabric of space and possesses negative pressure, which drives the accelerated expansion of the universe. It is quantitatively described by the equation of state parameter \\( w = p / \\rho \\), where \\( p \\) is the isotropic pressure and \\( \\rho \\) is the energy density; in the simplest models, such as the cosmological constant, \\( w \\approx -1 \\), indicating that the pressure is equal in magnitude but opposite in sign to the energy density.\n\nThe role of dark energy in cosmic acceleration emerges from the second Friedmann equation, which governs the dynamics of the universe's scale factor \\( a(t) \\):\n\n\\[\n\\frac{\\ddot{a}}{a} = -\\frac{4\\pi G}{3} \\left( \\rho + \\frac{3p}{c^2} \\right),\n\\]\n\nderived from the Einstein field equations under the assumptions of homogeneity and isotropy in a flat universe. For the scale factor to accelerate (\\( \\ddot{a} \\u003e 0 \\)), the effective gravitational source must satisfy \\( \\rho + 3p/c^2 \\u003c 0 \\), which translates to \\( w \\u003c -1/3 \\); this condition distinguishes dark energy from ordinary matter and radiation, as it produces a repulsive gravitational effect rather than attraction.\n\nIn contrast to dark matter, which behaves as pressureless dust with \\( w = 0 \\), and relativistic radiation with \\( w = 1/3 \\), dark energy in the standard \\(\\Lambda\\)CDM model has a constant energy density \\( \\rho_\\Lambda \\) that does not dilute with the universe's expansion. The present-day value of this density is estimated at \\( \\rho_\\Lambda \\approx 10^{-47} \\) GeV⁴, corresponding to about 68% of the total energy budget of the universe. This observed scale presents the vacuum energy problem: quantum field theory calculations of the zero-point energy of the vacuum predict a density up to 120 orders of magnitude larger than \\( \\rho_\\Lambda \\), highlighting a profound theoretical discrepancy.\n\n### Role in Cosmic Expansion\n\nIn the Lambda-CDM model, dark energy is incorporated as the cosmological constant term \\(\\Lambda\\), accounting for approximately 68\\% of the universe's current total energy density, while dark matter contributes about 27\\% and baryonic matter about 5\\%. This composition positions dark energy as the dominant driver of the universe's accelerated expansion in the late-time epoch, transitioning the overall dynamics from deceleration to acceleration.\n\nThe scale factor \\(a(t)\\), which measures the relative size of the universe over time, evolves through distinct phases dictated by the prevailing energy component: radiation domination in the primordial era (high redshift, \\(z \\gg 1\\)), matter domination during intermediate cosmic history (roughly \\(0.3 \\u003c z \\u003c 1000\\)), and dark energy domination in the present low-redshift regime (\\(z \\u003c 0.3\\)). In this final phase, dark energy's repulsive effect overtakes gravitational attraction, causing \\(a(t)\\) to grow exponentially.\n\nThe Hubble parameter \\(H(z)\\), quantifying the expansion rate at redshift \\(z\\), follows the Friedmann equation in a flat Lambda-CDM cosmology:\n\n\\[\nH(z) = H_0 \\sqrt{\\Omega_r (1+z)^4 + \\Omega_m (1+z)^3 + \\Omega_\\Lambda},\n\\]\n\nwhere \\(H_0\\) is the present-day Hubble constant, \\(\\Omega_r\\), \\(\\Omega_m\\), and \\(\\Omega_\\Lambda\\) are the present density parameters for radiation, matter, and dark energy, respectively, and the flatness condition \\(\\Omega_{\\rm tot} = \\Omega_r + \\Omega_m + \\Omega_\\Lambda = 1\\) holds, as confirmed by cosmic microwave background observations. This expression illustrates how dark energy's unchanging contribution flattens the expansion curve at low \\(z\\), ensuring a spatially flat universe consistent with measurements.\n\nAssuming a constant equation of state parameter \\(w = -1\\) for dark energy, its energy density \\(\\rho_\\Lambda\\) remains invariant with expansion (\\(\\rho_\\Lambda \\propto a^0\\)), unlike matter density which scales as \\(\\rho_m \\propto a^{-3}\\). This constancy allows dark energy to progressively overwhelm other components, cementing its role in the universe's current expansion dynamics.\n\n## Observational Evidence\n\n### Type Ia Supernovae Measurements\n\nType Ia supernovae (SNe Ia) are utilized as standard candles in cosmology because they exhibit a relatively uniform peak absolute magnitude, arising from the thermonuclear explosion of a carbon-oxygen white dwarf reaching the Chandrasekhar limit. This uniformity allows astronomers to infer distances to host galaxies by comparing observed apparent magnitudes to the intrinsic luminosity after empirical corrections. The initial discovery of cosmic acceleration through SNe Ia observations was reported by the High-Z Supernova Search Team and the Supernova Cosmology Project in 1998.\n\nA key standardization method is the Phillips relation, which correlates the peak luminosity of an SN Ia with the decline rate of its light curve, as slower-declining events are intrinsically brighter. This relation reduces the intrinsic scatter in peak brightness from about 0.8 magnitudes to roughly 0.15 magnitudes in the B-band after correction. Additional corrections account for host galaxy extinction and redshift effects using light-curve shape parameters from models like SALT2 or MLCS.\n\nDistances are calculated via the distance modulus, given by  \n\\[ m - M = 5 \\log_{10} (d_L) + 25, \\]  \nwhere \\( m \\) is the corrected apparent magnitude, \\( M \\) is the standardized absolute magnitude, and \\( d_L \\) is the luminosity distance. In a Friedmann-Lemaître-Robertson-Walker universe, the luminosity distance is expressed as  \n\\[ d_L = (1 + z) \\int_0^z \\frac{dz'}{H(z')}, \\]  \nwith \\( H(z) \\) the Hubble parameter that encodes the cosmic expansion history, including contributions from dark energy. By fitting observed distance moduli from SNe Ia samples to this model, constraints on dark energy parameters such as the density \\( \\Omega_\\Lambda \\) and equation-of-state parameter \\( w \\) are derived.\n\nMajor surveys have compiled large datasets of SNe Ia to probe dark energy. The Union2 compilation, aggregating 557 low-to-high redshift events from multiple projects, provided evidence for accelerated expansion around redshift \\( z \\approx 0.5 \\), favoring a dark energy-dominated universe with \\( w = -0.997^{+0.050}_{-0.054} \\) in a flat model. Building on this, the Pantheon+ dataset incorporated 1701 light curves from 1550 spectroscopically confirmed SNe Ia spanning \\( 0.01 \\u003c z \\u003c 2.3 \\), confirming the acceleration and yielding \\( \\Omega_m = 0.298 \\pm 0.017 \\) (implying \\( \\Omega_\\Lambda \\approx 0.70 \\pm 0.03 \\) in flat \\( \\Lambda \\)CDM) when combined with other priors, though SN Ia alone tightly constrain \\( w \\approx -1 \\).\n\nThese measurements contribute to the Hubble constant tension, where local SN Ia-based distance ladder estimates yield \\( H_0 \\approx 73 \\) km s\\(^{-1}\\) Mpc\\(^{-1}\\), conflicting at the 5σ level with the cosmic microwave background value of \\( H_0 \\approx 67.4 \\) km s\\(^{-1}\\) Mpc\\(^{-1}\\). Systematic uncertainties in SN Ia analyses include interstellar dust extinction, which reddens light curves and is mitigated via multi-band photometry, and variations in progenitor scenarios—such as single-degenerate versus double-degenerate systems—that may introduce subtle luminosity differences.\n\nRecent advancements have refined these measurements. The Dark Energy Survey's five-year supernova sample of 1499 photometrically classified SNe Ia improved light-curve fitting and host-mass corrections, reducing distance uncertainties to about 3% and supporting \\( w = -0.949^{+0.066}_{-0.078} \\). Observations with the James Webb Space Telescope of high-redshift SNe Ia (\\( z \\u003e 1.5 \\)) have enhanced calibration of the distance ladder, achieving precisions approaching 2% in relative distances and probing potential evolution in dark energy properties. Emerging analyses of expanded datasets hint at possible deviations from a constant \\( w(z) \\), with mild preferences for dynamical dark energy models at low significance.\n\n### Cosmic Microwave Background Anisotropies\n\nThe cosmic microwave background (CMB) anisotropies provide a powerful probe of dark energy by encoding information about the universe's geometry, expansion history, and the evolution of gravitational potentials from the early universe to the present day. Observations of the CMB temperature and polarization fluctuations constrain dark energy through their effects on the positions and amplitudes of peaks in the angular power spectrum, as well as late-time distortions arising from the transition to dark energy dominance. These measurements, primarily from satellite missions like Planck and ground-based experiments such as the Atacama Cosmology Telescope (ACT) and South Pole Telescope (SPT), favor a flat universe with a dark energy density parameter that drives accelerated expansion.\n\nThe temperature-temperature (TT) angular power spectrum exhibits acoustic peaks whose positions and heights are sensitive to the sound horizon at recombination and the subsequent angular diameter distance, both influenced by dark energy. In the standard ΛCDM model, the first peak position fits data with \\(\\Omega_\\Lambda h^2 \\approx 0.315\\), where \\(\\Omega_\\Lambda\\) is the present-day dark energy density parameter and \\(h\\) is the reduced Hubble constant, as determined from Planck's full-mission analysis combining temperature and polarization data. Ground-based observations from ACT and SPT corroborate these results, showing consistent peak positions that align with \\(\\Omega_\\Lambda h^2 \\approx 0.31\\) when combined with Planck data. The presence of dark energy suppresses the amplitudes of higher-order peaks relative to a matter-dominated model, due to its role in altering the integrated expansion history and reducing the contrast of potential wells during photon propagation; this suppression is evident in the observed damping of peaks beyond \\(\\ell \\approx 1000\\), providing indirect evidence for dark energy at over 3σ significance from CMB data alone.\n\nA direct signature of dark energy in the CMB arises from the integrated Sachs-Wolfe (ISW) effect, which measures the cumulative change in photon energy as they traverse evolving gravitational potentials in an accelerating universe. The temperature fluctuation due to the ISW is given by\n\n\\[\n\\frac{\\Delta T}{T} = 2 \\int \\dot{\\Phi} \\, \\frac{dl}{c},\n\\]\n\nwhere \\(\\Phi\\) is the gravitational potential, the dot denotes its time derivative, and the integral is along the photon path from the last scattering surface to the observer. In a dark energy-dominated era, the potentials decay because dark energy counteracts matter clustering, leading to a net blueshift (or redshift) of CMB photons and large-scale temperature distortions on angular scales \\(\\\theta \\gtrsim 5^\\circ\\). Planck measurements detect this late-time ISW effect at the 2-3σ level through cross-correlations with galaxy surveys, confirming the predicted decay driven by dark energy and constraining its equation-of-state parameter \\(w\\) to be consistent with -1 within uncertainties.\n\nCMB polarization data, particularly the E-mode auto-power spectrum (EE) and temperature-E-mode cross-spectrum (TE), further tighten constraints on dark energy by probing the same acoustic physics while being less contaminated by foregrounds and late-time effects like lensing. These spectra confirm a flat spatial geometry (\\(\\Omega_k = 0\\)) to high precision, as deviations would shift the peak locations; Planck's polarization analysis yields \\(\\Omega_k = -0.0007 \\pm 0.0019\\), supporting the flatness required for dark energy to close the energy budget. Additionally, the combined data parameterize matter clustering via \\(\\sigma_8 (\\Omega_m / 0.3)^{0.5} \\approx 0.81\\), where \\(\\sigma_8\\) is the root-mean-square fluctuation amplitude on 8 \\(h^{-1}\\) Mpc scales and \\(\\Omega_m\\) is the matter density parameter, indicating suppressed growth consistent with dark energy's influence on structure formation.\n\nRecent analyses, including a 2024 reprocessing of Planck data incorporating updated lensing reconstruction (PR4), maintain consistency with the ΛCDM model but reveal mild tensions in the growth parameter that hint at possible deviations from a constant \\(w = -1\\). Previews from the Simons Observatory, which achieved first light for its large aperture telescope in 2025 with enhanced sensitivity to small-scale polarization, forecast tighter constraints on dynamical dark energy models, potentially amplifying these hints through improved EE and TE measurements at high multipoles.\n\n### Large-Scale Structure and Baryon Acoustic Oscillations\n\nBaryon acoustic oscillations (BAO) provide a key probe of dark energy through the large-scale structure of the universe, acting as a standard ruler calibrated by the sound horizon at recombination, which spans approximately 150 Mpc in comoving distance. This scale originates from pressure waves in the early universe's photon-baryon plasma, freezing out as a characteristic bump in the galaxy correlation function \\(\\xi(r)\\) at separations around this distance after recombination. The Alcock-Paczyński test applies this feature to measure the expansion history by comparing observed angular and radial separations to expected isotropic scales, revealing distortions if the assumed cosmology mismatches the true \\(H(z)\\) or angular diameter distance \\(D_A(z)\\).\n\nMajor galaxy surveys have detected and refined BAO measurements, constraining dark energy's influence on cosmic distances and structure growth. The Sloan Digital Sky Survey (SDSS) first detected the BAO peak in luminous red galaxies, establishing the scale with 4% precision. The Baryon Oscillation Spectroscopic Survey (BOSS), an extension of SDSS-III, measured BAO in galaxy samples up to \\(z \\approx 0.7\\), yielding the dilation scale \\(D_V(z)/r_d\\) (where \\(r_d\\) is the sound horizon) with 1-2% accuracy and constraining \\(H(z)\\) and \\(D_A(z)\\) to percent levels, consistent with a flat \\(\\Lambda\\)CDM model but testing deviations in dark energy density. The Dark Energy Survey (DES) complemented these with BAO detections in photometric samples up to \\(z \\approx 1\\), reporting \\(D_V(z)/r_d\\) measurements that tighten bounds on the matter density \\(\\Omega_m\\) and dark energy equation-of-state parameter \\(w\\).\n\nRecent results from the Dark Energy Spectroscopic Instrument (DESI) Data Release 2 (DR2), covering more than 14 million galaxies and quasars up to \\(z \\approx 1.2\\), have delivered the most precise BAO constraints to date, with \\(D_V(z)/r_d\\) measured to sub-percent precision across multiple redshifts. These yield constraints consistent with a cosmological constant but, in extended analyses using models like w0waCDM, show ~3σ hints of \\(w\\) evolution, suggesting dark energy may vary mildly with redshift rather than remaining constant. Combined analyses favor \\(\\Omega_m = 0.30 \\pm 0.01\\).\n\nDark energy also imprints on structure growth via the growth factor \\(f\\sigma_8(z)\\), where \\(f\\) is the logarithmic growth rate and \\(\\sigma_8\\) normalizes density fluctuations on 8 \\(h^{-1}\\) Mpc scales; acceleration suppresses clustering relative to matter-dominated expectations. BOSS and DESI measurements of \\(f\\sigma_8(z)\\) from redshift-space distortions in galaxy clustering confirm this suppression, with values like \\(f\\sigma_8(0.57) = 0.455 \\pm 0.026\\) from BOSS aligning with \\(\\Lambda\\)CDM predictions but enabling tests of dynamic dark energy models that alter growth.\n\nCosmic voids, underdense regions spanning tens of Mpc, serve as additional tracers of dark energy through their size distribution and dynamics, with void abundances sensitive to the equation of state via expansion effects on underdensity evolution. Redshift-space distortions around voids further probe growth, revealing outflow velocities that reflect dark energy's impact on peculiar motions, with models showing voids can constrain \\(w\\) to 10-20% precision in future surveys.\n\n### Additional Probes\n\nOne prominent tension in dark energy studies arises from measurements of the Hubble constant \\(H_0\\), which quantifies the current expansion rate of the universe. Local determinations using the cosmic distance ladder, such as those from the SH0ES team analyzing Cepheid-calibrated Type Ia supernovae, yield \\(H_0 = 73.04 \\pm 1.04\\) km/s/Mpc. In contrast, early-universe inferences from cosmic microwave background (CMB) anisotropies by the Planck satellite give \\(H_0 = 67.4 \\pm 0.5\\) km/s/Mpc. This ~5σ discrepancy persists as of November 2025, with James Webb Space Telescope (JWST) cross-checks confirming the SH0ES local value around 73 km/s/Mpc, though independent JWST-based analyses using other methods (e.g., tip of the red giant branch) yield ~70.4 ± 2.1 km/s/Mpc, suggesting the tension may be resolving or indicative of new physics.\n\nThe late-time integrated Sachs-Wolfe (ISW) effect provides another supporting probe, arising from the redshift of CMB photons as they traverse evolving gravitational potentials in large-scale structures influenced by dark energy. Cross-correlations between the Wilkinson Microwave Anisotropy Probe (WMAP) CMB maps and Sloan Digital Sky Survey (SDSS) luminous red galaxies have detected this effect at ~2-3σ significance, consistent with dark energy driving the decay of potentials at low redshifts. Subsequent analyses with Planck and updated galaxy surveys reinforce this signal, offering an independent constraint on dark energy's role in late-time cosmic acceleration.\n\nWeak gravitational lensing surveys further constrain dark energy through measurements of matter clustering amplitude, parameterized by \\(\\sigma_8\\) (the root-mean-square density fluctuation on 8 \\(h^{-1}\\) Mpc scales). The Kilo-Degree Survey (KiDS-1000) and Hyper Suprime-Cam (HSC) Year 3 analyses yield \\(\\sigma_8 \\approx 0.76\\), lower than the CMB-derived \\(\\sigma_8 \\approx 0.81\\), indicating mild tension that dark energy models must accommodate. Cluster abundance counts from these surveys, combined with lensing profiles, tighten bounds on dark energy's equation-of-state parameter \\(w\\), while the Euclid mission's initial data release in March 2025 provides preview imaging from deep fields, with full weak lensing cosmological analyses expected in 2026 to refine these constraints with improved precision on cosmic shear power spectra.\n\nRecent 2024-2025 observations have introduced intriguing hints of dark energy dynamics. The Dark Energy Spectroscopic Instrument (DESI) Data Release 2 baryon acoustic oscillation results from March 2025, building on Year 1, favor models where dark energy's density weakens over time, with equation-of-state deviations from \\(w = -1\\) at ~3σ level when combined with supernova and CMB data. Complementarily, JWST observations of high-redshift Type Ia supernovae have reduced systematic uncertainties in light-curve standardization, yielding more robust distance estimates that align with local \\(H_0\\) values and bolster evidence for potential dark energy evolution. These probes show broad consistency with baryon acoustic oscillation scales from earlier measurements.\n\n## Theoretical Models\n\n### Cosmological Constant\n\nThe cosmological constant, denoted \\(\\Lambda\\), serves as the simplest theoretical model for dark energy and is incorporated directly into Einstein's field equations as a geometric term:\n\n\\[\nR_{\\mu\\\nu} - \\frac{1}{2} R g_{\\mu\\\nu} + \\Lambda g_{\\mu\\\nu} = \\frac{8\\pi G}{c^4} T_{\\mu\\\nu},\n\\]\n\nwhere \\(R_{\\mu\\\nu}\\) is the Ricci curvature tensor, \\(R\\) the Ricci scalar, \\(g_{\\mu\\\nu}\\) the metric tensor, \\(G\\) Newton's gravitational constant, \\(c\\) the speed of light, and \\(T_{\\mu\\\nu}\\) the stress-energy tensor. This formulation allows \\(\\Lambda\\) to be reinterpreted on the matter side as a uniform vacuum energy density \\(\\rho_\\Lambda = \\frac{\\Lambda c^2}{8\\pi G}\\) with an associated pressure \\(p_\\Lambda = -\\rho_\\Lambda c^2\\).\n\nUnlike matter or radiation densities, which dilute as the universe expands, \\(\\rho_\\Lambda\\) remains constant over time and space, exerting a repulsive gravitational effect due to its negative pressure. This leads to an equation-of-state parameter \\(w = p_\\Lambda / (\\rho_\\Lambda c^2) = -1\\), which drives the observed late-time acceleration of cosmic expansion. The model gained renewed prominence following the 1998 discovery of accelerating expansion from type Ia supernovae observations.\n\nIn the standard \\(\\Lambda\\)CDM framework, the cosmological constant with \\(w = -1\\) provides the best fit to a wide array of cosmological data, including cosmic microwave background anisotropies, type Ia supernovae distances, and baryon acoustic oscillation scales.\n\nA major theoretical challenge, known as the cosmological constant problem, stems from the vast discrepancy between the observed \\(\\rho_\\Lambda \\sim 10^{-120} M_{\\rm Pl}^4\\)—where \\(M_{\\rm Pl}\\) is the reduced Planck mass—and the quantum field theory prediction for the zero-point vacuum energy density of order \\(M_{\\rm Pl}^4\\), a difference spanning roughly 120 orders of magnitude.\n\nAs a fixed, non-dynamical component, \\(\\Lambda\\) introduces no intrinsic quantum fluctuations, distinguishing it from evolving field models, and implies that the universe will evolve toward an eternal de Sitter phase in the distant future, dominated by exponential expansion with a constant Hubble rate \\(H = \\sqrt{\\Lambda/3}\\).\n\n### Dynamic Scalar Fields\n\nDynamic scalar fields provide a framework for modeling dark energy as a time-varying component driven by the evolution of a scalar field \\(\\phi\\), contrasting with the static cosmological constant by allowing the equation of state parameter \\(w\\) to change with cosmic time. In the canonical quintessence model, the field is described by the Lagrangian \\(\\mathcal{L} = \\frac{1}{2} \\partial_\\mu \\phi \\partial^\\mu \\phi - V(\\phi)\\), where \\(V(\\phi)\\) is a potential that determines the field's dynamics, often taken as an inverse power-law form such as \\(V(\\phi) \\propto \\phi^{-p}\\) with \\(p \\u003e 0\\). The energy density \\(\\rho_\\phi = \\frac{1}{2} \\dot{\\phi}^2 + V(\\phi)\\) and pressure \\(p_\\phi = \\frac{1}{2} \\dot{\\phi}^2 - V(\\phi)\\) yield \\(w = p_\\phi / \\rho_\\phi = \\frac{\\dot{\\phi}^2 / 2 - V}{\\dot{\\phi}^2 / 2 + V}\\), which evolves from values greater than -1 in the early universe toward -1 today under slow-roll conditions where the kinetic energy is subdominant.\n\nQuintessence models are classified into tracker and thawing subtypes based on their dynamical behavior. Tracker models feature potentials like exponential \\(V(\\phi) \\propto e^{-\\lambda \\phi}\\) or inverse power-law forms, where the field evolves along an attractor trajectory that keeps \\(\\rho_\\phi\\) a fixed fraction of the dominant energy density—such as radiation or matter—before accelerating the expansion in the late universe, thereby alleviating the coincidence problem without extreme initial conditions. In thawing models, the field remains nearly frozen due to Hubble friction in the early universe, with \\(w \\approx -1\\), and begins rolling downhill from a flat potential region only recently, leading to \\(w\\) increasing away from -1 as the field gains kinetic energy; representative potentials include those approaching a constant at large \\(\\phi\\).\n\nPhantom dark energy extends scalar field dynamics to regions where \\(w \\u003c -1\\), achieved by flipping the sign of the kinetic term in the Lagrangian to \\(\\mathcal{L} = -\\frac{1}{2} \\partial_\\mu \\phi \\partial^\\mu \\phi - V(\\phi)\\), resulting in negative kinetic energy that allows the field's energy density to increase with expansion. Such models can evolve \\(w\\) from values greater than -1 to less than -1, though crossing the phantom divide \\(w = -1\\) requires careful potential design to avoid instabilities. K-essence generalizes this further with a Lagrangian \\(P(X, \\phi)\\) where \\(X = \\frac{1}{2} \\partial_\\mu \\phi \\partial^\\mu \\phi\\), incorporating non-canonical kinetic terms that enable attractor solutions for late-time acceleration without fine-tuning the potential slope. Coupled quintessence variants introduce a conformal coupling between \\(\\phi\\) and matter fields, modifying the field's roll to enhance tracking while preserving scalar-driven dynamics.\n\nObservational constraints on these models have tightened with recent data, highlighting their viability and limitations. The Dark Energy Spectroscopic Instrument (DESI) 2024 results, combining baryon acoustic oscillations with cosmic microwave background and supernova measurements, show a preference for time-varying \\(w(z)\\) at the 2\\(\\sigma\\) level in thawing and other quintessence-like models, with fits improving over \\(\\Lambda\\)CDM by \\(\\Delta \\chi^2 \\approx -5\\) to -17, though mirage models mimic \\(\\Lambda\\)CDM distances despite dynamics. However, quintessence suffers from a fine-tuning problem, requiring the initial field value or potential parameters to be adjusted precisely to ensure \\(\\rho_\\phi\\) dominates today without dominating earlier epochs. As of November 2025, the latest DESI analyses indicate that dark energy may be weakening, potentially slowing the universe's expansion, further supporting dynamical models over a constant \\(\\Lambda\\).\n\n### Interacting and Phantom Models\n\nIn interacting dark energy models, dark energy is permitted to exchange energy with other cosmic components, such as dark matter, through non-gravitational interactions, deviating from the standard assumption of independent evolution. The continuity equation for dark energy density \\(\\rho_{DE}\\) is modified to \\(\\dot{\\rho}_{DE} = -3H(1 + w_{DE})\\rho_{DE} + Q\\), where \\(H\\) is the Hubble parameter, \\(w_{DE}\\) is the equation-of-state parameter, and \\(Q\\) represents the interaction term. Common forms of \\(Q\\) include proportional couplings like \\(Q = \\Gamma \\rho_{DM}\\), where \\(\\Gamma\\) is a coupling constant and \\(\\rho_{DM}\\) is the dark matter density, allowing energy transfer from dark matter to dark energy to address issues like the coincidence problem where dark components have comparable densities today. These models extend beyond non-interacting scalar fields by introducing cross-sector dynamics that can alter expansion history and structure formation.\n\nPhantom dark energy models feature an equation-of-state parameter \\(w \\u003c -1\\), implying negative kinetic energy for the underlying field and a density evolution \\(\\rho_{DE} \\propto a^{-3(1+w)}\\), where \\(a\\) is the scale factor, leading to increasing energy density over time. This behavior contrasts with standard dark energy and can unify dark matter and dark energy in single-component models, such as the Chaplygin gas, where the equation of state \\(p = -A / \\rho^\\alpha\\) (with \\(\\alpha \\approx 1\\)) transitions from dust-like (\\(w \\approx 0\\)) at high densities to phantom-like (\\(w \\u003c -1\\)) at low densities, mimicking both components in a unified framework. Such unified models, including generalized variants, have been explored to reconcile observational data on cosmic acceleration and matter clustering without separate dark sectors.\n\nRecent advancements include time-varying quintessence-like interactions that incorporate mild couplings evolving with redshift, as analyzed in a 2025 study suggesting these could fit evolving dark energy signatures without violating stability. Constraints from the Dark Energy Spectroscopic Instrument (DESI) Year 2 baryon acoustic oscillation data favor models with weak interactions, placing tight upper limits on coupling strengths while maintaining consistency with cosmic microwave background and supernova observations.\n\nObservationally, interacting models have been tested for their ability to alleviate the Hubble constant (\\(H_0\\)) tension between early- and late-universe measurements, with energy transfers allowing higher \\(H_0\\) values (around 70-73 km/s/Mpc) that align local distance ladder results with Planck data. Similarly, these models can mitigate the \\(\\sigma_8\\) tension in matter clustering by suppressing growth through dark matter decay into dark energy, reducing \\(\\sigma_8\\) by up to 10% to match weak lensing and galaxy survey discrepancies. DESI analyses confirm that such interactions provide better fits to combined datasets without introducing instabilities.\n\n## Alternative Interpretations\n\n### Modified Gravity Approaches\n\nModified gravity approaches seek to explain the observed cosmic acceleration attributed to dark energy by altering the fundamental laws of general relativity, rather than introducing exotic energy components. These theories modify the gravitational action to produce an effective cosmological constant or dynamic behavior that mimics dark energy on large scales, while remaining consistent with general relativity in local environments through screening mechanisms.\n\nOne prominent class is f(R) gravity, where the Einstein-Hilbert action is generalized by replacing the Ricci scalar \\(R\\) with a function \\(f(R)\\), given by\n\\[\nS = \\int d^4x \\sqrt{-g} \\left[ \\frac{f(R)}{16\\pi G} + \\mathcal{L}_m \\right],\n\\]\nleading to field equations that can yield an effective \\(\\Lambda\\) term responsible for late-time acceleration. This modification allows f(R) models to drive cosmic expansion without a separate dark energy sector, as the higher-order curvature terms contribute to an energy density that evolves like a cosmological constant at low redshifts. A seminal example is the Starobinsky model, originally proposed for inflation as \\(f(R) = R + \\alpha R^2\\) with \\(\\alpha \\u003e 0\\), which has been extended to dark energy by incorporating additional terms that stabilize the potential and ensure viability at late times.90670-X) In this extension, the model produces a de Sitter-like phase for acceleration while satisfying cosmological viability conditions, such as the existence of a stable minimum in the scalar potential.\n\nScalar-tensor theories, such as Brans-Dicke theory, introduce a scalar field \\(\\phi\\) that couples non-minimally to the metric, modifying gravity through the parameter \\(\\omega_{BD}\\), which controls the field's kinetic term and the strength of the fifth force it mediates. In the Brans-Dicke action, the effective gravitational constant varies as \\(G_{\\rm eff} \\propto 1/\\phi\\), allowing the scalar to drive acceleration on cosmological scales. To evade stringent local tests, these theories employ screening mechanisms: the chameleon mechanism, where the scalar's effective mass increases in high-density regions like the solar system, suppressing the fifth force; and the symmetron mechanism, which relies on symmetry breaking in low-density environments to enhance the force cosmologically while screening it locally via environmental dependence of the field's vacuum expectation value.\n\nThese models face tight constraints from both local and cosmological observations. Solar system tests, particularly the Cassini mission's measurement of the Shapiro time delay, impose a lower bound \\(\\omega_{BD} \\u003e 40{,}000\\) on the Brans-Dicke parameter, requiring efficient screening to avoid deviations from general relativity. Cosmologically, data from the Dark Energy Spectroscopic Instrument (DESI) 2024 first-year clustering analysis, using full-shape modeling, show no strong preference for modified gravity parameters over the \\(\\Lambda\\)CDM model, with deviations consistent with general relativity at the percent level (e.g., \\(\\mu_0 = 0.05 \\pm 0.22\\), \\(\\Sigma_0 = 0.008 \\pm 0.045\\)).\n\nA specific braneworld example is the Dvali-Gabadadze-Porrati (DGP) model, where our universe is a 4D brane embedded in 5D Minkowski space, leading to late-time acceleration from modified gravitational leakage into the bulk at large scales, without invoking dark energy. In the self-accelerating branch, the crossover scale \\(r_c\\) between 4D and 5D gravity sets the acceleration epoch, with the effective equation of state \\(w \\approx -1 + \\frac{1}{3\\sqrt{\\Omega_{rc}}}\\) approaching \\(-1\\) today. However, DGP requires fine-tuning and faces tensions with Hubble constant measurements, though it remains viable under current constraints.\n\n### Inhomogeneous and Backreaction Models\n\nInhomogeneous cosmology proposes that the observed acceleration of the universe's expansion, typically attributed to dark energy, may arise from large-scale deviations from the homogeneity and isotropy assumed in the standard Friedmann-Lemaître-Robertson-Walker (FLRW) models, while adhering strictly to general relativity. These models suggest that our local environment, such as a vast underdense region or void surrounding the Milky Way, could create an apparent global acceleration when averaging over inhomogeneous structures. This approach avoids introducing exotic components like a cosmological constant or dynamic fields, instead emphasizing the role of gravitational effects from density contrasts in explaining supernova distance measurements and other observations.\n\nLemaître-Tolman-Bondi (LTB) models represent a class of exact, spherically symmetric solutions to Einstein's equations for dust-dominated universes, serving as toy models for giant voids that mimic dark energy effects. In these models, the metric takes the form\n\n\\[\nds^2 = -dt^2 + \\frac{(\\partial_r R)^2}{1 - k(r)} dr^2 + R^2 d\\Omega^2,\n\\]\n\nwhere \\(R = R(t, r)\\) is the areal radius, \\(k(r)\\) encodes the curvature profile, and the radial coordinate \\(r\\) parameterizes shells of matter with varying bang time and density. By placing the observer near the center of an underdense region—a Gpc-scale void—the local expansion rate appears slower than the global average, leading to an illusory acceleration in luminosity distances of distant supernovae, as if dark energy were present. Such configurations can fit Type Ia supernova data without \\(\\Lambda\\), but require the void to be sufficiently large and compensated by an overdense shell to match the observed Hubble diagram.\n\nBackreaction effects in general relativity arise when averaging over inhomogeneous geometries, where the average scalar curvature \\(\\langle R \\rangle\\) does not equal the curvature of the average metric \\(R(\\langle g \\rangle)\\), introducing non-negligible corrections to the effective Friedmann equations. The Buchert equations formalize this averaging procedure for irrotational dust, yielding\n\n\\[\n3 \\frac{\\ddot{a}_D}{a_D} = -\\frac{1}{2} \\langle \\rho \\rangle + Q, \\quad 3 H_D^2 = 8\\pi G \\langle \\rho \\rangle - \\frac{1}{2} \\langle R \\rangle - \\frac{1}{2} Q,\n\\]\n\nwith \\(a_D\\) the domain-averaged scale factor, \\(H_D = \\dot{a}_D / a_D\\), kinematic backreaction \\(Q\\) measuring variance in expansion, and \\(\\langle R \\rangle\\) the averaged spatial Ricci scalar. In structure-filled universes, positive \\(Q\\) from voids and clusters can drive an effective acceleration, interpreting the apparent \\(\\Lambda\\) as an artifact of neglecting these averaging discrepancies rather than a physical entity.\n\nRecent analyses of Type Ia supernova data have fueled skepticism toward acceleration, suggesting inhomogeneities might favor a decelerating expansion. A 2025 reanalysis of over 300 supernovae by Yonsei University researchers, incorporating progenitor age biases and alignment with baryon acoustic oscillation measurements from the Dark Energy Spectroscopic Instrument (DESI), indicates the universe entered a decelerated phase at the present epoch, with dark energy evolving and potentially weakening, consistent with void-induced slowdowns rather than uniform acceleration.\n\nDespite their appeal, inhomogeneous and backreaction models face significant challenges. LTB voids demand extreme fine-tuning, such as placing the observer within ~1% of the void's center to match observed isotropy and requiring precise density profiles to avoid contradictions with integrated Sachs-Wolfe effects in the cosmic microwave background (CMB). Backreaction contributions are generally small—estimated at ~10^{-3} relative to the Hubble rate—insufficient to fully account for the observed acceleration without additional assumptions, and they struggle against the high isotropy of the CMB, which limits void sizes to less than ~2 Gpc at 95% confidence.\n\n## Cosmological and Philosophical Implications\n\n### Impact on the Universe's Fate\n\nIn the standard ΛCDM model, dark energy in the form of a cosmological constant drives the universe toward eternal expansion, culminating in a heat death scenario known as the Big Freeze. As the scale factor \\(a(t)\\) grows exponentially as \\(a(t) \\propto \\exp(H t)\\) in the asymptotic de Sitter phase, where \\(H\\) is the constant Hubble parameter, matter and radiation densities dilute to negligible levels, leaving a cold, empty expanse dominated by vacuum energy. This outcome aligns with observations of accelerating expansion, where dark energy constitutes approximately 68% of the current energy budget, ensuring no future recollapse.\n\nIf dark energy behaves as phantom energy with an equation of state parameter \\(w \\u003c -1\\), the universe faces a dramatically different fate: the Big Rip singularity. In this scenario, the energy density of dark energy increases with expansion, leading to super-acceleration that overcomes all gravitational binding forces, first shredding galaxy clusters, then galaxies, stars, planets, and ultimately atoms in a finite time. The rip occurs at \\(t_{\\rm rip} = \\frac{2}{3 H_0 |1 + w|}\\), where \\(H_0\\) is the present Hubble constant, potentially within 20-100 billion years depending on the exact value of \\(w\\). This catastrophic end contrasts sharply with the ΛCDM prediction and remains disfavored by current data, which constrain \\(w\\) near -1.\n\nRecent observations from the Dark Energy Spectroscopic Instrument (DESI) in 2025 provide hints of a time-varying equation of state \\(w(z)\\), parametrized as \\(w(z) = w_0 + w_a (1 - a)\\) with \\(a\\) the scale factor, suggesting dark energy may not remain constant. These results indicate a possible evolution where \\(w\\) could cross above -1 in the future, potentially slowing acceleration and averting eternal expansion toward heat death or a rip, or even allowing for eventual recollapse if \\(w \\u003e -1\\) persists. Such dynamics challenge the fixed ΛCDM fate but require further confirmation.\n\nFuture missions like Euclid, launched in 2023, are poised to refine these predictions by mapping cosmic structures to constrain the dark energy equation of state to approximately 1% precision through baryon acoustic oscillations and weak lensing. These measurements will directly probe long-term evolution, distinguishing between eternal expansion, rips, or transitional scenarios with unprecedented accuracy.\n\n### Philosophical and Methodological Debates\n\nThe coincidence problem poses a significant puzzle in cosmology: why does the dark energy density parameter \\(\\Omega_\\Lambda\\) approximately equal the matter density parameter \\(\\Omega_m\\) in the present epoch, despite their disparate scaling behaviors over cosmic time? This near-equality, with both around 0.3 today, appears finely tuned and unlikely without an underlying explanation. One approach invokes the anthropic principle within a multiverse framework, particularly the string theory landscape, where myriad vacua exist with varying cosmological constants; observers can only emerge in those regions permitting sufficient structure formation before acceleration dominates, thus selecting for \\(\\Omega_\\Lambda \\approx \\Omega_m\\). Recent models, such as those combining negative cosmological constants with axion fields motivated by string theory, further explore anthropic selection to address this tuning.\n\nObservational skepticism has intensified with 2025 publications questioning the need for dark energy altogether. A University of Chicago study proposes that physics-based models indicate dark energy evolves rather than remains constant, potentially resolving discrepancies without invoking a static \\(\\Lambda\\). Similarly, Royal Astronomical Society research applied corrections to supernova data from the Dark Energy Survey, revealing that the adjusted dataset no longer supports accelerated expansion under the \\(\\Lambda\\)CDM model and instead suggests a slowdown, thereby challenging the foundational evidence for dark energy. These analyses highlight concerns over supernova data reliability, including systematic errors in distance measurements that may have overstated acceleration.\n\nIn the philosophy of cosmology, dark energy exemplifies a placeholder concept—empirically necessary to fit observations but lacking a fundamental theoretical basis—raising debates about whether it represents a true physical entity or merely an interim descriptor for incomplete physics. Bayesian model selection techniques underscore these tensions, as they compare the cosmological constant against dynamical alternatives; for instance, recent analyses show flexknot dark energy models initially favored by evidence but ultimately outperformed by systematic error corrections, illustrating the challenge in decisively selecting between static and evolving paradigms. Such methods reveal that while \\(\\Lambda\\)CDM remains statistically viable, Bayesian factors often indicate marginal preferences for non-constant models, complicating inferences about dark energy's nature.\n\nOpen questions loom large, particularly the integration of dark energy with quantum gravity, where the cosmological constant problem exposes a vast mismatch—up to 120 orders of magnitude—between quantum field theory vacuum energy predictions and observed values, hindering unification efforts. The 2024-2025 Dark Energy Spectroscopic Instrument (DESI) results have further prompted reevaluation of \\(\\Lambda\\) dominance, providing hints of evolving dark energy that weakens over time and challenges the assumption of a constant component in standard cosmology. These findings, when combined with baryon acoustic oscillation and supernova data, suggest potential deviations from \\(\\Lambda\\)CDM, urging broader theoretical scrutiny.",
  "external_references": [
    {
      "text": "Dark Energy",
      "url": "https://science.nasa.gov/dark-energy/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "1807.06209",
      "url": "https://arxiv.org/abs/1807.06209",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Dark Energy And Dark Matter",
      "url": "https://www.cfa.harvard.edu/research/topic/dark-energy-and-dark-matter",
      "domain": "cfa.harvard.edu",
      "type": "citation"
    },
    {
      "text": "New Desi Results Strengthen Hints That Dark Energy May Evolve",
      "url": "https://newscenter.lbl.gov/2025/03/19/new-desi-results-strengthen-hints-that-dark-energy-may-evolve/",
      "domain": "newscenter.lbl.gov",
      "type": "citation"
    },
    {
      "text": "New Science Results Images Euclid Q1",
      "url": "https://www.euclid-ec.org/public/press-releases/new-science-results-images-euclid-q1/",
      "domain": "euclid-ec.org",
      "type": "citation"
    },
    {
      "text": "1701.07261",
      "url": "https://arxiv.org/pdf/1701.07261",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1804.06768",
      "url": "https://arxiv.org/pdf/1804.06768",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Pmc8919128",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8919128/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Friedmann Universe Expand Contract",
      "url": "https://www.aps.org/apsnews/2024/05/friedmann-universe-expand-contract",
      "domain": "aps.org",
      "type": "citation"
    },
    {
      "text": "300499",
      "url": "https://iopscience.iop.org/article/10.1086/300499",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "307221",
      "url": "https://iopscience.iop.org/article/10.1086/307221",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Press Release",
      "url": "https://www.nobelprize.org/prizes/physics/2011/press-release/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Frieman6.html",
      "url": "https://ned.ipac.caltech.edu/level5/March08/Frieman/Frieman6.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Rpp2023 Rev Dark Energy.pdf",
      "url": "https://pdg.lbl.gov/2023/reviews/rpp2023-rev-dark-energy.pdf",
      "domain": "pdg.lbl.gov",
      "type": "citation"
    },
    {
      "text": "Frieman2.html",
      "url": "https://ned.ipac.caltech.edu/level5/March08/Frieman/Frieman2.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "1611.01899",
      "url": "https://arxiv.org/pdf/1611.01899",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "S10052 017 4720 1",
      "url": "https://link.springer.com/article/10.1140/epjc/s10052-017-4720-1",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Revmodphys.61.1",
      "url": "https://link.aps.org/doi/10.1103/RevModPhys.61.1",
      "domain": "link.aps.org",
      "type": "citation"
    },
    {
      "text": "0803.0982",
      "url": "https://arxiv.org/abs/0803.0982",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Ac8b7a",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/ac8b7a",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "0501171",
      "url": "https://arxiv.org/abs/astro-ph/0501171",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://ui.adsabs.harvard.edu/abs/1979Natur.281..358A/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "1607.03155",
      "url": "https://arxiv.org/abs/1607.03155",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2503.14738",
      "url": "https://arxiv.org/abs/2503.14738",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "S41550 025 02669 6",
      "url": "https://www.nature.com/articles/s41550-025-02669-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "1002.0014",
      "url": "https://arxiv.org/abs/1002.0014",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1707.08121",
      "url": "https://arxiv.org/abs/1707.08121",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2025 11 Supernova Standard Candle Wrong Hubble.html",
      "url": "https://phys.org/news/2025-11-supernova-standard-candle-wrong-hubble.html",
      "domain": "phys.org",
      "type": "citation"
    },
    {
      "text": "414",
      "url": "https://iopscience.iop.org/article/10.1088/0004-637X/701/1/414",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Aa25831 15.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2016/10/aa25831-15/aa25831-15.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "Aa52122 24.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2025/03/aa52122-24/aa52122-24.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "Cosmological Constant",
      "url": "http://www.scholarpedia.org/article/Cosmological_constant",
      "domain": "scholarpedia.org",
      "type": "citation"
    },
    {
      "text": "4202 Friedmann.html",
      "url": "https://people.physics.carleton.ca/~watson/Physics/Astrophysics/4202_Cosmology/4202_Friedmann.html",
      "domain": "people.physics.carleton.ca",
      "type": "citation"
    },
    {
      "text": "9805201",
      "url": "https://arxiv.org/abs/astro-ph/9805201",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "0207347",
      "url": "https://arxiv.org/abs/astro-ph/0207347",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "9812313",
      "url": "https://arxiv.org/abs/astro-ph/9812313",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Physrevlett.95.141301",
      "url": "https://link.aps.org/doi/10.1103/PhysRevLett.95.141301",
      "domain": "link.aps.org",
      "type": "citation"
    },
    {
      "text": "0006373",
      "url": "https://arxiv.org/abs/astro-ph/0006373",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "9908023",
      "url": "https://arxiv.org/abs/astro-ph/9908023",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2405.13588",
      "url": "https://arxiv.org/abs/2405.13588",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "251106003209.htm",
      "url": "https://www.sciencedaily.com/releases/2025/11/251106003209.htm",
      "domain": "sciencedaily.com",
      "type": "citation"
    },
    {
      "text": "1204.5892",
      "url": "https://arxiv.org/abs/1204.5892",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2302.11949",
      "url": "https://arxiv.org/abs/2302.11949",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1905.07304",
      "url": "https://arxiv.org/abs/1905.07304",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Aa0236 04.html",
      "url": "https://www.aanda.org/articles/aa/abs/2004/32/aa0236-04/aa0236-04.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "1204.4798",
      "url": "https://arxiv.org/abs/1204.4798",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Pnas.2524499122",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2524499122",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "2503.23225",
      "url": "https://arxiv.org/abs/2503.23225",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1704.08342",
      "url": "https://arxiv.org/abs/1704.08342",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2505.23382",
      "url": "https://arxiv.org/abs/2505.23382",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Ad87f0",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/ad87f0",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "1101.0191",
      "url": "https://arxiv.org/abs/1101.0191",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1002.4928",
      "url": "https://arxiv.org/abs/1002.4928",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "0370 2693(80",
      "url": "https://doi.org/10.1016/0370-2693(80",
      "domain": "doi.org",
      "type": "citation"
    },
    {
      "text": "2112.00822",
      "url": "https://arxiv.org/abs/2112.00822",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1907.07667",
      "url": "https://arxiv.org/abs/1907.07667",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Physrevd.101.043518",
      "url": "https://doi.org/10.1103/PhysRevD.101.043518",
      "domain": "doi.org",
      "type": "citation"
    },
    {
      "text": "S41114 018 0011 X",
      "url": "https://link.springer.com/article/10.1007/s41114-018-0011-x",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "2411.12026",
      "url": "https://arxiv.org/abs/2411.12026",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1807.00213",
      "url": "https://arxiv.org/abs/1807.00213",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2510.13121",
      "url": "https://arxiv.org/abs/2510.13121",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Physrevd.104.083511",
      "url": "https://link.aps.org/doi/10.1103/PhysRevD.104.083511",
      "domain": "link.aps.org",
      "type": "citation"
    },
    {
      "text": "9903425",
      "url": "https://arxiv.org/abs/astro-ph/9903425",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "0302506",
      "url": "https://arxiv.org/abs/astro-ph/0302506",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "0410095",
      "url": "https://arxiv.org/pdf/hep-th/0410095",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Sv119 Bousso.pdf",
      "url": "https://www.pas.va/content/dam/casinapioiv/pas/pdf-volumi/scripta-varia/sv119/sv119-bousso.pdf",
      "domain": "pas.va",
      "type": "citation"
    },
    {
      "text": "Reconsidering The Cosmological Constant",
      "url": "https://physicalsciences.uchicago.edu/news/article/reconsidering-the-cosmological-constant/",
      "domain": "physicalsciences.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Universes Expansion Now Slowing Not Speeding",
      "url": "https://ras.ac.uk/news-and-press/research-highlights/universes-expansion-now-slowing-not-speeding",
      "domain": "ras.ac.uk",
      "type": "citation"
    },
    {
      "text": "2025 11 Universe Expansion Evidence Mounts Dark.html",
      "url": "https://phys.org/news/2025-11-universe-expansion-evidence-mounts-dark.html",
      "domain": "phys.org",
      "type": "citation"
    },
    {
      "text": "1458871229f5b870d566ac0c06945603",
      "url": "https://www.cambridge.org/core/elements/philosophy-of-cosmology-and-astrophysics/1458871229F5B870D566AC0C06945603",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "2509.13220",
      "url": "https://arxiv.org/abs/2509.13220",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1009464",
      "url": "https://academic.oup.com/mnras/article/437/1/887/1009464",
      "domain": "academic.oup.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "space",
      "page": "Space"
    },
    {
      "text": "expansion of the universe",
      "page": "Expansion_of_the_universe"
    },
    {
      "text": "Saul Perlmutter",
      "page": "Saul_Perlmutter"
    },
    {
      "text": "Brian Schmidt",
      "page": "Brian_Schmidt"
    },
    {
      "text": "Adam Riess",
      "page": "Adam_Riess"
    },
    {
      "text": "Nobel Prize in Physics",
      "page": "Nobel_Prize_in_Physics"
    },
    {
      "text": "Big Bang",
      "page": "Big_Bang"
    },
    {
      "text": "Lambda-CDM model",
      "page": "Lambda-CDM_model"
    },
    {
      "text": "energy density",
      "page": "Energy_density"
    },
    {
      "text": "dark matter",
      "page": "Dark_matter"
    },
    {
      "text": "steady state",
      "page": "Steady_state"
    },
    {
      "text": "DESI",
      "page": "DESI"
    },
    {
      "text": "cosmic time",
      "page": "Cosmic_time"
    },
    {
      "text": "European",
      "page": "European"
    },
    {
      "text": "Nancy Grace Roman Space Telescope",
      "page": "Nancy_Grace_Roman_Space_Telescope"
    },
    {
      "text": "James Webb Space Telescope",
      "page": "James_Webb_Space_Telescope"
    },
    {
      "text": "satellite",
      "page": "Satellite"
    },
    {
      "text": "2018",
      "page": "2018"
    },
    {
      "text": "quantum field theory",
      "page": "Quantum_field_theory"
    },
    {
      "text": "general relativity",
      "page": "General_relativity"
    },
    {
      "text": "static universe",
      "page": "Static_universe"
    },
    {
      "text": "stability",
      "page": "Stability"
    },
    {
      "text": "1917",
      "page": "1917"
    },
    {
      "text": "Albert Einstein",
      "page": "Albert_Einstein"
    },
    {
      "text": "cosmological constant",
      "page": "Cosmological_constant"
    },
    {
      "text": "matter",
      "page": "Matter"
    },
    {
      "text": "density",
      "page": "Density"
    },
    {
      "text": "radius of curvature",
      "page": "Radius_of_curvature"
    },
    {
      "text": "hyperbolic geometry",
      "page": "Hyperbolic_geometry"
    },
    {
      "text": "vacuum energy",
      "page": "Vacuum_energy"
    },
    {
      "text": "Georges Lemaître",
      "page": "Georges_Lemaître"
    },
    {
      "text": "negative pressure",
      "page": "Negative_pressure"
    },
    {
      "text": "Alexander Friedmann",
      "page": "Alexander_Friedmann"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "epoch",
      "page": "Epoch"
    },
    {
      "text": "Alan Guth",
      "page": "Alan_Guth"
    },
    {
      "text": "scalar field",
      "page": "Scalar_field"
    },
    {
      "text": "inflaton",
      "page": "Inflaton"
    },
    {
      "text": "1990s",
      "page": "1990s"
    },
    {
      "text": "Lawrence Berkeley National Laboratory",
      "page": "Lawrence_Berkeley_National_Laboratory"
    },
    {
      "text": "Hubble Space Telescope",
      "page": "Hubble_Space_Telescope"
    },
    {
      "text": "supernova",
      "page": "Supernova"
    },
    {
      "text": "redshift",
      "page": "Redshift"
    },
    {
      "text": "universe",
      "page": "Universe"
    },
    {
      "text": "expansion",
      "page": "Expansion"
    },
    {
      "text": "term",
      "page": "Term"
    },
    {
      "text": "acceleration",
      "page": "Acceleration"
    },
    {
      "text": "dataset",
      "page": "Data_set"
    },
    {
      "text": "cosmological constant",
      "page": "cosmological_constant"
    },
    {
      "text": "dark matter",
      "page": "Dark_Matter"
    },
    {
      "text": "baryonic matter",
      "page": "Baryonic_Matter"
    },
    {
      "text": "Hubble constant",
      "page": "Hubble_constant"
    },
    {
      "text": "dark energy",
      "page": "dark_energy"
    },
    {
      "text": "cosmic microwave background",
      "page": "cosmic_microwave_background"
    },
    {
      "text": "Chandrasekhar limit",
      "page": "Chandrasekhar_limit"
    },
    {
      "text": "High-Z Supernova Search Team",
      "page": "High-Z_Supernova_Search_Team"
    },
    {
      "text": "Supernova Cosmology Project",
      "page": "Supernova_Cosmology_Project"
    },
    {
      "text": "SALT2",
      "page": "SALT2"
    },
    {
      "text": "MLCS",
      "page": "MLCS"
    },
    {
      "text": "evolution",
      "page": "Evolution"
    },
    {
      "text": "cosmic microwave background",
      "page": "Cosmic_microwave_background"
    },
    {
      "text": "geometry",
      "page": "Geometry"
    },
    {
      "text": "history",
      "page": "History"
    },
    {
      "text": "polarization",
      "page": "Polarization"
    },
    {
      "text": "angular",
      "page": "Angular"
    },
    {
      "text": "Atacama Cosmology Telescope",
      "page": "Atacama_Cosmology_Telescope"
    },
    {
      "text": "South Pole Telescope",
      "page": "South_Pole_Telescope"
    },
    {
      "text": "data",
      "page": "Data"
    },
    {
      "text": "0",
      "page": "0"
    },
    {
      "text": "precision",
      "page": "Precision"
    },
    {
      "text": "amplitude",
      "page": "Amplitude"
    },
    {
      "text": "structure formation",
      "page": "Structure_formation"
    },
    {
      "text": "EE",
      "page": ".ee"
    },
    {
      "text": "Baryon acoustic oscillations",
      "page": "Baryon_acoustic_oscillations"
    },
    {
      "text": "plasma",
      "page": "Plasma"
    },
    {
      "text": "galaxy",
      "page": "Galaxy"
    },
    {
      "text": "correlation function",
      "page": "Correlation_function"
    },
    {
      "text": "angular diameter distance",
      "page": "Angular_diameter_distance"
    },
    {
      "text": "parameter",
      "page": "Parameter"
    },
    {
      "text": "Dark Energy Spectroscopic Instrument",
      "page": "Dark_Energy_Spectroscopic_Instrument"
    },
    {
      "text": "constant",
      "page": "Constant"
    },
    {
      "text": "growth",
      "page": "Growth"
    },
    {
      "text": "growth factor",
      "page": "Growth_factor"
    },
    {
      "text": "logarithmic growth",
      "page": "Logarithmic_growth"
    },
    {
      "text": "redshift-space distortions",
      "page": "Redshift-space_distortions"
    },
    {
      "text": "enabling",
      "page": "Enabling"
    },
    {
      "text": "w",
      "page": "W"
    },
    {
      "text": "cosmic distance ladder",
      "page": "Cosmic_distance_ladder"
    },
    {
      "text": "red giant branch",
      "page": "Red-giant_branch"
    },
    {
      "text": "CMB",
      "page": "C.M.B."
    },
    {
      "text": "Wilkinson Microwave Anisotropy Probe",
      "page": "Wilkinson_Microwave_Anisotropy_Probe"
    },
    {
      "text": "Sloan Digital Sky Survey",
      "page": "Sloan_Digital_Sky_Survey"
    },
    {
      "text": "Hyper Suprime-Cam (HSC)",
      "page": "HSC"
    },
    {
      "text": "Euclid",
      "page": "Euclid"
    },
    {
      "text": "shear",
      "page": "Shear"
    },
    {
      "text": "baryon",
      "page": "Baryon"
    },
    {
      "text": "cosmological constant problem",
      "page": "Cosmological_constant_problem"
    },
    {
      "text": "distinguishing",
      "page": "Distinguishing"
    },
    {
      "text": "quintessence",
      "page": "Quintessence"
    },
    {
      "text": "Lagrangian",
      "page": "Lagrangian"
    },
    {
      "text": "pressure",
      "page": "Pressure"
    },
    {
      "text": "kinetic energy",
      "page": "Kinetic_energy"
    },
    {
      "text": "tracker",
      "page": "Tracker"
    },
    {
      "text": "thawing",
      "page": "Thawing"
    },
    {
      "text": "exponential",
      "page": "Exponential"
    },
    {
      "text": "attractor",
      "page": "Attractor"
    },
    {
      "text": "radiation",
      "page": "Radiation"
    },
    {
      "text": "friction",
      "page": "Friction"
    },
    {
      "text": "supernova measurements",
      "page": "Supernova_measurements"
    },
    {
      "text": "Hubble parameter",
      "page": "Hubble_Parameter"
    },
    {
      "text": "dark matter density",
      "page": "Dark_Matter_Density"
    },
    {
      "text": "Chaplygin gas",
      "page": "Chaplygin_gas"
    },
    {
      "text": "general relativity",
      "page": "general_relativity"
    },
    {
      "text": "metric",
      "page": "Metric"
    },
    {
      "text": "gravity",
      "page": "Gravity"
    },
    {
      "text": "fifth force",
      "page": "Fifth_force"
    },
    {
      "text": "gravitational constant",
      "page": "Gravitational_constant"
    },
    {
      "text": "mechanism",
      "page": "Mechanism"
    },
    {
      "text": "symmetry breaking",
      "page": "Symmetry_breaking"
    },
    {
      "text": "vacuum expectation value",
      "page": "Vacuum_expectation_value"
    },
    {
      "text": "Shapiro time delay",
      "page": "Shapiro_time_delay"
    },
    {
      "text": "Dark Energy Spectroscopic Instrument",
      "page": "Dark_Energy_Spectroscopic_Instrumen"
    },
    {
      "text": "isotropy",
      "page": "Isotropy"
    },
    {
      "text": "Milky Way",
      "page": "Milky_Way"
    },
    {
      "text": "Friedmann equations",
      "page": "Friedmann_equations"
    },
    {
      "text": "fine-tuning",
      "page": "Fine-tuning"
    },
    {
      "text": "equation of state",
      "page": "Equation_of_state"
    },
    {
      "text": "coincidence",
      "page": "Coincidence"
    },
    {
      "text": "anthropic principle",
      "page": "Anthropic_principle"
    },
    {
      "text": "multiverse",
      "page": "Multiverse"
    },
    {
      "text": "string theory landscape",
      "page": "String_theory_landscape"
    },
    {
      "text": "axion",
      "page": "Axion"
    },
    {
      "text": "string theory",
      "page": "String_theory"
    },
    {
      "text": "University of Chicago",
      "page": "University_of_Chicago"
    },
    {
      "text": "\\(\\Lambda\\)",
      "page": "Lambda"
    },
    {
      "text": "Royal Astronomical Society",
      "page": "Royal_Astronomical_Society"
    },
    {
      "text": "slowdown",
      "page": "Slowdown"
    },
    {
      "text": "placeholder",
      "page": "Placeholder"
    },
    {
      "text": "concept",
      "page": "Concept"
    },
    {
      "text": "model selection",
      "page": "Model_selection"
    },
    {
      "text": "quantum gravity",
      "page": "Quantum_gravity"
    }
  ],
  "fetched_at": "2025-12-07T07:23:03.386208",
  "elapsed_ms": 536324
}