{
  "topic": "Diabetes",
  "title": "Diabetes",
  "slug": "diabetes",
  "grokipedia_slug": "Diabetes",
  "grokipedia_url": "https://grokipedia.com/page/Diabetes",
  "source": "grokipedia",
  "content": "# Diabetes\n\nDiabetes mellitus is a group of chronic metabolic disorders characterized by persistent hyperglycemia resulting from defects in insulin secretion, insulin action, or both, leading to elevated blood glucose levels that, if uncontrolled, cause damage to multiple organ systems including the cardiovascular, renal, ocular, and nervous systems. The condition encompasses type 1 diabetes, an autoimmune-mediated destruction of pancreatic beta cells leading to absolute insulin deficiency; type 2 diabetes, the predominant form driven by peripheral insulin resistance compounded by inadequate insulin secretion, frequently linked to excess adiposity and overnutrition; and other variants such as gestational diabetes occurring during pregnancy due to hormonal influences exacerbating insulin resistance. In 2024, diabetes affects approximately 589 million adults aged 20-79 years globally, representing 1 in 9 individuals in that age group, with projections indicating a rise to 853 million by 2050 amid increasing obesity rates and aging populations, particularly in low- and middle-income countries. Type 2 diabetes constitutes over 90% of cases and is largely attributable to modifiable risk factors including obesity, physical inactivity, and dietary excess, with empirical data underscoring overnutrition as the primary causal driver rather than heterogeneous genetic factors alone.00157-8/abstract) Unmanaged diabetes precipitates severe complications, responsible for 3.4 million deaths in 2024—one every 9 seconds—and substantial morbidity including retinopathy, nephropathy, neuropathy, and accelerated atherosclerosis, imposing over $1 trillion in annual global health expenditure. While insulin replacement for type 1 and lifestyle modifications alongside pharmacotherapy for type 2 mitigate progression, debates continue over causal mechanisms and interventions, with evidence favoring low-carbohydrate dietary strategies for reversing insulin resistance over conventional high-carbohydrate guidelines from some public health bodies.00157-8/abstract)\n\n## Overview\n\n### Definition and Pathological Basis\n\nDiabetes mellitus encompasses a heterogeneous group of chronic metabolic disorders defined by persistent hyperglycemia, arising from defects in insulin secretion by pancreatic beta cells, impaired insulin action (insulin resistance), or a combination of both, which disrupts normal glucose homeostasis. This results in elevated blood glucose levels that, over time, cause cellular damage through mechanisms such as oxidative stress, advanced glycation end-products formation, and inflammation. Diagnosis is established using standardized criteria: fasting plasma glucose ≥126 mg/dL (7.0 mmol/L), 2-hour plasma glucose ≥200 mg/dL (11.1 mmol/L) during a 75-g oral glucose tolerance test, glycated hemoglobin (HbA1c) ≥6.5%, or random plasma glucose ≥200 mg/dL accompanied by classic symptoms of hyperglycemia such as polyuria, polydipsia, and unexplained weight loss.\n\nUnder physiological conditions, blood glucose is tightly regulated through insulin's role in promoting cellular glucose uptake—primarily via translocation of GLUT4 transporters to the cell membrane in skeletal muscle and adipose tissue—and suppression of hepatic glucose output via inhibition of gluconeogenesis and glycogenolysis. Pancreatic beta cells sense rising glucose levels postprandially, triggering insulin release in a biphasic manner: an initial rapid phase from pre-stored vesicles followed by sustained secretion dependent on glucose metabolism and calcium influx. Glucagon from alpha cells counterbalances this by elevating glucose during fasting, but insulin dominates in the fed state to prevent hyperglycemia.\n\nPathologically, diabetes manifests as absolute insulin deficiency, as in autoimmune beta-cell destruction, or relative deficiency coupled with peripheral insulin resistance, where target tissues fail to respond adequately to insulin signaling—often involving impaired IRS-1/PI3K/Akt pathways—leading to unchecked hepatic glucose production and reduced peripheral disposal. Chronic hyperglycemia induces glucotoxicity, which desensitizes beta cells and promotes apoptosis, while ectopic lipid accumulation (lipotoxicity) exacerbates resistance in non-adipose tissues. These defects converge on sustained elevation of plasma glucose, fostering a vicious cycle of metabolic decompensation independent of specific etiologies like genetic predisposition or environmental factors.\n\n### Signs and Symptoms\n\nThe classic symptoms of diabetes mellitus are polyuria (frequent urination), polydipsia (excessive thirst), and polyphagia (increased hunger), resulting from hyperglycemia-induced osmotic diuresis and cellular glucose starvation.  These often accompany unexplained weight loss, fatigue, and blurred vision, with the latter arising from osmotic swelling of the lens. \n\nIn type 1 diabetes, symptoms emerge acutely over days to weeks, potentially escalating to diabetic ketoacidosis with nausea, vomiting, abdominal pain, and fruity breath odor from acetone.  Type 2 diabetes symptoms develop gradually over years and may remain subclinical for extended periods, with many cases diagnosed incidentally via screening; when present, they include the classic triad plus slow-healing wounds, recurrent infections, and peripheral neuropathy manifesting as numbness or tingling in extremities. \n\nAdditional signs encompass acanthosis nigricans—velvety, hyperpigmented skin patches in flexural areas like the neck and axillae, linked to insulin resistance primarily in type 2—and ketonuria detectable via urine tests.  Dry mouth, pruritus, and erectile dysfunction can also occur, though evidence associates the latter more strongly with undiagnosed type 2.  Approximately 20-30% of type 2 cases present without symptoms, underscoring the value of risk-based screening.\n\n### Acute and Chronic Complications\n\nAcute complications of diabetes mellitus arise from rapid fluctuations in blood glucose levels and can be life-threatening if untreated. These include hypoglycemia, diabetic ketoacidosis (DKA), and hyperosmolar hyperglycemic state (HHS). Hypoglycemia, defined as blood glucose below 70 mg/dL, occurs primarily in insulin-treated patients and can lead to symptoms such as shakiness, confusion, seizures, or coma, with severe episodes associated with increased risk of cardiovascular events and mortality.  Severe hypoglycemia doubles the risk of subsequent cardiovascular events, including death, independent of other factors.\n\nDKA, characterized by hyperglycemia, ketosis, and metabolic acidosis, predominantly affects individuals with type 1 diabetes but can occur in type 2. It results from absolute or relative insulin deficiency leading to fat breakdown and ketone production, with symptoms including nausea, abdominal pain, and rapid breathing. Incidence varies, but in-hospital mortality rates range from 0.2% to 2.5% in developed countries, rising with factors like coma or hypothermia at presentation.  HHS, more common in type 2 diabetes, involves severe hyperglycemia and hyperosmolarity without significant ketosis, often precipitated by illness or dehydration, and carries a higher mortality rate of up to 15-20% due to associated comorbidities. Both DKA and HHS require prompt intravenous fluids, insulin, and electrolyte correction to prevent organ failure.\n\nChronic complications develop over years of sustained hyperglycemia and are categorized as microvascular (affecting small vessels) or macrovascular (affecting large vessels). Microvascular issues stem from damage to capillaries via mechanisms including advanced glycation end-products and oxidative stress. Diabetic retinopathy, the leading cause of new blindness in working-age adults, affects up to 10,000 individuals annually in the U.S. and correlates with diabetes duration.  Diabetic nephropathy progresses to end-stage renal disease in about 20-40% of cases, with prevalence linked to poor glycemic control. Neuropathy, present in 20-75% of diabetic patients depending on assessment method, manifests as sensory loss, pain, or autonomic dysfunction, increasing risks of foot ulcers and amputations. \n\nMacrovascular complications elevate cardiovascular disease risk 2-4 times in diabetic individuals compared to non-diabetics, encompassing coronary artery disease, stroke, and peripheral artery disease. People with diabetes face twice the likelihood of heart disease or stroke, with risks escalating with longer disease duration and hyperglycemia severity.  A 1% increase in HbA1c raises macrovascular event risk by approximately 18%. These complications underscore the causal role of chronic hyperglycemia in vascular endothelial damage, compounded by factors like hypertension and dyslipidemia. Tight glycemic control reduces microvascular risks but has variable impact on macrovascular outcomes, as evidenced by trials like UKPDS.\n\n## Classification\n\n### Type 1 Diabetes\n\nType 1 diabetes mellitus is a chronic autoimmune disease characterized by the immune-mediated destruction of insulin-producing beta cells in the pancreatic islets of Langerhans, resulting in absolute insulin deficiency and dependence on exogenous insulin for survival. This destruction leads to hyperglycemia, as the body cannot regulate blood glucose without endogenous insulin production. Unlike type 2 diabetes, type 1 is not associated with insulin resistance or obesity but stems from a failure of immune tolerance, where autoreactive T cells target beta cell antigens such as insulin, GAD65, and IA-2.\n\nThe etiology involves a combination of genetic predisposition and environmental triggers, with human leukocyte antigen (HLA) genes, particularly HLA-DR3 and HLA-DR4 haplotypes, conferring the strongest risk, present in over 90% of affected individuals in certain populations. Environmental factors, including viral infections (e.g., enteroviruses like coxsackievirus), may initiate or accelerate the autoimmune process in genetically susceptible individuals, though causation remains correlative rather than definitively proven. Beta cell destruction typically progresses over months to years, with clinical onset occurring when 70-90% of beta cells are lost, often presenting acutely with diabetic ketoacidosis (DKA) in children and adolescents.\n\nEpidemiologically, type 1 diabetes affects about 9.2 million people globally as of 2024, representing roughly 2% of all diabetes cases, though it accounts for a higher proportion (up to 10%) in pediatric diagnoses. In the United States, approximately 1.7 million adults and an estimated 200,000-300,000 children and adolescents live with the condition, with around 32,000 new cases diagnosed annually in adults over age 20. Incidence rates have risen steadily worldwide, with over 500,000 new diagnoses in 2024, varying by region—highest in Northern Europe (e.g., Finland at 60 per 100,000 children under 15) and lower in Asia and Africa. This increase is attributed partly to improved survival and detection rather than purely etiological shifts, though diagnostic criteria expansions may contribute. Family history elevates risk, with siblings of affected individuals having a 6-10% lifetime risk compared to 0.4% in the general population.\n\n### Type 2 Diabetes\n\nType 2 diabetes mellitus (T2DM) constitutes over 90% of all diagnosed diabetes cases globally. It arises from a combination of insulin resistance in muscle, liver, and adipose tissues, coupled with impaired insulin secretion from pancreatic beta cells, resulting in chronic hyperglycemia. Unlike type 1 diabetes, which features autoimmune-mediated destruction of beta cells and absolute insulin deficiency, T2DM involves no primary autoimmunity and retains some endogenous insulin production, albeit insufficient to overcome resistance. This relative insulin deficiency progresses over time, often preceded by 10-15 years of insulin resistance.\n\nT2DM predominantly affects adults aged 45 and older, but its onset in children, adolescents, and younger adults has surged due to rising obesity, physical inactivity, and high-calorie diets. In the United States, about 38 million people have diabetes, with type 2 comprising the vast majority. Key risk factors include overweight or obesity (body mass index ≥25 kg/m²), family history of T2DM, prediabetes (fasting glucose 100-125 mg/dL or HbA1c 5.7-6.4%), and physical inactivity less than three times weekly. Certain racial and ethnic groups, such as African Americans, Hispanics, Native Americans, and Asian Americans, exhibit higher susceptibility, independent of other factors. Gestational diabetes or delivery of a baby over 9 pounds also elevates risk.\n\nThe condition often remains undiagnosed for years, as symptoms like polyuria, polydipsia, and fatigue develop insidiously, contrasting with the acute presentation of type 1 diabetes. Hyperinsulinemia initially compensates for resistance but eventually fails as beta-cell mass declines. Obesity, particularly visceral fat accumulation, drives insulin resistance via inflammation and ectopic lipid deposition, underscoring lifestyle factors' causal role over genetic predisposition alone. Genetic variants contribute, but environmental influences like diet and sedentariness predominate in population-level increases.\n\n### Gestational Diabetes\n\nGestational diabetes mellitus (GDM) is defined as glucose intolerance with onset or first recognition during pregnancy, typically resolving postpartum but indicating underlying beta-cell dysfunction exacerbated by pregnancy-induced insulin resistance. The condition arises from placental hormones such as human placental lactogen, cortisol, and progesterone, which promote insulin resistance in maternal tissues to prioritize fetal nutrient supply; in susceptible individuals, pancreatic beta cells fail to compensate adequately with increased insulin secretion. Globally, prevalence ranges from 1% to 28%, influenced by diagnostic criteria, ethnicity, and population factors, with rates up to 9% in the United States.\n\nKey risk factors include pre-pregnancy obesity (BMI ≥30 kg/m²), advanced maternal age (\\u003e35 years), family history of type 2 diabetes, prior GDM, polycystic ovary syndrome, and multiparity, with evidence linking these to chronic insulin resistance and genetic predispositions. Physical inactivity and poor diet quality further elevate risk by compounding adipose tissue inflammation and impaired glucose uptake. Ethnic groups such as South Asian, Hispanic, and African American women exhibit higher incidence, attributable to higher baseline insulin resistance rather than solely socioeconomic factors.\n\nDiagnosis typically employs a two-step approach recommended by the American College of Obstetricians and Gynecologists (ACOG): universal screening at 24-28 weeks with a 50-gram one-hour glucose challenge test (GCT), followed by a diagnostic 100-gram three-hour oral glucose tolerance test (OGTT) if the one-hour value exceeds 130-140 mg/dL. GDM is confirmed if two or more OGTT values meet or exceed fasting ≥95 mg/dL, one-hour ≥180 mg/dL, two-hour ≥155 mg/dL, or three-hour ≥140 mg/dL. Alternatively, the American Diabetes Association (ADA) endorses a one-step 75-gram two-hour OGTT, diagnosing GDM with fasting ≥92 mg/dL, one-hour ≥180 mg/dL, or two-hour ≥153 mg/dL, though this yields higher prevalence due to increased sensitivity. Early screening before 24 weeks is advised for high-risk women.\n\nManagement prioritizes glycemic control through medical nutrition therapy emphasizing carbohydrate distribution (e.g., 175-200g daily in three meals and snacks), moderate physical activity (30 minutes daily), and self-monitoring of blood glucose four times daily, targeting fasting \\u003c95 mg/dL and one- to two-hour postprandial \\u003c140 mg/dL to minimize macrosomia risk. If lifestyle measures fail within one to two weeks (e.g., \\u003e30% elevated values), insulin therapy—preferably basal-bolus regimens avoiding rapid-acting analogs unless safety data supports—is initiated, as oral agents like metformin carry placental transfer risks despite some efficacy evidence. Fetal surveillance includes ultrasonography for growth assessment starting at 28-32 weeks and antepartum testing from 32 weeks in insulin-requiring cases.\n\nMaternal complications include preeclampsia (odds ratio ~1.5-2), cesarean delivery (due to macrosomia or failed induction), and a 7- to 10-fold increased lifetime risk of type 2 diabetes, necessitating postpartum 75-gram OGTT screening at 4-12 weeks and lifelong annual checks. Fetal and neonatal risks encompass macrosomia (\\u003e4,000g, increasing shoulder dystocia and birth trauma), preterm birth, neonatal hypoglycemia (from fetal hyperinsulinemia), hyperbilirubinemia, and respiratory distress, with long-term offspring predisposition to obesity and diabetes via epigenetic and metabolic programming. Strict glycemic control reduces these by up to 50% in randomized trials.\n\n### Rare and Secondary Forms\n\nSecondary diabetes mellitus refers to hyperglycemia resulting from an identifiable underlying condition or external agent that damages pancreatic beta cells, impairs insulin secretion, or induces insulin resistance, rather than primary autoimmune or polygenic mechanisms. These forms account for approximately 1-5% of diabetes cases, depending on population screening, and resolution or improvement often occurs with treatment of the primary cause. Common etiologies include pancreatic diseases such as chronic pancreatitis, which leads to exocrine and endocrine insufficiency through fibrosis and calcification, reducing insulin-producing cell mass by up to 80% in advanced cases; pancreatectomy; and cystic fibrosis, where mucoviscidosis causes ductal obstruction and progressive beta-cell loss, resulting in cystic fibrosis-related diabetes (CFRD) that typically manifests in adolescence or early adulthood and affects 20-50% of adults with the condition. \n\nEndocrinopathies contribute via excess counter-regulatory hormones: Cushing's syndrome elevates cortisol, promoting hepatic gluconeogenesis and peripheral insulin resistance; acromegaly involves growth hormone-induced lipolysis and reduced glucose uptake; pheochromocytoma releases catecholamines that antagonize insulin; and glucagonoma causes direct hyperglycemia through glucagon excess. Iatrogenic secondary diabetes arises from pharmacological agents, notably glucocorticoids like prednisone, which dose-dependently impair insulin signaling (risk increases with \\u003e5 mg/day equivalents); thiazide diuretics; certain antipsychotics; and calcineurin inhibitors used in transplantation. Less frequent causes encompass hemochromatosis, with iron deposition toxic to beta cells; infections such as congenital rubella; and infiltrative diseases like amyloidosis or lymphoma affecting the pancreas. \n\nRare genetic forms, collectively termed monogenic diabetes, stem from mutations in single genes regulating beta-cell development, function, or insulin processing, comprising 1-2% of diabetes diagnoses in screened populations. Maturity-onset diabetes of the young (MODY) subtypes, inherited autosomally dominantly, present before age 25-35 without obesity or ketosis, often misdiagnosed as type 1 or 2; MODY 3 (HNF1A mutation) affects ~70% of MODY cases and responds well to low-dose sulfonylureas due to preserved beta-cell sensitivity, while MODY 2 (GCK) requires no pharmacotherapy as mild hyperglycemia persists lifelong without complications. Neonatal diabetes mellitus (NDM), onset within the first 6 months of life, affects 1 in 100,000-400,000 live births; transient forms (e.g., 6q24 region anomalies) remit by 3-12 months but may recur as MODY, whereas permanent NDM from KCNJ11 or ABCC8 mutations (encoding KATP channels) permits sulfonylurea monotherapy in ~90% of cases, avoiding insulin dependence. Other rarities include mitochondrial diabetes (m.3243A\\u003eG mutation, maternally inherited, with deafness and lactic acidosis) and syndromic forms like Wolfram syndrome ( Wolfram gene, causing optic atrophy, deafness, and neurodegeneration alongside insulin-deficient diabetes). Genetic testing, prompted by family history, absence of autoantibodies, and atypical features, confirms diagnosis and guides targeted therapy, improving outcomes over empirical insulin use.\n\n## Pathophysiology\n\n### Mechanisms of Type 1 Diabetes\n\nType 1 diabetes mellitus results from the autoimmune destruction of insulin-producing beta cells in the pancreatic islets of Langerhans, leading to absolute insulin deficiency and hyperglycemia.  This process primarily involves T-cell-mediated cytotoxicity, where autoreactive CD4+ and CD8+ T cells infiltrate the islets (insulitis) and selectively target beta cells for elimination.  Autoantibodies, such as those against glutamic acid decarboxylase (GAD65), insulin (IAA), and islet antigen-2 (IA-2), serve as serological markers of ongoing autoimmunity but do not directly cause beta cell death; their presence precedes clinical onset by months to years in prediabetic stages.\n\nThe destruction requires a combination of genetic susceptibility and environmental triggers acting on a competent immune system. Genetic factors, particularly polymorphisms in human leukocyte antigen (HLA) class II genes on chromosome 6p21, confer the strongest risk, with HLA-DR3 and HLA-DR4 haplotypes increasing susceptibility odds by 10- to 15-fold in populations of European descent; these alleles account for approximately 40-50% of familial clustering. Non-HLA genes, including INS (insulin), PTPN22, and IL2RA, contribute smaller effects, but the polygenic nature underscores incomplete penetrance, as only 1-5% of carriers develop disease. In susceptible individuals, beta cells may express neoantigens or stress signals (e.g., via endoplasmic reticulum stress from high glucose demand) that mimic foreign peptides, breaking immune tolerance through molecular mimicry or bystander activation.\n\nEnvironmental factors likely initiate or accelerate the autoimmune cascade in genetically predisposed individuals, though causality remains associative rather than proven in humans. Enteroviral infections, particularly coxsackievirus B, correlate with increased risk, potentially via direct beta cell infection or molecular mimicry with islet antigens; prospective studies show elevated enterovirus RNA in blood and stools preceding autoantibody seroconversion. Early childhood factors, such as rapid weight gain, introduction of cow's milk proteins, or disruptions in gut microbiota (e.g., reduced diversity), may promote intestinal permeability and antigen presentation, though trials like TrialNet have not consistently prevented progression. Vitamin D deficiency and colder climates also associate with higher incidence, possibly via impaired immune regulation. The disease's rising global prevalence since the mid-20th century implicates modern environmental changes over genetic shifts alone.\n\nBeta cell loss progresses insidiously, with 70-90% destruction required for symptomatic hyperglycemia; residual cells may persist post-diagnosis but continue declining without intervention. Inflammation amplifies damage through cytokines (e.g., IFN-γ, TNF-α, IL-1β) that impair beta cell function and survival, creating a feed-forward loop of autoantigen release and immune amplification. Unlike type 2 diabetes, no significant insulin resistance precedes onset, emphasizing the primacy of insulinopenia.\n\n### Mechanisms of Type 2 Diabetes\n\nType 2 diabetes mellitus develops from a combination of peripheral insulin resistance and progressive pancreatic beta-cell dysfunction, leading to chronic hyperglycemia. Insulin resistance impairs glucose disposal in skeletal muscle, suppresses hepatic glucose production inadequately, and promotes adipose lipolysis, elevating circulating free fatty acids that further exacerbate the defect. Beta cells initially compensate with hyperinsulinemia, but eventual failure results in relative insulin deficiency, with approximately 50% reduction in beta-cell function observed at diagnosis.\n\nInsulin resistance primarily affects skeletal muscle, where defective insulin signaling hinders GLUT4 translocation and glucose uptake, accounting for 50-70% impairment in glucose transport. In the liver, resistance fails to suppress gluconeogenesis, contributing to fasting hyperglycemia, while in adipose tissue, unchecked lipolysis releases non-esterified fatty acids that accumulate ectopically in non-adipose organs like muscle and liver, inducing lipotoxicity via diacylglycerol and ceramide buildup. These processes involve disrupted pathways such as IRS-1/PI3K/Akt, with serine phosphorylation of IRS-1 by inflammatory kinases like JNK inhibiting insulin action.\n\nBeta-cell dysfunction stems from chronic exposure to hyperglycemia (glucotoxicity) and elevated fatty acids (lipotoxicity), triggering endoplasmic reticulum stress, oxidative stress from reactive oxygen species, and mitochondrial impairment that disrupts glucose-stimulated insulin secretion. Key mechanisms include activation of the unfolded protein response via PERK/IRE1α/ATF6 pathways leading to apoptosis, islet amyloid polypeptide aggregation, and dedifferentiation of beta cells into progenitor-like states. Hyperglucagonemia from dysregulated alpha cells compounds the issue by enhancing hepatic glucose output.\n\nObesity, particularly visceral adiposity with BMI ≥30 kg/m², drives these mechanisms through adipose tissue expansion, macrophage infiltration, and secretion of proinflammatory cytokines such as TNF-α and IL-6, which activate NF-κB and promote systemic inflammation linking to insulin resistance. Approximately 80% of type 2 diabetes cases associate with obesity, where reduced adiponectin and leptin resistance further impair insulin sensitivity, while ectopic fat deposition amplifies stress responses. Gut microbiota dysbiosis contributes by increasing lipopolysaccharide levels, fueling low-grade inflammation.\n\n### Genetic Factors\n\nGenetic factors contribute substantially to the risk of developing diabetes mellitus, with heritability estimates varying by subtype: approximately 50% for type 1 diabetes and 40-80% for type 2 diabetes. These estimates derive from twin and family studies, indicating that while polygenic inheritance predominates in common forms, environmental triggers are necessary for disease manifestation. Genome-wide association studies (GWAS) have identified hundreds of susceptibility loci, though they explain only a fraction of heritability, highlighting gaps in current understanding such as rare variants or gene-environment interactions.\n\nIn type 1 diabetes, an autoimmune destruction of pancreatic beta cells, human leukocyte antigen (HLA) genes on chromosome 6p21 confer the strongest risk, accounting for 40-50% of familial aggregation. Specific alleles like HLA-DR3 and HLA-DR4, particularly in haplotypes DR3-DQ2 and DR4-DQ8, increase susceptibility by influencing immune tolerance to islet autoantigens; individuals with both high-risk haplotypes face odds ratios up to 20-fold higher than the general population. Non-HLA loci, including INS (insulin gene) variable number tandem repeats and PTPN22 (encoding a protein tyrosine phosphatase), contribute smaller effects, with over 60 loci identified collectively explaining about 80% of heritability in some models.\n\nType 2 diabetes, characterized by insulin resistance and beta-cell dysfunction, exhibits polygenic inheritance with over 500 independent single nucleotide polymorphisms (SNPs) associated via GWAS, each conferring modest risk (odds ratios typically 1.05-1.20). The TCF7L2 gene variant rs7903146 represents the largest single effect, raising risk by 1.4-fold through impaired beta-cell function and incretin response. Other notable loci include SLC30A8 (zinc transporter affecting insulin secretion) and HHEX (hematopoietically expressed homeobox, influencing pancreatic development), identified in early GWAS cohorts exceeding 10,000 cases. Heritability partitioning reveals stronger genetic loading for beta-cell impairment than insulin resistance, with ancestry-specific variations; for instance, East Asian populations show distinct loci emphasizing hepatic glucose production.\n\nMonogenic forms, comprising 1-5% of diabetes cases, arise from single-gene mutations disrupting insulin production or secretion, often without autoimmunity or insulin resistance. Maturity-onset diabetes of the young (MODY), the most common subtype, results from heterozygous mutations in genes like HNF1A (MODY3, ~50% of cases) or GCK (MODY2, mild hyperglycemia from birth), enabling precise diagnosis via sequencing and tailored sulfonylurea therapy over insulin. Neonatal diabetes, presenting before six months, frequently involves KCNJ11 or ABCC8 mutations activating ATP-sensitive potassium channels, responsive to oral glibenclamide. These forms underscore causal roles of specific pathways, contrasting with polygenic complexity in type 1 and 2 diabetes.\n\n### Environmental and Lifestyle Influences\n\nEnvironmental factors contribute to the pathogenesis of type 1 diabetes primarily through triggering autoimmune destruction of pancreatic beta cells in genetically susceptible individuals. Viral infections, particularly enteroviruses, have been associated with increased risk, potentially via molecular mimicry where viral proteins resemble islet antigens, initiating or accelerating autoimmunity. Rapid weight gain in infancy and early childhood correlates with higher incidence, possibly stressing beta cells and promoting inflammation. Vitamin D deficiency, often linked to colder climates and limited sunlight exposure, impairs immune regulation and is inversely associated with type 1 diabetes onset.\n\nIn type 2 diabetes, lifestyle factors drive insulin resistance and beta-cell dysfunction through ectopic fat deposition and chronic low-grade inflammation. Visceral obesity, characterized by excess intra-abdominal fat, releases free fatty acids and adipokines that antagonize insulin signaling in liver, muscle, and adipose tissues, leading to hyperglycemia. Surgical removal of visceral fat depots in animal models prevents diet-induced insulin resistance, underscoring its causal role. Sedentary behavior exacerbates this by reducing muscle glucose uptake and GLUT4 translocation, with even short-term inactivity inducing insulin resistance independent of weight gain. Replacing sedentary time with moderate activity improves insulin sensitivity by lowering circulating cytokines.\n\nDietary patterns high in refined carbohydrates and sugars promote postprandial hyperglycemia and hyperinsulinemia, fostering insulin resistance over time. Ecologic data show parallel rises in refined carbohydrate consumption and type 2 diabetes prevalence since the 20th century, with high-glycemic-index diets linked to impaired beta-cell function. Sugar-sweetened beverages contribute via fructose-induced hepatic lipogenesis, which impairs insulin suppression of gluconeogenesis.\n\nAlterations in the gut microbiome, influenced by diet, antibiotics, and Western lifestyle, modulate diabetes risk by affecting short-chain fatty acid production and intestinal permeability, which influence systemic inflammation and insulin sensitivity. Dysbiosis with reduced microbial diversity correlates with type 2 diabetes, potentially exacerbating insulin resistance through lipopolysaccharide-mediated endotoxemia. In type 1 diabetes, early-life microbiome disruptions may skew immune tolerance toward autoimmunity.\n\n## Diagnosis\n\n### Diagnostic Criteria\n\nDiabetes mellitus is diagnosed based on elevated plasma glucose concentrations or glycated hemoglobin levels, reflecting chronic hyperglycemia sufficient to cause organ damage over time. The American Diabetes Association (ADA) establishes the primary criteria, which require confirmation by repeat testing unless unequivocal hyperglycemia with acute symptoms is present. These thresholds derive from epidemiological data linking levels to increased risk of microvascular complications, such as retinopathy, rather than a precise physiological boundary.\n\nThe diagnostic tests and corresponding thresholds are as follows:\n\n| Test | Normal | Prediabetes | Diabetes |\n|------|--------|-------------|----------|\n| A1C (%) | \\u003c5.7 | 5.7–6.4 | ≥6.5 |\n| Fasting plasma glucose (mg/dL) | \\u003c100 | 100–125 | ≥126 |\n| 2-hour plasma glucose during 75-g oral glucose tolerance test (mg/dL) | \\u003c140 | 140–199 | ≥200 |\n| Random plasma glucose (mg/dL) | N/A | N/A | ≥200 (with classic symptoms of hyperglycemia) |\n\nFasting plasma glucose measures venous plasma after at least 8 hours of no caloric intake, providing a standardized assessment of basal hyperglycemia. The oral glucose tolerance test (OGTT) involves ingesting 75 g of anhydrous glucose after fasting, followed by measuring plasma glucose at 2 hours, which detects impaired glucose handling postprandially but is less practical due to time and variability. Glycated hemoglobin A1C reflects average blood glucose over 2–3 months via nonenzymatic glycation of hemoglobin, though it may be unreliable in conditions like anemia, hemoglobinopathies, or recent blood loss. Random plasma glucose ≥200 mg/dL suffices in symptomatic patients (e.g., polyuria, polydipsia, unexplained weight loss), avoiding delay in acute cases.\n\nThe World Health Organization (WHO) aligns closely but prioritizes glucose-based tests over A1C in resource-limited settings, citing potential assay variability and ethnic differences in glycation rates. Diagnosis applies uniformly to type 1 and type 2 diabetes, with differentiation relying on clinical history, autoantibody testing (e.g., GAD65, islet cell antibodies for type 1), C-peptide levels indicating endogenous insulin production, and ketosis presence rather than altering hyperglycemia thresholds. In gestational diabetes, modified OGTT criteria are used, typically at 24–28 weeks gestation, with thresholds lowered to identify fetal risk (e.g., fasting ≥92 mg/dL, 1-hour ≥180 mg/dL, 2-hour ≥153 mg/dL per International Association of Diabetes and Pregnancy Study Groups).\n\nCertain populations warrant caution: A1C thresholds may overestimate glycemia in older adults or those with shortened red blood cell lifespan, while underestimating in prolonged hyperglycemia states. Continuous glucose monitoring data are not yet validated for diagnosis but correlate with lab measures for management.\n\n### Screening and Laboratory Tests\n\nScreening for type 2 diabetes is recommended by the American Diabetes Association (ADA) for adults aged 35 years or older who are overweight (BMI ≥25 kg/m²) or obese, as well as for younger adults with risk factors such as family history of diabetes, gestational diabetes in prior pregnancy, polycystic ovary syndrome, or delivery of a newborn weighing over 9 pounds. Individuals with prediabetes should be screened annually, while those with normal results may repeat testing every three years, though more frequent screening is advised for high-risk groups including certain ethnic populations like non-Hispanic Blacks, Hispanics, Native Americans, Asian Americans, and Pacific Islanders, who exhibit higher prevalence rates. The U.S. Preventive Services Task Force endorses similar screening for asymptomatic adults aged 35 to 70 with overweight or obesity, emphasizing cost-effectiveness in preventing progression to diabetes through early intervention.\n\nLaboratory tests for diabetes screening and diagnosis primarily include hemoglobin A1c (HbA1c), fasting plasma glucose (FPG), and the oral glucose tolerance test (OGTT), with random plasma glucose used in symptomatic patients. Diabetes is diagnosed if HbA1c is ≥6.5%, FPG ≥126 mg/dL (7.0 mmol/L), or 2-hour plasma glucose ≥200 mg/dL (11.1 mmol/L) during a 75-gram OGTT; these criteria align with both ADA and World Health Organization standards, though confirmation by repeat testing is required unless classic symptoms (polyuria, polydipsia, unexplained weight loss) and random glucose ≥200 mg/dL are present. Prediabetes thresholds are HbA1c 5.7–6.4%, FPG 100–125 mg/dL (5.6–6.9 mmol/L), or 2-hour glucose 140–199 mg/dL (7.8–11.0 mmol/L).\n\nHbA1c measures average glycemia over 2–3 months via nonenzymatic glycation of hemoglobin, offering convenience without fasting, but its accuracy varies; it underperforms in populations with high red blood cell turnover (e.g., anemia, hemoglobinopathies common in African and Mediterranean descent) or conditions like chronic kidney disease, with sensitivity around 68% and specificity 96% for diabetes detection compared to OGTT as gold standard. FPG requires an 8-hour fast and directly assesses hepatic glucose output, showing higher specificity in epidemiological contexts but lower sensitivity for early detection, correlating strongly with HbA1c yet sometimes discordant in up to 30% of cases due to postprandial spikes missed by fasting measures. OGTT, involving a standardized glucose load, provides the most comprehensive assessment of insulin response and beta-cell function but is resource-intensive, less reproducible (coefficient of variation ~15–20%), and contraindicated in gastrointestinal disorders. For type 1 diabetes screening, autoantibody tests (e.g., GAD65, IA-2) are used in research or high-risk relatives but not routinely due to low positive predictive value (~10–20%).\n\n| Test | Diabetes Threshold | Prediabetes Threshold | Key Limitations |\n|------|---------------------|-----------------------|-----------------|\n| HbA1c | ≥6.5% | 5.7–6.4% | Affected by hemoglobin variants, anemia; lower sensitivity in short RBC lifespan conditions |\n| FPG | ≥126 mg/dL (7.0 mmol/L) | 100–125 mg/dL (5.6–6.9 mmol/L) | Requires fasting; misses postprandial hyperglycemia |\n| 2-hour OGTT | ≥200 mg/dL (11.1 mmol/L) | 140–199 mg/dL (7.8–11.0 mmol/L) | Labor-intensive, variable reproducibility; not feasible for population screening |\n\n## Prevention\n\n### Primary Prevention for Type 1\n\nPrimary prevention of type 1 diabetes seeks to inhibit the initiation of beta-cell autoimmunity in genetically predisposed individuals prior to the detection of islet autoantibodies, though no validated strategies have demonstrated consistent efficacy in large-scale trials. Genetic risk factors, such as specific HLA alleles (e.g., HLA-DR3-DQ2 and HLA-DR4-DQ8 haplotypes), confer susceptibility in approximately 1-2% of the general population but interact with unidentified environmental triggers to precipitate disease in only a fraction of carriers. Early-life exposures, including enterovirus infections, rapid infant weight gain, and alterations in gut microbiota, have been implicated as potential initiators based on prospective cohort data, yet causal links remain unproven and preventive modifications like targeted antiviral prophylaxis or microbiome interventions lack empirical support.\n\nScreening programs represent a foundational step for identifying candidates for primary or early secondary prevention, with networks like TrialNet offering free autoantibody testing (e.g., for GAD65, IA-2, insulin, and ZnT8 antibodies) to first-degree relatives aged 2-45 years or those with elevated genetic risk. Positive autoantibody results indicate stage 1 presymptomatic disease, enabling monitoring for progression to dysglycemia (stage 2) or clinical hyperglycemia (stage 3), though screening itself does not prevent autoimmunity onset. Historical primary prevention trials, such as those testing hydrolyzed infant formulas or delayed introduction of cow's milk proteins to avoid putative dietary triggers, have yielded null or inconsistent results; for instance, the TRIGR study (2002-2017) found no significant reduction in diabetes incidence among high-risk infants randomized to casein hydrolysate formula versus standard feeding.\n\nWhile true primary prevention remains unachieved, interventions targeting early presymptomatic stages offer delay of clinical manifestation. In November 2022, the U.S. Food and Drug Administration approved teplizumab (Tzield), an anti-CD3 monoclonal antibody, for intravenous administration to delay stage 3 onset by a median of about 2 years in individuals aged 8 years and older with stage 2 disease (confirmed autoantibodies plus abnormal glucose tolerance). This approval stemmed from the TN10 trial (2010-2018), where a single 14-day course reduced progression risk by 43% over 3 years compared to placebo, though long-term effects on beta-cell preservation are under investigation and the therapy does not reverse autoimmunity. Ongoing trials explore oral insulin or other immunomodulators for primary prevention in autoantibody-negative high-risk groups, but results have been equivocal, underscoring the need for refined risk stratification and larger cohorts to overcome low event rates in genetically screened populations.\n\n### Lifestyle-Based Prevention for Type 2\n\nLifestyle interventions emphasizing weight reduction, increased physical activity, and dietary modifications have demonstrated substantial efficacy in preventing or delaying the onset of type 2 diabetes in individuals with prediabetes or elevated risk factors such as obesity. Randomized controlled trials, including the Diabetes Prevention Program (DPP), showed that a structured program achieving 5-7% weight loss through calorie restriction and at least 150 minutes per week of moderate-intensity physical activity reduced the incidence of type 2 diabetes by 58% over 2.8 years compared to placebo, outperforming metformin (31% reduction).  Similarly, the Finnish Diabetes Prevention Study reported a 58% risk reduction with comparable goals: weight loss of at least 5%, fiber intake exceeding 15 g/1,000 kcal, and physical activity of 30 minutes daily. These effects stem from improvements in insulin sensitivity and beta-cell function, countering the progressive insulin resistance and hyperglycemia central to type 2 diabetes pathogenesis. Meta-analyses of such trials confirm an average 40-50% relative risk reduction, with benefits persisting over 10-20 years if adherence is maintained, though real-world implementation yields smaller but significant effects (e.g., 35% reduction in program completers). \n\n**Weight management** forms the cornerstone, as sustained loss of 5% or more of initial body weight disrupts the cycle of visceral fat accumulation exacerbating insulin resistance. In the DPP, participants meeting the 7% weight loss goal at one year had a 16-fold lower diabetes incidence over three years compared to those failing to meet activity goals alone. Long-term follow-up in the DPP Outcomes Study indicated that early weight loss predicted reduced cumulative incidence, with benefits enduring up to 22 years. Observational data reinforce this, showing that even modest reductions (e.g., 3-5 kg) correlate with improved glucose tolerance, though randomized evidence emphasizes intentional, supervised loss over incidental changes.\n\n**Physical activity** independently lowers risk by enhancing glucose uptake in skeletal muscle and mitigating sedentary-induced metabolic decline. Prospective studies link moderate-to-vigorous activity (e.g., brisk walking) exceeding 150 minutes weekly to a 30-50% lower incidence, with dose-response effects: higher volumes yield greater protection, independent of adiposity.  In prediabetic cohorts, combining aerobic and resistance training improves insulin sensitivity more than either alone, with trials showing 44% risk reduction among those achieving activity goals despite incomplete weight loss. Benefits accrue from both structured exercise and reduced sedentary time, though adherence wanes without behavioral support.\n\n**Dietary modifications** target macronutrient balance and energy intake to support weight control and glycemic stability. Interventions promoting reduced fat (especially saturated), increased fiber (\\u003e25-30 g/day), and whole-food patterns (e.g., vegetables, whole grains, lean proteins) yield superior outcomes over isolated restrictions. The Mediterranean diet, emphasizing unsaturated fats and plant-based foods, has been associated with up to 52% lower risk in high-adherence groups, per cohort analyses, though causal inference relies on trial subsets mirroring these patterns. Low-glycemic-load diets enhance beta-cell preservation, but evidence favors overall calorie deficit over specific macronutrient ratios for prevention. Combined with activity, these changes amplify effects, as seen in meta-analyses where diet-plus-exercise programs halved progression rates in prediabetes.\n\nSustained implementation requires individualized counseling, as dropout rates in trials exceed 20%, diluting population-level impact; however, even partial adherence confers partial protection. Public programs adapting DPP protocols have replicated 35-40% reductions in diverse settings, underscoring scalability when targeting high-risk groups (e.g., BMI \\u003e25 kg/m², impaired glucose tolerance).\n\n### Public Health Interventions\n\nPublic health interventions for diabetes primarily target type 2 diabetes prevention and early detection, given its strong links to modifiable risk factors such as obesity, sedentary behavior, and excessive sugar consumption. These efforts emphasize population-level strategies including structured lifestyle programs, screening initiatives, and policy measures to alter environmental influences on diet and activity. Evidence from randomized trials, such as the Diabetes Prevention Program (DPP), demonstrates that intensive lifestyle interventions—focusing on 7% body weight loss and 150 minutes of weekly physical activity—reduce type 2 diabetes incidence by 58% over 2.8 years in prediabetic adults, outperforming metformin (31% reduction). Scaled implementations, like the U.S. Centers for Disease Control and Prevention's (CDC) National Diabetes Prevention Program (NDPP) launched in 2010, have enrolled over 1 million participants by 2024, achieving average 5-6% weight loss, increased physical activity (42% meeting 150 minutes/week), and a 46-57% lower diabetes incidence at 1-2 years follow-up among completers.  \n\nCommunity health worker (CHW) programs represent another scalable approach, engaging lay personnel to deliver education on diet, exercise, and self-monitoring, which improve glycemic control and reduce risk factors in underserved populations. Systematic reviews indicate CHW interventions enhance diabetes self-management behaviors, with moderate evidence for better HbA1c reductions (0.3-1.0%) compared to usual care, particularly in low-income and minority groups.  Screening programs, recommended by the U.S. Preventive Services Task Force for asymptomatic overweight or obese adults aged 35-70, facilitate early identification of prediabetes (fasting glucose 100-125 mg/dL or HbA1c 5.7-6.4%), enabling timely lifestyle or pharmacological referral; post-screening, population-level improvements in glucose, blood pressure, and lipid control have been observed since 1995, though undiagnosed cases remain high at 20-30% in the U.S.  \n\nPolicy interventions, such as excise taxes on sugar-sweetened beverages (SSBs), aim to curb consumption driving obesity and insulin resistance. In U.S. cities implementing SSB taxes since 2017, purchases declined by 20-30% post-tax, with sustained reductions observed over years. Modeling estimates suggest such taxes could avert 180,000-200,000 diabetes cases over a decade in countries like the UK and Mexico, alongside lower obesity rates, especially in children; however, longitudinal studies in taxed areas show no clinically meaningful changes in adult HbA1c or incident diabetes rates, indicating indirect or delayed effects.    The World Health Organization's Global Diabetes Compact, initiated in 2021, promotes similar strategies globally, advocating reduced SSB intake, tobacco cessation, and urban planning for active transport to address rising prevalence, which affects 422 million adults worldwide as of 2014 data. \n\nDespite successes, challenges persist in retention (e.g., 30-50% NDPP dropout) and equity, with lower uptake in rural or low-socioeconomic areas; integrating digital tools like mobile health coaching has shown promise for HbA1c improvements (0.5-1%) in high-risk ethnic groups.  Overall, these interventions prioritize causal risk reduction over symptom management, yielding cost savings—e.g., NDPP averts $2,600 per participant in medical costs over 3 years—though long-term population impacts require sustained multisectoral commitment.\n\n## Management\n\n### Non-Pharmacological Approaches\n\nNon-pharmacological approaches constitute the foundational elements of diabetes management, emphasizing dietary modifications, physical activity, weight control, and behavioral interventions to improve glycemic control, reduce insulin resistance, and potentially achieve remission, particularly in type 2 diabetes mellitus (T2DM). These strategies leverage physiological mechanisms such as enhanced insulin sensitivity and beta-cell function preservation, with evidence from randomized controlled trials demonstrating sustained benefits when adhered to long-term. For instance, intensive lifestyle interventions combining calorie restriction and exercise have induced T2DM remission rates of up to 36% at one year in participants achieving at least 10-15 kg weight loss, with partial remission maintained in 13% after five years in the Diabetes Remission Clinical Trial (DiRECT). \n\nDietary interventions prioritize reducing carbohydrate intake to minimize postprandial glucose excursions and promote weight loss, outperforming traditional low-fat diets in several metrics for T2DM. Low-carbohydrate diets (typically \\u003c130 g/day or \\u003c26% of energy intake) yield comparable or superior reductions in HbA1c (e.g., 0.5-1.0% greater at 6-12 months), alongside decreased medication needs and improved lipid profiles, as shown in meta-analyses of randomized trials.  Very-low-carbohydrate or ketogenic patterns (\\u003c50 g/day) further enhance these effects by inducing ketosis, which suppresses hepatic glucose output, though long-term adherence remains a challenge without nutritional guidance. In contrast, standard high-carbohydrate diets (\\u003e45% energy from carbs) often require more pharmacological support to achieve equivalent glycemic targets. Plant-based low-carb variants may offer additional cardiovascular benefits over animal-heavy ones, mitigating risks like elevated LDL in susceptible individuals.\n\nPhysical activity enhances glucose uptake via muscle contraction-independent pathways, independent of insulin, and is recommended at a minimum of 150 minutes per week of moderate-intensity aerobic exercise (e.g., brisk walking) plus resistance training 2-3 times weekly for adults with diabetes. This regimen improves HbA1c by 0.5-0.7% and insulin sensitivity, with combined aerobic-resistance protocols showing additive effects over aerobic alone in T2DM cohorts. Glucose monitoring before and after sessions is advised to prevent hypoglycemia, especially in insulin users.\n\nWeight management integrates diet and exercise, targeting 5-10% body weight reduction to reverse early T2DM pathophysiology, including ectopic fat deposition in liver and pancreas. Behavioral components, such as diabetes self-management education and support (DSMES), facilitate adherence, with structured programs yielding 0.3-0.5% greater HbA1c reductions versus usual care. For type 1 diabetes, these approaches focus on carbohydrate counting and activity-adjusted insulin dosing rather than remission, though they mitigate complications. Overall, meta-analyses confirm non-pharmacological strategies reduce T2DM progression risk by 40-60% in high-risk groups when implemented early. \n\n### Pharmacological Treatments\n\nPharmacological management of type 2 diabetes mellitus emphasizes oral agents that target hyperglycemia through distinct mechanisms, with selection guided by patient-specific factors such as comorbidities, risk of hypoglycemia, and cardiovascular outcomes. The American Diabetes Association's 2025 Standards of Care recommend metformin as the initial pharmacologic therapy for most patients due to its efficacy, safety profile, and cost-effectiveness, unless contraindicated. These agents are often used in combination when monotherapy fails to achieve glycemic targets, typically an HbA1c below 7% for most non-pregnant adults without significant hypoglycemia risk.\n\nMetformin, the cornerstone biguanide, primarily suppresses hepatic gluconeogenesis and enhances peripheral insulin sensitivity without stimulating insulin secretion, thereby minimizing hypoglycemia risk. Clinical trials demonstrate an average HbA1c reduction of 1-1.5%, with additional benefits including modest weight loss and cardiovascular risk reduction observed in long-term studies like the UK Prospective Diabetes Study, where it lowered myocardial infarction rates by 39% in overweight patients. Common adverse effects include gastrointestinal intolerance affecting up to 25% of users, often mitigated by dose titration, while rare but serious lactic acidosis occurs at a rate of approximately 3-10 per 100,000 patient-years, primarily in renal impairment.\n\nOther oral classes include sulfonylureas and meglitinides, which stimulate pancreatic beta-cell insulin release; dipeptidyl peptidase-4 (DPP-4) inhibitors, which prolong incretin effects to boost insulin secretion and suppress glucagon; sodium-glucose cotransporter-2 (SGLT2) inhibitors, which promote renal glucose excretion; thiazolidinediones (TZDs), which improve insulin sensitivity via peroxisome proliferator-activated receptor-gamma activation; and alpha-glucosidase inhibitors, which delay carbohydrate absorption. SGLT2 inhibitors stand out for cardiorenal benefits, with meta-analyses of outcome trials showing 14% reductions in major adverse cardiovascular events and 11% in heart failure hospitalizations, independent of glycemic effects. In contrast, sulfonylureas carry higher risks of hypoglycemia (up to 2-4% annual incidence) and weight gain (2-3 kg), limiting their use in frail patients.\n\n| Class | Mechanism | Typical HbA1c Reduction | Key Side Effects |\n|-------|-----------|--------------------------|------------------|\n| Biguanides (e.g., metformin) | Inhibits hepatic glucose production, increases insulin sensitivity | 1-1.5% | Gastrointestinal upset, vitamin B12 deficiency, rare lactic acidosis |\n| Sulfonylureas (e.g., glipizide) | Stimulates insulin secretion from beta cells | 1-2% | Hypoglycemia, weight gain |\n| DPP-4 inhibitors (e.g., sitagliptin) | Enhances incretin-mediated insulin release and glucagon suppression | 0.5-1% | Neutral weight effect, low hypoglycemia risk, possible joint pain |\n| SGLT2 inhibitors (e.g., empagliflozin) | Blocks renal glucose reabsorption, induces glycosuria | 0.5-1% | Genitourinary infections, volume depletion, ketoacidosis risk; CV/renal benefits |\n| TZDs (e.g., pioglitazone) | Enhances insulin sensitivity in adipose/muscle | 0.5-1.5% | Weight gain, fluid retention, bone fractures, heart failure risk |\n\nCombination therapies, such as metformin with SGLT2 inhibitors or DPP-4 inhibitors, are prioritized in patients with established atherosclerotic cardiovascular disease or chronic kidney disease per 2025 guidelines, reflecting evidence from trials like EMPA-REG OUTCOME and CREDENCE showing superior outcomes over alternatives like sulfonylureas. Oral formulations of GLP-1 receptor agonists, such as semaglutide, provide incretin-based glycemic control with weight loss benefits (up to 5-10% body weight) but require strict administration conditions and carry gastrointestinal side effects similar to injectables. Long-term adherence remains challenged by polypharmacy, with real-world data indicating 40-50% discontinuation rates within one year due to side effects or complexity.\n\n### Insulin and Injectable Therapies\n\nInsulin, a peptide hormone produced by beta cells in the pancreatic islets, is essential for regulating blood glucose by facilitating cellular uptake and storage. In diabetes mellitus, particularly type 1 where beta cell destruction leads to absolute insulin deficiency, exogenous insulin replacement is required for survival; the hormone was first isolated from canine pancreata in 1921 by Frederick Banting and Charles Best at the University of Toronto, with successful human administration to 14-year-old Leonard Thompson on January 11, 1922, dramatically reducing mortality from diabetic ketoacidosis.  For type 2 diabetes, insulin therapy is indicated when hyperglycemia persists despite lifestyle interventions and oral agents, typically at thresholds of A1C \\u003e10% or random glucose ≥300 mg/dL, as per American Diabetes Association guidelines recommending basal insulin initiation followed by prandial if needed.\n\nCommercially available insulins are classified by onset, peak, and duration of action to approximate physiological profiles: rapid-acting analogs (e.g., insulin lispro, aspart, glulisine) onset in 5-15 minutes, peak at 1-2 hours, and last 3-5 hours, used for mealtime boluses; short-acting regular insulin onsets in 30 minutes, peaks at 2-3 hours, lasts 3-6 hours; intermediate-acting neutral protamine Hagedorn (NPH) onsets in 1-2 hours, peaks at 4-12 hours, lasts 12-18 hours; long-acting basal insulins like glargine (Lantus) or detemir onset in 1-2 hours without pronounced peak, lasting up to 24 hours; and ultra-long-acting degludec extends to 42 hours for flexible dosing.  Premixed formulations combine basal and prandial components for simplified regimens in type 2 diabetes.\n\nInsulin is primarily administered subcutaneously via syringes, prefilled pens, or continuous infusion pumps to mimic basal (steady background) and bolus (meal-related) needs, with injection sites rotated among abdomen, thighs, or arms to prevent lipohypertrophy—localized fat accumulation from repeated use.  Intravenous administration is reserved for acute settings like ketoacidosis. Common regimens include basal-bolus for intensive control in type 1, targeting A1C \\u003c7% while minimizing hypoglycemia, or once/twice-daily basal for type 2 initiation at 0.1-0.2 units/kg/day, titrated upward. Risks include hypoglycemia (blood glucose \\u003c70 mg/dL), occurring in up to 20-30% of users annually due to overdose, exercise, or missed meals, and weight gain of 2-4 kg/year from anabolic effects and reduced glycosuria; injection site reactions affect 10-20% initially but resolve with rotation. \n\nBeyond human or analog insulins, injectable incretin-based therapies, primarily glucagon-like peptide-1 (GLP-1) receptor agonists, augment endogenous insulin secretion in a glucose-dependent manner, suppress glucagon, delay gastric emptying, and promote satiety, thereby improving glycemic control and inducing 5-15% weight loss in type 2 diabetes without the hypoglycemia risk of insulin. Examples include short-acting exenatide (Byetta, twice-daily), daily liraglutide (Victoza, up to 1.8 mg), and weekly formulations like dulaglutide (Trulicity, 1.5-4.5 mg), semaglutide (Ozempic, 0.5-2 mg), or tirzepatide (Mounjaro, dual GLP-1/GIP agonist, 5-15 mg), which reduce A1C by 1-2% and are recommended early in type 2 with cardiovascular disease or obesity per ADA standards.  Gastrointestinal adverse effects like nausea (20-40% incidence, dose-dependent) predominate, with rare risks of pancreatitis or thyroid C-cell tumors in rodents, though human data show cardiovascular benefits in trials like LEADER (liraglutide reduced major events by 13%). These agents are self-injected subcutaneously, often weekly for adherence, and may be combined with insulin to lessen doses and mitigate weight gain.\n\n### Surgical and Procedural Options\n\nMetabolic surgery, also known as bariatric surgery when performed for obesity-related conditions, offers a procedural option for managing type 2 diabetes, particularly in patients with obesity, by inducing diabetes remission through mechanisms including weight loss, altered gut hormone secretion, and improved insulin sensitivity. Common procedures include Roux-en-Y gastric bypass (RYGB), sleeve gastrectomy (SG), and adjustable gastric banding (AGB). In randomized trials, RYGB has demonstrated diabetes remission rates of approximately 80% at one year, compared to 95% for biliopancreatic diversion and 50% for AGB, with remission defined as glycemic control without antidiabetic medications. Long-term data indicate sustained remission in 24.5% of RYGB patients and 15.2% of SG patients at five years, outperforming medical management alone, where remission rates remain below 10%. These effects often manifest rapidly, within days to weeks post-surgery, prior to substantial weight loss, suggesting direct metabolic reprogramming via reduced hepatic glucose production and enhanced incretin responses.\n\nFor patients with class II or III obesity (BMI ≥35 kg/m²) and poorly controlled type 2 diabetes despite lifestyle and pharmacological interventions, guidelines from organizations like the American Society for Metabolic and Bariatric Surgery endorse metabolic surgery as it yields higher remission rates than conventional therapy, with six-year follow-up showing 62% remission in RYGB patients versus 6-8% in non-surgical controls. Sleeve gastrectomy, involving removal of about 80% of the stomach, achieves over 60% remission in some cohorts by altering ghrelin levels and intestinal nutrient sensing. However, remission rates vary by diabetes duration and beta-cell function; patients with longer disease duration (\\u003e8 years) exhibit lower sustained remission, emphasizing early intervention. Risks include nutritional deficiencies, surgical complications (e.g., leaks, infections in 1-5%), and weight regain, which does not always reverse glycemic benefits in RYGB cases.\n\nIn type 1 diabetes, surgical options are limited to transplantation procedures for select patients with severe hypoglycemia unawareness or end-stage complications. Pancreas transplantation, often simultaneous with kidney transplantation (SPK) in uremic patients, restores endogenous insulin production and achieves insulin independence in over 80% of recipients initially, with five-year graft survival rates of 78.7% for SPK in type 1 cohorts. It improves glycemic stability and reduces hypoglycemic events but requires lifelong immunosuppression, carrying risks of rejection (10-20% annually), infection, and malignancy. Patient survival post-SPK exceeds 90% at five years, with benefits in stabilizing retinopathy and neuropathy, though full reversal of long-standing complications is partial.\n\nIslet cell transplantation, involving infusion of donor pancreatic islets into the portal vein, provides a less invasive alternative for type 1 patients, achieving insulin independence in 74% of recipients at one year, with graft function persisting in over 50% at five years via stimulated C-peptide levels. Long-term outcomes show 40-47% graft survival at 15-20 years, alongside reduced severe hypoglycemia and stable organ function, though multiple infusions are often needed and immunosuppression remains mandatory. This procedure suits brittle diabetes cases but is constrained by donor shortages and variable durability, with only about 15% of type 1 patients qualifying. Emerging endoscopic procedures, such as duodenal mucosal resurfacing, aim to ablate duodenal mucosa to mimic surgical metabolic effects but lack large-scale remission data exceeding 50% at one year and are not yet standard. Overall, these interventions are reserved for refractory cases due to procedural risks and variable long-term efficacy compared to optimized medical management.\n\n### Technological and Monitoring Tools\n\nTechnological advancements in diabetes management have shifted from intermittent self-monitoring of blood glucose (SMBG) using fingerstick meters to continuous and automated systems that provide real-time data and insulin delivery. Continuous glucose monitoring (CGM) systems, which use subcutaneous sensors to measure interstitial glucose levels every few minutes, enable frequent tracking without repeated pricks, reducing burden and improving glycemic control. These devices transmit data to smartphones or receivers, often with customizable alarms for hypo- or hyperglycemia.\n\nProminent CGM systems include the Dexcom G7, FreeStyle Libre 3 from Abbott, Eversense 365, and Medtronic Simplera. The Dexcom G7 offers a 10.5-day wear time with a mean absolute relative difference (MARD) accuracy of approximately 8.2%, allowing treatment decisions shortly after sensor insertion. Abbott's FreeStyle Libre 3 provides 14-day wear and real-time readings but requires scanning for alerts in some models, with studies showing it slightly less accurate than Dexcom G7 in comparative metrics like time in range (TIR). Eversense 365, an implantable CGM lasting up to a year, achieves an 8.8% MARD and vibratory alerts, suitable for those preferring minimal site changes. Real-time CGM (rtCGM) outperforms intermittently scanned CGM (isCGM or flash monitoring, e.g., earlier Libre models) in reducing hypoglycemia and boosting TIR by up to 10% in type 1 diabetes patients with normal awareness.\n\nInsulin delivery has advanced via external pumps providing continuous subcutaneous insulin infusion (CSII), mimicking basal-bolus physiology more precisely than multiple daily injections. Types include tubed systems like Medtronic's MiniMed and Tandem's t:slim, and tubeless options like Insulet's Omnipod 5, which uses adhesive pods for discreet wear. Pumps calculate boluses based on carbohydrate intake and current glucose, with features like temporary basal rates. In 2025, Omnipod 5 expanded use to 30% type 2 patients off-label, demonstrating broader applicability.\n\nHybrid closed-loop systems, often termed artificial pancreas technologies, integrate CGM with pumps using algorithms to automate basal insulin adjustments, requiring user input for meals. The FDA approved Medtronic's MiniMed 780G for adults with type 2 diabetes in September 2025, expanding from pediatric and type 1 indications. Other systems include Omnipod 5 and Cambridge's CamAPS FX app, which adapt to individual patterns for improved TIR exceeding 70%. These reduce user intervention by 70-90% overnight, though full closed-loop without meal boluses remains developmental due to challenges in postprandial control.\n\nSoftware complements hardware through apps like mySugr, Glucose Buddy, and Gluroo, which log data, predict trends via AI, and facilitate sharing with caregivers. Wearables, including CGM-integrated smartwatches, enable remote monitoring and predictive alerts, with 2025 trends toward AI-driven personalization despite limitations in non-invasive glucose sensing. Evidence from clinical trials confirms these tools lower HbA1c by 0.5-1.0% and hypoglycemic events, though access disparities persist due to cost and insurance.\n\n### Emerging Therapies and Research Frontiers\n\nStem cell-derived islet cell therapies represent a promising frontier for type 1 diabetes treatment, aiming to restore endogenous insulin production. In June 2025, Vertex Pharmaceuticals reported positive phase 1/2 data for zimislecel (formerly VX-880), an allogeneic stem cell-derived fully differentiated islet cell therapy, demonstrating insulin independence in multiple patients with severe hypoglycemia unawareness after infusion, with sustained glycemic control and no unanticipated safety signals. The therapy requires immunosuppression, but ongoing phase 3 trials, initiated in early 2025, seek to confirm efficacy and support regulatory submissions later that year. Similarly, in a small trial reported in June 2025, a stem cell-based treatment cured 10 of 12 participants with severe type 1 diabetes, enabling insulin independence via single infusion, though long-term durability remains under evaluation.\n\nGene editing technologies, particularly CRISPR-Cas9 and Cas12b, are advancing immune-evasive beta cell therapies to potentially eliminate the need for lifelong immunosuppression. In August 2025, researchers successfully transplanted CRISPR-edited allogeneic islet cells into a patient with long-standing type 1 diabetes, resulting in endogenous insulin production without immune rejection or broad immunosuppressants, by knocking out HLA proteins and introducing PD-L1 expression. Sana Biotechnology's approach, using CRISPR to hypoimmunize stem cell-derived islets, showed preclinical evasion of immune detection in humanized models, with clinical translation targeted for type 1 diabetes. These edits address causal immune destruction of beta cells, but scalability and off-target effects require further validation in larger trials.\n\nFor type 2 diabetes, dual and triple agonists targeting GLP-1, GIP, and potentially glucagon receptors are expanding therapeutic options beyond traditional agents. Tirzepatide, approved in 2022, demonstrated superior A1C reduction and weight loss in 2025 analyses, prompting recommendations for earlier use in patients with cardiovascular or kidney risks. SGLT2 inhibitors like empagliflozin and sotagliflozin gained endorsements as first-line therapies in updated guidelines, with sotagliflozin showing significant reductions in heart attacks and strokes in high-risk type 2 patients in February 2025 data.  Emerging immunomodulators, such as verapamil and Janus kinase inhibitors, are under investigation for preserving beta cell function in early type 2 diabetes, based on trials showing delayed progression.\n\nAutomated insulin delivery systems, often termed artificial pancreas technologies, continue to evolve with AI integration for broader applicability. In 2025, hybrid closed-loop systems achieved Time in Range improvements exceeding 70% in pediatric and pregnant populations, with NHS rollout enabling full automation without manual carbohydrate counting in select cases.  Event-triggered dual-hormone (insulin-glucagon) pumps, incorporating machine learning for predictive dosing, reduced hypoglycemia by 50% in simulations and early trials, addressing limitations of single-hormone systems. These devices rely on causal feedback loops between continuous glucose monitoring and hormone delivery, though challenges persist in exercise and meal variability.\n\nResearch frontiers also explore beta cell regeneration and microbiome modulation, with preclinical CRISPR corrections reversing monogenic diabetes forms in models, and fecal microbiota transplants showing modest glycemic improvements in type 2 cohorts. Encapsulated islet therapies, combining stem cells with protective biomaterials, advanced in 2025 trials to mitigate immune attack without drugs, though vascularization and fibrosis remain hurdles. Overall, these developments prioritize causal restoration of insulin dynamics over symptomatic management, with clinical translation hinging on rigorous safety data amid historical trial setbacks.\n\n## Controversies and Debates\n\n### Glycemic Control Targets and Risks\n\nGlycemic control targets in diabetes management aim to minimize long-term complications while avoiding acute risks such as hypoglycemia, with recommendations individualized based on patient factors including age, comorbidities, hypoglycemia awareness, and life expectancy. The American Diabetes Association (ADA) recommends an HbA1c target of less than 7% (53 mmol/mol) for many nonpregnant adults without a history of severe or frequent hypoglycemia, though targets may be relaxed to less than 8% (64 mmol/mol) for those with limited life expectancy, advanced complications, or high hypoglycemia risk, and tightened to less than 6.5% (48 mmol/mol) for selected patients with short diabetes duration and minimal comorbidities.   For continuous glucose monitoring users, a time in range (TIR) of approximately 70% (70-180 mg/dL or 3.9-10.0 mmol/L) is targeted, alongside minimizing time above range and hypoglycemia.  Plasma glucose targets typically include fasting/premeal levels of 80-130 mg/dL (4.4-7.2 mmol/L) and postprandial peaks below 180 mg/dL (10.0 mmol/L). \n\nEvidence from randomized controlled trials supports the benefits of achieving these targets in reducing microvascular complications, though macrovascular benefits emerge more gradually and vary by diabetes type. In the Diabetes Control and Complications Trial (DCCT) involving type 1 diabetes patients, intensive control achieving a mean HbA1c of 7.0% versus 9.0% in conventional therapy reduced retinopathy progression by 47%, nephropathy by 54%, and neuropathy by 60% over 6.5 years, with legacy effects persisting in the follow-up Epidemiology of Diabetes Interventions and Complications (EDIC) study.   The United Kingdom Prospective Diabetes Study (UKPDS) in newly diagnosed type 2 diabetes demonstrated that intensive glucose lowering (mean HbA1c 7.0% vs. 7.9%) decreased microvascular complications by 25% and, in long-term follow-up, reduced myocardial infarction by 15% and all-cause mortality by 11%.   These findings underscore a causal link between sustained hyperglycemia and tissue damage via mechanisms including advanced glycation end-products, oxidative stress, and inflammation. \n\nHowever, aggressive targets below 7% carry risks, particularly of hypoglycemia, which can precipitate cardiovascular events, cognitive impairment, falls, and mortality, prompting debate over universal application. The Action to Control Cardiovascular Risk in Diabetes (ACCORD) trial in high-risk type 2 patients with cardiovascular disease found that intensive control targeting HbA1c below 6.0% increased all-cause mortality by 22% and severe hypoglycemia threefold compared to standard control (HbA1c 7.0-7.9%), leading to early termination of the intensive arm.   Hypoglycemia, defined as level 1 (\\u003c70 mg/dL or 3.9 mmol/L), level 2 (\\u003c54 mg/dL or 3.0 mmol/L), or level 3 (severe, requiring assistance), triggers counterregulatory responses but recurrent episodes impair awareness, heightening vulnerability; in diabetes, it associates with arrhythmias, QT prolongation, and sympathetic overactivation.   Chronic hyperglycemia, conversely, drives retinopathy, nephropathy, neuropathy, and accelerated atherosclerosis, with each 1% HbA1c elevation raising microvascular risk by 20-40% and macrovascular events incrementally.   Optimal targets thus balance these trade-offs, prioritizing avoidance of extremes in vulnerable populations like the elderly or those with autonomic neuropathy. \n\n### Dietary Interventions and Nutritional Paradigms\n\nTraditional dietary guidelines for diabetes management, as promulgated by organizations like the American Diabetes Association (ADA), have long emphasized a balanced macronutrient distribution with carbohydrates comprising 45-65% of total caloric intake, primarily from whole grains, fruits, and vegetables, alongside reduced saturated fats and increased physical activity. These recommendations stem from early 20th-century observations linking high-fat diets to cardiovascular risks, though they have been critiqued for not sufficiently prioritizing glycemic control in insulin-resistant states. In practice, such carb-inclusive approaches often fail to achieve sustained normoglycemia for many type 2 diabetes patients, with meta-analyses indicating modest HbA1c reductions of 0.2-0.5% at one year compared to baseline.\n\nAlternative paradigms, particularly low-carbohydrate (typically \\u003c130 g/day) and very-low-carbohydrate/ketogenic diets (\\u003c50 g/day carbs), challenge this consensus by targeting carbohydrate restriction to minimize postprandial glucose excursions and insulin demand, addressing the core pathophysiology of hyperglycemia driven by hepatic glucose overproduction and peripheral resistance. Randomized controlled trials and meta-analyses demonstrate superior short-term outcomes, including greater HbA1c reductions (e.g., 0.23% more than control diets at 6 months) and higher diabetes remission rates (HbA1c \\u003c6.5% without medication: 57% vs. 31% at 6 months). Long-term data from interventions like Virta Health's continuous remote care model with nutritional ketosis show sustained benefits over 5 years, with 12.5% achieving remission, average HbA1c drops from 7.6% to 6.2%, and 55% discontinuing non-insulin medications, alongside 7-10% body weight loss in adherent participants. These effects are attributed to reduced hyperinsulinemia and improved beta-cell function, with studies linking excess refined carbohydrate intake to insulin resistance via chronic pancreatic overstimulation and lipid accumulation in tissues.\n\nDebates persist over sustainability and safety, with critics citing potential cardiovascular risks from elevated LDL in some low-carb adherents and lack of long-term adherence in non-supervised settings, though plant-based low-carb variants mitigate these concerns and show reduced type 2 diabetes incidence. Institutional resistance, including delayed endorsement by the ADA until 2019 (now allowing low-carb for short-term use), has been attributed to entrenched high-carb paradigms and potential conflicts from pharmaceutical funding, as carbohydrate restriction often obviates or reduces reliance on glucose-lowering drugs. Proponents argue that first-line carbohydrate reduction aligns with causal mechanisms—excess dietary glucose directly fuels hyperglycemia—outperforming standard advice in empirical trials, particularly for type 2 diabetes where obesity and metabolic syndrome predominate. For type 1 diabetes, low-carb approaches demand meticulous insulin adjustments to avert hypoglycemia but yield tighter glycemic control and reduced insulin doses in controlled studies.\n\nEmerging evidence supports ketogenic diets for remission in select type 2 cases, with one-year rates up to 20% in intensive programs, though relapse occurs upon reintroducing carbs, underscoring the need for lifelong adherence. Overall, while mainstream guidelines prioritize individualized, moderate-carb plans to accommodate diverse preferences, rigorous data favor low-carb strategies for superior metabolic outcomes, prompting calls for guideline revisions amid critiques of source biases in nutrition research favoring pharmaceutical adjuncts over dietary primacy.\n\n### Genetic Predisposition vs. Personal Responsibility\n\nType 2 diabetes exhibits substantial genetic heritability, with twin studies estimating it at 40-70% based on analyses of monozygotic and dizygotic pairs. Probandwise concordance rates reach 34% in monozygotic twins compared to 16% in dizygotic twins, indicating a genetic component but also highlighting that shared environment and personal behaviors prevent full penetrance even in genetically identical individuals. Genome-wide association studies have identified over 400 susceptibility loci, yet these variants collectively explain only a modest fraction of risk, underscoring that genetic predisposition alone does not determine onset.\n\nIn contrast, modifiable lifestyle factors exert a dominant influence on type 2 diabetes incidence, particularly amid the parallel rise of obesity epidemics worldwide. Obesity contributes to 30-53% of new U.S. diabetes cases annually, with lifetime risk escalating from 7% in non-obese men to 70% in those with severe obesity. The Diabetes Prevention Program, a randomized trial involving 3,234 prediabetic adults, demonstrated that intensive lifestyle intervention—emphasizing 7% weight loss through diet and 150 minutes weekly exercise—reduced diabetes incidence by 58% over 2.8 years, outperforming metformin (31% reduction) and persisting in long-term follow-up with a 27% lower cumulative incidence after 15 years. These outcomes held across genetic risk strata, with lifestyle modifications yielding greater absolute risk reductions in high-genetic-risk subgroups.\n\nThe interplay reveals causal primacy of personal agency over genetic inevitability for most individuals, as evidenced by discordance in monozygotic twins and the reversibility of insulin resistance through sustained weight loss. While genetic factors may lower the threshold for disease in susceptible populations, epidemiological trends link surging diabetes rates to obesogenic environments rather than isolated genetic shifts, implying that avoidance of excess adiposity via caloric restraint and physical activity averts onset in 70-90% of predisposed cases per intervention trials. Claims minimizing personal responsibility by overemphasizing genetics often overlook this empirical modifiability, as heritability estimates incorporate both fixed and interactive effects without negating behavioral causation. For type 1 diabetes, genetic-autoimmune mechanisms predominate with minimal lifestyle mediation, but debates center on type 2, where evidence prioritizes actionable prevention over fatalistic attribution.\n\n### Overreliance on Pharmaceuticals\n\nCritics argue that the predominant emphasis on pharmacological interventions for type 2 diabetes mellitus prioritizes symptom management over addressing underlying causes such as insulin resistance and excess adiposity, which are often reversible through sustained weight loss and lifestyle modifications. Standard guidelines recommend escalating medication use to achieve glycemic targets, yet randomized trials demonstrate that intensive lifestyle interventions can induce remission—defined as HbA1c below 6.5% without antidiabetic drugs—in a substantial proportion of patients, rates not replicated by pharmacotherapy alone.00385-6/fulltext) For instance, the Diabetes Remission Clinical Trial (DiRECT), a 2017-2018 primary care-led study involving 306 participants with type 2 diabetes diagnosed within six years, achieved 46% remission at one year through total diet replacement followed by structured weight management, compared to 4% in the control group continuing usual care with medications. At five-year follow-up in 2024, 13% of the intervention group maintained remission, with weight loss identified as the primary driver, underscoring that pharmacological approaches rarely yield comparable durable outcomes without concurrent or prior non-drug strategies.00385-6/fulltext)\n\nPharmaceutical industry involvement has shaped treatment paradigms, including advocacy for stricter glycemic targets that necessitate broader drug utilization. In the early 2000s, campaigns by companies producing sulfonylureas and other agents influenced the American Diabetes Association to lower HbA1c goals from 7.0-7.5% to below 7.0%, correlating with increased prescriptions but also heightened risks of overtreatment, such as severe hypoglycemia in older patients. A 2021 Reuters investigation revealed how firms like Sanofi and Takeda funded studies and physician education to promote intensive therapy, leading to polypharmacy in vulnerable populations despite evidence from trials like ACCORD (2008) showing no mortality benefit and excess cardiovascular events from aggressive control. Such dynamics reflect financial incentives, as diabetes medications generated over $50 billion annually by 2020, fostering dependency on chronic therapy rather than remission-focused alternatives.\n\nCommon antidiabetic agents carry documented adverse effects that compound reliance risks, often underemphasized in guideline endorsements. Metformin, the first-line therapy, induces gastrointestinal distress in up to 25% of users, including diarrhea and nausea, prompting discontinuation in 5-10%. Sulfonylureas elevate hypoglycemia risk by 2-4 fold versus comparators, with incidence rates exceeding 10% in trials, while GLP-1 agonists like semaglutide cause nausea and vomiting in 20-40% initially, alongside potential pancreatitis. SGLT2 inhibitors, promoted for cardiorenal benefits, link to genital infections in 5-10% and rare but serious ketoacidosis. These harms, aggregated across classes, contribute to non-adherence rates of 30-50% in type 2 diabetes cohorts, exacerbating poor outcomes without resolving root metabolic dysfunction.\n\nIn contrast, lifestyle interventions like those in the Look AHEAD trial (2001-2012) yielded partial remission in 11.5% of intensive participants versus 7.9% in controls after one year, with sustained benefits tied to 5-10% body weight reduction, independent of medications. This evidence supports contentions that overreliance perpetuates a model of lifelong pharmacotherapy, incurring annual U.S. costs exceeding $100 billion for diabetes drugs by 2023, while sidelining scalable, low-cost reversibility for early-stage disease. Proponents of de-emphasizing drugs advocate prioritizing caloric restriction and physical activity, citing causal links between visceral fat reduction and beta-cell function restoration, though implementation barriers persist in resource-limited settings.\n\n## Epidemiology\n\n### Global Prevalence and Trends\n\nIn 2025, approximately 589 million adults aged 20-79 years live with diabetes worldwide, equating to nearly one in nine adults in this age group. Of these, an estimated 252 million cases remain undiagnosed, highlighting substantial gaps in screening and detection, particularly in low- and middle-income countries. Type 2 diabetes accounts for over 90% of all cases, while type 1 diabetes affects about 9.5 million individuals globally, including 1.85 million under age 20.\n\nGlobal prevalence has accelerated markedly over recent decades. Age-standardized prevalence among adults rose from 7% in 1990 to 14% in 2022, with the absolute number of cases quadrupling to around 828 million adults aged 18 and older by the latter year, driven primarily by population growth, aging, and rising obesity rates in developing regions.02317-1/fulltext) The steepest increases occurred in low- and middle-income countries, where urbanization, dietary shifts toward processed foods, and reduced physical activity have contributed to higher incidence of type 2 diabetes, though direct causation remains tied to insulin resistance and beta-cell dysfunction rather than socioeconomic factors alone.\n\nProjections from the International Diabetes Federation indicate a further rise to 853 million adults by 2050, a 46% increase from 2025 levels, with the greatest burdens expected in South Asia, sub-Saharan Africa, and the Middle East-North Africa region due to demographic pressures and persistent lifestyle risk factors. Type 1 diabetes prevalence shows slower growth, with stable incidence in high-income countries but emerging increases in pediatric cases elsewhere, potentially linked to environmental triggers atop genetic predispositions. These trends underscore the need for empirical interventions targeting modifiable risks, as undiagnosed and uncontrolled cases amplify complications like cardiovascular disease and renal failure.\n\n### Risk Factors and Population Disparities\n\nRisk factors for type 1 diabetes mellitus primarily involve genetic predisposition, particularly specific human leukocyte antigen (HLA) genotypes such as DR4-DQ8 and DR3-DQ2, which confer the strongest known genetic risks. Environmental triggers, including certain viral infections and possibly early childhood dietary factors, interact with these genetics to initiate autoimmune destruction of pancreatic beta cells, though causality remains incompletely established. Family history increases risk, with first-degree relatives facing elevated odds, but the condition can onset at any age, most commonly in childhood or adolescence.\n\nIn contrast, type 2 diabetes mellitus arises from insulin resistance compounded by relative insulin deficiency, with modifiable lifestyle factors playing a dominant causal role alongside non-modifiable ones. Overweight or obesity, particularly visceral adiposity, directly promotes insulin resistance through mechanisms like chronic low-grade inflammation and ectopic fat deposition. Physical inactivity exacerbates this by impairing glucose uptake in muscles, while advancing age (over 45 years) correlates with declining beta-cell function and increased adiposity. Family history indicates genetic susceptibility, often polygenic, but gestational diabetes or delivering a baby over 9 pounds signals prior metabolic dysfunction. Hypertension, dyslipidemia (HDL below 35 mg/dL or triglycerides above 250 mg/dL), and prediabetes further heighten risk through endothelial dysfunction and impaired insulin signaling.\n\n- **Key modifiable risk factors for type 2 diabetes**:\n  - Overweight or obesity (BMI ≥25 kg/m²)\n  - Sedentary lifestyle (\\u003c150 minutes moderate activity weekly)\n  - Poor diet high in refined carbohydrates and saturated fats\n  - Smoking, which induces oxidative stress and beta-cell damage\n\n- **Non-modifiable risk factors**:\n  - Age ≥45 years\n  - Family history of type 2 diabetes\n  - History of gestational diabetes or polycystic ovary syndrome\n\nPopulation disparities in diabetes prevalence reflect intersections of genetics, lifestyle, and socioeconomic conditions, with higher burdens in certain ethnic groups and lower socioeconomic strata. In the United States, age-adjusted prevalence of diagnosed diabetes is highest among American Indian and Alaska Native adults at 13.6%, followed by non-Hispanic Black (12.1%) and Hispanic adults, compared to 6.9% for non-Hispanic White adults, patterns persisting into 2023 data. Non-Hispanic Black adults face a 24% higher diagnosis rate than the general population, attributable partly to higher obesity prevalence and genetic factors influencing insulin sensitivity, though lifestyle mediators like diet quality amplify risks. Native American populations exhibit roughly twice the prevalence of White Americans, linked to historical dietary shifts from traditional to processed foods post-colonization, alongside genetic predispositions.\n\nGlobally, diabetes prevalence has quadrupled since 1990, rising from 7% to 14% in adults by 2022, with the sharpest increases (15-22 percentage points) in low- and middle-income countries (LMICs), where over 87.5% of undiagnosed cases reside due to limited screening and higher obesity transitions.  Socioeconomic status inversely correlates with risk: lower-income individuals experience 1.5-2 times higher odds, mediated by barriers to healthy food access, sedentary jobs, and stress-induced cortisol dysregulation promoting insulin resistance.  In high-income settings, sustained low income or income declines elevate type 2 diabetes incidence by impairing preventive care adherence. These disparities underscore causal pathways where environmental exposures, rather than inherent inequities alone, drive outcomes, as evidenced by migration studies showing acculturation to Western diets increasing risks in predisposed groups.\n\n| Ethnic Group (US Adults) | Diagnosed Diabetes Prevalence (%) | Relative Risk vs. White |\n|---------------------------|-----------------------------------|--------------------------|\n| American Indian/Alaska Native | 13.6 | ~2.0x |\n| Non-Hispanic Black | 12.1 | 1.8x |\n| Hispanic | 11.7 | 1.7x |\n| Non-Hispanic White | 6.9 | 1.0x (reference) |\n\n### Socioeconomic and Health System Impacts\n\nDiabetes imposes substantial economic burdens worldwide, with global health expenditures related to the condition exceeding $1 trillion USD in 2024, marking a 338% increase over the prior 17 years. In the United States, the total estimated cost of diagnosed diabetes reached $412.9 billion in 2022, comprising $306.6 billion in direct medical costs—such as hospital inpatient care, medications, and outpatient services—and $106.3 billion in indirect costs from reduced productivity. These direct costs for individuals with diabetes are 2.6 times higher than for those without, driven primarily by management of complications like cardiovascular disease and kidney failure. Per capita, type 2 diabetes generates annual healthcare costs of approximately $10,801 in high-income countries, compared to $242 in low-income nations, reflecting disparities in access to advanced treatments and complication management.\n\nIndirect costs, including lost productivity, further amplify the socioeconomic toll. In the US, presenteeism—reduced efficiency at work due to diabetes symptoms—accounts for $35.8 billion annually in indirect costs, while absenteeism from missed workdays contributes an additional portion of the $106.3 billion total. Household productivity losses and premature mortality due to diabetes add to this burden, with inability to work affecting over 2.5 million individuals yearly. Globally, these productivity losses strain economies, particularly in low- and middle-income countries (LMICs), where rising diabetes prevalence—doubling from 7% to 14% between 1990 and 2022—coincides with limited resources for prevention and care.\n\nSocioeconomic disparities exacerbate diabetes prevalence and outcomes, with lower income and education levels correlating to higher rates. In the US, diabetes prevalence rises inversely with income, forming a gradient where lower socioeconomic groups experience elevated incidence independent of other risk factors. Similarly, in Canada, adults in the lowest income quintile have a diabetes prevalence 2.1 times higher than those in the highest quintile. These patterns persist across Europe and Asia, where lower education and rural residence predict poorer glycemic control and higher complication rates, often due to barriers in accessing nutritious food, physical activity opportunities, and routine screening. \n\nHealth systems face significant strain from diabetes, accounting for disproportionate resource utilization. In the US, diabetes drives elevated hospital admissions for acute complications like hypoglycemia and ketoacidosis, contributing to 10-15% of total healthcare spending on chronic conditions. Globally, the condition's complications lead to millions of disability-adjusted life years (DALYs) lost annually, with LMICs bearing the heaviest load due to underfunded primary care and late diagnoses. This burden intensifies in systems with fragmented care, where uncoordinated management increases emergency visits and long-term costs, underscoring the need for targeted interventions in vulnerable populations.\n\n## History\n\n### Pre-Modern Observations\n\nThe earliest recorded observations of a condition resembling diabetes mellitus appear in the Ebers Papyrus, an Egyptian medical text dating to approximately 1550 BCE, which describes excessive urination as a symptom treatable with herbal remedies like elderberry and milk, though without identifying sweetness in the urine or underlying causes. Similar polyuria is noted in other ancient Egyptian manuscripts around 1500 BCE, characterized as \"too great emptying of urine,\" but linked empirically to debility without causal explanation beyond humoral imbalances.\n\nIn ancient India, Sushruta (circa 600–500 BCE) documented the disease as *madhumeha* (\"honey urine\") in the *Sushruta Samhita*, observing polyuria with urine sweet enough to attract ants and flies, excessive thirst, emaciation, and pruritus, attributing it to imbalances in bodily humors like *kapha* and recommending dietary restrictions on sweets and fats alongside purgatives and exercise. Charaka, around the same era or slightly later, similarly described *madhumeha* with symptoms of fatigue and wasting, distinguishing it from other urinary disorders through taste and odor tests, and proposed treatments including bitter herbs and lifestyle moderation, reflecting early empirical differentiation based on clinical presentation rather than etiology. By the 5th century CE, Indian texts began noting distinctions between acute, wasting forms (resembling type 1) in youth and chronic, obesity-associated variants (type 2), as evidenced in works like those of Vagbhata.\n\nChinese medical literature from antiquity, including texts like the *Huangdi Neijing* (circa 200 BCE), referenced a syndrome of excessive urination and thirst (*xiao ke*, or \"wasting thirst\"), empirically linked to dietary excess and heat in the body, with urine described as sweet-tasting in some records, treated via acupuncture, herbal decoctions like ginseng, and avoidance of sweet foods, though without isolating glucose involvement.\n\nGreek physician Aretaeus of Cappadocia (1st–2nd century CE) provided one of the most detailed pre-modern clinical accounts, coining the term *diabetes* (Greek for \"siphon\") to denote the relentless passage of undigested urine, noting unquenchable thirst, voracious hunger, rapid flesh and fluid wasting despite intake, and a fatal progression to coma, observing that \"the patients never cease to urinate, even if they drink little,\" and rejecting prior humoral cures as ineffective. Roman and later Byzantine texts echoed these symptoms, with limited interventions like barley diets or bloodletting, but no reversal for severe cases, underscoring the condition's empirical lethality prior to metabolic insights. Medieval Arabic scholars, such as Avicenna (Ibn Sina, 980–1037 CE), compiled these observations in the *Canon of Medicine*, adding notes on urine's saccharine quality and gangrenous complications, yet treatments remained symptomatic and futile for insulin-deficient forms.\n\n### Key Discoveries in the 19th and 20th Centuries\n\nIn the mid-19th century, French physiologist Claude Bernard established that blood glucose levels are maintained through a balance of dietary absorption and endogenous hepatic production, identifying glycogen as the liver's stored glucose form in 1855 and demonstrating its role in glycemia regulation via puncturing the floor of the fourth ventricle in rabbits, which induced hyperglycemia. These findings shifted understanding from diabetes as mere digestive excess to a disorder of internal metabolic control.\n\nIn 1869, German medical student Paul Langerhans described clusters of cells scattered throughout the pancreas, distinct from its exocrine tissue, later termed the islets of Langerhans and recognized as endocrine structures essential to glucose homeostasis.\n\nA landmark experiment in 1889 by German physicians Joseph von Mering and Oskar Minkowski demonstrated that surgical removal of the pancreas in dogs consistently produced severe hyperglycemia, glycosuria, and symptoms mimicking human diabetes mellitus, providing causal evidence linking pancreatic integrity to blood sugar regulation and refuting prior theories centered solely on the nervous system or kidneys. This work spurred targeted research into pancreatic extracts as potential therapies.\n\nThe early 20th century culminated in the 1921 isolation of insulin by Canadian researchers Frederick Banting and Charles Best, who ligated pancreatic ducts in dogs to degenerate acinar cells while preserving islets, then extracted and purified a glucose-lowering substance from the atrophied glands, successfully treating depancreatized dogs. On January 11, 1922, biochemist James Collip refined the extract for the first human administration to 14-year-old Leonard Thompson, whose near-fatal ketosis resolved dramatically, enabling survival beyond months. Commercial production followed in 1923, averting death for countless type 1 patients previously reliant on starvation diets.\n\nSubsequent refinements included Hans Christian Hagedorn's 1923 development of neutral protamine Hagedorn (NPH) insulin for prolonged action, reducing injection frequency. By 1959, clinical observations formalized the distinction between type 1 diabetes—marked by absolute insulin deficiency and juvenile onset—and type 2, involving peripheral insulin resistance with initial hyperinsulinemia and adult predominance, guiding targeted interventions. The mid-1950s introduction of oral sulfonylureas, such as tolbutamide, offered non-insulin options for type 2 by stimulating beta-cell secretion, though efficacy varied and hypoglycemia risks emerged.\n\n### Post-2000 Developments and Milestones\n\nThe Diabetes Prevention Program, a multicenter trial initiated by the National Institute of Diabetes and Digestive and Kidney Diseases, reported in 2002 that intensive lifestyle modifications—aiming for 7% body weight loss and 150 minutes of weekly physical activity—reduced the incidence of type 2 diabetes by 58% over three years in adults with prediabetes, compared to 31% with metformin alone. This built on the 2001 Finnish Diabetes Prevention Study, which similarly showed a 58% relative risk reduction through diet and exercise in high-risk individuals. These findings shifted emphasis toward preventive strategies, influencing guidelines like the American Diabetes Association's 2004 endorsement of metformin for prediabetes in those over 60 or with BMI above 35 kg/m².\n\nPharmacological advancements accelerated in the 2000s with the introduction of incretin-based therapies. Exenatide, the first GLP-1 receptor agonist, received FDA approval in 2005 for type 2 diabetes, mimicking gut hormones to enhance insulin secretion, suppress glucagon, and promote satiety, leading to glycemic improvements and modest weight loss. SGLT2 inhibitors, such as canagliflozin approved in 2013, emerged as a novel class inhibiting renal glucose reabsorption, reducing HbA1c by 0.5-1% and offering cardiovascular and renal protective effects demonstrated in trials like EMPA-REG OUTCOME (2015). By the late 2010s, long-acting GLP-1 agonists like semaglutide (Ozempic, approved 2017) showed superior outcomes, with the SUSTAIN-6 trial (2016) reporting a 26% reduction in major adverse cardiovascular events.\n\nTechnological innovations transformed monitoring and delivery. Continuous glucose monitoring (CGM) systems, first commercially available around 2000 with devices like the MiniMed Guardian, enabled real-time interstitial glucose tracking, reducing HbA1c by up to 1% in type 1 diabetes users per the 2008 JDRF study. Insulin pumps advanced with hybrid closed-loop systems, dubbed \"artificial pancreases,\" gaining FDA clearance starting with the Medtronic MiniMed 670G in 2016, which automates basal insulin adjustments based on CGM data, improving time-in-range to over 70%. By 2020, integration of AI-driven algorithms in apps and devices further personalized therapy, though evidence from real-world data highlights variability in outcomes tied to user adherence.\n\nEpidemiological trends underscored urgency, with global diabetes prevalence rising from 171 million in 2000 to 422 million by 2014 per WHO estimates, prompting updated guidelines like the ADA's 2025 Standards of Care emphasizing CGM for all type 2 patients on insulin or with hypoglycemia unawareness. Ongoing trials, such as EDIC (extension of DCCT), confirmed in 2010s analyses that early intensive control yields decades-long microvascular benefits, reinforcing causal links between hyperglycemia duration and complications. These milestones reflect a paradigm from reactive symptom management to proactive, data-informed interventions, though real-world control rates plateaued post-2010 in U.S. adults, with only 50% achieving HbA1c below 7%.",
  "external_references": [
    {
      "text": "Pmc2613584",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2613584/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "What Is Diabetes",
      "url": "https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-diabetes",
      "domain": "niddk.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk513253",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK513253/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Diabetes Facts Figures",
      "url": "https://idf.org/about-diabetes/diabetes-facts-figures/",
      "domain": "idf.org",
      "type": "citation"
    },
    {
      "text": "S41392 024 01951 9",
      "url": "https://www.nature.com/articles/s41392-024-01951-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "diabetesatlas.org",
      "url": "https://diabetesatlas.org/",
      "domain": "diabetesatlas.org",
      "type": "citation"
    },
    {
      "text": "Nbk551501",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK551501/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7791288",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7791288/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2 Diagnosis And Classification Of Diabetes",
      "url": "https://diabetesjournals.org/care/article/48/Supplement_1/S27/157566/2-Diagnosis-and-Classification-of-Diabetes",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc9810477",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9810477/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk507839",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK507839/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Diabetes",
      "url": "https://www.who.int/health-topics/diabetes",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Pmc7503727",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7503727/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk279119",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK279119/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Syc 20371444",
      "url": "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/diabetes/signs-symptoms/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "7104 Diabetes",
      "url": "https://my.clevelandclinic.org/health/diseases/7104-diabetes",
      "domain": "my.clevelandclinic.org",
      "type": "citation"
    },
    {
      "text": "Diabetes",
      "url": "https://www.who.int/news-room/fact-sheets/detail/diabetes",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Warning Signs Symptoms",
      "url": "https://diabetes.org/about-diabetes/warning-signs-symptoms",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "Syc 20351193",
      "url": "https://www.mayoclinic.org/diseases-conditions/type-2-diabetes/symptoms-causes/syc-20351193",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Diabetes Mellitus Dm",
      "url": "https://www.merckmanuals.com/home/hormonal-and-metabolic-disorders/diabetes-mellitus-dm-and-disorders-of-blood-sugar-metabolism/diabetes-mellitus-dm",
      "domain": "merckmanuals.com",
      "type": "citation"
    },
    {
      "text": "Pmc6969655",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6969655/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Symptoms Of Diabetes And Their Association With",
      "url": "https://diabetesjournals.org/care/article/30/11/2868/4786/Symptoms-of-Diabetes-and-Their-Association-With",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Syc 20371525",
      "url": "https://www.mayoclinic.org/diseases-conditions/diabetic-hypoglycemia/symptoms-causes/syc-20371525",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Pmc3632150",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3632150/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8012317",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8012317/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk560723",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK560723/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6195777",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6195777/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Dia Ch17.pdf",
      "url": "https://www.niddk.nih.gov/-/media/Files/Strategic-Plans/Diabetes-in-America-3rd-Edition/DIA_Ch17.pdf",
      "domain": "niddk.nih.gov",
      "type": "citation"
    },
    {
      "text": "33651551",
      "url": "https://pubmed.ncbi.nlm.nih.gov/33651551/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Microvascular And Macrovascular Complications Of",
      "url": "https://diabetesjournals.org/clinical/article/26/2/77/1823/Microvascular-and-Macrovascular-Complications-of",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "12 Retinopathy Neuropathy And Foot Care Standards",
      "url": "https://diabetesjournals.org/care/article/48/Supplement_1/S252/157552/12-Retinopathy-Neuropathy-and-Foot-Care-Standards",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc11032697",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11032697/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Wnl.43.4.817",
      "url": "https://www.neurology.org/doi/10.1212/WNL.43.4.817",
      "domain": "neurology.org",
      "type": "citation"
    },
    {
      "text": "A Clinical Study Of The Association And Risk.21.aspx",
      "url": "https://journals.lww.com/jfmpc/fulltext/2020/09040/a_clinical_study_of_the_association_and_risk.21.aspx",
      "domain": "journals.lww.com",
      "type": "citation"
    },
    {
      "text": "31722562",
      "url": "https://pubmed.ncbi.nlm.nih.gov/31722562/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Cardiovascular Disease Diabetes",
      "url": "https://www.heart.org/en/health-topics/diabetes/diabetes-complications-and-risks/cardiovascular-disease--diabetes",
      "domain": "heart.org",
      "type": "citation"
    },
    {
      "text": "Cir.0000000000001040",
      "url": "https://www.ahajournals.org/doi/10.1161/CIR.0000000000001040",
      "domain": "ahajournals.org",
      "type": "citation"
    },
    {
      "text": "Vascular Complications Of Diabetes A Narrative.79.aspx",
      "url": "https://journals.lww.com/md-journal/fulltext/2023/10060/vascular_complications_of_diabetes__a_narrative.79.aspx",
      "domain": "journals.lww.com",
      "type": "citation"
    },
    {
      "text": "Pmc4911847",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4911847/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk507713",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK507713/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "117739 Overview",
      "url": "https://emedicine.medscape.com/article/117739-overview",
      "domain": "emedicine.medscape.com",
      "type": "citation"
    },
    {
      "text": "Pmc5723426",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5723426/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Dom.16460",
      "url": "https://dom-pubs.onlinelibrary.wiley.com/doi/full/10.1111/dom.16460",
      "domain": "dom-pubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "164460",
      "url": "https://www.jci.org/articles/view/164460",
      "domain": "jci.org",
      "type": "citation"
    },
    {
      "text": "Pmc4903951",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4903951/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Dom.16501",
      "url": "https://dom-pubs.onlinelibrary.wiley.com/doi/full/10.1111/dom.16501",
      "domain": "dom-pubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/diabetes/php/data-research/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Incidence Prevalence",
      "url": "https://www.breakthrought1d.org/t1d-basics/incidence-prevalence/",
      "domain": "breakthrought1d.org",
      "type": "citation"
    },
    {
      "text": "40536127",
      "url": "https://pubmed.ncbi.nlm.nih.gov/40536127/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41390 024 03107 5",
      "url": "https://www.nature.com/articles/s41390-024-03107-5",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc8104985",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8104985/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "117853 Overview",
      "url": "https://emedicine.medscape.com/article/117853-overview",
      "domain": "emedicine.medscape.com",
      "type": "citation"
    },
    {
      "text": "Pmc10574155",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10574155/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "About Type 2 Diabetes.html",
      "url": "https://www.cdc.gov/diabetes/about/about-type-2-diabetes.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/diabetes/risk-factors/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Risk Factors Type 2 Diabetes",
      "url": "https://www.niddk.nih.gov/health-information/diabetes/overview/risk-factors-type-2-diabetes",
      "domain": "niddk.nih.gov",
      "type": "citation"
    },
    {
      "text": "Differences Between Type 1 And Type 2 Diabetes",
      "url": "https://www.diabetes.org.uk/diabetes-the-basics/differences-between-type-1-and-type-2-diabetes",
      "domain": "diabetes.org.uk",
      "type": "citation"
    },
    {
      "text": "Pmc4166864",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4166864/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8050730",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8050730/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk545196",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK545196/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "What Is Gestational Diabetes Really",
      "url": "https://diabetesjournals.org/diabetes/article/74/7/1037/158091/What-Is-Gestational-Diabetes-Really",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc6274679",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6274679/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Prevalence Of Gestational Diabetes And Associated.18.aspx",
      "url": "https://journals.lww.com/annals-of-medicine-and-surgery/fulltext/2025/10000/prevalence_of_gestational_diabetes_and_associated.18.aspx",
      "domain": "journals.lww.com",
      "type": "citation"
    },
    {
      "text": "Gestational Diabetes",
      "url": "https://diabetes.org/living-with-diabetes/pregnancy/gestational-diabetes",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "Pmc7958210",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7958210/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0215372",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "S0002916523025765",
      "url": "https://www.sciencedirect.com/science/article/pii/S0002916523025765",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S43856 023 00427 1",
      "url": "https://www.nature.com/articles/s43856-023-00427-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Acog Releases Updated Guidance Gestational Diabetes",
      "url": "https://www.obgproject.com/2023/01/02/acog-releases-updated-guidance-gestational-diabetes/",
      "domain": "obgproject.com",
      "type": "citation"
    },
    {
      "text": "2 Diagnosis And Classification Of Diabetes",
      "url": "https://diabetesjournals.org/care/article/47/Supplement_1/S20/153954/2-Diagnosis-and-Classification-of-Diabetes",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Gestational Diabetes",
      "url": "https://www.acog.org/womens-health/faqs/gestational-diabetes",
      "domain": "acog.org",
      "type": "citation"
    },
    {
      "text": "15 Management Of Diabetes In Pregnancy Standards",
      "url": "https://diabetesjournals.org/care/article/48/Supplement_1/S306/157565/15-Management-of-Diabetes-in-Pregnancy-Standards",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Gestational Diabetes Mellitus Obstetric Issues And Management",
      "url": "https://www.uptodate.com/contents/gestational-diabetes-mellitus-obstetric-issues-and-management",
      "domain": "uptodate.com",
      "type": "citation"
    },
    {
      "text": "S41598 024 59465 X",
      "url": "https://www.nature.com/articles/s41598-024-59465-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc7564828",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7564828/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/maternal-infant-health/pregnancy-diabetes/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Bmj 2021 067946",
      "url": "https://www.bmj.com/content/377/bmj-2021-067946",
      "domain": "bmj.com",
      "type": "citation"
    },
    {
      "text": "Pmc11185335",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11185335/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Secondary Diabetes.html",
      "url": "https://www.diabetes.co.uk/secondary-diabetes.html",
      "domain": "diabetes.co.uk",
      "type": "citation"
    },
    {
      "text": "Rare Forms Of Diabetes",
      "url": "https://idf.org/about-diabetes/types-of-diabetes/rare-forms-of-diabetes/",
      "domain": "idf.org",
      "type": "citation"
    },
    {
      "text": "12676",
      "url": "https://www.mdpi.com/1422-0067/24/16/12676",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Monogenic Neonatal Mellitus Mody",
      "url": "https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-diabetes/monogenic-neonatal-mellitus-mody",
      "domain": "niddk.nih.gov",
      "type": "citation"
    },
    {
      "text": "Monogenic Diabetes",
      "url": "https://www.endocrine.org/patient-engagement/endocrine-library/monogenic-diabetes",
      "domain": "endocrine.org",
      "type": "citation"
    },
    {
      "text": "Pmc8313202",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8313202/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "P162.html",
      "url": "https://www.aafp.org/pubs/afp/issues/2022/0200/p162.html",
      "domain": "aafp.org",
      "type": "citation"
    },
    {
      "text": "Type 1 Diabetes Pathophysiology And Diagnosis",
      "url": "https://pharmaceutical-journal.com/article/ld/type-1-diabetes-pathophysiology-and-diagnosis",
      "domain": "pharmaceutical-journal.com",
      "type": "citation"
    },
    {
      "text": "Pmc9032728",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9032728/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "16280652",
      "url": "https://pubmed.ncbi.nlm.nih.gov/16280652/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk1662",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK1662/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2024.1457213/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "S41574 020 00443 4",
      "url": "https://www.nature.com/articles/s41574-020-00443-4",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc5571740",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5571740/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2021.737964/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pmc3385937",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3385937/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Dom.16628",
      "url": "https://dom-pubs.onlinelibrary.wiley.com/doi/full/10.1111/dom.16628",
      "domain": "dom-pubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc10855901",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10855901/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk597726",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK597726/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10294065",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10294065/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41586 024 07019 6",
      "url": "https://www.nature.com/articles/s41586-024-07019-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S2452014425000561",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S2452014425000561",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Dom.14777",
      "url": "https://dom-pubs.onlinelibrary.wiley.com/doi/full/10.1111/dom.14777",
      "domain": "dom-pubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "8090174",
      "url": "https://academic.oup.com/jcem/article/110/6/1505/8090174",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Genetic Predisposition Type 1 Diabetes",
      "url": "https://diabetesresearchconnection.org/genetic-predisposition-type-1-diabetes/",
      "domain": "diabetesresearchconnection.org",
      "type": "citation"
    },
    {
      "text": "Pmc3521576",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3521576/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "View.php",
      "url": "https://www.e-dmj.org/journal/view.php?number=6",
      "domain": "e-dmj.org",
      "type": "citation"
    },
    {
      "text": "Circresaha.119.316065",
      "url": "https://www.ahajournals.org/doi/10.1161/CIRCRESAHA.119.316065",
      "domain": "ahajournals.org",
      "type": "citation"
    },
    {
      "text": "Nbk597414",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK597414/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "142244",
      "url": "https://www.jci.org/articles/view/142244",
      "domain": "jci.org",
      "type": "citation"
    },
    {
      "text": "Monogenic Diabetes From Genetic Insights To",
      "url": "https://diabetesjournals.org/care/article/43/12/3117/31098/Monogenic-Diabetes-From-Genetic-Insights-to",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "608",
      "url": "https://www.mdpi.com/2079-7737/11/4/608",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Pmc8740746",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8740746/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Removal Of Visceral Fat Prevents Insulin",
      "url": "https://diabetesjournals.org/diabetes/article/51/10/2951/25266/Removal-of-Visceral-Fat-Prevents-Insulin",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc8516544",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8516544/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "15113714",
      "url": "https://pubmed.ncbi.nlm.nih.gov/15113714/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S2161831325000493",
      "url": "https://www.sciencedirect.com/science/article/pii/S2161831325000493",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc6945290",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6945290/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41598 020 74678 6",
      "url": "https://www.nature.com/articles/s41598-020-74678-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/diabetes/diabetes-testing/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "2172154 Overview",
      "url": "https://emedicine.medscape.com/article/2172154-overview",
      "domain": "emedicine.medscape.com",
      "type": "citation"
    },
    {
      "text": "Diagnosis",
      "url": "https://diabetes.org/about-diabetes/diagnosis",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "Pmc3075530",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3075530/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk278985",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK278985/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9902703",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9902703/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "P103.html",
      "url": "https://www.aafp.org/pubs/afp/issues/2016/0115/p103.html",
      "domain": "aafp.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/endocrinology/articles/10.3389/fendo.2020.00248/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Nbk604182",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK604182/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4225540",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4225540/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nct00097292",
      "url": "https://clinicaltrials.gov/study/NCT00097292",
      "domain": "clinicaltrials.gov",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://www.fda.gov/media/164864/download",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Drug Delaying Type 1 Diabetes",
      "url": "https://www.niaid.nih.gov/research/drug-delaying-type-1-diabetes",
      "domain": "niaid.nih.gov",
      "type": "citation"
    },
    {
      "text": "Type 1 Diabetes Mellitus Prevention And Disease Modifying Therapy",
      "url": "https://www.uptodate.com/contents/type-1-diabetes-mellitus-prevention-and-disease-modifying-therapy",
      "domain": "uptodate.com",
      "type": "citation"
    },
    {
      "text": "Pmc1282458",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1282458/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nejmoa012512",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa012512",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "The Finnish Diabetes Prevention Study Dps",
      "url": "https://diabetesjournals.org/care/article/26/12/3230/21849/The-Finnish-Diabetes-Prevention-Study-DPS",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc6893436",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6893436/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1762038",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1762038/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4623946",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4623946/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "14633807",
      "url": "https://pubmed.ncbi.nlm.nih.gov/14633807/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Physical Activity For Type 2 Diabetes Prevention",
      "url": "https://diabetesjournals.org/care/article/46/6/1132/148916/Physical-Activity-for-Type-2-Diabetes-Prevention",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Physical Activity In The Prevention Of Type 2",
      "url": "https://diabetesjournals.org/diabetes/article/54/1/158/14625/Physical-Activity-in-the-Prevention-of-Type-2",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Nbk549946",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK549946/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6125024",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6125024/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Mediterranean Diet Type 2 Diabetes Wellness",
      "url": "https://www.cnn.com/2025/08/25/health/mediterranean-diet-type-2-diabetes-wellness",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Pmc5426415",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5426415/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370%2822%2900380-7/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "S1751991821000425",
      "url": "https://www.sciencedirect.com/science/article/pii/S1751991821000425",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Evidence",
      "url": "https://coveragetoolkit.org/about-national-dpp/evidence/",
      "domain": "coveragetoolkit.org",
      "type": "citation"
    },
    {
      "text": "The Diabetes Prevention Program And Its Outcomes",
      "url": "https://diabetesjournals.org/care/article/48/7/1101/158195/The-Diabetes-Prevention-Program-and-Its-Outcomes",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/diabetes-prevention/programs/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5606310",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5606310/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "151678",
      "url": "https://stacks.cdc.gov/view/cdc/151678",
      "domain": "stacks.cdc.gov",
      "type": "citation"
    },
    {
      "text": "Diabetes Management Interventions Engaging Community Health Workers.html",
      "url": "https://www.thecommunityguide.org/findings/diabetes-management-interventions-engaging-community-health-workers.html",
      "domain": "thecommunityguide.org",
      "type": "citation"
    },
    {
      "text": "Diabetes Prevention Interventions Engaging Community Health Workers",
      "url": "https://odphp.health.gov/healthypeople/tools-action/browse-evidence-based-resources/diabetes-prevention-interventions-engaging-community-health-workers",
      "domain": "odphp.health.gov",
      "type": "citation"
    },
    {
      "text": "2783414",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/2783414",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Pmc2890385",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2890385/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "23 0173.htm",
      "url": "https://www.cdc.gov/pcd/issues/2023/23_0173.htm",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Taxes On Sugar Sweetened Drinks Drive Decline In Consumption",
      "url": "https://publichealth.berkeley.edu/articles/spotlight/research/taxes-on-sugar-sweetened-drinks-drive-decline-in-consumption",
      "domain": "publichealth.berkeley.edu",
      "type": "citation"
    },
    {
      "text": "Making Case Sugar Taxes Uk Ireland And Mexico",
      "url": "https://www.ox.ac.uk/research/research-impact/making-case-sugar-taxes-uk-ireland-and-mexico",
      "domain": "ox.ac.uk",
      "type": "citation"
    },
    {
      "text": "38753006",
      "url": "https://pubmed.ncbi.nlm.nih.gov/38753006/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Sugar Tax Shows Sweet Results In Cutting Obesity And Diabetes Rates.aspx",
      "url": "https://www.news-medical.net/news/20240229/Sugar-tax-shows-sweet-results-in-cutting-obesity-and-diabetes-rates.aspx",
      "domain": "news-medical.net",
      "type": "citation"
    },
    {
      "text": "The Who Global Diabetes Compact",
      "url": "https://www.who.int/initiatives/the-who-global-diabetes-compact",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Pmc6682852",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6682852/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2809969",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2809969",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Pmc10928673",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10928673/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Diabetes Interventions.html",
      "url": "https://www.cdc.gov/nccdphp/priorities/diabetes-interventions.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587%2823%2900385-6/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Pmc7692017",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7692017/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9609579",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9609579/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0002916523137026",
      "url": "https://www.sciencedirect.com/science/article/pii/S0002916523137026",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc11147446",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11147446/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Bmj.m4743",
      "url": "https://www.bmj.com/content/372/bmj.m4743",
      "domain": "bmj.com",
      "type": "citation"
    },
    {
      "text": "Some Reduced Carb Diets May Decrease Diabetes Risk But Others May Raise It",
      "url": "https://www.heart.org/en/news/2022/11/17/some-reduced-carb-diets-may-decrease-diabetes-risk-but-others-may-raise-it",
      "domain": "heart.org",
      "type": "citation"
    },
    {
      "text": "Pmc6908414",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6908414/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nonpharmacologic Therapy And Exercise In The",
      "url": "https://diabetesjournals.org/care/article/32/suppl_2/S189/27325/Nonpharmacologic-Therapy-and-Exercise-in-the",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Art 20045697",
      "url": "https://www.mayoclinic.org/diseases-conditions/diabetes/in-depth/diabetes-and-exercise/art-20045697",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Nutrition Interventions For Remission Of Type 2",
      "url": "https://diabetesjournals.org/clinical/article/43/2/291/157413/Nutrition-Interventions-for-Remission-of-Type-2",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Standards Of Care In Diabetes 2023 Abridged For",
      "url": "https://diabetesjournals.org/clinical/article/41/1/4/148029/Standards-of-Care-in-Diabetes-2023-Abridged-for",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc4873312",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4873312/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "36480153",
      "url": "https://pubmed.ncbi.nlm.nih.gov/36480153/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "9 Pharmacologic Approaches To Glycemic Treatment",
      "url": "https://diabetesjournals.org/care/article/48/Supplement_1/S181/157569/9-Pharmacologic-Approaches-to-Glycemic-Treatment",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc6851752",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6851752/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Dom.15663",
      "url": "https://dom-pubs.onlinelibrary.wiley.com/doi/10.1111/dom.15663",
      "domain": "dom-pubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "2771459",
      "url": "https://jamanetwork.com/journals/jamacardiology/fullarticle/2771459",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Nbk482386",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK482386/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk279141",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK279141/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk576405",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK576405/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1000",
      "url": "https://www.aafp.org/pubs/afp/issues/2001/0501/p1747.html/1000",
      "domain": "aafp.org",
      "type": "citation"
    },
    {
      "text": "Nejmoa2505669",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2505669",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "Pmc3714061",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3714061/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Banting And Best Discover Insulin",
      "url": "https://www.umassmed.edu/dcoe/diabetes-education/patient-resources/banting-and-best-discover-insulin/",
      "domain": "umassmed.edu",
      "type": "citation"
    },
    {
      "text": "Nbk278938",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK278938/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Insulin Basics",
      "url": "https://diabetes.org/health-wellness/medication/insulin-basics",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "Diabetes Types Insulin",
      "url": "https://www.webmd.com/diabetes/diabetes-types-insulin",
      "domain": "webmd.com",
      "type": "citation"
    },
    {
      "text": "4 Ways To Take Insulin.html",
      "url": "https://www.cdc.gov/diabetes/about/4-ways-to-take-insulin.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Nbk560688",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK560688/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Common Side Effects",
      "url": "https://www.goodrx.com/classes/insulins/common-side-effects",
      "domain": "goodrx.com",
      "type": "citation"
    },
    {
      "text": "Nbk551568",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK551568/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "13901 Glp 1 Agonists",
      "url": "https://my.clevelandclinic.org/health/treatments/13901-glp-1-agonists",
      "domain": "my.clevelandclinic.org",
      "type": "citation"
    },
    {
      "text": "Pmc3475287",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3475287/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Type 2 Diabetes And Metabolic Surgery Fact Sheet",
      "url": "https://asmbs.org/resources/type-2-diabetes-and-metabolic-surgery-fact-sheet/",
      "domain": "asmbs.org",
      "type": "citation"
    },
    {
      "text": "Nejmoa1200111",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa1200111",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "2815401",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/2815401",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Surgery For Diabetes",
      "url": "https://asmbs.org/patients/surgery-for-diabetes/",
      "domain": "asmbs.org",
      "type": "citation"
    },
    {
      "text": "Metabolic Surgery Surgical Treatment For Type 2 Diabetes",
      "url": "https://weillcornell.org/metabolic-surgery-surgical-treatment-for-type-2-diabetes",
      "domain": "weillcornell.org",
      "type": "citation"
    },
    {
      "text": "Pmc8311476",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8311476/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gastric Bypass Improves Long Term Diabetes Remission Even After Weight Recurrence",
      "url": "https://www.facs.org/media-center/press-releases/2024/gastric-bypass-improves-long-term-diabetes-remission-even-after-weight-recurrence/",
      "domain": "facs.org",
      "type": "citation"
    },
    {
      "text": "S12902 020 0506 9",
      "url": "https://bmcendocrdisord.biomedcentral.com/articles/10.1186/s12902-020-0506-9",
      "domain": "bmcendocrdisord.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc9311210",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9311210/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0955470x25000102",
      "url": "https://www.sciencedirect.com/science/article/pii/S0955470X25000102",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc9767903",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9767903/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587%2824%2900341-3/abstract",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "First Islet Cell Transplant Patient Thriving Nearly 20 Years Later",
      "url": "https://www.cityofhope.org/first-islet-cell-transplant-patient-thriving-nearly-20-years-later",
      "domain": "cityofhope.org",
      "type": "citation"
    },
    {
      "text": "Metabolic Bariatric And Nonbariatric Surgery For",
      "url": "https://diabetesjournals.org/care/article/42/2/331/30515/Metabolic-Bariatric-and-Nonbariatric-Surgery-for",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pancreas Transplantation For Patients With Type 1",
      "url": "https://diabetesjournals.org/care/article/26/suppl_1/s120/21735/Pancreas-Transplantation-for-Patients-With-Type-1",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "7 Diabetes Technology Standards Of Care In",
      "url": "https://diabetesjournals.org/care/article/48/Supplement_1/S146/157557/7-Diabetes-Technology-Standards-of-Care-in",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Dexcom G7 Vs Freestyle Libre 3 And Libre 3 Plus Choosing The Right Cgm",
      "url": "https://www.dexcom.com/en-us/all-access/dexcom-cgm-explained/dexcom-g7-vs-freestyle-libre-3-and-libre-3-plus-choosing-the-right-cgm",
      "domain": "dexcom.com",
      "type": "citation"
    },
    {
      "text": "Choosing Cgm",
      "url": "https://diabetes.org/about-diabetes/devices-technology/choosing-cgm",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "A Comparative Analysis Of Glycemic Metrics Derived",
      "url": "https://diabetesjournals.org/care/article/48/7/1213/158092/A-Comparative-Analysis-of-Glycemic-Metrics-Derived",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "5 Best Continuous Glucose Monitors For 2025",
      "url": "https://www.type1strong.org/blog-post/5-best-continuous-glucose-monitors-for-2025",
      "domain": "type1strong.org",
      "type": "citation"
    },
    {
      "text": "Pmc7576432",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7576432/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Aid Insulin Pumps",
      "url": "https://www.breakthrought1d.org/daily-management/t1d-technology/aid-insulin-pumps/",
      "domain": "breakthrought1d.org",
      "type": "citation"
    },
    {
      "text": "Top Diabetes Tech Ada 2025",
      "url": "https://beyondtype1.org/top-diabetes-tech-ada-2025/",
      "domain": "beyondtype1.org",
      "type": "citation"
    },
    {
      "text": "Fda Approves Automated Insulin Delivery System For Adults With Type 2 Diabetes",
      "url": "https://www.healio.com/news/endocrinology/20250902/fda-approves-automated-insulin-delivery-system-for-adults-with-type-2-diabetes",
      "domain": "healio.com",
      "type": "citation"
    },
    {
      "text": "camdiab.com",
      "url": "https://camdiab.com/",
      "domain": "camdiab.com",
      "type": "citation"
    },
    {
      "text": "Pmc12213539",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12213539/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "12 Best Diabetes Apps Of 2025 Tools For Better Management And Monitoring",
      "url": "https://www.type1strong.org/blog-post/12-best-diabetes-apps-of-2025-tools-for-better-management-and-monitoring",
      "domain": "type1strong.org",
      "type": "citation"
    },
    {
      "text": "Whats Next For Diabetes Technology In 2025",
      "url": "https://openloophealth.com/blog/whats-next-for-diabetes-technology-in-2025",
      "domain": "openloophealth.com",
      "type": "citation"
    },
    {
      "text": "Nejmoa2506549",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2506549",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "Vertex Announces Program Updates Type 1 Diabetes Portfolio",
      "url": "https://investors.vrtx.com/news-releases/news-release-details/vertex-announces-program-updates-type-1-diabetes-portfolio",
      "domain": "investors.vrtx.com",
      "type": "citation"
    },
    {
      "text": "Diabetes Cure Insulin Stem Cell.html",
      "url": "https://www.nytimes.com/2025/06/20/health/diabetes-cure-insulin-stem-cell.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Crispr Edited Beta Cells Avoid Immune Rejection Without Immunosuppressants In Human Transplantation",
      "url": "https://crisprmedicinenews.com/news/crispr-edited-beta-cells-avoid-immune-rejection-without-immunosuppressants-in-human-transplantation/",
      "domain": "crisprmedicinenews.com",
      "type": "citation"
    },
    {
      "text": "Immune Dodging Cells Could Give Diabetes Treatment Shot Arm",
      "url": "https://www.science.org/content/article/immune-dodging-cells-could-give-diabetes-treatment-shot-arm",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "D41586 025 02802 5",
      "url": "https://www.nature.com/articles/d41586-025-02802-5",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Ada 2025 Advances In Type 2 Diabetes Management With Tirzepatide",
      "url": "https://www.pharmacytimes.com/view/ada-2025-advances-in-type-2-diabetes-management-with-tirzepatide",
      "domain": "pharmacytimes.com",
      "type": "citation"
    },
    {
      "text": "Bmj.r1777",
      "url": "https://www.bmj.com/content/390/bmj.r1777",
      "domain": "bmj.com",
      "type": "citation"
    },
    {
      "text": "A Diabetes Heart Failure And Kidney Disease Medication Is The First Of Its Kind To Significantly Reduce Both Heart Attacks And Strokes",
      "url": "https://www.mountsinai.org/about/newsroom/2025/a-diabetes-heart-failure-and-kidney-disease-medication-is-the-first-of-its-kind-to-significantly-reduce-both-heart-attacks-and-strokes",
      "domain": "mountsinai.org",
      "type": "citation"
    },
    {
      "text": "Artificial Pancreas Transforming Lives Of Thousands Of Children And Young People With Type 1 Diabetes",
      "url": "https://www.nice.org.uk/news/articles/-artificial-pancreas-transforming-lives-of-thousands-of-children-and-young-people-with-type-1-diabetes",
      "domain": "nice.org.uk",
      "type": "citation"
    },
    {
      "text": "Nhs Rolls Out New Generation Artificial Pancreas To Help Pregnant Diabetic Women",
      "url": "https://www.england.nhs.uk/2025/09/nhs-rolls-out-new-generation-artificial-pancreas-to-help-pregnant-diabetic-women/",
      "domain": "england.nhs.uk",
      "type": "citation"
    },
    {
      "text": "S41598 025 18085 9",
      "url": "https://www.nature.com/articles/s41598-025-18085-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Ai Full Automation Could Expand Artificial Pancreas More Patients",
      "url": "https://newsroom.uvahealth.com/2025/08/18/ai-full-automation-could-expand-artificial-pancreas-more-patients/",
      "domain": "newsroom.uvahealth.com",
      "type": "citation"
    },
    {
      "text": "Diabetes Reversed In Mice With Genetically Edited Patient Derived Stem Cells",
      "url": "https://medicine.washu.edu/news/diabetes-reversed-in-mice-with-genetically-edited-patient-derived-stem-cells/",
      "domain": "medicine.washu.edu",
      "type": "citation"
    },
    {
      "text": "Top Type 1 Diabetes Research Breakthroughs To Watch In 2025",
      "url": "https://www.type1strong.org/blog-post/top-type-1-diabetes-research-breakthroughs-to-watch-in-2025",
      "domain": "type1strong.org",
      "type": "citation"
    },
    {
      "text": "Research Updates From Easd 2025",
      "url": "https://www.breakthrought1d.org/news-and-updates/research-updates-from-easd-2025/",
      "domain": "breakthrought1d.org",
      "type": "citation"
    },
    {
      "text": "6 Glycemic Goals And Hypoglycemia Standards Of",
      "url": "https://diabetesjournals.org/care/article/48/Supplement_1/S128/157561/6-Glycemic-Goals-and-Hypoglycemia-Standards-of",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Recommended Glycemic Targets And Value Of Routine Monitoring",
      "url": "https://www.uspharmacist.com/article/recommended-glycemic-targets-and-value-of-routine-monitoring-",
      "domain": "uspharmacist.com",
      "type": "citation"
    },
    {
      "text": "S1499267113000178",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S1499267113000178",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Dom.15511",
      "url": "https://dom-pubs.onlinelibrary.wiley.com/doi/10.1111/dom.15511",
      "domain": "dom-pubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Complications Of Acute And Chronic Hyperglycemia",
      "url": "https://touchendocrinology.com/diabetes/journal-articles/complications-of-acute-and-chronic-hyperglycemia/",
      "domain": "touchendocrinology.com",
      "type": "citation"
    },
    {
      "text": "Pmc2694067",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2694067/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Hypoglycemia And Cardiovascular Risks",
      "url": "https://diabetesjournals.org/care/article/34/Supplement_2/S132/28705/Hypoglycemia-and-Cardiovascular-Risks",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Initial Management Of Hyperglycemia In Adults With Type 2 Diabetes Mellitus",
      "url": "https://www.uptodate.com/contents/initial-management-of-hyperglycemia-in-adults-with-type-2-diabetes-mellitus",
      "domain": "uptodate.com",
      "type": "citation"
    },
    {
      "text": "Low Carbohydrate And Very Low Carbohydrate Diets",
      "url": "https://diabetesjournals.org/spectrum/article/33/2/133/32999/Low-Carbohydrate-and-Very-Low-Carbohydrate-Diets",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc1188071",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1188071/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "32638087",
      "url": "https://pubmed.ncbi.nlm.nih.gov/32638087/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0899900714003323",
      "url": "https://www.sciencedirect.com/science/article/pii/S0899900714003323",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2797714",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2797714",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.diabetesresearchclinicalpractice.com/article/S0168-8227%2824%2900808-8/fulltext",
      "domain": "diabetesresearchclinicalpractice.com",
      "type": "citation"
    },
    {
      "text": "S0002916522039181",
      "url": "https://www.sciencedirect.com/science/article/pii/S0002916522039181",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "New Theory How Insulin Resistance Metabolic Disease Begin",
      "url": "https://corporate.dukehealth.org/news/new-theory-how-insulin-resistance-metabolic-disease-begin",
      "domain": "corporate.dukehealth.org",
      "type": "citation"
    },
    {
      "text": "Ada American Diabetes Association Big Pharma",
      "url": "https://www.theguardian.com/commentisfree/2024/apr/17/ada-american-diabetes-association-big-pharma",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "70024 Main 35.pdf",
      "url": "https://cdn.mdedge.com/files/s3fs-public/issues/articles/70024_main_35.pdf",
      "domain": "cdn.mdedge.com",
      "type": "citation"
    },
    {
      "text": "Pmc6366262",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6366262/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Research",
      "url": "https://www.virtahealth.com/research",
      "domain": "virtahealth.com",
      "type": "citation"
    },
    {
      "text": "E000354",
      "url": "https://drc.bmj.com/content/5/1/e000354",
      "domain": "drc.bmj.com",
      "type": "citation"
    },
    {
      "text": "142246",
      "url": "https://www.jci.org/articles/view/142246",
      "domain": "jci.org",
      "type": "citation"
    },
    {
      "text": "Bf02221682",
      "url": "https://link.springer.com/article/10.1007/BF02221682",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587%2824%2900339-5/abstract",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Obesity Contributes To Up To Half Of New Diabetes Cases Annually In The United States",
      "url": "https://newsroom.heart.org/news/obesity-contributes-to-up-to-half-of-new-diabetes-cases-annually-in-the-united-states",
      "domain": "newsroom.heart.org",
      "type": "citation"
    },
    {
      "text": "Nbk592412",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK592412/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "26377054",
      "url": "https://pubmed.ncbi.nlm.nih.gov/26377054/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8852694",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8852694/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Genetics Or Lifestyle How Do We Prevent Diabetes",
      "url": "https://touchendocrinology.com/diabetes/journal-articles/genetics-or-lifestyle-how-do-we-prevent-diabetes/",
      "domain": "touchendocrinology.com",
      "type": "citation"
    },
    {
      "text": "Pmc3820646",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3820646/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Obesity Is A Critical Risk Factor For Type 2 Diabetes Regardless Of Genetics",
      "url": "https://diabetologia-journal.org/2020/04/16/obesity-is-a-critical-risk-factor-for-type-2-diabetes-regardless-of-genetics/",
      "domain": "diabetologia-journal.org",
      "type": "citation"
    },
    {
      "text": "Genetics Diabetes",
      "url": "https://diabetes.org/about-diabetes/genetics-diabetes",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/endocrinology/articles/10.3389/fendo.2022.888557/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "S0140673617331021",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0140673617331021",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Usa Diabetes Overtreatment",
      "url": "https://www.reuters.com/investigates/special-report/usa-diabetes-overtreatment/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "The High Cost Of Diabetes Drugs Disparate Impact",
      "url": "https://diabetesjournals.org/care/article/43/10/2330/35954/The-High-Cost-of-Diabetes-Drugs-Disparate-Impact",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc6533625",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6533625/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Bmj 2022 074068",
      "url": "https://www.bmj.com/content/381/bmj-2022-074068",
      "domain": "bmj.com",
      "type": "citation"
    },
    {
      "text": "Pmc4966497",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4966497/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1486829",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/1486829",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Idf Diabetes Atlas 11th Edition",
      "url": "https://idf.org/news/idf-diabetes-atlas-11th-edition/",
      "domain": "idf.org",
      "type": "citation"
    },
    {
      "text": "8242620",
      "url": "https://academic.oup.com/ndt/advance-article/doi/10.1093/ndt/gfaf177/8242620",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "S0168822725002918",
      "url": "https://www.sciencedirect.com/science/article/pii/S0168822725002918",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "13 11 2024 Urgent Action Needed As Global Diabetes Cases Increase Four Fold Over Past Decades",
      "url": "https://www.who.int/news/item/13-11-2024-urgent-action-needed-as-global-diabetes-cases-increase-four-fold-over-past-decades",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Nbk597412",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK597412/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Diabetes And Blackafrican Americans",
      "url": "https://minorityhealth.hhs.gov/diabetes-and-blackafrican-americans",
      "domain": "minorityhealth.hhs.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11070656",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11070656/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk581940",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK581940/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10477368",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10477368/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Social Determinants Of Health And Diabetes A",
      "url": "https://diabetesjournals.org/care/article/44/1/258/33180/Social-Determinants-of-Health-and-Diabetes-A",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "2808553",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2808553",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "S12889 024 18452 7",
      "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-024-18452-7",
      "domain": "bmcpublichealth.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Economic Costs Of Diabetes In The U S In 2022",
      "url": "https://diabetesjournals.org/care/article/47/1/26/153797/Economic-Costs-of-Diabetes-in-the-U-S-in-2022",
      "domain": "diabetesjournals.org",
      "type": "citation"
    },
    {
      "text": "New American Diabetes Association Report Finds Annual Costs Diabetes Be",
      "url": "https://diabetes.org/newsroom/press-releases/new-american-diabetes-association-report-finds-annual-costs-diabetes-be",
      "domain": "diabetes.org",
      "type": "citation"
    },
    {
      "text": "Pmc11034455",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11034455/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Totalindirectcost",
      "url": "https://nccd.cdc.gov/Toolkit/DiabetesBurden/TotalIndirectCost",
      "domain": "nccd.cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7783927",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7783927/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Inequalities Diabetes Related Risk Factors Comparing Adults Levels Income.html",
      "url": "https://www.canada.ca/en/public-health/services/publications/science-research-data/inequalities-diabetes-related-risk-factors-comparing-adults-levels-income.html",
      "domain": "canada.ca",
      "type": "citation"
    },
    {
      "text": "21582440251316478",
      "url": "https://journals.sagepub.com/doi/10.1177/21582440251316478",
      "domain": "journals.sagepub.com",
      "type": "citation"
    },
    {
      "text": "Jogh 15 04095",
      "url": "https://jogh.org/2025/jogh-15-04095/",
      "domain": "jogh.org",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/article/S0140-6736%2823%2901301-6/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Pmc3749019",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3749019/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4707300",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4707300/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "History Of Diabetes.aspx",
      "url": "https://www.news-medical.net/health/History-of-Diabetes.aspx",
      "domain": "news-medical.net",
      "type": "citation"
    },
    {
      "text": "317484",
      "url": "https://www.medicalnewstoday.com/articles/317484",
      "domain": "medicalnewstoday.com",
      "type": "citation"
    },
    {
      "text": "History Of Diabetes Series 1 Diabetes Care In.3.aspx",
      "url": "https://journals.lww.com/ijdt/fulltext/2024/03030/history_of_diabetes__series_1_diabetes_care_in.3.aspx",
      "domain": "journals.lww.com",
      "type": "citation"
    },
    {
      "text": "Nejmra1110560",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMra1110560",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "History Of Diabetes",
      "url": "https://www.houstondiabetesinstitute.org/history-of-diabetes/",
      "domain": "houstondiabetesinstitute.org",
      "type": "citation"
    },
    {
      "text": "The Fascinating History Of Diabetes Mellitus",
      "url": "https://diabetesresearchconnection.org/the-fascinating-history-of-diabetes-mellitus/",
      "domain": "diabetesresearchconnection.org",
      "type": "citation"
    },
    {
      "text": "100 Years Insulin",
      "url": "https://www.fda.gov/about-fda/fda-history-exhibits/100-years-insulin",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9942084",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9942084/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Next Stop Cure Quick History Diabetes Research",
      "url": "https://diabetesresearchconnection.org/next-stop-cure-quick-history-diabetes-research/",
      "domain": "diabetesresearchconnection.org",
      "type": "citation"
    },
    {
      "text": "Milestones.html",
      "url": "https://www.cdc.gov/diabetes-prevention/programs/milestones.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Milestones Timeline",
      "url": "https://joslin.org/about/history/milestones-timeline",
      "domain": "joslin.org",
      "type": "citation"
    },
    {
      "text": "Pmc10591058",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10591058/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nejmsa2032271",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMsa2032271",
      "domain": "nejm.org",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "hyperglycemia",
      "page": "Hyperglycemia"
    },
    {
      "text": "insulin secretion",
      "page": "Secretion"
    },
    {
      "text": "insulin action",
      "page": "Insulin_resistance"
    },
    {
      "text": "type 1 diabetes",
      "page": "Type_1_diabetes"
    },
    {
      "text": "type 2 diabetes",
      "page": "Type_2_diabetes"
    },
    {
      "text": "overnutrition",
      "page": "Overnutrition"
    },
    {
      "text": "gestational diabetes",
      "page": "Gestational_diabetes"
    },
    {
      "text": "obesity",
      "page": "Obesity"
    },
    {
      "text": "retinopathy",
      "page": "Retinopathy"
    },
    {
      "text": "atherosclerosis",
      "page": "Atherosclerosis"
    },
    {
      "text": "global health",
      "page": "Global_health"
    },
    {
      "text": "public health",
      "page": "Public_health"
    },
    {
      "text": "chronic",
      "page": "Chronic"
    },
    {
      "text": "homeostasis",
      "page": "Homeostasis"
    },
    {
      "text": "oxidative stress",
      "page": "Oxidative_stress"
    },
    {
      "text": "advanced glycation end-products",
      "page": "Advanced_glycation_end-product"
    },
    {
      "text": "inflammation",
      "page": "Inflammation"
    },
    {
      "text": "Diagnosis",
      "page": "Diagnosis"
    },
    {
      "text": "glucose tolerance test",
      "page": "Glucose_tolerance_test"
    },
    {
      "text": "glycated hemoglobin",
      "page": "Glycated_hemoglobin"
    },
    {
      "text": "polyuria",
      "page": "Polyuria"
    },
    {
      "text": "polydipsia",
      "page": "Polydipsia"
    },
    {
      "text": "weight loss",
      "page": "Weight_loss"
    },
    {
      "text": "glucose uptake",
      "page": "Glucose_uptake"
    },
    {
      "text": "GLUT4",
      "page": "GLUT4"
    },
    {
      "text": "cell membrane",
      "page": "Cell_membrane"
    },
    {
      "text": "skeletal muscle",
      "page": "Skeletal_muscle"
    },
    {
      "text": "adipose tissue",
      "page": "Adipose_tissue"
    },
    {
      "text": "gluconeogenesis",
      "page": "Gluconeogenesis"
    },
    {
      "text": "glycogenolysis",
      "page": "Glycogenolysis"
    },
    {
      "text": "Glucagon",
      "page": "Glucagon"
    },
    {
      "text": "apoptosis",
      "page": "Apoptosis"
    },
    {
      "text": "lipotoxicity",
      "page": "Lipotoxicity"
    },
    {
      "text": "plasma",
      "page": "Plasma"
    },
    {
      "text": "decompensation",
      "page": "Decompensation"
    },
    {
      "text": "genetic predisposition",
      "page": "Genetic_predisposition"
    },
    {
      "text": "diabetic ketoacidosis",
      "page": "Diabetic_ketoacidosis"
    },
    {
      "text": "nausea",
      "page": "Nausea"
    },
    {
      "text": "vomiting",
      "page": "Vomiting"
    },
    {
      "text": "abdominal pain",
      "page": "Abdominal_pain"
    },
    {
      "text": "peripheral neuropathy",
      "page": "Peripheral_neuropathy"
    },
    {
      "text": "acanthosis nigricans",
      "page": "Acanthosis_nigricans"
    },
    {
      "text": "ketonuria",
      "page": "Ketonuria"
    },
    {
      "text": "erectile dysfunction",
      "page": "Erectile_dysfunction"
    },
    {
      "text": "hypoglycemia",
      "page": "Hypoglycemia"
    },
    {
      "text": "hyperosmolar hyperglycemic state",
      "page": "Hyperosmolar_hyperglycemic_state"
    },
    {
      "text": "coma",
      "page": "Coma"
    },
    {
      "text": "Diabetic retinopathy",
      "page": "Diabetic_retinopathy"
    },
    {
      "text": "Diabetic nephropathy",
      "page": "Diabetic_nephropathy"
    },
    {
      "text": "sensory loss",
      "page": "Sensory_loss"
    },
    {
      "text": "cardiovascular disease",
      "page": "Cardiovascular_disease"
    },
    {
      "text": "coronary artery disease",
      "page": "Coronary_artery_disease"
    },
    {
      "text": "stroke",
      "page": "Stroke"
    },
    {
      "text": "peripheral artery disease",
      "page": "Peripheral_artery_disease"
    },
    {
      "text": "hypertension",
      "page": "Hypertension"
    },
    {
      "text": "dyslipidemia",
      "page": "Dyslipidemia"
    },
    {
      "text": "autoimmune disease",
      "page": "Autoimmune_disease"
    },
    {
      "text": "beta cell",
      "page": "Beta_cell"
    },
    {
      "text": "pancreatic islets",
      "page": "Pancreatic_islets"
    },
    {
      "text": "immune tolerance",
      "page": "Immune_tolerance"
    },
    {
      "text": "etiology",
      "page": "Etiology"
    },
    {
      "text": "human leukocyte antigen",
      "page": "Human_leukocyte_antigen"
    },
    {
      "text": "HLA-DR4",
      "page": "HLA-DR4"
    },
    {
      "text": "coxsackievirus",
      "page": "Coxsackievirus"
    },
    {
      "text": "Northern Europe",
      "page": "Northern_Europe"
    },
    {
      "text": "Finland",
      "page": "Finland"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "Africa",
      "page": "Africa"
    },
    {
      "text": "risk",
      "page": "Risk"
    },
    {
      "text": "population",
      "page": "Population"
    },
    {
      "text": "autoimmunity",
      "page": "Autoimmunity"
    },
    {
      "text": "overweight",
      "page": "Overweight"
    },
    {
      "text": "body mass index",
      "page": "Body_mass_index"
    },
    {
      "text": "m²",
      "page": "M_squared"
    },
    {
      "text": "prediabetes",
      "page": "Prediabetes"
    },
    {
      "text": "African Americans",
      "page": "African_Americans"
    },
    {
      "text": "Native Americans",
      "page": "Native_Americans"
    },
    {
      "text": "Asian Americans",
      "page": "Asian_Americans"
    },
    {
      "text": "pregnancy",
      "page": "Pregnancy"
    },
    {
      "text": "human placental lactogen",
      "page": "Human_placental_lactogen"
    },
    {
      "text": "cortisol",
      "page": "Cortisol"
    },
    {
      "text": "prevalence",
      "page": "Prevalence"
    },
    {
      "text": "ethnicity",
      "page": "Ethnicity"
    },
    {
      "text": "advanced maternal age",
      "page": "Advanced_maternal_age"
    },
    {
      "text": "polycystic ovary syndrome",
      "page": "Polycystic_ovary_syndrome"
    },
    {
      "text": "diet",
      "page": "Diet"
    },
    {
      "text": "Hispanic",
      "page": "Hispanic"
    },
    {
      "text": "African",
      "page": "African"
    },
    {
      "text": "carbohydrate",
      "page": "Carbohydrate"
    },
    {
      "text": "physical activity",
      "page": "Physical_activity"
    },
    {
      "text": "self-monitoring",
      "page": "Self-monitoring"
    },
    {
      "text": "preeclampsia",
      "page": "Pre-eclampsia"
    },
    {
      "text": "shoulder dystocia",
      "page": "Shoulder_dystocia"
    },
    {
      "text": "hyperinsulinemia",
      "page": "Hyperinsulinemia"
    },
    {
      "text": "chronic pancreatitis",
      "page": "Chronic_pancreatitis"
    },
    {
      "text": "pancreatectomy",
      "page": "Pancreatectomy"
    },
    {
      "text": "cystic fibrosis",
      "page": "Cystic_fibrosis"
    },
    {
      "text": "adolescence",
      "page": "Adolescence"
    },
    {
      "text": "Cushing's syndrome",
      "page": "Cushing's_syndrome"
    },
    {
      "text": "acromegaly",
      "page": "Acromegaly"
    },
    {
      "text": "lipolysis",
      "page": "Lipolysis"
    },
    {
      "text": "pheochromocytoma",
      "page": "Pheochromocytoma"
    },
    {
      "text": "glucagonoma",
      "page": "Glucagonoma"
    },
    {
      "text": "prednisone",
      "page": "Prednisone"
    },
    {
      "text": "thiazide",
      "page": "Thiazide"
    },
    {
      "text": "calcineurin",
      "page": "Calcineurin"
    },
    {
      "text": "rubella",
      "page": "Rubella"
    },
    {
      "text": "amyloidosis",
      "page": "Amyloidosis"
    },
    {
      "text": "lymphoma",
      "page": "Lymphoma"
    },
    {
      "text": "pancreas",
      "page": "Pancreas"
    },
    {
      "text": "Maturity-onset diabetes of the young",
      "page": "Maturity-onset_diabetes_of_the_young"
    },
    {
      "text": "HNF1A",
      "page": "HNF1A"
    },
    {
      "text": "sulfonylureas",
      "page": "Sulfonylurea"
    },
    {
      "text": "pharmacotherapy",
      "page": "Pharmacotherapy"
    },
    {
      "text": "mutation",
      "page": "Mutation"
    },
    {
      "text": "deafness",
      "page": "Deafness"
    },
    {
      "text": "lactic acidosis",
      "page": "Lactic_acidosis"
    },
    {
      "text": "Wolfram syndrome",
      "page": "Wolfram_syndrome"
    },
    {
      "text": "Genetic testing",
      "page": "Genetic_testing"
    },
    {
      "text": "targeted therapy",
      "page": "Targeted_therapy"
    },
    {
      "text": "glutamic acid",
      "page": "Glutamic_acid"
    },
    {
      "text": "immune system",
      "page": "Immune_system"
    },
    {
      "text": "chromosome",
      "page": "Chromosome"
    },
    {
      "text": "European",
      "page": "European"
    },
    {
      "text": "INS",
      "page": "INS"
    },
    {
      "text": "IL2RA",
      "page": "IL2RA"
    },
    {
      "text": "penetrance",
      "page": "Penetrance"
    },
    {
      "text": "stress",
      "page": "Stress"
    },
    {
      "text": "loop",
      "page": "Loop"
    },
    {
      "text": "ceramide",
      "page": "Ceramide"
    },
    {
      "text": "phosphorylation",
      "page": "Phosphorylation"
    },
    {
      "text": "reactive oxygen species",
      "page": "Reactive_oxygen_species"
    },
    {
      "text": "dedifferentiation",
      "page": "Dedifferentiation"
    },
    {
      "text": "macrophage",
      "page": "Macrophage"
    },
    {
      "text": "NF-κB",
      "page": "NF-κB"
    },
    {
      "text": "adiponectin",
      "page": "Adiponectin"
    },
    {
      "text": "leptin",
      "page": "Leptin"
    },
    {
      "text": "Gut microbiota",
      "page": "Gut_microbiota"
    },
    {
      "text": "dysbiosis",
      "page": "Dysbiosis"
    },
    {
      "text": "lipopolysaccharide",
      "page": "Lipopolysaccharide"
    },
    {
      "text": "heritability",
      "page": "Heritability"
    },
    {
      "text": "family",
      "page": "Family"
    },
    {
      "text": "inheritance",
      "page": "Inheritance"
    },
    {
      "text": "disease",
      "page": "Disease"
    },
    {
      "text": "association",
      "page": "Association"
    },
    {
      "text": "gene",
      "page": "Gene"
    },
    {
      "text": "protein tyrosine phosphatase",
      "page": "Protein_tyrosine_phosphatase"
    },
    {
      "text": "TCF7L2 gene",
      "page": "TCF7L2_gene"
    },
    {
      "text": "incretin",
      "page": "Incretin"
    },
    {
      "text": "zinc",
      "page": "Zinc"
    },
    {
      "text": "homeobox",
      "page": "Homeobox"
    },
    {
      "text": "pathogenesis",
      "page": "Pathogenesis"
    },
    {
      "text": "beta",
      "page": "Beta"
    },
    {
      "text": "weight gain",
      "page": "Weight_gain"
    },
    {
      "text": "early childhood",
      "page": "Early_childhood"
    },
    {
      "text": "Vitamin D deficiency",
      "page": "Vitamin_D_deficiency"
    },
    {
      "text": "behavior",
      "page": "Behavior"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "lipogenesis",
      "page": "Lipogenesis"
    },
    {
      "text": "microbiome",
      "page": "Microbiome"
    },
    {
      "text": "Western lifestyle",
      "page": "Western_lifestyle"
    },
    {
      "text": "intestinal permeability",
      "page": "Intestinal_permeability"
    },
    {
      "text": "systemic inflammation",
      "page": "Systemic_inflammation"
    },
    {
      "text": "American Diabetes Association",
      "page": "American_Diabetes_Association"
    },
    {
      "text": "hemoglobin",
      "page": "Hemoglobin"
    },
    {
      "text": "anemia",
      "page": "Anemia"
    },
    {
      "text": "hemoglobinopathies",
      "page": "Hemoglobinopathies"
    },
    {
      "text": "chronic kidney disease",
      "page": "Chronic_Kidney_Disease"
    },
    {
      "text": "OGTT",
      "page": "Oral_Glucose_Tolerance_Test"
    },
    {
      "text": "GAD65",
      "page": "GAD65"
    },
    {
      "text": "IA-2",
      "page": "IA-2"
    },
    {
      "text": "Diabetes Prevention Program (DPP)",
      "page": "Diabetes_Prevention_Program"
    },
    {
      "text": "Finnish Diabetes Prevention Study",
      "page": "Finnish_Diabetes_Prevention_Study"
    },
    {
      "text": "vegetables",
      "page": "Vegetable"
    },
    {
      "text": "Mediterranean diet",
      "page": "Mediterranean_diet"
    },
    {
      "text": "causal inference",
      "page": "Causal_inference"
    },
    {
      "text": "lifestyle",
      "page": "Lifestyle"
    },
    {
      "text": "policy",
      "page": "Policy"
    },
    {
      "text": "education",
      "page": "Education"
    },
    {
      "text": "evidence",
      "page": "Evidence"
    },
    {
      "text": "asymptomatic",
      "page": "Asymptomatic"
    },
    {
      "text": "blood pressure",
      "page": "Blood_pressure"
    },
    {
      "text": "SSBs",
      "page": "SSB"
    },
    {
      "text": "decade",
      "page": "Decade"
    },
    {
      "text": "UK",
      "page": "United_Kingdom"
    },
    {
      "text": "Mexico",
      "page": "Mexico"
    },
    {
      "text": "tobacco",
      "page": "Tobacco"
    },
    {
      "text": "urban planning",
      "page": "Urban_planning"
    },
    {
      "text": "active transport",
      "page": "Active_transport"
    },
    {
      "text": "health coaching",
      "page": "Health_coaching"
    },
    {
      "text": "diabetes management",
      "page": "Diabetes_management"
    },
    {
      "text": "calorie restriction",
      "page": "Calorie_restriction"
    },
    {
      "text": "Clinical Trial",
      "page": "Clinical_trial"
    },
    {
      "text": "aerobic exercise",
      "page": "Aerobic_exercise"
    },
    {
      "text": "pathophysiology",
      "page": "Pathophysiology"
    },
    {
      "text": "biguanide",
      "page": "Biguanide"
    },
    {
      "text": "myocardial infarction",
      "page": "Myocardial_infarction"
    },
    {
      "text": "meglitinides",
      "page": "Meglitinide"
    },
    {
      "text": "absorption",
      "page": "Absorption"
    },
    {
      "text": "major adverse cardiovascular events",
      "page": "Major_adverse_cardiovascular_events"
    },
    {
      "text": "heart failure",
      "page": "Heart_failure"
    },
    {
      "text": "vitamin B12 deficiency",
      "page": "Vitamin_B12_deficiency"
    },
    {
      "text": "glycosuria",
      "page": "Glycosuria"
    },
    {
      "text": "ketoacidosis",
      "page": "Ketoacidosis"
    },
    {
      "text": "chronic kidney disease",
      "page": "Chronic_kidney_disease"
    },
    {
      "text": "semaglutide",
      "page": "Semaglutide"
    },
    {
      "text": "polypharmacy",
      "page": "Polypharmacy"
    },
    {
      "text": "peptide hormone",
      "page": "Peptide_hormone"
    },
    {
      "text": "Frederick Banting",
      "page": "Frederick_Banting"
    },
    {
      "text": "University of Toronto",
      "page": "University_of_Toronto"
    },
    {
      "text": "prandial",
      "page": "Prandial"
    },
    {
      "text": "insulin lispro",
      "page": "Insulin_lispro"
    },
    {
      "text": "regular insulin",
      "page": "Regular_insulin"
    },
    {
      "text": "infusion",
      "page": "Infusion"
    },
    {
      "text": "lipohypertrophy",
      "page": "Lipohypertrophy"
    },
    {
      "text": "administration",
      "page": "Administration"
    },
    {
      "text": "Roux-en-Y gastric bypass (RYGB)",
      "page": "Roux-en-Y_gastric_bypass"
    },
    {
      "text": "sleeve gastrectomy (SG)",
      "page": "sleeve_gastrectomy"
    },
    {
      "text": "adjustable gastric banding (AGB)",
      "page": "adjustable_gastric_banding"
    },
    {
      "text": "kidney transplantation",
      "page": "Kidney_transplantation"
    },
    {
      "text": "immunosuppression",
      "page": "Immunosuppression"
    },
    {
      "text": "malignancy",
      "page": "Malignancy"
    },
    {
      "text": "blood",
      "page": "Blood+"
    },
    {
      "text": "real-time data",
      "page": "Real-time_data"
    },
    {
      "text": "Dexcom",
      "page": "Dexcom"
    },
    {
      "text": "Abbott",
      "page": "Abbott"
    },
    {
      "text": "Medtronic",
      "page": "Medtronic"
    },
    {
      "text": "treatment",
      "page": "Treatment"
    },
    {
      "text": "sensor",
      "page": "Sensor"
    },
    {
      "text": "physiology",
      "page": "Physiology"
    },
    {
      "text": "adhesive",
      "page": "Adhesive"
    },
    {
      "text": "app",
      "page": "App"
    },
    {
      "text": "intervention",
      "page": "Intervention"
    },
    {
      "text": "AI",
      "page": "Ai"
    },
    {
      "text": "personalization",
      "page": "Personalization"
    },
    {
      "text": "access",
      "page": "Access"
    },
    {
      "text": "cost",
      "page": "Cost"
    },
    {
      "text": "insurance",
      "page": "Insurance"
    },
    {
      "text": "Vertex Pharmaceuticals",
      "page": "Vertex_Pharmaceuticals"
    },
    {
      "text": "efficacy",
      "page": "Efficacy"
    },
    {
      "text": "CRISPR",
      "page": "CRISPR"
    },
    {
      "text": "islet",
      "page": "Islet"
    },
    {
      "text": "patient",
      "page": "Patient"
    },
    {
      "text": "PD-L1",
      "page": "PD-L1"
    },
    {
      "text": "machine learning",
      "page": "Machine_learning"
    },
    {
      "text": "hormone",
      "page": "Hormone"
    },
    {
      "text": "meal",
      "page": "Meal"
    },
    {
      "text": "fibrosis",
      "page": "Fibrosis"
    },
    {
      "text": "life expectancy",
      "page": "Life_expectancy"
    },
    {
      "text": "fasting",
      "page": "Fasting"
    },
    {
      "text": "Epidemiology of Diabetes",
      "page": "Epidemiology_of_diabetes"
    },
    {
      "text": "cognitive impairment",
      "page": "Cognitive_impairment"
    },
    {
      "text": "autonomic neuropathy",
      "page": "Autonomic_neuropathy"
    },
    {
      "text": "metabolic syndrome",
      "page": "Metabolic_syndrome"
    },
    {
      "text": "research",
      "page": "Research"
    },
    {
      "text": "DiRECT",
      "page": "Di-rect"
    },
    {
      "text": "overtreatment",
      "page": "Overtreatment"
    },
    {
      "text": "Reuters",
      "page": "Reuters"
    },
    {
      "text": "Sanofi",
      "page": "Sanofi"
    },
    {
      "text": "diarrhea",
      "page": "Diarrhea"
    },
    {
      "text": "pancreatitis",
      "page": "Pancreatitis"
    },
    {
      "text": "1990",
      "page": "1990"
    },
    {
      "text": "2022",
      "page": "2022"
    },
    {
      "text": "population growth",
      "page": "Population_growth"
    },
    {
      "text": "urbanization",
      "page": "Urbanization"
    },
    {
      "text": "South Asia",
      "page": "South_Asia"
    },
    {
      "text": "sub-Saharan Africa",
      "page": "Sub-Saharan_Africa"
    },
    {
      "text": "genetics",
      "page": "Genetics"
    },
    {
      "text": "endothelial dysfunction",
      "page": "Endothelial_dysfunction"
    },
    {
      "text": "Sedentary lifestyle",
      "page": "Sedentary_lifestyle"
    },
    {
      "text": "Smoking",
      "page": "Smoking"
    },
    {
      "text": "Indian",
      "page": "Indian"
    },
    {
      "text": "Alaska",
      "page": "Alaska"
    },
    {
      "text": "Black",
      "page": "Black"
    },
    {
      "text": "White",
      "page": "White"
    },
    {
      "text": "White Americans",
      "page": "White_Americans"
    },
    {
      "text": "income",
      "page": "Income"
    },
    {
      "text": "Socioeconomic status",
      "page": "Socioeconomic_status"
    },
    {
      "text": "healthy food",
      "page": "Healthy_food"
    },
    {
      "text": "US",
      "page": "United_States"
    },
    {
      "text": "primary care",
      "page": "Primary_care"
    },
    {
      "text": "care",
      "page": "Care"
    },
    {
      "text": "management",
      "page": "Management"
    },
    {
      "text": "mellitus",
      "page": "Mellitus"
    },
    {
      "text": "Ebers Papyrus",
      "page": "Ebers_Papyrus"
    },
    {
      "text": "Egyptian",
      "page": "Egyptian"
    },
    {
      "text": "urination",
      "page": "Urination"
    },
    {
      "text": "India",
      "page": "India"
    },
    {
      "text": "Sushruta Samhita",
      "page": "Sushruta_Samhita"
    },
    {
      "text": "Charaka",
      "page": "Charaka"
    },
    {
      "text": "Vagbhata",
      "page": "Vagbhata"
    },
    {
      "text": "Claude Bernard",
      "page": "Claude_Bernard"
    },
    {
      "text": "glycogen",
      "page": "Glycogen"
    },
    {
      "text": "fourth ventricle",
      "page": "Fourth_ventricle"
    },
    {
      "text": "Paul Langerhans",
      "page": "Paul_Langerhans"
    },
    {
      "text": "nervous system",
      "page": "Nervous_system"
    },
    {
      "text": "James Collip",
      "page": "James_Collip"
    },
    {
      "text": "ketosis",
      "page": "Ketosis"
    },
    {
      "text": "tolbutamide",
      "page": "Tolbutamide"
    },
    {
      "text": "relative risk reduction",
      "page": "Relative_risk_reduction"
    },
    {
      "text": "Exenatide",
      "page": "Exenatide"
    },
    {
      "text": "GLP-1 receptor agonist",
      "page": "GLP-1_receptor_agonist"
    },
    {
      "text": "satiety",
      "page": "Satiety"
    },
    {
      "text": "JDRF",
      "page": "JDRF"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "paradigm",
      "page": "Paradigm"
    }
  ],
  "fetched_at": "2025-12-07T07:23:37.721738",
  "elapsed_ms": 570660
}