{
  "topic": "DNA",
  "title": "DNA",
  "slug": "dna",
  "grokipedia_slug": "DNA",
  "grokipedia_url": "https://grokipedia.com/page/DNA",
  "source": "grokipedia",
  "content": "# DNA\n\nDeoxyribonucleic acid (**DNA**) is a long polymer composed of two polynucleotide strands that form a double helix, serving as the primary carrier of genetic information in nearly all living organisms and many viruses. This molecule encodes the instructions for building and maintaining an organism, with its sequence of nucleotide bases determining traits through the process of heredity. Each strand consists of a sugar-phosphate backbone made from deoxyribose sugars and phosphate groups, linked to one of four nitrogenous bases: adenine (**A**), thymine (**T**), guanine (**G**), or cytosine (**C**), where **A** pairs with **T** and **G** with **C** via hydrogen bonds to stabilize the helical structure. The double-helix configuration, with approximately 10.4 base pairs per helical turn and a pitch of 3.4 nanometers, allows DNA to be efficiently packed into chromosomes while enabling accurate replication and information transfer.\n\nThe discovery of DNA's role and structure unfolded over more than a century of scientific inquiry. In 1869, Swiss biochemist Friedrich Miescher first isolated DNA from white blood cells in pus, identifying it as a novel substance he called \"nuclein,\" though its biological significance remained unclear. By 1944, Oswald Avery, Colin MacLeod, and Maclyn McCarty demonstrated that DNA is the \"transforming principle\" responsible for heredity, confirming it as the molecule that transmits genetic information between generations in bacteria. The iconic double-helix model was proposed in 1953 by James Watson and Francis Crick, building on X-ray diffraction data from Rosalind Franklin and Maurice Wilkins, which revealed DNA's helical nature and base-pairing rules. This breakthrough, published in *Nature*, explained how DNA could replicate semi-conservatively, with each strand serving as a template for a new complementary strand during cell division.\n\nFunctionally, DNA's nucleotide sequence forms genes that encode proteins essential for cellular processes, with only about 1-2% of human DNA consisting of protein-coding genes (approximately 20,000 in total). During gene expression, segments of DNA are transcribed into messenger RNA (**mRNA**), which is then translated into proteins following the genetic code, where triplets of bases (codons) specify amino acids. Non-coding regions of DNA regulate gene activity, influence chromosome structure, and play roles in processes like DNA repair and epigenetic inheritance. In humans, the entire DNA sequence, or genome, comprises about 3 billion base pairs distributed across 23 pairs of chromosomes, enabling the diversity and complexity of life. Variations in DNA sequences, such as single nucleotide polymorphisms, contribute to individual differences in traits, disease susceptibility, and evolutionary adaptation.\n\n## Physical and Chemical Properties\n\n### Nucleobase Composition\n\nDNA nucleotides are the monomeric units that form the polymer chain of deoxyribonucleic acid (DNA), each consisting of a nitrogenous base, a deoxyribose sugar, and one to three phosphate groups linked via phosphodiester bonds.\n\nThe canonical nucleobases in DNA are adenine (A), thymine (T), guanine (G), and cytosine (C), which serve as the primary information-encoding components. Adenine and guanine are purines, characterized by a fused double-ring structure, while thymine and cytosine are pyrimidines with a single six-membered ring. The molecular formulas of these bases are adenine (C₅H₅N₅), guanine (C₅H₅N₅O), cytosine (C₄H₅N₃O), and thymine (C₅H₆N₂O₂). These bases exhibit hydrogen bonding capabilities through specific donor and acceptor sites on their ring nitrogens and exocyclic groups, enabling interactions that contribute to DNA stability, with purines generally offering more extensive bonding potential due to their larger structure.\n\nNon-canonical bases occur in DNA as modified or damage-derived variants, expanding functional diversity beyond the standard set. For instance, 5-methylcytosine (5mC, C₅H₇N₃O) arises from enzymatic methylation of cytosine and plays a key role in epigenetic regulation by influencing gene expression and chromatin structure without altering the DNA sequence. Hypoxanthine (Hx, C₅H₄N₄O), formed by deamination of adenine, is mutagenic as it can pair erroneously during replication, leading to A-to-G transitions if unrepaired. Detection of such bases often involves techniques like bisulfite sequencing for 5mC, which converts unmethylated cytosines to uracil while preserving 5mC, or mass spectrometry for hypoxanthine identification in DNA hydrolysates.\n\nThe nucleobases display acidity primarily through deprotonation of ring nitrogens or exocyclic groups, with pKa values determining their ionization state at physiological pH. For example, the pKa of thymine at the N3 proton is approximately 9.8, indicating it remains mostly protonated under neutral conditions but can deprotonate in basic environments.\n\nA key macroscopic property arising from the aromatic π-electron systems of the nucleobases is strong ultraviolet absorbance at 260 nm, which allows for straightforward quantification of DNA concentration using the Beer-Lambert law, where an absorbance of 1 corresponds to about 50 μg/mL of double-stranded DNA.\n\n### Double Helix and Base Pairing\n\nThe double helix structure of DNA, proposed by James D. Watson and Francis H. C. Crick in 1953, describes two right-handed antiparallel polynucleotide chains coiled around a central axis to form the B-DNA conformation, the most common structural form observed in cells. This model features a helical diameter of approximately 2 nm, a pitch of approximately 3.6 nm per turn, and an average of 10.5 base pairs per helical turn, with each base pair separated by a rise of 0.34 nm along the axis. These parameters were refined through X-ray fiber diffraction studies, providing a stable scaffold for genetic information storage.\n\nThe integrity of the double helix relies on specific base pairing between the nucleobases on opposite strands, where adenine (A) forms two hydrogen bonds with thymine (T), and guanine (G) forms three hydrogen bonds with cytosine (C). This pairing ensures structural specificity through complementary geometric shapes and hydrogen bonding patterns that favor the standard keto and amino tautomeric forms of the bases, thereby avoiding mismatches from rare tautomeric shifts. The resulting Watson-Crick base pairs maintain uniform width across the helix, contributing to its overall stability.\n\nEmpirical observations by Erwin Chargaff in 1949 revealed key compositional rules in double-stranded DNA: the molar amounts of adenine equal those of thymine (A = T), and guanine equals cytosine (G = C), reflecting the complementary pairing that balances purine and pyrimidine content. These Chargaff's rules provided crucial evidence supporting the base pairing hypothesis and the double-helical architecture.\n\nThe two strands in the double helix exhibit antiparallel orientation, with each running in the 5' to 3' direction relative to its phosphodiester backbone but in opposite directions overall. In genetic contexts, the sense (or coding) strand carries the sequence information directly corresponding to the mature mRNA (with thymine replacing uracil), while the antisense (or template) strand serves as the complementary template for transcription. This polarity ensures directional synthesis during replication and transcription processes.\n\nIn contrast to double-stranded DNA (dsDNA), single-stranded DNA (ssDNA) lacks interstrand base pairing, resulting in greater flexibility and lower thermal stability, as ssDNA adopts more irregular, dynamic conformations without the rigid helical scaffold. DsDNA's enhanced stability arises from hydrophobic base stacking and hydrogen bonding, which collectively raise its resistance to denaturation. The melting temperature (Tm), defined as the point at which 50% of the duplex dissociates into single strands, quantifies this stability; for short oligonucleotides under standard conditions, Tm can be approximated as 69.3 + 0.41(%GC) - 650/L (°C), where %GC is the guanine-cytosine content and L is the length in nucleotides, underscoring the stabilizing influence of GC pairs due to their additional hydrogen bond.\n\n### Grooves and Supercoiling\n\nThe double helix of B-DNA features two asymmetric grooves formed by the sugar-phosphate backbones: the major groove, approximately 1.2 nm wide, and the minor groove, about 0.6 nm wide. These dimensions arise from the antiparallel orientation of the strands and the geometry of the base pairs, with the major groove being wider and deeper, providing greater accessibility to the edges of the bases. The grooves facilitate interactions with macromolecules, where the major groove's exposure of distinct base patterns enables sequence-specific recognition, while the minor groove contributes to shape-based binding through its narrower profile and electrostatic properties.\n\nSupercoiling refers to the over- or under-winding of the DNA double helix beyond its relaxed state, introducing topological constraints particularly in closed circular DNA molecules, such as bacterial plasmids or viral genomes. Negative supercoiling, which underwinds the helix (reducing the twist), predominates in nature and generates torsional stress that promotes processes like strand separation, whereas positive supercoiling overwinds the helix and stabilizes the structure. This topology is quantified by the linking number (Lk), which counts the number of times one strand crosses the other in a projection; it decomposes into twist (Tw), the helical winding of the strands, and writhe (Wr), the coiling of the helix axis.\n\n$$\n\\\text{Lk} = \\\text{Tw} + \\\text{Wr}\n$$\n\nIn circular DNA, deviations from the relaxed linking number (Lk$_0$) induce superhelical density $\\sigma = (\\\text{Lk} - \\\text{Lk}_0)/\\\text{Lk}_0$, with typical cellular values around -0.06, creating torsional stress that can be partitioned between twisting and writhing to minimize energy. The free energy of supercoiling for the entire molecule is approximated as $\\Delta G \\approx \\frac{1100 RT}{N} (Lk - Lk_0)^2$, where $N$ is the number of base pairs, $R$ is the gas constant, and $T$ is temperature in Kelvin; this quadratic dependence in $\\sigma$ (since $Lk - Lk_0 \\approx \\sigma Lk_0$) highlights how even modest supercoiling levels ($\\sigma \\approx -0.06$) accumulate significant energetic costs in long molecules, scaling linearly with length.\n\nIn eukaryotic chromosomes, DNA is organized into topological domains, such as topologically associating domains (TADs) spanning hundreds of kilobases to megabases, where supercoiling is independently regulated and constrained by protein barriers like CTCF and cohesin. These domains limit the propagation of torsional stress, maintaining local superhelical states that influence chromatin folding without affecting distant regions. For scale, the human haploid genome comprises approximately 3 billion base pairs, extending about 1 meter if fully unwound, with the diploid complement in a single cell totaling roughly 2 meters, underscoring the topological challenges of managing such extensive, supercoiled structures within the nucleus.\n\n### Alternative Structures and Chemistry\n\nWhile the B-form double helix represents the predominant conformation of DNA under physiological conditions, alternative structures arise under specific environmental or sequence-dependent triggers, deviating from the standard right-handed spiral. A-DNA, for instance, features a shorter, more compact helix with approximately 11 base pairs per turn and a wide, shallow minor groove alongside a deep major groove. This form is stabilized by dehydration or high salt concentrations, which reduce water activity and promote base tilting and positive roll angles in the helix.\n\nIn contrast, Z-DNA adopts a left-handed helical conformation characterized by a zigzag phosphate backbone and roughly 12 base pairs per turn, with syn glycosidic bonds for purines and anti for pyrimidines. Formation of Z-DNA is favored in high salt environments or sequences rich in alternating purine-pyrimidine tracts, particularly GC-rich motifs like poly(dG-dC), where the zigzag arrangement arises from the anti-Z conformation of the sugar-phosphate chain.\n\nG-quadruplexes constitute another class of non-canonical structures, formed in guanine-rich sequences through Hoogsteen hydrogen bonding that assembles four guanines into planar G-tetrads, which then stack via π-π interactions to yield a four-stranded scaffold often stabilized by monovalent cations like potassium. These structures occur prominently in telomeric regions, where repetitive G-tracts enable intramolecular folding into compact, propeller-like topologies.\n\nBranched DNA configurations extend beyond linear duplexes, including Holliday junctions as four-way branched intermediates where two duplexes exchange strands to form a cross-shaped structure with antiparallel stacked helices at the branch point. Y-shaped structures, or three-way junctions, feature three double-helical arms meeting at a central fork, often exhibiting flexibility in arm orientations. Artificial branched constructs, such as DNA tiles, leverage these motifs—typically double-crossover or paranemic tiles—to self-assemble into periodic lattices or nanostructures, where sticky ends facilitate programmable tiling without covalent ligation.\n\nAlternative chemistries expand DNA's structural repertoire through synthetic analogs that alter the sugar-phosphate backbone or nucleobases. Xeno-nucleic acids (XNAs) incorporate modified sugars, such as threose in threose nucleic acid (TNA) or 1,5-anhydrohexitol in hexitol nucleic acid (HNA), yielding stable helical forms compatible with Watson-Crick base pairing but resistant to nuclease degradation. Expanded genetic codes employ artificial bases, as in artificially expanded genetic information systems (AEGIS), which introduce non-natural pairs like dP-dZ alongside standard A-T and G-C to increase informational density while maintaining orthogonal pairing geometries.\n\nPost-2020 advances have realized synthetic DNA incorporating six nucleobases, enabling expanded codon repertoires through engineered polymerases that replicate AEGIS pairs with fidelity comparable to natural bases, thus supporting larger genetic alphabets in vitro. Additionally, XNAs like TNA demonstrate enhanced stability in extreme environments, including nuclease-rich cellular milieus or harsh chemical conditions, due to their non-natural backbones that evade enzymatic hydrolysis while preserving hybridization properties.\n\n## Modifications and Damage\n\n### Chemical Modifications\n\nChemical modifications to DNA occur post-synthesis and alter the structure of bases or the phosphodiester backbone, influencing stability, gene expression, and cellular function. These modifications include epigenetic marks like methylation on nucleobases and synthetic changes for therapeutic applications, as well as oxidative products that can arise from environmental or metabolic stress.\n\nAmong base modifications, 5-methylcytosine (5mC) is the most prevalent in mammalian genomes, formed by the addition of a methyl group to the 5-position of cytosine, primarily at CpG dinucleotides. This modification is catalyzed by DNA methyltransferases, with DNMT1 serving as the maintenance enzyme that copies methylation patterns during DNA replication. N6-methyladenine (6mA), involving methylation at the N6 position of adenine, is less common in eukaryotes but has been identified in various organisms and linked to gene regulation. Detection of 5mC typically relies on bisulfite sequencing, which converts unmethylated cytosines to uracils while leaving 5mC intact, allowing precise mapping of methylation sites.\n\nA key DNA-level derivative of 5mC is 5-hydroxymethylcytosine (5hmC), generated by TET family enzymes through oxidation of 5mC, acting as both an intermediate in demethylation and a stable epigenetic mark associated with active transcription. 5hmC levels interact with histone modifications, such as acetylation, to modulate chromatin accessibility, though its primary role remains at the DNA base.\n\nOxidative modifications, such as 8-oxoguanine (8-oxoG), form when guanine is oxidized by reactive oxygen species, creating a lesion that pairs preferentially with adenine instead of cytosine, leading to G-to-T transversion mutations and contributing to mutagenesis. This modification is a common biomarker of oxidative stress in DNA.\n\nBackbone modifications, like phosphorothioate (PS) linkages, replace a non-bridging oxygen in the phosphodiester bond with sulfur, enhancing resistance to nuclease degradation and improving pharmacokinetics in oligonucleotide therapeutics such as antisense drugs.\n\nRecent advances (2023–2025) include CRISPR-based epigenetic editors, such as dCas9 fused to TET1, which enable targeted demethylation by oxidizing 5mC at specific loci without altering the DNA sequence, offering potential for precise gene activation in research and therapy.\n\n### DNA Damage and Repair\n\nDNA damage arises from both endogenous and exogenous sources, threatening genomic integrity by introducing lesions that can lead to mutations if unrepaired. Endogenous damage includes spontaneous chemical alterations, such as the deamination of cytosine to uracil, which occurs frequently due to hydrolytic processes and can result in C-to-T transitions during replication. Exogenous damage is often inflicted by environmental agents, including ultraviolet (UV) radiation that induces cyclobutane pyrimidine dimers, particularly thymine dimers, distorting the DNA helix and blocking replication and transcription. Ionizing radiation, from sources like X-rays or cosmic rays, generates single-strand breaks (SSBs) and more severe double-strand breaks (DSBs) by direct ionization or through reactive oxygen species (ROS).\n\nCells have evolved multiple repair pathways to counteract these lesions, each tailored to specific damage types. Base excision repair (BER) addresses small, non-helix-distorting base modifications, such as deaminated bases, where DNA glycosylases recognize and excise the damaged base, creating an abasic site that is then processed by AP endonuclease and DNA polymerase to restore the correct nucleotide. Nucleotide excision repair (NER) targets bulky, helix-distorting adducts like UV-induced thymine dimers; it involves damage recognition by proteins such as XPC or RNA polymerase stalling, followed by excision of a 24-32 nucleotide oligonucleotide containing the lesion and gap-filling synthesis. Mismatch repair (MMR) corrects base-base or insertion-deletion mismatches arising from replication errors, with MutSα (MSH2-MSH6) recognizing mismatches and directing excision and resynthesis strand-specifically, enhancing replication fidelity by up to 100- to 1000-fold.\n\nDSBs, the most cytotoxic lesions, are repaired by two primary pathways: non-homologous end joining (NHEJ) and homologous recombination (HR). NHEJ, active throughout the cell cycle, rapidly ligates broken ends using the Ku70/Ku80 heterodimer to bind DNA ends and recruit DNA-PKcs for processing and ligation, though it is error-prone and can introduce small insertions or deletions. In contrast, HR provides accurate repair during the S and G2 phases by using a sister chromatid template; it involves resection of DSB ends, RAD51-mediated strand invasion, and DNA synthesis, with key regulators like BRCA1 and BRCA2 facilitating RAD51 loading.\n\nIn immune responses, neutrophils can release extracellular DNA as part of neutrophil extracellular traps (NETs), web-like structures formed during NETosis to ensnare pathogens. NETs consist of decondensed chromatin fibers coated with antimicrobial proteins, including nuclear and mitochondrial DNA that may bear oxidative damage from ROS generated during activation; this DNA extrusion aids in trapping microbes but can propagate inflammation as damage-associated molecular patterns (DAMPs).\n\nUnrepaired or misrepaired DNA damage accumulates mutations, potentially driving carcinogenesis, or triggers apoptosis via p53-mediated pathways to eliminate compromised cells and prevent tumorigenesis. Defects in HR, such as mutations in BRCA1 or BRCA2, impair DSB repair and confer high lifetime risks of breast and ovarian cancers, as observed in up to 90 of 600 breast cancer patients.\n\n### Packaging and Chromatin\n\nIn eukaryotic cells, DNA must be highly compacted to fit within the nucleus while remaining accessible for cellular processes. This packaging begins at the lowest level with the formation of nucleosomes, the fundamental units of chromatin. Each nucleosome consists of approximately 147 base pairs of DNA wrapped about 1.7 times around a histone octamer composed of two copies each of the core histones H2A, H2B, H3, and H4. The DNA-histone interaction is stabilized by electrostatic forces between the negatively charged DNA phosphate backbone and the positively charged histone tails. Adjacent nucleosomes are connected by short stretches of linker DNA, typically 20–60 base pairs long, which can bind the linker histone H1 to further stabilize the structure and promote folding. This \"beads-on-a-string\" configuration represents the primary level of chromatin organization, reducing the length of the DNA double helix by about six- to sevenfold.\n\nHigher-order chromatin structures build upon nucleosomes to achieve greater compaction. Classical models propose that nucleosomes can fold into a 30-nm chromatin fiber, such as a solenoid structure where approximately six nucleosomes form one turn of the helix, further shortening the chromatin fiber by about sixfold; however, recent studies indicate that such regular 30-nm fibers may not predominate in vivo, with chromatin often exhibiting more irregular or disordered organization. These structures then organize into larger looped domains, often anchored to a protein scaffold, forming chromatin loops that range from 50 to 200 kilobases in size and facilitate spatial segregation of genomic regions. At even larger scales, chromatin condenses into topologically distinct domains that contribute to the overall three-dimensional architecture of the genome. Chromatin exists in two main forms based on packing density and accessibility: euchromatin, which is loosely packed and transcriptionally active, allowing easy access to DNA for gene expression; and heterochromatin, which is densely compacted and generally transcriptionally silent, restricting access to regulatory proteins.\n\nOverall, eukaryotic DNA undergoes compaction to form interphase chromatin with a packing ratio of approximately 400- to 1,000-fold, varying by region (euchromatin more extended, heterochromatin denser). During mitosis, chromatin condenses further into visible chromosomes, achieving a 10,000- to 20,000-fold packing ratio, which enables efficient segregation of the genome during cell division. Mitotic chromosomes feature a radial loop organization, where chromatin fibers extend from a central protein scaffold, further stabilized by condensin complexes.\n\nEpigenetic modifications on histones play a crucial role in regulating chromatin packaging and function. For instance, trimethylation of histone H3 at lysine 9 (H3K9me3) recruits heterochromatin protein 1 (HP1), promoting chromatin condensation and transcriptional silencing by stabilizing compact heterochromatic states. Such modifications alter histone-DNA interactions and influence higher-order folding without changing the underlying DNA sequence, thereby linking packaging to gene regulation. These epigenetic marks can propagate through cell divisions, maintaining stable chromatin states.\n\nRecent advances in chromatin conformation capture techniques, such as Hi-C, have revolutionized our understanding of three-dimensional genome architecture. Hi-C maps pairwise chromatin interactions genome-wide, revealing topologically associating domains (TADs)—self-interacting chromatin regions of about 1 megabase that act as structural and functional units, insulating genes from enhancers in adjacent domains. In 2024, improved Hi-C variants, including single-cell and multi-way interaction profiling, have enhanced resolution to uncover dynamic TAD boundaries and their roles in development and disease, showing how disruptions in TAD organization lead to misregulated gene expression. These findings underscore TADs as key organizers of chromatin packaging beyond linear sequence. As of 2025, computational models reveal that chromatin fibers exhibit conformational variability dependent on ionic conditions, supporting irregular rather than uniform higher-order structures.\n\n## Biological Functions\n\n### Genetic Information Storage\n\nDNA serves as the primary repository for genetic information in most organisms, encoding instructions for protein synthesis and cellular functions through sequences of nucleotide bases. In prokaryotes, the genome is typically organized as a single, circular chromosome located in the nucleoid region, allowing for compact and efficient storage with minimal non-essential DNA. In contrast, eukaryotic genomes consist of multiple linear chromosomes housed within the nucleus, enabling complex regulation and segregation during cell division; for example, the human genome comprises 23 pairs of chromosomes totaling approximately 3.1 billion base pairs (Gb) and encoding around 20,000 protein-coding genes, resulting in a relatively low gene density of about one gene per 100,000-150,000 base pairs.\n\nGenes represent the fundamental units of genetic information storage, defined as segments of DNA that contain an open reading frame (ORF)—a continuous sequence beginning with a start codon (typically ATG) and ending with a stop codon (TAA, TAG, or TGA), uninterrupted by internal stop codons, which directs the synthesis of a specific polypeptide. Within eukaryotic genes, coding regions (exons) are interspersed with non-coding introns, which are removed during RNA splicing, while prokaryotic genes lack introns and are more continuously expressed. Non-coding DNA, comprising over 98% of the human genome, includes regulatory elements such as promoters that initiate transcription and enhancers that modulate gene expression over long distances, challenging early misconceptions that labeled much of this DNA as \"junk\" without function, as subsequent studies revealed its roles in gene regulation and genome stability. Pseudogenes, duplicated gene copies rendered non-functional by mutations like frameshifts or premature stop codons, accumulate in genomes and may influence evolution by serving as raw material for new genes, though they do not produce viable proteins.\n\nGenome size varies dramatically across species, reflecting differences in organismal complexity and non-coding content rather than gene number alone; for instance, the bacterium *Mycoplasma genitalium* possesses the smallest known free-living genome at approximately 0.58 megabases (Mb), containing just 580 genes essential for basic metabolism. At the opposite extreme, the fork fern *Tmesipteris oblanceolata* holds the largest recorded genome at 160.45 Gb, dominated by repetitive and non-coding sequences that may facilitate adaptation but also pose challenges for replication. Specialized DNA structures contribute to information storage and regulation, such as G-quadruplexes formed by guanine-rich telomeric repeats, which fold into stable four-stranded motifs to protect chromosome ends from degradation and regulate telomere length maintenance. Branched DNA structures, like Holliday junctions arising during recombination, also play roles in maintaining genome integrity by facilitating precise information exchange without loss.\n\n### Transcription and Translation\n\nTranscription is the process by which genetic information encoded in DNA is copied into messenger RNA (mRNA) by the enzyme RNA polymerase II in eukaryotes. This occurs when RNA polymerase II binds to promoter regions, such as those containing the TATA box approximately 25-35 base pairs upstream of the transcription start site, facilitating the assembly of the pre-initiation complex with general transcription factors. Initiation begins with the unwinding of the DNA double helix at the promoter, allowing the template strand—read in the 3' to 5' direction—to serve as the blueprint for synthesizing complementary RNA in the 5' to 3' direction. The coding strand, also known as the sense strand, has the same sequence as the mRNA (with thymine replaced by uracil) and runs in the 5' to 3' direction, but it is not directly transcribed. Elongation proceeds as RNA polymerase II moves along the template strand, adding nucleotides until reaching a termination signal, such as a polyadenylation sequence in eukaryotes, which triggers the release of the nascent RNA transcript.\n\nIn eukaryotes, the primary transcript, or pre-mRNA, undergoes extensive processing to become mature mRNA. Capping occurs co-transcriptionally near the 5' end, where a 7-methylguanosine cap is added via a 5'-5' triphosphate linkage, protecting the mRNA from degradation and aiding in ribosome binding. Splicing removes non-coding introns and joins coding exons, a discovery made through studies of adenovirus transcripts showing interrupted gene structures. At the 3' end, cleavage at a specific site is followed by the addition of a poly(A) tail, typically 200-250 adenines long, which enhances mRNA stability and export from the nucleus; this posttranscriptional modification was first identified in eukaryotic mRNAs in the early 1970s.\n\nThe central dogma of molecular biology describes the flow of genetic information from DNA to RNA to protein, proposed by Francis Crick as a framework for understanding information transfer in cells. One gene can produce multiple proteins through alternative splicing, where different exon combinations yield isoform variants, expanding proteome diversity beyond the number of genes.\n\nTranslation converts the mRNA sequence into a polypeptide chain at ribosomes, large ribonucleoprotein complexes composed of small and large subunits. The process begins with initiation, where the ribosome assembles on the mRNA's start codon (AUG), followed by elongation as transfer RNAs (tRNAs) deliver amino acids; each tRNA's anticodon base-pairs with a complementary mRNA codon, ensuring accurate amino acid addition. The genetic code, deciphered starting with Nirenberg and Matthaei's 1961 experiments using synthetic polynucleotides, consists of 64 triplets (codons) specifying 20 standard amino acids and stop signals, exhibiting degeneracy where multiple codons encode the same amino acid to buffer against mutations. Termination occurs when a stop codon is reached, releasing the completed protein.\n\nGene expression is tightly regulated during transcription and translation. Enhancers, distal DNA elements first identified in viral contexts, boost transcription by looping to interact with promoters, independent of orientation or position. Silencers, their repressive counterparts, bind repressors to inhibit transcription, often functioning as bifunctional elements that switch roles by cell type. Non-coding RNAs, such as microRNAs (miRNAs) discovered in 1993 through studies of developmental timing in *C. elegans*, post-transcriptionally repress translation by binding mRNA target sites, leading to degradation or inhibition.90595-V) Long non-coding RNAs (lncRNAs), longer than 200 nucleotides, modulate expression by recruiting chromatin-modifying complexes to enhancers or promoters, influencing both activation and repression.\n\n### Replication and Cell Division\n\nDNA replication proceeds via a semi-conservative mechanism, in which each daughter DNA molecule consists of one intact parental strand and one newly synthesized complementary strand. This process ensures the accurate transmission of genetic information during cell division. The semi-conservative model was experimentally confirmed in 1958 by Matthew Meselson and Franklin Stahl, who used density gradient centrifugation to track the replication of *Escherichia coli* DNA labeled with heavy nitrogen (¹⁵N) and then switched to light nitrogen (¹⁴N); after one generation, all DNA molecules had intermediate density, and after two generations, half were intermediate and half light, matching the predictions of semi-conservative replication.\n\nInitiation of replication occurs at specific genomic sites known as origins of replication. In bacteria like *E. coli*, replication begins at a single origin, *oriC*, a approximately 245-base-pair sequence that serves as a binding site for the initiator protein DnaA, which unwinds the DNA to recruit additional replication factors. In eukaryotes, replication initiates from multiple origins to accommodate larger genomes; for example, in budding yeast (*Saccharomyces cerevisiae*), autonomously replicating sequences (ARS) function as origins, with ARS1 identified as the first such element capable of supporting plasmid replication independently of chromosomal integration. These origins ensure timely and coordinated duplication of the genome.\n\nThe replication process involves unwinding the double helix at the origin and fork progression. Helicase enzymes, such as DnaB in bacteria, use ATP hydrolysis to separate the parental strands, forming a Y-shaped replication fork where synthesis occurs bidirectionally. Primase (DnaG in bacteria) synthesizes short RNA primers complementary to the DNA template, providing a 3'-OH group for DNA polymerase to begin nucleotide addition. Elongation is carried out by replicative DNA polymerases: in bacteria, DNA polymerase III extends the primers in the 5' to 3' direction on the leading strand continuously, while on the lagging strand, it synthesizes discontinuous segments known as Okazaki fragments, each initiated by a new primer. In eukaryotes, DNA polymerase ε primarily synthesizes the leading strand, while DNA polymerase δ handles the lagging strand and Okazaki fragment synthesis, with these assignments genetically confirmed in yeast mutants exhibiting strand-specific mutation biases. After synthesis, Okazaki fragments are processed by removal of RNA primers, gap filling, and ligation to form a continuous strand. Topoisomerases relieve torsional stress from supercoiling ahead of the fork to allow fork progression.80069-0)\n\nReplication fidelity is maintained through multiple mechanisms to minimize errors. DNA polymerases possess 3'→5' exonuclease proofreading activity, which excises mismatched nucleotides immediately after incorporation, reducing the base substitution error rate from approximately 10^{-5} to 10^{-7} per nucleotide. Combined with post-replication mismatch repair, the overall error rate achieves about 10^{-9} to 10^{-10} errors per base pair replicated. In eukaryotes with linear chromosomes, the end-replication problem—where the lagging strand terminus cannot be fully completed due to primer removal—leads to progressive shortening unless addressed; telomerase, a ribonucleoprotein reverse transcriptase, extends the 3' overhang by adding telomeric repeats using its RNA template, thereby maintaining telomere length. This enzyme was first identified in *Tetrahymena* extracts in 1985.90170-9)75503-3/fulltext)\n\nDNA replication is tightly integrated into the eukaryotic cell cycle, occurring exclusively during S phase to ensure genome duplication precedes division. Entry into S phase is triggered by cyclin-dependent kinases that activate origins, while checkpoints, such as the intra-S phase checkpoint, monitor replication progress and halt the cycle if forks stall or damage occurs, preventing incomplete replication. In prokaryotes, replication timing aligns with cell growth and division, often initiating once per cycle. Mitochondrial DNA replication, which supports cellular energy production, operates semi-conservatively but independently of the nuclear cycle, using a specialized replisome with DNA polymerase γ as the replicative enzyme and occurring continuously in post-mitotic cells to maintain organelle numbers.\n\n## Protein Interactions\n\n### DNA-Binding Proteins\n\nDNA-binding proteins are a diverse class of molecules that interact with DNA to regulate gene expression, maintain chromatin structure, and facilitate various cellular processes. These proteins recognize specific DNA sequences or structural features through distinct binding domains, enabling precise control over genetic activity. Unlike enzymes that modify DNA, DNA-binding proteins primarily function through non-catalytic recognition and stabilization of DNA conformations.\n\nDNA-binding proteins can be broadly classified into sequence-specific transcription factors and non-sequence-specific architectural proteins. Transcription factors, such as TFIIB, utilize motifs like the helix-turn-helix (HTH) to bind promoter regions and recruit the transcriptional machinery. The HTH motif in TFIIB's C-terminal domain inserts an alpha-helix into the major groove of DNA, facilitating sequence-specific interactions upstream of the TATA box. Architectural proteins, exemplified by high-mobility group (HMG) proteins like HMG1 and HMG2, bend DNA to promote higher-order chromatin folding without sequence preference. These proteins insert HMG boxes into the minor groove, inducing sharp bends of up to 90 degrees to facilitate nucleoprotein complex assembly.\n\nBinding occurs through two primary modes: sequence-specific and non-specific. In sequence-specific binding, proteins like zinc finger domains contact base pairs in the DNA major groove via hydrogen bonds and van der Waals interactions, allowing recognition of unique nucleotide triplets. For instance, the zinc finger protein Zif268 inserts its alpha-helices into the major groove, where key residues probe the edges of base pairs for specificity. Non-specific binding, in contrast, relies on electrostatic interactions between positively charged protein residues and the negatively charged phosphate backbone, enabling proteins to slide along DNA for efficient target search. This mode is common in architectural proteins and supports rapid diffusion along the genome.\n\nProminent examples illustrate these mechanisms in regulation. The p53 tumor suppressor protein binds as a tetramer to palindromic response elements consisting of two RRRCWWGYYY half-sites (where R = purine, Y = pyrimidine, W = A or T), inserting its DNA-binding domain into the major groove to activate genes involved in cell cycle arrest and apoptosis. Similarly, the lac repressor in bacteria binds the operator sequence of the lac operon via its N-terminal DNA-binding domain, forming a loop that represses transcription in the absence of lactose; inducer binding allosterically releases this interaction.\n\nInteractions with DNA grooves provide both specificity and structural readout. The major groove, being wider and richer in hydrogen-bonding groups, is the primary site for sequence-specific recognition, as seen in zinc fingers and HTH motifs where protein side chains directly contact base edges. The minor groove, narrower and more uniform, supports shape readout for non-specific binding, with proteins like HMG boxes inserting arginines to sense and deform DNA curvature. This groove duality allows proteins to integrate sequence and deformability cues for accurate targeting.\n\nRecent advances in AI-driven structure prediction have accelerated the discovery of novel DNA-binding proteins. AlphaFold3, released in 2024, enables high-accuracy modeling of protein-DNA complexes, predicting interactions for previously uncharacterized binders and aiding design of synthetic regulators.\n\n### Enzymes Acting on DNA\n\nEnzymes acting on DNA encompass a diverse class of catalytic proteins essential for maintaining genomic integrity through synthesis, cleavage, or structural modification of DNA strands. These enzymes include nucleases that degrade DNA, ligases that join DNA fragments, helicases and topoisomerases that manage DNA topology, and polymerases that synthesize new DNA strands. Their activities are tightly regulated to ensure precise manipulation of DNA during cellular processes, with mechanisms often involving metal ion cofactors like Mg²⁺ and energy sources such as ATP.\n\nNucleases hydrolyze phosphodiester bonds in DNA, either internally or from the ends, to cleave or trim strands. Restriction endonucleases, particularly Type II variants, recognize specific short palindromic sequences of 4–8 base pairs and cleave DNA within or near these sites in the presence of Mg²⁺, generating sticky or blunt ends that are crucial for molecular cloning techniques. For example, EcoRI, isolated from *Escherichia coli*, cuts at the palindrome GAATTC, producing 5' overhangs four bases long. Exonucleases, in contrast, progressively degrade DNA from the termini; human exonuclease 1 (hEXO1) exhibits robust 5'→3' exonuclease activity on single- and double-stranded DNA, activated in a mismatch-dependent manner to remove erroneous nucleotides. This directional specificity allows exonucleases to process DNA ends during various cellular maintenance activities.\n\nDNA ligases catalyze the formation of phosphodiester bonds to seal nicks between adjacent nucleotides on a DNA strand, requiring a 5'-phosphate and 3'-hydroxyl group. In eukaryotes, ATP-dependent ligases, such as human DNA ligase I, employ a three-step mechanism: adenylation of the enzyme using ATP, transfer of the AMP to the 5'-phosphate of the nick, and subsequent ligation with release of AMP, all facilitated by Mg²⁺. This process ensures the continuity of DNA strands after synthesis or repair events.\n\nHelicases unwind double-stranded DNA by translocating along the strands in an ATP-dependent manner, separating bases to expose single-stranded regions. RecA-like helicases, such as bacterial RecA, facilitate strand invasion and unwinding during homologous recombination by forming nucleoprotein filaments that promote ATP hydrolysis-driven branch migration. Topoisomerases relieve torsional stress in DNA without unwinding the helix. Type I topoisomerases, like eukaryotic topoisomerase I, create a transient single-strand nick, allowing the intact strand to rotate around the break for supercoil relaxation before resealing, independent of ATP. Type II topoisomerases, such as topoisomerase II, introduce coordinated double-strand breaks, pass another DNA segment through the gap (decatenation), and religate, requiring ATP to drive the strand-passage mechanism essential for separating intertwined chromosomes.\n\nDNA polymerases synthesize new DNA strands by adding deoxynucleotides to a primer in the 5'→3' direction, using a template strand for base-pairing fidelity. Replicative polymerases, such as bacterial DNA polymerase III or eukaryotic polymerases δ and ε, achieve high fidelity through base selection and 3'→5' exonuclease proofreading, with error rates as low as 10⁻⁷ per base pair. Repair polymerases, like DNA polymerase β, fill short gaps during base excision repair (BER) by incorporating 1–10 nucleotides with lower processivity but specialized lyase activity to remove damaged residues. Reverse transcriptases, found in retroviruses like HIV-1, polymerize DNA from an RNA template, combining polymerase and RNase H activities to degrade the RNA strand post-synthesis, enabling integration of viral genetic material into host DNA.\n\nThese enzymes exhibit remarkable processivity and kinetic efficiency to handle large genomes rapidly. For instance, bacterial replicative polymerases achieve speeds of approximately 1000 nucleotides per second while maintaining high processivity, often exceeding 100,000 nucleotides per binding event due to accessory factors like sliding clamps. Such kinetics underscore their adaptation for efficient DNA manipulation in vivo.\n\n## Genetic Processes\n\n### Recombination and Repair\n\nHomologous recombination (HR) is a fundamental genetic process that enables the exchange of genetic material between homologous DNA molecules, facilitating both DNA repair and the generation of genetic diversity. This mechanism involves the invasion of a single-stranded DNA region from one molecule into a homologous duplex, forming a displacement loop (D-loop), followed by DNA synthesis and branch migration. Central to HR is the formation of Holliday junctions, four-way DNA intermediates that arise during strand exchange and can be resolved to produce either crossover or non-crossover products.\n\nIn meiosis, HR plays a critical role in promoting crossing over, which physically links homologous chromosomes to ensure their proper segregation during the first meiotic division. Crossing over occurs at recombination hotspots, where double-strand breaks (DSBs) are induced by the Spo11 protein, leading to HR-mediated exchange and the formation of chiasmata. This process not only secures bipolar attachment to the spindle but also shuffles alleles, contributing to genetic variation in gametes. For instance, in humans, meiotic recombination generates an average of 30-50 crossovers per cell, with rates varying by chromosomal region.\n\nSite-specific recombination, in contrast, involves precise rearrangements at defined DNA sequences without requiring extensive homology, mediated by specialized enzymes such as integrases. These recombinases, often tyrosine- or serine-based, recognize short inverted repeat sites and catalyze strand cleavage, exchange, and religation to achieve integration, excision, or inversion. In transposons, integrases facilitate the mobilization and insertion of mobile genetic elements, such as in integrons that capture antibiotic resistance genes through site-specific recombination. A prominent example is the Cre-lox system from bacteriophage P1, where the Cre recombinase acts on loxP sites to enable conditional gene deletion or inversion in eukaryotic genomes.\n\nThe overlap between recombination and repair is evident in the use of HR to resolve DSBs, a major threat to genomic integrity. In the double-strand break repair model, DSB ends are resected to generate 3' single-stranded tails that facilitate strand invasion and Holliday junction formation, ultimately restoring the sequence using the intact homolog as a template. This pathway predominates in S/G2 phases of the cell cycle when a sister chromatid is available. Non-homologous mechanisms, such as non-homologous end joining (NHEJ), provide an alternative for DSB repair by directly ligating broken ends, often with minimal processing, though at the cost of potential insertions or deletions. HR's error-free nature makes it essential for maintaining fidelity during repair, while NHEJ operates throughout the cell cycle but can introduce mutations.\n\nRecombination significantly influences genetic diversity by breaking linkage disequilibrium (LD), the non-random association of alleles at different loci. Higher recombination rates reduce LD over generations, allowing alleles to assort independently and promoting adaptive evolution. In human populations, genome-wide recombination rates average 1-2 centimorgans per megabase, with hotspots exhibiting rates up to 100-fold higher, leading to rapid decay of LD within 10-100 kb in outbred groups. Allelic recombination rates vary across species and sexes, with females typically showing higher rates, further diversifying gametic haplotypes.\n\nRecent advances in 2024 have leveraged recombination principles in prime editing for precise genome modifications. Prime editing installs site-specific recombinase landing sites via a fused Cas9 nickase and reverse transcriptase, enabling subsequent integration of large DNA payloads through systems like PASSIGE (prime-assisted site-specific integrase gene editing). This approach achieves efficient, homology-independent insertions in mammalian cells, expanding prime editing's utility beyond small edits to large gene integrations without DSBs. Additionally, prime editing has been used to engineer recombination hotspots by inserting recombinase sites into repetitive genomic regions, facilitating controlled randomization for studying evolutionary dynamics.\n\n### Evolution of DNA-Based Life\n\nThe RNA world hypothesis posits that early life on Earth relied on RNA as both genetic material and catalyst, predating the dominance of DNA. This scenario suggests a transition to DNA-based genomes occurred because deoxyribose, the sugar in DNA, is less reactive than ribose in RNA, lacking a 2'-hydroxyl group that makes RNA prone to hydrolysis and degradation. The shift likely provided a selective advantage by enhancing genetic stability in prebiotic environments, allowing for longer-term information storage amid fluctuating conditions. During this evolutionary step, enzymes such as ribonucleotide reductase emerged to convert ribonucleotides to deoxyribonucleotides, enabling DNA synthesis from RNA precursors.\n\nDNA-based life is inferred to have originated around 4.2 billion years ago in the last universal common ancestor (LUCA), a prokaryotic-like organism that possessed a DNA genome, replication machinery, and basic metabolic pathways shared by all modern cellular life. Fossil and genomic evidence places LUCA shortly after Earth's oceans formed, in a reducing atmosphere conducive to nucleic acid polymerization. In parallel, DNA genomes evolved in viruses, with large double-stranded DNA viruses likely arising from ancient cellular genetic elements through gene capture and recombination, predating or coinciding with cellular DNA adoption. Some viruses retain RNA genomes today, highlighting DNA's selective dominance in cellular lineages but persistence of RNA in high-mutation-rate viral niches.\n\nKey advantages of DNA over RNA include the double helix structure, which protects bases from environmental damage and facilitates accurate replication through complementary base pairing, reducing error rates compared to RNA's single-stranded flexibility. Additionally, DNA's chemical inertness supports efficient repair mechanisms, such as base excision repair, which evolved to maintain genome integrity against mutations and lesions—features less robust in RNA systems. These traits enabled larger genomes and more complex cellular organization, driving the expansion of prokaryotic diversity by the Archean eon.\n\nHorizontal gene transfer (HGT), facilitated by recombination, played a pivotal role in DNA genome evolution by allowing rapid acquisition of adaptive traits across lineages, such as antibiotic resistance or metabolic innovations, without vertical inheritance constraints. For instance, recombination integrates transferred DNA segments into the recipient genome, resolving potential disruptions from HGT and promoting evolutionary innovation in bacterial and archaeal populations. A landmark example is endosymbiosis, where an alphaproteobacterium was engulfed by an archaeal host around 1.5–2 billion years ago, contributing its circular DNA genome to form mitochondria and enabling eukaryotic aerobic respiration. This event not only added mitochondrial DNA (mtDNA) but also spurred gene shuffling between endosymbiont and host nuclei, reshaping eukaryotic genome architecture.\n\nDNA is universal in all cellular life domains—Bacteria, Archaea, and Eukarya—yet exhibits variations, particularly in archaeal replication and repair systems, which blend bacterial-like polymerases with unique helicases adapted to extreme environments. Recent phylogenomic analyses, integrating metagenomic data from diverse habitats, have refined the archaeal tree, revealing Asgard archaea as a sister group to eukaryotes with expanded gene duplications in DNA-handling proteins, underscoring their role in early eukaryotic evolution. These studies highlight DNA's conserved core amid domain-specific adaptations, with HGT continuing to blur phylogenetic boundaries in microbial evolution.\n\n## Technological and Historical Applications\n\n### Genetic Engineering and Biotechnology\n\nGenetic engineering involves the direct manipulation of an organism's DNA to introduce desirable traits or study gene function, revolutionizing biotechnology by enabling precise alterations for applications in medicine, agriculture, and research. This field emerged in the 1970s with the development of recombinant DNA technology and has advanced rapidly with tools like CRISPR-Cas9, allowing targeted modifications without relying on traditional breeding methods. These techniques have led to breakthroughs such as therapeutic gene delivery and pest-resistant crops, transforming how genetic information is harnessed for practical benefits.\n\nRecombinant DNA technology, pioneered in the early 1970s, allows the creation of novel DNA molecules by combining genetic material from different sources. The process begins with restriction enzymes, which are bacterial proteins that recognize and cleave DNA at specific sequences, generating \"sticky ends\" for precise joining. A gene of interest is isolated and inserted into a vector, typically a plasmid—a small, circular DNA molecule that can replicate independently in host cells like *Escherichia coli*. The cloning steps include: cutting both the insert DNA and plasmid with the same restriction enzyme, ligating the fragments using DNA ligase to form a recombinant plasmid, transforming the plasmid into bacterial cells via heat shock or electroporation, and selecting successful clones through antibiotic resistance markers on the plasmid. This method enabled the first production of human insulin in bacteria, marking a milestone in biotechnology.\n\nCRISPR-Cas9, derived from bacterial adaptive immunity, provides a versatile tool for genome editing by targeting and cleaving specific DNA sequences. The system uses a guide RNA (gRNA), a synthetic single-stranded RNA that hybridizes to the target DNA via complementary base pairing, directing the Cas9 nuclease—a RNA-guided endonuclease—to induce a double-strand break at the precise location. Cellular repair mechanisms, such as non-homologous end joining or homology-directed repair, then introduce insertions, deletions, or replacements at the site, enabling gene knockout or correction. Variants like Cas12 (also known as Cpf1) offer advantages for diagnostics; it processes its own CRISPR RNAs and creates staggered cuts, facilitating detection of nucleic acids in assays like DETECTR for rapid pathogen identification without amplification.01200-3)\n\nGene therapy employs genetic engineering to treat diseases by delivering functional DNA to correct genetic defects, often using adeno-associated virus (AAV) vectors due to their low immunogenicity and ability to transduce non-dividing cells. AAV vectors encapsulate therapeutic DNA, such as a corrected gene copy, and deliver it to target tissues via intravenous infusion, where it integrates or persists episomally to produce the missing protein. A landmark example is Zolgensma (onasemnogene abeparvovec), an AAV9-based therapy approved by the FDA in 2019 for children under two years with spinal muscular atrophy (SMA), a condition caused by mutations in the *SMN1* gene; a single dose delivers a functional *SMN1* copy, significantly improving motor function and survival rates in clinical trials.\n\nGenetically modified organisms (GMOs) in agriculture incorporate engineered DNA to enhance traits like pest resistance, with Bt crops serving as a primary example. Bt crops, such as corn and cotton, express Cry proteins from the bacterium *Bacillus thuringiensis*, encoded by inserted genes under plant promoters; these proteins bind to insect midgut receptors, forming pores that disrupt digestion and kill target pests like the European corn borer. First commercialized in the mid-1990s, Bt crops have reduced insecticide applications by up to 37% globally while increasing yields, demonstrating the agricultural impact of recombinant DNA.\n\nAs of 2025, advances in base editing enable precise single-letter changes in DNA without double-strand breaks, expanding therapeutic potential. Developed by fusing a catalytically inactive Cas9 (dCas9) or nickase Cas9 with a base-modifying enzyme, such as cytidine deaminase for C-to-T conversions or adenine deaminase for A-to-G, base editors chemically alter one base pair while the gRNA directs specificity, minimizing off-target effects. This technology, recognized with the 2025 Breakthrough Prize, has progressed to clinical trials for conditions like sickle cell disease. Complementing this, synthetic genomes like JCVI-syn3.0 represent efforts to design minimal cells with reduced gene sets for fundamental biology and bioengineering; this 2016 construct, with 473 essential genes in a 531 kb genome, has informed ongoing refinements, including adaptive evolution studies up to 2025 that enhance growth rates and reveal novel gene functions.\n\n### Forensic and Anthropological Uses\n\nDNA profiling, also known as DNA fingerprinting, utilizes short tandem repeat (STR) loci—variable regions of non-coding DNA where short nucleotide sequences repeat multiple times—to identify individuals with high precision in forensic investigations. The Combined DNA Index System (CODIS), maintained by the FBI, employs an expanded panel of 20 core STR loci for generating DNA profiles from crime scene evidence, suspects, and victims. These loci are amplified using polymerase chain reaction (PCR), a technique that exponentially copies targeted DNA segments even from minute or degraded samples, enabling analysis from sources like blood, semen, or touch DNA. With 20 or more STR loci, the random match probability for an individual's full profile is extraordinarily low, approximately 1 in 10^18, making false positives virtually impossible in unrelated populations.\n\nMitochondrial DNA (mtDNA) plays a complementary role in forensics, particularly when nuclear DNA is insufficient, due to its high copy number per cell (hundreds to thousands) and maternal inheritance pattern, which traces lineages exclusively through the mother's side without recombination. Forensic mtDNA analysis focuses on the hypervariable regions (HVR I and HVR II) in the control region of the mitochondrial genome, where mutations accumulate rapidly, allowing differentiation of maternal lineages for identification or exclusion in cases like unidentified remains. These regions are sequenced and compared to databases such as EMPOP, providing ancestry insights alongside individual matching, though with lower discriminatory power than STR profiles due to shared maternal haplotypes within populations.\n\nThe Y-chromosome, inherited solely from father to son in a patrilineal manner, is valuable in forensics for tracing male lineages and identifying suspects in male-specific crimes, such as sexual assaults, through analysis of Y-STR haplotypes or single nucleotide polymorphisms (SNPs). Y-chromosome haplogroups, defined by specific SNP markers, classify paternal lineages into major branches (e.g., R1b in Western Europe), aiding in ancestry inference and kinship testing without the need for recombination considerations. In anthropological contexts, ancient DNA (aDNA) extraction from fossils involves silica-based methods to isolate degraded genetic material from bone or tooth powder, often using dedicated clean rooms to minimize contamination, enabling Y-chromosome analysis of prehistoric male remains. For instance, protocols employing magnetic particles or spin columns recover ultrashort DNA fragments (25-35 base pairs) from Pleistocene-era samples, revealing patrilineal continuity or migrations in human populations.\n\nIn anthropology, DNA evidence supports the Out-of-Africa model, positing that modern humans (Homo sapiens) originated in Africa around 200,000-300,000 years ago and migrated globally starting approximately 60,000-70,000 years ago, as traced by the distribution of mtDNA macrohaplogroup L3 (ancestral to non-African lineages M and N) and Y-chromosome haplogroup CT (ancestor to non-African DE and CF groups). Haplogroup migrations, such as the spread of Y-haplogroup E from East Africa and mtDNA haplogroup M along coastal routes, illustrate serial founder effects and bottlenecks during dispersals into Eurasia and beyond. Ancient DNA studies further illuminate interbreeding events, showing that non-African populations carry approximately 1-2% Neanderthal admixture from encounters in Eurasia 50,000-60,000 years ago, absent or minimal in sub-Saharan Africans, as quantified in genome-wide comparisons.\n\nRecent advances in 2022 have pushed the boundaries of aDNA recovery, with environmental DNA extracted from 2-million-year-old permafrost sediments in Greenland revealing an ancient Arctic ecosystem of mastodons, hares, and poplar trees, providing indirect context for early hominin habitats during Pliocene-Pleistocene transitions, though direct hominin sequences remain limited to younger samples. These findings, achieved through shotgun sequencing of fragmented DNA, underscore the potential for tracing hominin evolution via associated faunal and floral genetics in ultra-ancient deposits. The high fidelity of DNA replication, which minimizes mutations during transmission, underpins the reliability of such profiles in both modern forensics and paleogenomic reconstructions.\n\n### Emerging Technologies\n\nDNA nanotechnology harnesses the programmable self-assembly properties of DNA to construct nanoscale structures with precise geometries. Pioneered by Nadrian Seeman in the 1980s, this field utilizes DNA tile assemblies—rigid motifs formed by Watson-Crick base pairing—as building blocks to create periodic lattices and complex patterns, enabling applications in materials science and biomedicine.00273-4.pdf) A key advancement is DNA origami, introduced by Paul Rothemund in 2006, which folds a long single-stranded DNA scaffold into custom two- and three-dimensional shapes using short staple strands, achieving resolutions down to 5 nanometers. These structures have been adapted for drug delivery, where origami-based nanocages encapsulate chemotherapeutic agents like doxorubicin and release them in response to cellular triggers such as pH changes or enzyme activity, enhancing targeted therapy while minimizing off-target effects in cancer treatment.\n\nDNA computing leverages the massive parallelism of molecular interactions to solve computational problems intractable for traditional silicon-based systems. In a seminal 1994 experiment, Leonard Adleman demonstrated the feasibility of this approach by encoding a small directed graph into DNA strands and using hybridization, separation, and amplification to find a Hamiltonian path—a solution to an NP-complete problem—illustrating how DNA can perform exhaustive searches via biochemical reactions. Subsequent developments have extended this to logic gates and circuits based on strand displacement, where input strands trigger conformational changes to propagate signals, though scalability remains limited by error rates in synthesis and readout.\n\nDNA-based information storage exploits the polymer's extraordinary density and stability for archival data preservation, far surpassing magnetic or optical media. Theoretically, DNA can achieve a storage density of approximately 10^18 bytes per cubic millimeter, with each base pair encoding two bits of information in a compact helical structure that resists degradation for thousands of years under proper conditions. In practice, binary data is converted to nucleotide sequences (A, C, G, T), synthesized into DNA oligomers, and stored in solution or dried form; retrieval involves PCR amplification, sequencing, and decoding. Microsoft's research has demonstrated encoding and retrieving data in synthetic DNA, incorporating error correction through redundancy and parity codes to mitigate synthesis errors up to 1 in 100 bases.\n\nCatalytic DNA, or deoxyribozymes (DNAzymes), represents an emerging class of synthetic enzymes with applications in biosensing and therapeutics. Unlike natural ribozymes (RNA catalysts), DNAzymes are selected in vitro for activities such as RNA cleavage, where a single-stranded DNA motif binds a substrate and cleaves phosphodiester bonds in the presence of cofactors like metal ions, achieving rate enhancements of up to 10^6-fold over uncatalyzed reactions. For instance, the 10-23 DNAzyme efficiently cleaves specific RNA targets, enabling designs for gene silencing or detection of nucleic acid biomarkers in diagnostic assays.\n\nIntegration of bioinformatics tools has accelerated the design and analysis of DNA-based technologies. The Basic Local Alignment Search Tool (BLAST), developed by NCBI, performs rapid sequence alignments to identify homologous DNA regions, facilitating the optimization of nanostructures by screening for unintended hybridizations or evolutionary patterns in catalytic motifs. Recent advances in artificial intelligence, such as AlphaFold 3 released in 2024, enable predictive modeling of DNA and RNA structures, including interactions with proteins or ligands, by learning from vast crystallographic datasets to forecast folding energies and 3D conformations with near-atomic accuracy.\n\nAs of 2025, innovations in DNA hybrids and retrieval methods are pushing practical viability. Quantum dot-DNA conjugates, where semiconductor nanocrystals are templated onto DNA scaffolds, serve as ultrasensitive sensors for detecting biomolecules; for example, CdSe/ZnS quantum dots linked to DNA aptamers exhibit fluorescence quenching upon target binding, enabling single-molecule resolution in physiological conditions. Concurrently, scalable DNA data retrieval has advanced through AI-optimized decoding algorithms that accelerate readout speeds by over 3,000-fold, alongside enzymatic methods like DNA StairLoop for high-fidelity error correction during random access, addressing bottlenecks in large-scale archival systems.\n\n## History of Discovery\n\n### Early Observations\n\nIn 1869, Swiss biochemist Friedrich Miescher isolated a phosphorus-rich substance he termed \"nuclein\" from the nuclei of white blood cells extracted from pus on discarded surgical bandages. This marked the first identification of what is now known as DNA, though Miescher recognized its distinct chemical properties, including resistance to pepsin digestion and high phosphorus content, setting it apart from typical proteins.\n\nBuilding on Miescher's work in the 1870s, German biochemist Albrecht Kossel analyzed nuclein from various tissues and identified its key nitrogenous bases, including adenine in 1885 and guanine in 1891. Kossel's isolation of these purine bases, along with pyrimidines like cytosine (1894) and thymine (1893), provided the foundational chemical components of nucleic acids, earning him the 1910 Nobel Prize in Physiology or Medicine for contributions to understanding cell chemistry.\n\nIn the early 1900s, Russian-American biochemist Phoebus Levene advanced nucleic acid research by elucidating their structure as polymers of nucleotides, each comprising a sugar, phosphate, and base. He proposed the tetranucleotide hypothesis around 1909–1910, positing that DNA consisted of a simple, repeating tetramer of the four nucleotides (one each of adenine, guanine, cytosine, and thymine derivatives) in a fixed ABCD sequence, implying limited informational complexity. This model, refined through Levene's extensive hydrolysis studies at the Rockefeller Institute, persisted for decades despite evidence of variable base compositions across species.\n\nEarly microscopic techniques in the 1920s further localized nuclein to the nucleus; the Feulgen stain, developed by Robert Feulgen in 1924, used acid hydrolysis to depurinate DNA followed by Schiff's reagent, producing a magenta color specifically in chromosomal material. This histochemical method confirmed DNA's concentration in cell nuclei and its association with chromatin, supporting its nuclear role while distinguishing it from cytoplasmic components.\n\nPre-1940s debates on heredity centered on whether nuclein or proteins served as the genetic material, with many researchers favoring proteins for their greater structural diversity and apparent capacity to encode information, especially given the tetranucleotide hypothesis's portrayal of DNA as chemically uniform and unlikely to vary sufficiently for inheritance. Experiments showing constant DNA amounts per cell type, contrasted with variable protein profiles, reinforced skepticism about DNA's hereditary function until transforming principle studies began shifting views.\n\n### Structural Elucidation\n\nBuilding on Frederick Griffith's 1928 discovery of bacterial transformation in non-virulent and virulent strains of Streptococcus pneumoniae, in 1944 Oswald Avery, Colin MacLeod, and Maclyn McCarty conducted experiments demonstrating that DNA is the transforming principle responsible for genetic inheritance in bacteria. They isolated a purified DNA fraction from virulent Streptococcus pneumoniae type III and showed that it could transform non-virulent type II bacteria into the virulent form, even after treatment with enzymes that degraded proteins, RNA, or polysaccharides, but not DNA. This work provided the first direct evidence that DNA, rather than proteins, carries genetic information.\n\nBuilding on this foundation, Alfred Hershey and Martha Chase performed the \"blender experiment\" in 1952 to confirm DNA as the genetic material in bacteriophages. They labeled phage DNA with radioactive phosphorus-32 and phage proteins with sulfur-35, then allowed infection of Escherichia coli bacteria. After agitation in a blender to separate phage coats from bacteria, they found that only the phosphorus-labeled DNA entered the cells and directed viral replication, while sulfur-labeled proteins remained outside. This conclusively showed that DNA is the hereditary substance transmitted during viral infection.\n\nAdditionally, Erwin Chargaff's analyses from 1949 to 1951 revealed that in DNA samples from various organisms, the amount of adenine equals thymine and guanine equals cytosine, providing essential data on base composition that informed pairing rules.61522-8/fulltext)\n\nThe structural model of DNA emerged in 1953 through the collaborative efforts of James Watson, Francis Crick, Maurice Wilkins, and Rosalind Franklin. Watson and Crick proposed the double helix structure based on X-ray diffraction data, particularly Franklin's seminal \"Photo 51,\" which revealed the molecule's helical nature with a pitch of 3.4 nm and repeating units every 0.34 nm, as well as Chargaff's base ratios. Their model described two anti-parallel polynucleotide chains wound around a common axis, stabilized by hydrogen bonds between complementary base pairs: adenine with thymine and guanine with cytosine. This base-pairing rule explained DNA's ability to store and replicate genetic information. Franklin's precise diffraction patterns from hydrated and dehydrated DNA fibers were crucial, though she received limited recognition at the time.\n\nFollowing the double helix proposal, Matthew Meselson and Franklin Stahl's 1958 experiment verified semi-conservative DNA replication. Using density-gradient centrifugation, they grew E. coli in a medium containing heavy nitrogen-15 to label parental DNA strands, then switched to light nitrogen-14. After one generation, all DNA had intermediate density, indicating each daughter molecule contained one old and one new strand; after two generations, half was intermediate and half light, ruling out conservative or dispersive models. This confirmed Watson and Crick's prediction that replication unwinds the helix, with each strand serving as a template for a new complementary strand.\n\nIn 1964, Robin Holliday introduced a model for genetic recombination that integrated strand breakage, hybrid DNA formation, and resolution into a single framework. The Holliday model posits that recombination begins with single-strand nicks at homologous sites on two DNA duplexes, allowing strand invasion and ligation to form a cross-shaped \"Holliday junction.\" Branch migration extends heteroduplex regions, and resolution of the junction by cuts in either plane yields either crossover or non-crossover products, explaining gene conversion and crossing over observed in fungi and other organisms. This model laid the groundwork for understanding meiotic recombination mechanisms.\n\nThe 1980s marked a leap in DNA manipulation with Kary Mullis's invention of the polymerase chain reaction (PCR) in 1983. PCR enables exponential amplification of specific DNA segments through repeated cycles of denaturation, primer annealing, and extension using a thermostable DNA polymerase like Taq from Thermus aquaticus. Mullis's innovation, detailed in early publications and patented in 1987, revolutionized molecular biology by allowing rapid copying of minute DNA samples without cloning. For this breakthrough, Mullis shared the 1993 Nobel Prize in Chemistry.\n\nInitiated on October 1, 1990, by the U.S. Department of Energy and National Institutes of Health, the Human Genome Project aimed to sequence the entire human genome and map its genes. This international effort, involving collaborators from multiple countries, set milestones for generating physical and genetic maps, developing sequencing technologies, and analyzing ethical implications, ultimately completing a draft sequence in 2000 and a finished version in 2003. The project accelerated genomics by establishing public databases and tools for studying DNA structure and function.",
  "external_references": [
    {
      "text": "Deoxyribonucleic Acid Fact Sheet",
      "url": "https://www.genome.gov/about-genomics/fact-sheets/Deoxyribonucleic-Acid-Fact-Sheet",
      "domain": "genome.gov",
      "type": "citation"
    },
    {
      "text": "Nbk26821",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK26821/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "171737a0",
      "url": "https://www.nature.com/articles/171737a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc6822018",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6822018/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nitrogenous Base",
      "url": "https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/nitrogenous-base",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Adenine",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/Adenine",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Guanine",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/Guanine",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Cytosine",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/Cytosine",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Thymine",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/Thymine",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "5 Methylcytosine",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/5-Methylcytosine",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6305559",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6305559/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Hypoxanthine",
      "url": "https://pubchem.ncbi.nlm.nih.gov/compound/Hypoxanthine",
      "domain": "pubchem.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5623627",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5623627/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pka Compilation Williams.pdf",
      "url": "https://organicchemistrydata.org/hansreich/resources/pka/pka_data/pka-compilation-williams.pdf",
      "domain": "organicchemistrydata.org",
      "type": "citation"
    },
    {
      "text": "Ultraviolet Absorbance Of Oligonucleotides",
      "url": "https://atdbio.com/nucleic-acids-book/Ultraviolet-absorbance-of-oligonucleotides",
      "domain": "atdbio.com",
      "type": "citation"
    },
    {
      "text": "5040245",
      "url": "https://pubmed.ncbi.nlm.nih.gov/5040245/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2175026",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2175026/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "18107444",
      "url": "https://pubmed.ncbi.nlm.nih.gov/18107444/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1670",
      "url": "https://jnm.snmjournals.org/content/42/11/1670",
      "domain": "jnm.snmjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc6467422",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6467422/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "B Dna",
      "url": "https://www.sciencedirect.com/topics/agricultural-and-biological-sciences/b-dna",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Nbk538241",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK538241/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2793086",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2793086/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2853108",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2853108/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5425793",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5425793/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk6545",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK6545/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5371509",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5371509/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk26834",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK26834/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "324385a0",
      "url": "https://www.nature.com/articles/324385a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 020 15242 8",
      "url": "https://www.nature.com/articles/s41467-020-15242-8",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41557 021 00736 9",
      "url": "https://www.nature.com/articles/s41557-021-00736-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Ncomms2792",
      "url": "https://www.nature.com/articles/ncomms2792",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 023 43558 8",
      "url": "https://www.nature.com/articles/s41467-023-43558-8",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 017 02014 0",
      "url": "https://www.nature.com/articles/s41467-017-02014-0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 024 48408 9",
      "url": "https://www.nature.com/articles/s41467-024-48408-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 023 43735 9",
      "url": "https://www.nature.com/articles/s41467-023-43735-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41392 021 00648 7",
      "url": "https://www.nature.com/articles/s41392-021-00648-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Bit.27911",
      "url": "https://analyticalsciencejournals.onlinelibrary.wiley.com/doi/10.1002/bit.27911",
      "domain": "analyticalsciencejournals.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc11546248",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11546248/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S12276 022 00822 Z",
      "url": "https://www.nature.com/articles/s12276-022-00822-z",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Nat.2014.0506",
      "url": "https://www.liebertpub.com/doi/10.1089/nat.2014.0506",
      "domain": "liebertpub.com",
      "type": "citation"
    },
    {
      "text": "38686348",
      "url": "https://pubmed.ncbi.nlm.nih.gov/38686348/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41392 024 01933 X",
      "url": "https://www.nature.com/articles/s41392-024-01933-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc1831843",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1831843/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S42003 024 07211 4",
      "url": "https://www.nature.com/articles/s42003-024-07211-4",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc4598263",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4598263/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.262672799",
      "url": "https://www.pnas.org/doi/10.1073/pnas.262672799",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S41467 023 42072 1",
      "url": "https://www.nature.com/articles/s41467-023-42072-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0955067418301881",
      "url": "https://www.sciencedirect.com/science/article/pii/S0955067418301881",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc12423499",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12423499/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "The Structure And Function Of Chromatin",
      "url": "https://www.creative-diagnostics.com/blog/index.php/the-structure-and-function-of-chromatin/",
      "domain": "creative-diagnostics.com",
      "type": "citation"
    },
    {
      "text": "Pmc11473595",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11473595/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Emm201711",
      "url": "https://www.nature.com/articles/emm201711",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Embr.201540945",
      "url": "https://www.embopress.org/doi/10.15252/embr.201540945",
      "domain": "embopress.org",
      "type": "citation"
    },
    {
      "text": "Science.aaj2114",
      "url": "https://www.science.org/doi/10.1126/science.aaj2114",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S2001037024004392",
      "url": "https://www.sciencedirect.com/science/article/pii/S2001037024004392",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S41467 024 48593 7",
      "url": "https://www.nature.com/articles/s41467-024-48593-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Cg Modeling Of Nucleosome Arrays Reveals The Salt",
      "url": "https://pubs.aip.org/aip/jcp/article/162/2/024101/3329529/CG-modeling-of-nucleosome-arrays-reveals-the-salt",
      "domain": "pubs.aip.org",
      "type": "citation"
    },
    {
      "text": "7933606",
      "url": "https://academic.oup.com/nar/article/53/4/gkae1267/7933606",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Nbk21120",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK21120/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gcf 000001405.40",
      "url": "https://www.ncbi.nlm.nih.gov/datasets/genome/GCF_000001405.40/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "How Many Genes Are In The Human Genome 71673",
      "url": "https://www.the-scientist.com/how-many-genes-are-in-the-human-genome-71673",
      "domain": "the-scientist.com",
      "type": "citation"
    },
    {
      "text": "Open Reading Frame",
      "url": "https://www.genome.gov/genetics-glossary/Open-Reading-Frame",
      "domain": "genome.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10112331",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10112331/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3078729",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3078729/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Jb.172.8.4705 4707.1990",
      "url": "https://journals.asm.org/doi/10.1128/jb.172.8.4705-4707.1990",
      "domain": "journals.asm.org",
      "type": "citation"
    },
    {
      "text": "S2589 0042%2824%2901111 8",
      "url": "https://www.cell.com/iscience/fulltext/S2589-0042%2824%2901111-8",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Pnas.1814777116",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1814777116",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Science.169.3948.882",
      "url": "https://www.science.org/doi/10.1126/science.169.3948.882",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "224234a0",
      "url": "https://www.nature.com/articles/224234a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/molecular-biosciences/articles/10.3389/fmolb.2021.681550/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Translation Dna To Mrna To Protein 393",
      "url": "https://www.nature.com/scitable/topicpage/translation-dna-to-mrna-to-protein-393/",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pnas.74.8.3171",
      "url": "https://www.pnas.org/doi/10.1073/pnas.74.8.3171",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "227561a0",
      "url": "https://www.nature.com/articles/227561a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pnas.0700800104",
      "url": "https://www.pnas.org/doi/10.1073/pnas.0700800104",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Nirenberg Lecture.pdf",
      "url": "https://www.nobelprize.org/uploads/2018/06/nirenberg-lecture.pdf",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "6277502",
      "url": "https://pubmed.ncbi.nlm.nih.gov/6277502/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8119328",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8119328/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41580 020 00315 9",
      "url": "https://www.nature.com/articles/s41580-020-00315-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pnas.76.2.580",
      "url": "https://www.pnas.org/doi/10.1073/pnas.76.2.580",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc3033576",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3033576/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6817399",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6817399/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5055853",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5055853/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gb 2000 1 1 Reviews001",
      "url": "https://genomebiology.biomedcentral.com/articles/10.1186/gb-2000-1-1-reviews001",
      "domain": "genomebiology.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pnas.0904309106",
      "url": "https://www.pnas.org/doi/10.1073/pnas.0904309106",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc47589",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC47589/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Science.2028256",
      "url": "https://www.science.org/doi/10.1126/science.2028256",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Pnas.1410569111",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1410569111",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "17.12.3342",
      "url": "https://www.embopress.org/doi/10.1093/emboj/17.12.3342",
      "domain": "embopress.org",
      "type": "citation"
    },
    {
      "text": "Pnas.0409387102",
      "url": "https://www.pnas.org/doi/10.1073/pnas.0409387102",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc1934558",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1934558/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41586 024 07487 W",
      "url": "https://www.nature.com/articles/s41586-024-07487-w",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "9210460",
      "url": "https://pubmed.ncbi.nlm.nih.gov/9210460/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc55916",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC55916/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "11809771",
      "url": "https://pubmed.ncbi.nlm.nih.gov/11809771/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc139351",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC139351/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc316708",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC316708/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8748870",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8748870/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2730144",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2730144/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3639319",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3639319/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2765039",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2765039/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk19424",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK19424/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3290774",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3290774/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12369570",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12369570/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Acssynbio.7b00308",
      "url": "https://pubs.acs.org/doi/10.1021/acssynbio.7b00308",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "Pmc3758668",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3758668/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1226024",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1226024/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41551 024 01227 1",
      "url": "https://www.nature.com/articles/s41551-024-01227-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Science.ado3979",
      "url": "https://www.science.org/doi/10.1126/science.ado3979",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S12862 015 0548 1",
      "url": "https://bmcecolevol.biomedcentral.com/articles/10.1186/s12862-015-0548-1",
      "domain": "bmcecolevol.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pnas.111005198",
      "url": "https://www.pnas.org/doi/10.1073/pnas.111005198",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S0300908405000921",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0300908405000921",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "All Life On Earth Today Descended From A Single Cell Meet Luca 20241120",
      "url": "https://www.quantamagazine.org/all-life-on-earth-today-descended-from-a-single-cell-meet-luca-20241120/",
      "domain": "quantamagazine.org",
      "type": "citation"
    },
    {
      "text": "Pnas.1919860117",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1919860117",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S41467 019 11433 0",
      "url": "https://www.nature.com/articles/s41467-019-11433-0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc5972412",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5972412/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4817804",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4817804/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.2119010119",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2119010119",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Sciadv.adj4493",
      "url": "https://www.science.org/doi/10.1126/sciadv.adj4493",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Pmc3428767",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3428767/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41559 025 02882 6",
      "url": "https://www.nature.com/articles/s41559-025-02882-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Fda Approves Innovative Gene Therapy Treat Pediatric Patients Spinal Muscular Atrophy Rare Disease",
      "url": "https://www.fda.gov/news-events/press-announcements/fda-approves-innovative-gene-therapy-treat-pediatric-patients-spinal-muscular-atrophy-rare-disease",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7444828",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7444828/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Codis And Ndis Fact Sheet",
      "url": "https://www.fbi.gov/how-we-can-help-you/dna-fingerprint-act-of-2005-expungement-policy/codis-and-ndis-fact-sheet",
      "domain": "fbi.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11049589",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11049589/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Str Analysis Explained",
      "url": "https://www.ande.com/str-analysis-explained",
      "domain": "ande.com",
      "type": "citation"
    },
    {
      "text": "Pmc8457767",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8457767/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Howismitochondrialdnatypingusedinforensicscience.pdf",
      "url": "https://ww2.jacksonms.gov/fulldisplay/qIWc39/7OK144/HowIsMitochondrialDnaTypingUsedInForensicScience.pdf",
      "domain": "ww2.jacksonms.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5418305",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5418305/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "898",
      "url": "https://www.mdpi.com/2073-4425/13/5/898",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "S41596 018 0050 5.pdf",
      "url": "https://reich.hms.harvard.edu/sites/reich.hms.harvard.edu/files/inline-files/s41596-018-0050-5.pdf",
      "domain": "reich.hms.harvard.edu",
      "type": "citation"
    },
    {
      "text": "S41586 023 06035 2",
      "url": "https://www.nature.com/articles/s41586-023-06035-2",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc3267120",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3267120/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Srep26565",
      "url": "https://www.nature.com/articles/srep26565",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Worlds Oldest Dna Represents Two Million Year Old Ecosystem.html",
      "url": "https://www.nhm.ac.uk/discover/news/2022/december/worlds-oldest-dna-represents-two-million-year-old-ecosystem.html",
      "domain": "nhm.ac.uk",
      "type": "citation"
    },
    {
      "text": "Worlds Oldest Dna Greenland Ecosystem",
      "url": "https://www.livescience.com/worlds-oldest-dna-greenland-ecosystem",
      "domain": "livescience.com",
      "type": "citation"
    },
    {
      "text": "Nbt1199supp1 11",
      "url": "https://www.nature.com/articles/nbt1199supp1_11",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc10440542",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10440542/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Science.7973651",
      "url": "https://www.science.org/doi/10.1126/science.7973651",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Ncomms2965",
      "url": "https://www.nature.com/articles/ncomms2965",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Dna Storage",
      "url": "https://www.microsoft.com/en-us/research/project/dna-storage/",
      "domain": "microsoft.com",
      "type": "citation"
    },
    {
      "text": "The Dna Data Storage Model",
      "url": "https://www.microsoft.com/en-us/research/publication/the-dna-data-storage-model/",
      "domain": "microsoft.com",
      "type": "citation"
    },
    {
      "text": "Pmc4930396",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4930396/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S42004 023 00924 3",
      "url": "https://www.nature.com/articles/s42004-023-00924-3",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Blast.cgi",
      "url": "https://blast.ncbi.nlm.nih.gov/Blast.cgi",
      "domain": "blast.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Google Deepmind Isomorphic Alphafold 3 Ai Model",
      "url": "https://blog.google/technology/ai/google-deepmind-isomorphic-alphafold-3-ai-model/",
      "domain": "blog.google",
      "type": "citation"
    },
    {
      "text": "40460458",
      "url": "https://pubmed.ncbi.nlm.nih.gov/40460458/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2025 03 Dna Storage Ai Method.html",
      "url": "https://techxplore.com/news/2025-03-dna-storage-ai-method.html",
      "domain": "techxplore.com",
      "type": "citation"
    },
    {
      "text": "S41467 025 64230 3",
      "url": "https://www.nature.com/articles/s41467-025-64230-3",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc7268995",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7268995/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0012160604008231",
      "url": "https://www.sciencedirect.com/science/article/pii/S0012160604008231",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Detail.php",
      "url": "https://historyofinformation.com/detail.php?id=3947",
      "domain": "historyofinformation.com",
      "type": "citation"
    },
    {
      "text": "Lecture",
      "url": "https://www.nobelprize.org/prizes/medicine/1910/kossel/lecture/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Pmc6378961",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6378961/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "225199302 The Tetranucleotide Hypothesis A Centennial",
      "url": "https://www.researchgate.net/publication/225199302_The_tetranucleotide_hypothesis_A_centennial",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Pmc11227455",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11227455/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk595925",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK595925/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc214882",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC214882/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc107887",
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC107887/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0021 9258(20",
      "url": "https://www.jbc.org/article/S0021-9258(20",
      "domain": "jbc.org",
      "type": "citation"
    },
    {
      "text": "Pnas.44.10.671",
      "url": "https://www.pnas.org/doi/10.1073/pnas.44.10.671",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "1",
      "url": "https://www.genetics.org/content/46/1/1",
      "domain": "genetics.org",
      "type": "citation"
    },
    {
      "text": "Lecture",
      "url": "https://www.nobelprize.org/prizes/chemistry/1993/mullis/lecture/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Human Genome Project",
      "url": "https://www.genome.gov/about-genomics/educational-resources/fact-sheets/human-genome-project",
      "domain": "genome.gov",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "polymer",
      "page": "Polymer"
    },
    {
      "text": "organisms",
      "page": "Organism"
    },
    {
      "text": "nucleotide",
      "page": "Nucleotide"
    },
    {
      "text": "heredity",
      "page": "Heredity"
    },
    {
      "text": "phosphate",
      "page": "Phosphate"
    },
    {
      "text": "deoxyribose",
      "page": "Deoxyribose"
    },
    {
      "text": "adenine",
      "page": "Adenine"
    },
    {
      "text": "thymine",
      "page": "Thymine"
    },
    {
      "text": "guanine",
      "page": "Guanine"
    },
    {
      "text": "cytosine",
      "page": "Cytosine"
    },
    {
      "text": "hydrogen",
      "page": "Hydrogen"
    },
    {
      "text": "structure",
      "page": "Structure"
    },
    {
      "text": "deoxyribonucleic acid (DNA)",
      "page": "DNA"
    },
    {
      "text": "5-methylcytosine",
      "page": "5-Methylcytosine"
    },
    {
      "text": "methylation",
      "page": "Methylation"
    },
    {
      "text": "gene expression",
      "page": "Gene_expression"
    },
    {
      "text": "chromatin",
      "page": "Chromatin"
    },
    {
      "text": "deamination",
      "page": "Deamination"
    },
    {
      "text": "bisulfite sequencing",
      "page": "Bisulfite_sequencing"
    },
    {
      "text": "mass spectrometry",
      "page": "Mass_spectrometry"
    },
    {
      "text": "deprotonation",
      "page": "Deprotonation"
    },
    {
      "text": "pKa",
      "page": "PKA"
    },
    {
      "text": "ionization",
      "page": "Ionization"
    },
    {
      "text": "pH",
      "page": "PH"
    },
    {
      "text": "ultraviolet",
      "page": "Ultraviolet"
    },
    {
      "text": "diameter",
      "page": "Diameter"
    },
    {
      "text": "nm",
      "page": "Nm"
    },
    {
      "text": "base pair",
      "page": "Base_pair"
    },
    {
      "text": "X-ray",
      "page": "X-ray"
    },
    {
      "text": "hydrogen bond",
      "page": "Hydrogen_bond"
    },
    {
      "text": "temperature",
      "page": "Temperature"
    },
    {
      "text": "oligonucleotides",
      "page": "Oligonucleotide"
    },
    {
      "text": "GC",
      "page": "GC"
    },
    {
      "text": "double helix",
      "page": "The_Double_Helix"
    },
    {
      "text": "base",
      "page": "Base"
    },
    {
      "text": "helix",
      "page": "Helix"
    },
    {
      "text": "twist",
      "page": "Twist"
    },
    {
      "text": "linking number",
      "page": "Linking_number"
    },
    {
      "text": "projection",
      "page": "Projection"
    },
    {
      "text": "axis",
      "page": "Axis"
    },
    {
      "text": "CTCF",
      "page": "CTCF"
    },
    {
      "text": "cohesin",
      "page": "Cohesin"
    },
    {
      "text": "human",
      "page": "Human"
    },
    {
      "text": "genome",
      "page": "Genome"
    },
    {
      "text": "cell",
      "page": "Cell"
    },
    {
      "text": "nucleus",
      "page": "Nucleus"
    },
    {
      "text": "A-DNA",
      "page": "A-DNA"
    },
    {
      "text": "dehydration",
      "page": "Dehydration"
    },
    {
      "text": "water activity",
      "page": "Water_activity"
    },
    {
      "text": "Z-DNA",
      "page": "Z-DNA"
    },
    {
      "text": "zigzag",
      "page": "Zigzag"
    },
    {
      "text": "syn",
      "page": "The_Syn"
    },
    {
      "text": "anti",
      "page": "Anti"
    },
    {
      "text": "potassium",
      "page": "Potassium"
    },
    {
      "text": "threose nucleic acid",
      "page": "TNA"
    },
    {
      "text": "nuclease",
      "page": "Nuclease"
    },
    {
      "text": "AEGIS",
      "page": "Aegis"
    },
    {
      "text": "in vitro",
      "page": "In_vitro"
    },
    {
      "text": "hydrolysis",
      "page": "Hydrolysis"
    },
    {
      "text": "stress",
      "page": "Stress"
    },
    {
      "text": "methyl group",
      "page": "Methyl_group"
    },
    {
      "text": "DNMT1",
      "page": "DNMT1"
    },
    {
      "text": "DNA replication",
      "page": "DNA_replication"
    },
    {
      "text": "5-hydroxymethylcytosine",
      "page": "5-Hydroxymethylcytosine"
    },
    {
      "text": "TET",
      "page": "Tet"
    },
    {
      "text": "histone",
      "page": "Histone"
    },
    {
      "text": "acetylation",
      "page": "Acetylation"
    },
    {
      "text": "8-oxoguanine",
      "page": "8-Oxoguanine"
    },
    {
      "text": "reactive oxygen species",
      "page": "Reactive_oxygen_species"
    },
    {
      "text": "lesion",
      "page": "Lesion"
    },
    {
      "text": "mutagenesis",
      "page": "Mutagenesis"
    },
    {
      "text": "biomarker",
      "page": "Biomarker"
    },
    {
      "text": "oxidative stress",
      "page": "Oxidative_stress"
    },
    {
      "text": "phosphodiester bond",
      "page": "Phosphodiester_bond"
    },
    {
      "text": "sulfur",
      "page": "Sulfur"
    },
    {
      "text": "pharmacokinetics",
      "page": "Pharmacokinetics"
    },
    {
      "text": "mutations",
      "page": "The_Mutations"
    },
    {
      "text": "pyrimidine dimers",
      "page": "Pyrimidine_dimer"
    },
    {
      "text": "Ionizing radiation",
      "page": "Ionizing_radiation"
    },
    {
      "text": "Base excision repair",
      "page": "Base_excision_repair"
    },
    {
      "text": "DNA glycosylases",
      "page": "DNA_glycosylase"
    },
    {
      "text": "AP",
      "page": "AP"
    },
    {
      "text": "DNA polymerase",
      "page": "DNA_polymerase"
    },
    {
      "text": "RNA polymerase",
      "page": "RNA_polymerase"
    },
    {
      "text": "non-homologous end joining",
      "page": "Non-homologous_end_joining"
    },
    {
      "text": "homologous recombination",
      "page": "Homologous_recombination"
    },
    {
      "text": "cell cycle",
      "page": "Cell_cycle"
    },
    {
      "text": "DNA-PKcs",
      "page": "DNA-PKcs"
    },
    {
      "text": "chromatid",
      "page": "Chromatid"
    },
    {
      "text": "DNA synthesis",
      "page": "DNA_synthesis"
    },
    {
      "text": "BRCA1",
      "page": "BRCA1"
    },
    {
      "text": "BRCA2",
      "page": "BRCA2"
    },
    {
      "text": "neutrophil extracellular traps",
      "page": "Neutrophil_extracellular_traps"
    },
    {
      "text": "carcinogenesis",
      "page": "Carcinogenesis"
    },
    {
      "text": "apoptosis",
      "page": "Apoptosis"
    },
    {
      "text": "HR",
      "page": "HR"
    },
    {
      "text": "breast",
      "page": "Breast"
    },
    {
      "text": "breast cancer",
      "page": "Breast_cancer"
    },
    {
      "text": "nucleosomes",
      "page": "Nucleosome"
    },
    {
      "text": "histone octamer",
      "page": "Histone_octamer"
    },
    {
      "text": "linker DNA",
      "page": "Linker_DNA"
    },
    {
      "text": "linker histone H1",
      "page": "Histone_H1"
    },
    {
      "text": "solenoid",
      "page": "Solenoid"
    },
    {
      "text": "in vivo",
      "page": "In_vivo"
    },
    {
      "text": "euchromatin",
      "page": "Euchromatin"
    },
    {
      "text": "heterochromatin",
      "page": "Heterochromatin"
    },
    {
      "text": "interphase",
      "page": "Interphase"
    },
    {
      "text": "mitosis",
      "page": "Mitosis"
    },
    {
      "text": "cell division",
      "page": "Cell_division"
    },
    {
      "text": "loop",
      "page": "Loop"
    },
    {
      "text": "condensin",
      "page": "Condensin"
    },
    {
      "text": "histone H3",
      "page": "Histone_H3"
    },
    {
      "text": "lysine",
      "page": "Lysine"
    },
    {
      "text": "H3K9me3",
      "page": "H3K9me3"
    },
    {
      "text": "heterochromatin protein 1",
      "page": "Heterochromatin_protein_1"
    },
    {
      "text": "Hi-C",
      "page": "Hi-C"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "disease",
      "page": "Disease"
    },
    {
      "text": "chromosome",
      "page": "Chromosome"
    },
    {
      "text": "nucleoid",
      "page": "Nucleoid"
    },
    {
      "text": "human genome",
      "page": "Human_genome"
    },
    {
      "text": "gene",
      "page": "Gene"
    },
    {
      "text": "open reading frame",
      "page": "Open_reading_frame"
    },
    {
      "text": "start codon",
      "page": "Start_codon"
    },
    {
      "text": "stop codon",
      "page": "Stop_codon"
    },
    {
      "text": "synthesis",
      "page": "Synthesis"
    },
    {
      "text": "RNA splicing",
      "page": "RNA_splicing"
    },
    {
      "text": "Non-coding DNA",
      "page": "Non-coding_DNA"
    },
    {
      "text": "messenger RNA",
      "page": "Messenger_RNA"
    },
    {
      "text": "RNA polymerase II",
      "page": "RNA_polymerase_II"
    },
    {
      "text": "TATA box",
      "page": "TATA_box"
    },
    {
      "text": "initiation",
      "page": "Initiation"
    },
    {
      "text": "RNA",
      "page": "RNA"
    },
    {
      "text": "coding strand",
      "page": "Coding_strand"
    },
    {
      "text": "sense strand",
      "page": "Sense_strand"
    },
    {
      "text": "Elongation",
      "page": "Elongation"
    },
    {
      "text": "polyadenylation",
      "page": "Polyadenylation"
    },
    {
      "text": "cap",
      "page": "Cap"
    },
    {
      "text": "degradation",
      "page": "Degradation"
    },
    {
      "text": "ribosome",
      "page": "Ribosome"
    },
    {
      "text": "discovery",
      "page": "Discovery"
    },
    {
      "text": "posttranscriptional modification",
      "page": "Post-transcriptional_modification"
    },
    {
      "text": "central dogma of molecular biology",
      "page": "Central_dogma_of_molecular_biology"
    },
    {
      "text": "Francis Crick",
      "page": "Francis_Crick"
    },
    {
      "text": "alternative splicing",
      "page": "Alternative_splicing"
    },
    {
      "text": "exon",
      "page": "Exon"
    },
    {
      "text": "proteome",
      "page": "Proteome"
    },
    {
      "text": "Translation",
      "page": "Translation"
    },
    {
      "text": "AUG",
      "page": "Aug"
    },
    {
      "text": "amino acids",
      "page": "Amino_acid"
    },
    {
      "text": "genetic code",
      "page": "Genetic_code"
    },
    {
      "text": "binding",
      "page": "Binding"
    },
    {
      "text": "Matthew Meselson",
      "page": "Matthew_Meselson"
    },
    {
      "text": "Escherichia coli",
      "page": "Escherichia_coli"
    },
    {
      "text": "nitrogen",
      "page": "Nitrogen"
    },
    {
      "text": "exonuclease",
      "page": "Exonuclease"
    },
    {
      "text": "telomerase",
      "page": "Telomerase"
    },
    {
      "text": "reverse transcriptase",
      "page": "Reverse_transcriptase"
    },
    {
      "text": "telomere",
      "page": "Telomere"
    },
    {
      "text": "enzyme",
      "page": "Enzyme"
    },
    {
      "text": "Tetrahymena",
      "page": "Tetrahymena"
    },
    {
      "text": "S phase",
      "page": "S_phase"
    },
    {
      "text": "division",
      "page": "Division"
    },
    {
      "text": "cycle",
      "page": "Cycle"
    },
    {
      "text": "cell growth",
      "page": "Cell_growth"
    },
    {
      "text": "Mitochondrial DNA",
      "page": "Mitochondrial_DNA"
    },
    {
      "text": "replisome",
      "page": "Replisome"
    },
    {
      "text": "organelle",
      "page": "Organelle"
    },
    {
      "text": "helix-turn-helix",
      "page": "Helix-turn-helix"
    },
    {
      "text": "nucleoprotein",
      "page": "Nucleoprotein"
    },
    {
      "text": "p53",
      "page": "P53"
    },
    {
      "text": "purine",
      "page": "Purine"
    },
    {
      "text": "pyrimidine",
      "page": "Pyrimidine"
    },
    {
      "text": "DNA-binding domain",
      "page": "DNA-binding_domain"
    },
    {
      "text": "lac repressor",
      "page": "Lac_repressor"
    },
    {
      "text": "lac operon",
      "page": "Lac_operon"
    },
    {
      "text": "zinc fingers",
      "page": "zinc_fingers"
    },
    {
      "text": "HTH motifs",
      "page": "HTH_motifs"
    },
    {
      "text": "HMG boxes",
      "page": "HMG_boxes"
    },
    {
      "text": "topoisomerases",
      "page": "Topology"
    },
    {
      "text": "mechanism",
      "page": "Mechanism"
    },
    {
      "text": "AMP",
      "page": "Amp"
    },
    {
      "text": "RecA",
      "page": "RecA"
    },
    {
      "text": "meiosis",
      "page": "Meiosis"
    },
    {
      "text": "segregation",
      "page": "Segregation"
    },
    {
      "text": "exchange",
      "page": "Exchange"
    },
    {
      "text": "spindle",
      "page": "Spindle"
    },
    {
      "text": "genetic variation",
      "page": "Genetic_variation"
    },
    {
      "text": "mobile genetic elements",
      "page": "Mobile_genetic_elements"
    },
    {
      "text": "site-specific recombination",
      "page": "Site-specific_recombination"
    },
    {
      "text": "bacteriophage",
      "page": "Bacteriophage"
    },
    {
      "text": "Cre recombinase",
      "page": "Cre_recombinase"
    },
    {
      "text": "Holliday junction",
      "page": "Holliday_junction"
    },
    {
      "text": "genetic diversity",
      "page": "Genetic_diversity"
    },
    {
      "text": "linkage disequilibrium",
      "page": "Linkage_disequilibrium"
    },
    {
      "text": "evolution",
      "page": "Evolution"
    },
    {
      "text": "kb",
      "page": "KB"
    },
    {
      "text": "species",
      "page": "Species"
    },
    {
      "text": "Earth",
      "page": "Earth"
    },
    {
      "text": "ribose",
      "page": "Ribose"
    },
    {
      "text": "ribonucleotide reductase",
      "page": "Ribonucleotide_reductase"
    },
    {
      "text": "last universal common ancestor",
      "page": "Last_universal_common_ancestor"
    },
    {
      "text": "life",
      "page": "Life"
    },
    {
      "text": "reducing atmosphere",
      "page": "Reducing_atmosphere"
    },
    {
      "text": "nucleic acid",
      "page": "Nucleic_acid"
    },
    {
      "text": "polymerization",
      "page": "Polymerization"
    },
    {
      "text": "pairing",
      "page": "Pairing"
    },
    {
      "text": "Archean",
      "page": "Archean"
    },
    {
      "text": "biotechnology",
      "page": "Biotechnology"
    },
    {
      "text": "medicine",
      "page": "Medicine"
    },
    {
      "text": "agriculture",
      "page": "Agriculture"
    },
    {
      "text": "research",
      "page": "Research"
    },
    {
      "text": "recombinant DNA",
      "page": "Recombinant_DNA"
    },
    {
      "text": "gene delivery",
      "page": "Gene_delivery"
    },
    {
      "text": "genome editing",
      "page": "Genome_editing"
    },
    {
      "text": "guide RNA",
      "page": "Guide_RNA"
    },
    {
      "text": "Cas9",
      "page": "Cas9"
    },
    {
      "text": "homology-directed repair",
      "page": "Homology-directed_repair"
    },
    {
      "text": "gene knockout",
      "page": "Gene_knockout"
    },
    {
      "text": "pathogen",
      "page": "Pathogen"
    },
    {
      "text": "genetic engineering",
      "page": "Genetic_engineering"
    },
    {
      "text": "adeno-associated virus",
      "page": "Adeno-associated_virus"
    },
    {
      "text": "immunogenicity",
      "page": "Immunogenicity"
    },
    {
      "text": "onasemnogene abeparvovec",
      "page": "Onasemnogene_abeparvovec"
    },
    {
      "text": "spinal muscular atrophy",
      "page": "Spinal_muscular_atrophy"
    },
    {
      "text": "Bt crops",
      "page": "Bacillus_thuringiensis"
    },
    {
      "text": "corn",
      "page": "Cotton"
    },
    {
      "text": "midgut",
      "page": "Midgut"
    },
    {
      "text": "European corn borer",
      "page": "European_corn_borer"
    },
    {
      "text": "base editing",
      "page": "Base_editing"
    },
    {
      "text": "Breakthrough Prize",
      "page": "Breakthrough_Prize"
    },
    {
      "text": "sickle cell disease",
      "page": "Sickle_cell_disease"
    },
    {
      "text": "father",
      "page": "Father"
    },
    {
      "text": "son",
      "page": "Son"
    },
    {
      "text": "Y-STR",
      "page": "Y-STR"
    },
    {
      "text": "Western Europe",
      "page": "Western_Europe"
    },
    {
      "text": "ancestry inference",
      "page": "Inference"
    },
    {
      "text": "kinship",
      "page": "Kinship"
    },
    {
      "text": "ancient DNA",
      "page": "Ancient_DNA"
    },
    {
      "text": "bone",
      "page": "Bone"
    },
    {
      "text": "tooth",
      "page": "Tooth"
    },
    {
      "text": "anthropology",
      "page": "Anthropology"
    },
    {
      "text": "Africa",
      "page": "Africa"
    },
    {
      "text": "haplogroup CT",
      "page": "Haplogroup_CT"
    },
    {
      "text": "East Africa",
      "page": "East_Africa"
    },
    {
      "text": "Eurasia",
      "page": "Eurasia"
    },
    {
      "text": "Neanderthal",
      "page": "Neanderthal"
    },
    {
      "text": "environmental DNA",
      "page": "Environmental_DNA"
    },
    {
      "text": "permafrost",
      "page": "Permafrost"
    },
    {
      "text": "Greenland",
      "page": "Greenland"
    },
    {
      "text": "Arctic",
      "page": "Arctic"
    },
    {
      "text": "ecosystem",
      "page": "Ecosystem"
    },
    {
      "text": "poplar",
      "page": "Poplar"
    },
    {
      "text": "shotgun sequencing",
      "page": "Shotgun_sequencing"
    },
    {
      "text": "genetics",
      "page": "Genetics"
    },
    {
      "text": "materials science",
      "page": "Materials_science"
    },
    {
      "text": "DNA origami",
      "page": "DNA_origami"
    },
    {
      "text": "drug delivery",
      "page": "Drug_delivery"
    },
    {
      "text": "doxorubicin",
      "page": "Doxorubicin"
    },
    {
      "text": "targeted therapy",
      "page": "Targeted_therapy"
    },
    {
      "text": "cancer treatment",
      "page": "Cancer_treatment"
    },
    {
      "text": "1994",
      "page": "1994"
    },
    {
      "text": "Leonard Adleman",
      "page": "Leonard_Adleman"
    },
    {
      "text": "directed graph",
      "page": "Directed_graph"
    },
    {
      "text": "amplification",
      "page": "Amplification"
    },
    {
      "text": "Hamiltonian path",
      "page": "Hamiltonian_path"
    },
    {
      "text": "density",
      "page": "Density"
    },
    {
      "text": "A, C, G, T",
      "page": "A.C.G.T"
    },
    {
      "text": "PCR",
      "page": "PCR"
    },
    {
      "text": "Microsoft",
      "page": "Microsoft"
    },
    {
      "text": "substrate",
      "page": "Substrate"
    },
    {
      "text": "gene silencing",
      "page": "Gene_silencing"
    },
    {
      "text": "artificial intelligence",
      "page": "Artificial_intelligence"
    },
    {
      "text": "AlphaFold",
      "page": "AlphaFold"
    },
    {
      "text": "semiconductor",
      "page": "Semiconductor"
    },
    {
      "text": "random access",
      "page": "Random_access"
    },
    {
      "text": "Friedrich Miescher",
      "page": "Friedrich_Miescher"
    },
    {
      "text": "white blood cells",
      "page": "White_Blood_Cells"
    },
    {
      "text": "pus",
      "page": "Pus"
    },
    {
      "text": "pepsin",
      "page": "Pepsin"
    },
    {
      "text": "phosphorus",
      "page": "Phosphorus"
    },
    {
      "text": "1870s",
      "page": "1870s"
    },
    {
      "text": "Albrecht Kossel",
      "page": "Albrecht_Kossel"
    },
    {
      "text": "Nobel Prize",
      "page": "Nobel_Prize"
    },
    {
      "text": "Physiology",
      "page": "Physiology"
    },
    {
      "text": "Phoebus Levene",
      "page": "Phoebus_Levene"
    },
    {
      "text": "sugar",
      "page": "Sugar"
    },
    {
      "text": "Feulgen stain",
      "page": "Feulgen_stain"
    },
    {
      "text": "magenta",
      "page": "Magenta"
    },
    {
      "text": "phosphorus-32",
      "page": "Phosphorus-32"
    },
    {
      "text": "viral replication",
      "page": "Viral_replication"
    },
    {
      "text": "daughter",
      "page": "Daughter"
    },
    {
      "text": "light",
      "page": "Light"
    },
    {
      "text": "Watson",
      "page": "Watson"
    },
    {
      "text": "genetic recombination",
      "page": "Genetic_recombination"
    },
    {
      "text": "polymerase chain reaction",
      "page": "Polymerase_chain_reaction"
    },
    {
      "text": "Thermus aquaticus",
      "page": "Thermus_aquaticus"
    },
    {
      "text": "molecular biology",
      "page": "Molecular_biology"
    },
    {
      "text": "cloning",
      "page": "Cloning"
    },
    {
      "text": "Nobel Prize in Chemistry",
      "page": "Nobel_Prize_in_Chemistry"
    },
    {
      "text": "National Institutes of Health",
      "page": "National_Institutes_of_Health"
    },
    {
      "text": "Human Genome Project",
      "page": "Human_Genome_Project"
    },
    {
      "text": "sequence",
      "page": "Sequence"
    },
    {
      "text": "genomics",
      "page": "Genomics"
    }
  ],
  "fetched_at": "2025-12-07T07:23:06.944615",
  "elapsed_ms": 539882
}