{
  "topic": "ExxonMobil",
  "title": "ExxonMobil",
  "slug": "exxonmobil",
  "grokipedia_slug": "ExxonMobil",
  "grokipedia_url": null,
  "source": "generated",
  "content": "# ExxonMobil\n\n# ExxonMobil\n\n## Overview\n\nExxonMobil Corporation is one of the largest publicly traded international oil and gas companies in the world. Headquartered in Irving, Texas, USA, ExxonMobil operates in over 70 countries and is involved in the exploration, production, refining, and distribution of petroleum and natural gas, as well as the manufacturing of petrochemicals. Formed in 1999 through the merger of Exxon and Mobil—two successors of John D. Rockefeller’s Standard Oil Company—ExxonMobil has grown into a global energy giant with a significant impact on the energy sector and the global economy [ExxonMobil Official History](https://corporate.exxonmobil.com/About-us/History).\n\nThe company is a key player in the fossil fuel industry and has faced both praise for its contributions to energy accessibility and criticism for its environmental impact, particularly concerning climate change. As of recent years, ExxonMobil has also ventured into renewable energy and carbon capture technologies, reflecting a shift in response to global energy transition demands [Reuters - ExxonMobil Climate Goals](https://www.reuters.com/business/energy/exxon-sets-plan-lower-emissions-pledges-net-zero-by-2050-2021-12-06/).\n\n## Historical Background\n\nExxonMobil traces its roots to the Standard Oil Company, founded in 1870 by John D. Rockefeller and partners. Standard Oil dominated the oil industry in the United States until it was broken up in 1911 under antitrust laws by the U.S. Supreme Court, resulting in the creation of 34 independent companies. Two of these entities were Standard Oil of New Jersey (later renamed Exxon) and Standard Oil of New York (later renamed Mobil) [History.com - Standard Oil](https://www.history.com/topics/early-20th-century-us/standard-oil).\n\n- **Exxon (Standard Oil of New Jersey):** Established as a major player in refining and marketing, Exxon became a leading brand in the U.S. and internationally, adopting its name in 1972.\n- **Mobil (Standard Oil of New York):** Focused on marketing and refining, Mobil was known for innovations in fuel technology and its iconic Pegasus logo, adopting its name in 1966.\n\nThe 1999 merger of Exxon and Mobil, valued at $81 billion, reunited two of Standard Oil’s largest successors, creating ExxonMobil. At the time, it was one of the largest corporate mergers in history, driven by the need to compete in a consolidating global oil market and to achieve economies of scale [CNN Money - Exxon-Mobil Merger](https://money.cnn.com/1998/12/01/deals/exxon/).\n\nThroughout the 20th century, ExxonMobil and its predecessors played pivotal roles in major historical events, including supplying fuel during both World Wars and being at the center of environmental controversies such as the 1989 Exxon Valdez oil spill in Alaska, one of the worst environmental disasters in U.S. history [EPA - Exxon Valdez Spill](https://www.epa.gov/emergency-response/exxon-valdez-spill-profile).\n\n## Current Status and Relevance\n\nAs of 2023, ExxonMobil remains a titan in the energy industry, ranking among the top companies on the Fortune 500 list. It reported revenues of over $413 billion in 2022, driven by its operations in upstream (exploration and production), downstream (refining and marketing), and chemical sectors [Fortune - ExxonMobil Ranking](https://fortune.com/company/exxon-mobil/fortune500/). The company produces approximately 3.7 million barrels of oil equivalent per day, making it a significant contributor to global energy supply [ExxonMobil Annual Report](https://corporate.exxonmobil.com/Investors/Annual-report).\n\nExxonMobil is also navigating the global energy transition. While historically focused on fossil fuels, the company has pledged to achieve net-zero greenhouse gas emissions from its operated assets by 2050 and is investing in low-carbon technologies such as carbon capture and storage (CCS), hydrogen, and biofuels. However, critics argue that its investments in renewables remain limited compared to its fossil fuel operations [The Guardian - ExxonMobil Climate Criticism](https://www.theguardian.com/environment/2023/jan/18/exxonmobil-climate-change-net-zero-emissions).\n\nThe company has faced legal and public scrutiny over its role in climate change. Investigations, including a 2015 report by *InsideClimate News*, revealed that ExxonMobil’s own scientists warned of climate risks as early as the 1970s, yet the company publicly downplayed these risks for decades [InsideClimate News - Exxon Knew](https://insideclimatenews.org/news/22092015/exxon-the-road-not-taken/). This has led to lawsuits from states and activists seeking accountability [BBC - ExxonMobil Lawsuits](https://www.bbc.com/news/business-50174794).\n\n## Notable Facts and Details\n\n- **Market Presence:** ExxonMobil operates under several well-known brands, including Exxon, Mobil, and Esso, with a network of over 20,000 retail service stations worldwide [ExxonMobil Brands](https://corporate.exxonmobil.com/About-us/Our-brands).\n- **Research and Innovation:** The company invests heavily in research and development, spending billions annually on technologies for energy efficiency and emissions reduction. It holds thousands of patents in energy-related fields [ExxonMobil R&D](https://corporate.exxonmobil.com/Innovation/Research-and-development).\n- **Environmental Impact:** The Exxon Valdez spill released 11 million gallons of crude oil into Alaska’s Prince William Sound, devastating local ecosystems. Cleanup and legal costs exceeded $7 billion, and the incident remains a benchmark for oil spill response policies [National Geographic - Exxon Valdez](https://www.nationalgeographic.com/environment/article/exxon-valdez).\n- **Financial Power:** ExxonMobil is consistently one of the most profitable companies globally, though its earnings fluctuate with oil price volatility. In 2022, it reported record profits due to high energy prices following geopolitical tensions [Bloomberg - ExxonMobil Profits](https://www.bloomberg.com/news/articles/2023-01-31/exxon-posts-record-55-7-billion-profit-almost-double-2021-haul).\n- **Leadership:** Darren Woods has served as CEO since 2017, steering the company through challenges related to climate policy and energy transition [ExxonMobil Leadership](https://corporate.exxonmobil.com/About-us/Leadership).\n\n## Related Topics\n\n- **Energy Transition:** ExxonMobil’s role in the shift from fossil fuels to renewable energy sources is a topic of ongoing debate, as global policies push for decarbonization.\n- **Climate Change Litigation:** The company is central to lawsuits alleging misinformation about climate science, paralleling cases against other fossil fuel giants like Chevron and Shell.\n- **Standard Oil Legacy:** Understanding ExxonMobil requires knowledge of Standard Oil’s monopolistic practices and the antitrust movement in the early 20th century.\n- **Oil Spills and Environmental Policy:** The Exxon Valdez disaster links to broader discussions on environmental regulations and corporate responsibility in the energy sector.\n- **Geopolitical Influence:** As a major oil producer, ExxonMobil’s operations intersect with international politics, particularly in oil-rich regions like the Middle East and Africa.\n\n## References\n\n- [ExxonMobil Official History](https://corporate.exxonmobil.com/About-us/History)\n- [Reuters - ExxonMobil Climate Goals](https://www.reuters.com/business/energy/exxon-sets-plan-lower-emissions-pledges-net-zero-by-2050-2021-12-06/)\n- [History.com - Standard Oil](https://www.history.com/topics/early-20th-century-us/standard-oil)\n- [CNN Money - Exxon-Mobil Merger](https://money.cnn.com/1998/12/01/deals/exxon/)\n- [EPA - Exxon Valdez Spill](https://www.epa.gov/emergency-response/exxon-valdez-spill-profile)\n- [Fortune - ExxonMobil Ranking](https://fortune.com/company/exxon-mobil/fortune500/)\n- [ExxonMobil Annual Report](https://corporate.exxonmobil.com/Investors/Annual-report)\n- [The Guardian - ExxonMobil Climate Criticism](https://www.theguardian.com/environment/2023/jan/18/exxonmobil-climate-change-net-zero-emissions)\n- [InsideClimate News - Exxon Knew](https://insideclimatenews.org/news/22092015/exxon-the-road-not-taken/)\n- [BBC - ExxonMobil Lawsuits](https://www.bbc.com/news/business-50174794)\n- [ExxonMobil Brands](https://corporate.exxonmobil.com/About-us/Our-brands)\n- [ExxonMobil R&D](https://corporate.exxonmobil.com/Innovation/Research-and-development)\n- [National Geographic - Exxon Valdez](https://www.nationalgeographic.com/environment/article/exxon-valdez)\n- [Bloomberg - ExxonMobil Profits](https://www.bloomberg.com/news/articles/2023-01-31/exxon-posts-record-55-7-billion-profit-almost-double-2021-haul)\n- [ExxonMobil Leadership](https://corporate.exxonmobil.com/About-us/Leadership)",
  "external_references": [],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:22:34.403063",
  "elapsed_ms": 507341
}