{
  "topic": "F. Scott Fitzgerald",
  "title": "F. Scott Fitzgerald",
  "slug": "f-scott-fitzgerald",
  "grokipedia_slug": "F._Scott_Fitzgerald",
  "grokipedia_url": null,
  "source": "generated",
  "content": "# F. Scott Fitzgerald\n\n# F. Scott Fitzgerald\n\n## Introduction\n\nF. Scott Fitzgerald (1896–1940) was an American novelist and short story writer, widely regarded as one of the greatest literary voices of the 20th century. Often associated with the Jazz Age—a term he popularized—Fitzgerald's works capture the exuberance, disillusionment, and moral decay of the post-World War I era. His most famous novel, *The Great Gatsby* (1925), is a poignant critique of the American Dream and remains a staple in literary education worldwide. Fitzgerald's writing style, characterized by lyrical prose and keen social observation, has left an indelible mark on American literature, though his personal life was marred by financial struggles, alcoholism, and a tumultuous marriage to Zelda Sayre [Biography.com](https://www.biography.com/writer/f-scott-fitzgerald).\n\n## Historical Background\n\n### Early Life\nFrancis Scott Key Fitzgerald was born on September 24, 1896, in St. Paul, Minnesota, to an upper-middle-class family. Named after his distant relative, Francis Scott Key, the author of the American national anthem, Fitzgerald was raised in a Catholic household with Irish roots. His father, Edward Fitzgerald, struggled as a businessman, while his mother, Mary McQuillan, came from a wealthier background, which instilled in young Scott a fascination with social status—a recurring theme in his works. He attended Princeton University starting in 1913 but left in 1917 without graduating to join the U.S. Army during World War I, though he never saw combat [Britannica](https://www.britannica.com/biography/F-Scott-Fitzgerald).\n\n### Rise to Fame\nFitzgerald's literary career began with the publication of his debut novel, *This Side of Paradise* (1920), which became an instant success and established him as a voice of the \"Lost Generation\"—a term coined by Gertrude Stein to describe the disillusioned youth of the post-war era. The novel's success allowed him to marry Zelda Sayre, a Southern belle whose vivacious personality and mental health struggles would deeply influence his life and writing. The couple became emblematic of the Jazz Age, living a lavish lifestyle in New York and later in Paris, where they mingled with expatriate writers like Ernest Hemingway [PBS American Masters](https://www.pbs.org/wnet/americanmasters/f-scott-fitzgerald-about-f-scott-fitzgerald/625/).\n\n### Major Works and Decline\nFitzgerald's career peaked with *The Great Gatsby* (1925), a novel that, while initially receiving mixed reviews, is now considered a masterpiece for its exploration of wealth, class, and unrequited love. Other notable works include *Tender Is the Night* (1934), a semi-autobiographical novel about mental illness and personal decline, and numerous short stories published in magazines like *The Saturday Evening Post*. However, by the late 1920s, Fitzgerald's life began to unravel due to Zelda's schizophrenia, his own alcoholism, and mounting debts. His later years were spent in Hollywood as a screenwriter, where he struggled to regain literary prominence before dying of a heart attack at age 44 in 1940 [History.com](https://www.history.com/topics/roaring-twenties/f-scott-fitzgerald).\n\n## Current Status and Relevance\n\nThough Fitzgerald died believing himself a failure, his reputation has grown immensely posthumously. *The Great Gatsby* is now a cornerstone of American literature, frequently taught in schools and adapted into numerous films, most notably in 1974 and 2013. His works continue to resonate due to their timeless exploration of ambition, social inequality, and the fragility of dreams—issues still relevant in contemporary society. Scholars and readers alike analyze Fitzgerald's prose for its poetic quality and historical insight into the Roaring Twenties. Additionally, his personal story serves as a cautionary tale about the perils of fame and excess [The New York Times](https://www.nytimes.com/2020/09/24/books/f-scott-fitzgerald-great-gatsby.html).\n\nFitzgerald's influence extends beyond literature into popular culture, with references to his life and works appearing in music, film, and theater. His name remains synonymous with the Jazz Age, and his complex relationship with Zelda continues to inspire biographical studies and fictionalized accounts.\n\n## Notable Facts and Details\n\n- **Jazz Age Icon**: Fitzgerald coined the term \"Jazz Age\" to describe the 1920s, a period of economic prosperity and cultural rebellion in the United States, which he both celebrated and critiqued in his writing [Smithsonian Magazine](https://www.smithsonianmag.com/history/f-scott-fitzgeralds-jazz-age-180975189/).\n- **Prolific Short Story Writer**: He wrote over 160 short stories, many of which were published in popular magazines, providing a significant source of income during his career. Stories like \"The Curious Case of Benjamin Button\" (1922) have also been adapted into major films.\n- **Personal Struggles**: Fitzgerald battled alcoholism throughout much of his life, a struggle reflected in characters like Dick Diver in *Tender Is the Night*. His wife Zelda's institutionalization for schizophrenia further strained their relationship and finances [Mental Floss](https://www.mentalfloss.com/article/641007/f-scott-fitzgerald-facts).\n- **Hollywood Years**: In the late 1930s, Fitzgerald moved to Hollywood to work as a screenwriter, contributing to films like *Gone with the Wind* (uncredited). His unfinished novel, *The Last Tycoon* (1941), published posthumously, reflects his disillusionment with the film industry.\n- **Legacy**: Fitzgerald's works were largely rediscovered after World War II, thanks to reprints distributed to soldiers and critical reevaluations by literary scholars, cementing his status as a major American author.\n\n## Related Topics\n\n- **The Jazz Age**: The cultural and social movement of the 1920s, characterized by jazz music, flapper culture, and economic prosperity, which Fitzgerald both epitomized and critiqued.\n- **The Lost Generation**: A group of American writers, including Fitzgerald and Hemingway, who expressed disillusionment with traditional values after World War I.\n- **Zelda Fitzgerald**: Scott's wife, a writer and artist in her own right, whose mental health struggles and relationship with Scott profoundly influenced his work.\n- **The Great Gatsby**: Fitzgerald's most famous novel, often studied for its commentary on the American Dream and social stratification.\n- **American Literature**: Fitzgerald's contributions to the canon of 20th-century American writing, alongside contemporaries like Hemingway and Faulkner.\n\n## References\n\n- [Biography.com: F. Scott Fitzgerald](https://www.biography.com/writer/f-scott-fitzgerald)\n- [Britannica: F. Scott Fitzgerald](https://www.britannica.com/biography/F-Scott-Fitzgerald)\n- [PBS American Masters: About F. Scott Fitzgerald](https://www.pbs.org/wnet/americanmasters/f-scott-fitzgerald-about-f-scott-fitzgerald/625/)\n- [History.com: F. Scott Fitzgerald](https://www.history.com/topics/roaring-twenties/f-scott-fitzgerald)\n- [The New York Times: F. Scott Fitzgerald and The Great Gatsby](https://www.nytimes.com/2020/09/24/books/f-scott-fitzgerald-great-gatsby.html)\n- [Smithsonian Magazine: F. Scott Fitzgerald's Jazz Age](https://www.smithsonianmag.com/history/f-scott-fitzgeralds-jazz-age-180975189/)\n- [Mental Floss: F. Scott Fitzgerald Facts](https://www.mentalfloss.com/article/641007/f-scott-fitzgerald-facts)",
  "external_references": [],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:16:02.500877",
  "elapsed_ms": 115439
}