{
  "topic": "Film",
  "title": "_/Film_",
  "slug": "film",
  "grokipedia_slug": "Film",
  "grokipedia_url": "https://grokipedia.com/page/Film",
  "source": "grokipedia",
  "content": "# _/Film_\n\n**/Film** (stylized as /Film and also known as *SlashFilm*) is an American digital media outlet specializing in film and television coverage, including news, reviews, trailers, interviews, and feature articles.  \nFounded in August 2005 by Peter Sciretta as a personal blog dedicated to movie news and commentary, /Film quickly expanded into a comprehensive entertainment resource, attracting a wide audience through its timely reporting and critical analysis.  \nIn 2021, the site was acquired by Static Media Inc., a Delaware-based digital publishing company established in 2012 and backed by private equity firm Novacap, which has since integrated /Film into its portfolio of over two dozen brands focused on entertainment, lifestyle, and technology.  \nUnder Static Media's ownership, /Film continues to produce original content, including the long-running podcast */Film Weekly*, hosted by editors such as Ben Pearson, which discusses current films, television, and industry trends.  \nThe publication emphasizes a mix of mainstream blockbusters from studios like Marvel and Disney, independent cinema, classic Hollywood retrospectives, and pop culture intersections, positioning itself as a trusted voice in the \"reel world\" for over two decades.\n\n## History\n\n### Founding\n\n/Film was founded by Peter Sciretta on August 23, 2005, as an independent movie blog dedicated to providing in-depth coverage of filmmaking, news, and discussions for film enthusiasts. Sciretta, a film journalist based in San Francisco, launched the site shortly after concluding his full-time role as a writer for Cinematical, an AOL-owned movie blog, seeking to create a personal platform that reflected his passion for cinema without corporate constraints. The inaugural post, contributed by guest writer Zach Lawrence, featured a list of his top 10 films of all time, setting the tone for a community-driven approach to film discourse.\n\nFrom its inception, /Film operated as a solo endeavor by Sciretta, who dedicated significant time to content creation in the first five years, driven by a desire to offer unique perspectives and rigorous research on movies and filmmakers. The blog quickly expanded by assembling a team of more than 20 bloggers from across the United States within its first month, fostering collaborative contributions that emphasized behind-the-scenes insights and critical analysis over mainstream summaries. This grassroots growth transformed /Film from a modest personal project into a prominent voice in online film journalism, prioritizing accessibility for movie buffs while avoiding the sensationalism common in early 2000s entertainment media.\n\nSciretta's vision for /Film was rooted in his lifelong enthusiasm for films, aiming to build a space where enthusiasts could engage deeply with the craft of filmmaking. Unlike established outlets, the site focused on original angles, such as exclusive interviews and speculative features on upcoming projects, which helped it carve a niche in the burgeoning blogosphere of the mid-2000s. By emphasizing quality over quantity, /Film's founding principles laid the groundwork for its evolution into a multimedia entertainment brand, though Sciretta initially never anticipated such scale.\n\n### Expansion and ownership changes\n\nFollowing its launch in 2005 as a personal blog dedicated to film news and commentary, /Film rapidly expanded its scope and reach, evolving into a comprehensive entertainment platform. The site incorporated multimedia elements, including podcasts starting in the late 2000s, video content on YouTube, and interactive features on Snapchat, which broadened its audience engagement beyond traditional articles. By 2021, /Film had achieved significant scale, attracting approximately 25 million monthly users across its digital properties and earning recognition as an approved critic source by Rotten Tomatoes and Metacritic.\n\nThis period of growth also saw /Film establish a reputation for in-depth coverage of major industry events, such as the Toronto International Film Festival and San Diego Comic-Con, alongside exclusive interviews with filmmakers and actors, solidifying its influence in online film journalism. The expansion included building a diverse editorial team to handle increased output, focusing on timely reviews, trailers, and analysis that catered to a global audience of movie enthusiasts.\n\nIn terms of ownership, /Film operated independently under founder Peter Sciretta until 2021, when it was acquired by Static Media, an Indianapolis-based digital publishing network specializing in lifestyle and entertainment brands. The acquisition integrated /Film into Static Media's portfolio, which includes over two dozen sites like The List and Tasting Table, providing resources for further content development while maintaining its core focus on film and television. This shift marked a pivotal change, transitioning the site from a founder-led venture to part of a larger media conglomerate. Sciretta continued in an editorial role post-acquisition but stepped down from /Film on May 25, 2023, after nearly 18 years with the site.\n\n## Content\n\n### Website\n\n/Film's website, accessible at slashfilm.com, serves as the primary platform for delivering film and television content, established as an award-winning publication approved by Rotten Tomatoes and Metacritic. It specializes in providing up-to-date news, in-depth commentary, and critical analysis across the spectrum of cinematic and televisual media. The site emphasizes a balance between mainstream blockbusters and niche productions, covering releases from major studios like Marvel, DC, and Disney as well as independent films, classic Hollywood titles, and emerging trends.\n\nThe website's content is organized into distinct categories to facilitate user navigation and exploration. The \"Movies\" section features subcategories by genre, including Action \\u0026 Adventure, Animation, Comedy, Documentary, Drama, Fantasy, History, Horror, Thriller, and Romance, where users can find reviews, news, and analyses tailored to specific interests. Complementing this is a dedicated \"Television\" category that addresses series, episodes, and industry developments in TV programming. News is segmented into \"Movie News\" and \"TV News,\" offering breaking updates, casting announcements, production insights, and release information.\n\nBeyond standard news and reviews, the site hosts specialized content types that enhance engagement and depth. The \"Features\" category includes longform articles such as lists, rankings, and explanatory pieces designed to inform, provoke discussion, and provide comprehensive overviews on topics like film history, director spotlights, or genre evolutions. \"Exclusives\" deliver original reporting, including interviews with filmmakers, actors, and industry insiders, often uncovering behind-the-scenes details not available elsewhere. Trailers are prominently embedded throughout articles, allowing immediate access to promotional materials, while opinion pieces offer editorial perspectives on cultural impacts and trends in entertainment.\n\nAdditional features on the website support user interaction and retention, such as daily film and TV roundups that curate essential updates in a digestible format. The platform also integrates multimedia elements, including video content and image galleries, to accompany textual articles, ensuring a dynamic reading experience. Overall, slashfilm.com functions as a comprehensive resource for enthusiasts seeking both timely reporting and thoughtful critique in the film and television landscape.\n\n### Podcasts\n\n/Film has produced several podcasts over the years, focusing on film and television news, reviews, interviews, and discussions. The site's primary audio offerings have evolved, starting with a flagship show in the late 2000s and expanding to daily and weekly formats in the 2010s. These podcasts feature contributions from /Film's editorial team, including founder Peter Sciretta, and have helped extend the site's reach through in-depth conversations with filmmakers, actors, and industry insiders.\n\nThe earliest major podcast associated with /Film was The /Filmcast, launched in 2009 at the invitation of founder Peter Sciretta to provide audio content for the website. Hosted initially by Sciretta and later by a rotating group including Devindra Hardawar, Jeff Cannata, and others, it ran weekly for over 12 years, covering new releases, box office analysis, and geek culture topics. Episodes often included segments like \"What We Watched,\" \"Box Office Breakdown,\" and listener voicemails, fostering a conversational tone among the hosts. In 2021, the podcast spun off as an independent entity renamed The Filmcast. The separation allowed greater creative freedom while maintaining occasional crossovers with /Film staff, with episodes continuing weekly at thefilmcast.com.\n\nIn 2017, /Film introduced /Film Daily on July 10, a weekday podcast that delivers timely discussions on breaking movie and TV news, deeper dives into trailers and announcements, and casual \"water cooler\" chats among staff. Hosted by editors like Ben Pearson, Peter Sciretta, and contributors such as Jacob Hall and Chris Evangelista, it emphasizes quick, engaging takes on current events, often featuring interviews with directors and actors. For example, episodes have included exclusive talks with showrunners like Tony Gilroy about *Andor* and authors like Kyle Buchanan on the making of *Mad Max: Fury Road*. As of late 2024, /Film Daily had released over 1,700 episodes; as of November 2025, it has over 2,000 episodes.\n\nComplementing the daily format, /Film Weekly debuted on June 27, 2017, offering a more structured weekly roundup of film and TV developments, spoiler-filled reviews, and high-to-low rankings of recent releases. Primarily hosted by Ben Pearson and Peter Sciretta, with guest appearances from the broader team, it has produced over 430 episodes as of November 2025, covering topics from major festival premieres like SXSW to analyses of franchises such as *The Conjuring*. Notable segments include news recaps, interviews (e.g., with screenwriters like Jesse Wigutow on *Tron: Ares*), and thematic discussions, such as the best movie moments of a given year. The podcast's longevity reflects /Film's commitment to accessible, editor-driven commentary.\n\nThese podcasts have collectively amplified /Film's voice in online film discourse, blending journalistic insight with enthusiast passion. While The /Filmcast's independence marked a shift, /Film Daily and /Film Weekly continue to anchor the site's audio content, available across platforms like Apple Podcasts, Spotify, and YouTube.\n\n## Staff\n\n### Key personnel\n\nPeter Sciretta founded /Film in August 2005 as a blog dedicated to film news, reviews, and discussions on filmmaking. As the site's editorial director, Sciretta has overseen its growth from a personal project into a prominent entertainment outlet, contributing to its acquisition by Static Media in 2021. His vision emphasized in-depth coverage of cinema, including interviews with industry figures and analysis of film techniques.\n\nChris Evangelista serves as chief film critic and editor at /Film, a role he has held since 2017. Based in the Philadelphia area, Evangelista specializes in horror films, the works of Steven Spielberg, and film festivals, and he is a Rotten Tomatoes-approved critic as well as a member of the Critics Choice Association. His contributions include reviews, features, and hosting the \"21st Century Spielberg\" podcast, which explores Spielberg's post-2000 filmography.\n\nBen Pearson is a senior editor at /Film, having joined in 2017. He co-hosts the /Film Daily podcast, providing analysis on film and TV news, and contributes reviews and features on major releases and industry trends. A graduate of the University of Texas at Austin, Pearson's work covers a broad spectrum of entertainment, including blockbusters and awards-season films.\n\nJacob Hall has been /Film's senior news editor since 2015, managing daily news coverage and editorial content. A graduate of the Savannah College of Art and Design with a degree in film and television, Hall focuses on franchises like Star Trek, James Bond, and horror genres. Prior to his editorial role, he wrote for outlets such as Cinematical and Esquire, and notable pieces include his influential analysis of *Star Wars: The Last Jedi* and interviews with figures like Patrick Stewart.\n\n### Contributors\n\n/Film relies on a network of freelance and staff writers who bring expertise in film criticism, news reporting, and industry analysis to its content. These contributors, often with backgrounds in journalism, academia, or independent media, cover a wide range of topics from blockbuster releases to indie films and horror genres. The team's collective experience ensures in-depth coverage, including interviews with filmmakers and exclusive insights, while adhering to editorial standards of accuracy and integrity.\n\nAmong the prominent contributors is Sandy Schaefer, who joined /Film in 2021 after working as a staff writer and editor at Screen Rant since 2010 and contributing to Comic Book Resources. With degrees in mathematics and anthropology from the University of Utah, Schaefer specializes in Star Wars, animation, and the Marvel Cinematic Universe, having written about film history since the late 2000s.\n\nHannah Shaw-Williams, based in the UK, has been contributing since 2021, drawing on her bachelor's in English from the University of Exeter and a diploma in filmmaking from the New York Film Academy. Previously a features editor at Screen Rant and a contributor to Bleeding Cool, she focuses on horror movies, box office trends, and British cinema, with experience as a boom operator on productions like *Alien: Covenant*. Her interviews include directors such as M. Night Shyamalan and actors like Michael Fassbender.\n\nRick Stevenson, a Brooklyn-based writer who joined in 2021, holds a B.A. in writing and storytelling from the College of William \\u0026 Mary and has authored over 2,000 articles on film and TV since 2020. A former senior writer at Screen Rant and contributor to Looper and TVLine, he excels in sci-fi, fantasy, streaming originals, and animation, often covering advance screenings in New York City.\n\nMatthew Monagle, an Austin-based contributor with an M.A. in film studies from Columbia University, has covered the intersection of cinema and tabletop games for /Film for several years. A member of the Austin Film Critics Association and jury member for festivals like the Brooklyn Horror Film Festival, he has interviewed filmmakers including the Safdie brothers and Ruben Fleischer, and also writes for IGN and Polygon.\n\nChad Collins, a features writer since 2021, specializes in horror, particularly slasher films and the *Scream* franchise, with a B.A. in media studies from Flagler College and an M.A. in interpersonal communication from the University of Central Florida. Previously a staff writer at Dread Central, he has contributed to Rue Morgue and Anatomy of a Scream, interviewed horror figures like Mick Garris, and participated in the Sundance Film Festival Press Inclusion Initiative in 2023.\n\nDevin Meenan, who joined in 2022, is a Connecticut-based writer with a B.A. in cinema and English from Denison University. His work spans film history, Marvel comics, and anime like *Neon Genesis Evangelion*; prior to /Film, he freelanced for IGN and Comic Book Resources and published essays in *Film Matters* magazine.\n\nOther notable contributors include David Court, a UK-based writer with expertise in movies, comics, and TV since 2008, whose fiction has appeared in the Hugo Award-winning *StarShipSofa* podcast; Jeremy Herbert, a Florida filmmaker and horror specialist who has written for Bloody Disgusting and won awards for his screenplays; and Steven Ward, a Los Angeles contributor with seven years in entertainment writing, formerly editor-in-chief of El Paisano and focused on movies and TV. This diverse group reflects /Film's commitment to multifaceted perspectives in entertainment journalism.\n\n## Reception\n\n### Awards\n\n/Film has received recognition for its contributions to online film journalism, particularly through awards from Total Film magazine. In 2009, the site won the \"Best Major Movie Blog\" award in Total Film's inaugural Movie Blog Awards, which was described as the top prize equivalent to an overall best blog category. This victory underscored /Film's early prominence in delivering influential movie news and analysis.\n\nThe following year, /Film secured another win from Total Film, taking home the \"Best Movie News Blog\" award in the 2010 Movie Blog Awards. The site received 58% of the public votes, marking a repeat success that highlighted its growing audience engagement and authority in the field. These back-to-back accolades from a leading film publication affirmed /Film's status as a leading voice in digital film discourse during the late 2000s.\n\nBeyond these specific honors, /Film contributes to the site's credibility in awards-season coverage. However, no further major site-wide awards have been prominently documented in subsequent years.\n\n### Influence\n\n/Film has significantly shaped online film journalism since its inception in 2005, emerging as one of the pioneering blogs dedicated to movie news, reviews, and analysis. Its founder, Peter Sciretta, was named one of the 100 most influential people in film by *Total Film* magazine in 2009, highlighting the site's early impact on industry discourse. The platform was recognized as an essential movie website by *The Guardian* and ranked among the ten best film sites of the decade by MSN, underscoring its role in democratizing access to film information.\n\nThe site's expansive reach, serving 25 million users monthly across its website, YouTube, and Snapchat channels as of 2025, has amplified its influence in shaping public opinion on films and television. As a Tomatometer-approved critic on Rotten Tomatoes and a prominent contributor to Metacritic, /Film's reviews carry weight in aggregating scores that affect box office performance and awards buzz.\n\nBeyond criticism, /Film has influenced film marketing by serving as a quoted source in promotional campaigns for movies such as *Hostel: Part II* and *Fido*, demonstrating its credibility among studios seeking fan endorsements. Its podcasts, including the long-running /Filmcast, have fostered in-depth discussions among enthusiasts, contributing to broader cultural conversations around cinema. Through these efforts, /Film has helped transition film journalism from print to digital, prioritizing timely news and community engagement over traditional outlets.",
  "external_references": [
    {
      "text": "slashfilm.com",
      "url": "https://www.slashfilm.com/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Petersciretta",
      "url": "https://www.slashfilm.com/author/petersciretta/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Policies",
      "url": "https://www.slashfilm.com/policies/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "static.com",
      "url": "https://www.static.com/",
      "domain": "static.com",
      "type": "citation"
    },
    {
      "text": "3wrisazntjudsfdtlm5h8u",
      "url": "https://open.spotify.com/show/3WrisazNTJuDSFdTlM5h8u",
      "domain": "open.spotify.com",
      "type": "citation"
    },
    {
      "text": "Slashfilm",
      "url": "https://www.youtube.com/c/slashfilm",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Slashfilm",
      "url": "https://muckrack.com/media-outlet/slashfilm",
      "domain": "muckrack.com",
      "type": "citation"
    },
    {
      "text": "About",
      "url": "https://www.slashfilm.com/about/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Csse9zklklp",
      "url": "https://www.instagram.com/p/CssE9ZkLKlp/",
      "domain": "instagram.com",
      "type": "citation"
    },
    {
      "text": "Movies",
      "url": "https://www.slashfilm.com/category/movies/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Features",
      "url": "https://www.slashfilm.com/category/features/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Exclusives",
      "url": "https://www.slashfilm.com/category/exclusives/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "The Slashfilmcast Is Now The Filmcast Heres What You Need To Know",
      "url": "https://www.slashfilm.com/582327/the-slashfilmcast-is-now-the-filmcast-heres-what-you-need-to-know/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Id281400220",
      "url": "https://podcasts.apple.com/us/podcast/the-filmcast/id281400220",
      "domain": "podcasts.apple.com",
      "type": "citation"
    },
    {
      "text": "Podcast",
      "url": "https://www.slashfilm.com/category/podcast/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Daily Podcast Kyle Buchanan On The Making Of Mad Max Fury Road",
      "url": "https://www.slashfilm.com/776457/daily-podcast-kyle-buchanan-on-the-making-of-mad-max-fury-road/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Daily Podcast Life Changing Films Movies That Fall Apart In Act 3 And More",
      "url": "https://www.slashfilm.com/580887/daily-podcast-life-changing-films-movies-that-fall-apart-in-act-3-and-more/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Slashfilm Daily Podcast Launched",
      "url": "https://www.slashfilm.com/551971/slashfilm-daily-podcast-launched/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Film Weekly 40803",
      "url": "https://goodpods.com/podcasts/film-weekly-40803",
      "domain": "goodpods.com",
      "type": "citation"
    },
    {
      "text": "Id1254073246",
      "url": "https://podcasts.apple.com/us/podcast/film-weekly/id1254073246",
      "domain": "podcasts.apple.com",
      "type": "citation"
    },
    {
      "text": "Film Weekly Podcast",
      "url": "https://www.podbean.com/podcast-detail/dhip2-2947f7/Film-Weekly-Podcast",
      "domain": "podbean.com",
      "type": "citation"
    },
    {
      "text": "Playlist",
      "url": "https://www.youtube.com/playlist?list=PLYGrLu6DBhGbQkPUeUVdncONmh7xe6yej",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Slashfilm Profile B4b931e3fb2204d6",
      "url": "https://rocketreach.co/slashfilm-profile_b4b931e3fb2204d6",
      "domain": "rocketreach.co",
      "type": "citation"
    },
    {
      "text": "Peter Sciretta",
      "url": "https://natfluence.com/interview/peter-sciretta/",
      "domain": "natfluence.com",
      "type": "citation"
    },
    {
      "text": "Chrisevangelista",
      "url": "https://www.slashfilm.com/author/chrisevangelista/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Movies",
      "url": "https://www.rottentomatoes.com/critics/chris-evangelista/movies",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Chris Evangelista",
      "url": "https://muckrack.com/chris-evangelista",
      "domain": "muckrack.com",
      "type": "citation"
    },
    {
      "text": "Benpearson",
      "url": "https://www.slashfilm.com/author/benpearson/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Benpears",
      "url": "https://www.linkedin.com/in/benpears",
      "domain": "linkedin.com",
      "type": "citation"
    },
    {
      "text": "Jacobhall",
      "url": "https://www.slashfilm.com/author/jacobhall/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Jacobshall",
      "url": "https://muckrack.com/jacobshall",
      "domain": "muckrack.com",
      "type": "citation"
    },
    {
      "text": "Slashfilm Staff",
      "url": "https://www.slashfilm.com/author/slashfilm-staff/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Sandyschaefer",
      "url": "https://www.slashfilm.com/author/sandyschaefer/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Hannahshawwilliams",
      "url": "https://www.slashfilm.com/author/hannahshawwilliams/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Rickstevenson",
      "url": "https://www.slashfilm.com/author/rickstevenson/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Matthewmonagle",
      "url": "https://www.slashfilm.com/author/matthewmonagle/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Chadcollins",
      "url": "https://www.slashfilm.com/author/chadcollins/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Devinmeenan",
      "url": "https://www.slashfilm.com/author/devinmeenan/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Davidcourt",
      "url": "https://www.slashfilm.com/author/davidcourt/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Jeremyherbert",
      "url": "https://www.slashfilm.com/author/jeremyherbert/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Stevenward",
      "url": "https://www.slashfilm.com/author/stevenward/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Total Film Magazine Names Film As Best Major Movie Blog Of 2009",
      "url": "https://www.slashfilm.com/502233/total-film-magazine-names-film-as-best-major-movie-blog-of-2009/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "Total Film Magazine Names Film The Best News Blog Of 2010",
      "url": "https://www.slashfilm.com/507338/total-film-magazine-names-film-the-best-news-blog-of-2010/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "The 100 Most Influential People In Movies",
      "url": "https://www.totalfilm.com/features/the-100-most-influential-people-in-movies",
      "domain": "totalfilm.com",
      "type": "citation"
    },
    {
      "text": "Msn Names Film One Of The Best Movie Sites Of The Decade",
      "url": "https://www.slashfilm.com/2009/12/11/msn-names-film-one-of-the-best-movie-sites-of-the-decade/",
      "domain": "slashfilm.com",
      "type": "citation"
    },
    {
      "text": "1996",
      "url": "https://www.rottentomatoes.com/critics/source/1996",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Slashfilm",
      "url": "https://www.metacritic.com/publication/slashfilm",
      "domain": "metacritic.com",
      "type": "citation"
    },
    {
      "text": "Send",
      "url": "https://etd.ohiolink.edu/acprod/odb_etd/ws/send_file/send?accession=ouhonors1285035004\\u0026disposition=inline",
      "domain": "etd.ohiolink.edu",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "blog",
      "page": "Blog"
    },
    {
      "text": "filmmaking",
      "page": "Filmmaking"
    },
    {
      "text": "journalist",
      "page": "Journalist"
    },
    {
      "text": "San Francisco",
      "page": "San_Francisco"
    },
    {
      "text": "writer",
      "page": "Writer"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "grassroots",
      "page": "Grassroots"
    },
    {
      "text": "film",
      "page": "35_mm"
    },
    {
      "text": "journalism",
      "page": "Journalism"
    },
    {
      "text": "sensationalism",
      "page": "Sensationalism"
    },
    {
      "text": "2000s",
      "page": "2000s"
    },
    {
      "text": "blogosphere",
      "page": "Blogosphere"
    },
    {
      "text": "multimedia",
      "page": "Multimedia"
    },
    {
      "text": "Toronto International Film Festival",
      "page": "Toronto_International_Film_Festival"
    },
    {
      "text": "San Diego Comic-Con",
      "page": "San_Diego_Comic-Con"
    },
    {
      "text": "Static Media",
      "page": "Static_Media"
    },
    {
      "text": "entertainment",
      "page": "Entertainment"
    },
    {
      "text": "Table",
      "page": "Table"
    },
    {
      "text": "film and television",
      "page": "The_Dark_Tower"
    },
    {
      "text": "media conglomerate",
      "page": "Media_conglomerate"
    },
    {
      "text": "Rotten Tomatoes",
      "page": "Rotten_Tomatoes"
    },
    {
      "text": "Metacritic",
      "page": "Metacritic"
    },
    {
      "text": "Marvel",
      "page": "Marvel"
    },
    {
      "text": "DC",
      "page": "DC"
    },
    {
      "text": "Disney",
      "page": "Disney+"
    },
    {
      "text": "Hollywood",
      "page": "Hollywood"
    },
    {
      "text": "Animation",
      "page": "Animation"
    },
    {
      "text": "Comedy",
      "page": "Comedy"
    },
    {
      "text": "Documentary",
      "page": "The_Documentary"
    },
    {
      "text": "Drama",
      "page": "Drama"
    },
    {
      "text": "History",
      "page": "History"
    },
    {
      "text": "Horror",
      "page": "Horror"
    },
    {
      "text": "Thriller",
      "page": "Thriller"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "box office",
      "page": "Box_office"
    },
    {
      "text": "geek",
      "page": "Geek"
    },
    {
      "text": "film",
      "page": "The_Conjuring"
    },
    {
      "text": "podcast",
      "page": "Podcast"
    },
    {
      "text": "Apple Podcasts",
      "page": "Apple_Podcasts"
    },
    {
      "text": "Spotify",
      "page": "Spotify"
    },
    {
      "text": "YouTube",
      "page": "YouTube"
    },
    {
      "text": "film news",
      "page": "News"
    },
    {
      "text": "cinema",
      "page": "Cinema"
    },
    {
      "text": "interviews",
      "page": "Interview"
    },
    {
      "text": "Philadelphia",
      "page": "Philadelphia"
    },
    {
      "text": "Steven Spielberg",
      "page": "Steven_Spielberg"
    },
    {
      "text": "critic",
      "page": "Critic"
    },
    {
      "text": "Critics Choice Association",
      "page": "Critics_Choice_Association"
    },
    {
      "text": "the /Film Daily",
      "page": "The_Film_Daily"
    },
    {
      "text": "University of Texas at Austin",
      "page": "University_of_Texas_at_Austin"
    },
    {
      "text": "Star Trek",
      "page": "Star_Trek"
    },
    {
      "text": "James Bond",
      "page": "James_Bond"
    },
    {
      "text": "Esquire",
      "page": "Esquire"
    },
    {
      "text": "Star Wars: The Last Jedi",
      "page": "Star_Wars:_The_Last_Jedi"
    },
    {
      "text": "Patrick Stewart",
      "page": "Patrick_Stewart"
    },
    {
      "text": "film criticism",
      "page": "Film_criticism"
    },
    {
      "text": "academia",
      "page": "Academia"
    },
    {
      "text": "independent media",
      "page": "Independent_media"
    },
    {
      "text": "blockbuster",
      "page": "Blockbuster"
    },
    {
      "text": "indie",
      "page": "Indie"
    },
    {
      "text": "Screen Rant",
      "page": "Screen_Rant"
    },
    {
      "text": "Comic Book Resources",
      "page": "Comic_Book_Resources"
    },
    {
      "text": "mathematics",
      "page": "Mathematics"
    },
    {
      "text": "anthropology",
      "page": "Anthropology"
    },
    {
      "text": "University of Utah",
      "page": "University_of_Utah"
    },
    {
      "text": "Marvel Cinematic Universe",
      "page": "Marvel_Cinematic_Universe"
    },
    {
      "text": "University of Exeter",
      "page": "University_of_Exeter"
    },
    {
      "text": "diploma",
      "page": "Diploma"
    },
    {
      "text": "New York Film Academy",
      "page": "New_York_Film_Academy"
    },
    {
      "text": "Bleeding Cool",
      "page": "Bleeding_Cool"
    },
    {
      "text": "M. Night Shyamalan",
      "page": "M._Night_Shyamalan"
    },
    {
      "text": "Michael Fassbender",
      "page": "Michael_Fassbender"
    },
    {
      "text": "College of William \\u0026 Mary",
      "page": "College_of_William_\\u0026_Mary"
    },
    {
      "text": "Looper",
      "page": "Looper"
    },
    {
      "text": "TVLine",
      "page": "TVLine"
    },
    {
      "text": "New York City",
      "page": "New_York_City"
    },
    {
      "text": "film studies",
      "page": "Film_studies"
    },
    {
      "text": "Columbia University",
      "page": "Columbia_University"
    },
    {
      "text": "Brooklyn Horror Film Festival",
      "page": "Brooklyn_Horror_Film_Festival"
    },
    {
      "text": "Safdie brothers",
      "page": "Safdie_brothers"
    },
    {
      "text": "Ruben Fleischer",
      "page": "Ruben_Fleischer"
    },
    {
      "text": "IGN",
      "page": "IGN"
    },
    {
      "text": "Polygon",
      "page": "Polygon"
    },
    {
      "text": "Denison University",
      "page": "Denison_University"
    },
    {
      "text": "Marvel comics",
      "page": "Marvel_Comics"
    },
    {
      "text": "anime",
      "page": "Anime"
    },
    {
      "text": "Neon Genesis Evangelion",
      "page": "Neon_Genesis_Evangelion"
    },
    {
      "text": "Florida",
      "page": "Florida"
    },
    {
      "text": "Bloody Disgusting",
      "page": "Bloody_Disgusting"
    },
    {
      "text": "Los Angeles",
      "page": "Los_Angeles"
    },
    {
      "text": "entertainment journalism",
      "page": "Entertainment_journalism"
    },
    {
      "text": "2009",
      "page": "2009"
    },
    {
      "text": "Snapchat",
      "page": "Snapchat"
    },
    {
      "text": "Fido",
      "page": "Fido"
    },
    {
      "text": "print",
      "page": "Print"
    },
    {
      "text": "digital",
      "page": "Digital"
    }
  ],
  "fetched_at": "2025-12-07T07:24:33.226613",
  "elapsed_ms": 626164
}