{
  "topic": "Galaxy",
  "title": "Galaxy",
  "slug": "galaxy",
  "grokipedia_slug": "Galaxy",
  "grokipedia_url": "https://grokipedia.com/page/Galaxy",
  "source": "grokipedia",
  "content": "# Galaxy\n\nA galaxy is a gravitationally bound system consisting of stars, interstellar gas, dust, dark matter, and other components such as stellar remnants, planets, and potentially supermassive black holes at their centers, all orbiting a common gravitational center. These immense structures vary greatly in size, from dwarf galaxies containing millions of stars and spanning a few thousand light-years to giant galaxies with trillions of stars extending over 100,000 light-years or more in diameter. Galaxies serve as the fundamental building blocks of the universe's large-scale structure, forming clusters, superclusters, and vast cosmic filaments through gravitational interactions over billions of years.\n\nGalaxies are primarily classified by their morphology into three main categories: spiral, elliptical, and irregular, a system originally developed by astronomer Edwin Hubble in the 1920s. Spiral galaxies, like the Milky Way, feature a central bulge of older stars surrounded by a rotating disk of gas, dust, and younger stars arranged in prominent spiral arms, often with a bar-shaped structure through the center. Elliptical galaxies appear smooth and featureless, lacking significant gas or dust, and range from nearly spherical to highly elongated shapes dominated by older, reddish stars. Irregular galaxies, such as the Magellanic Clouds, lack a defined structure and often result from gravitational interactions or mergers, containing regions of active star formation. A fourth category, lenticular galaxies, bridges spirals and ellipticals with a disk and central bulge but minimal spiral arms or gas content.\n\nThe Milky Way, Earth's home galaxy, is a barred spiral galaxy approximately 100,000 light-years across, harboring an estimated 100 to 400 billion stars along with vast amounts of gas, dust, and dark matter. It resides in the Local Group, a collection of over 50 galaxies bound by gravity, including the larger Andromeda Galaxy (M31) and smaller satellites like the Large and Small Magellanic Clouds. The observable universe, extending about 93 billion light-years in diameter, is estimated to contain around 2 trillion galaxies, based on deep-field observations from telescopes like Hubble.\n\nDark matter, an invisible form of matter that does not interact with light, constitutes the majority of a galaxy's mass—up to 85% or more—and provides the gravitational scaffolding that holds stars and gas in orbit, preventing galaxies from flying apart due to rotational speeds. Galaxies evolve through mergers, accretion of gas, and interactions with dark matter halos, leading to diverse forms observed today, with ongoing star formation fueled by gravitational collapse in molecular clouds. Active galaxies, a subset featuring supermassive black holes accreting material at their cores, emit intense radiation across the electromagnetic spectrum, influencing galaxy evolution and the intergalactic medium.\n\n## Etymology and Nomenclature\n\n### Etymology\n\nThe term \"galaxy\" derives from the ancient Greek word *galaxias* (γαλαξίας), meaning \"milky,\" a reference to the hazy band of light known as the Milky Way that encircles the night sky and resembles spilled milk. This etymology stems from the Greek root *gala* (γάλα), denoting \"milk\"; the full ancient Greek phrase for the Milky Way was *galaxias kyklos* (γαλαξίας κύκλος), meaning \"milky circle,\" highlighting its luminous, circular appearance as observed by early civilizations. Ancient Greeks, including poets and mythologists, associated this celestial feature with divine narratives, such as the myth of Hera's breast milk creating the milky band when she rejected the infant Heracles.\n\nPhilosophers in the 5th century BCE, such as Democritus, advanced early scientific interpretations of the Milky Way, proposing it consisted of countless distant stars too faint and numerous to be resolved by the naked eye, rather than a continuous luminous substance. Democritus suggested this stellar aggregation formed part of an infinite universe unbound by traditional cosmological spheres, marking one of the earliest atomistic explanations for its glow. Anaxagoras also thought the Milky Way might consist of distant stars. These ideas persisted through antiquity but remained speculative until the advent of observational tools.\n\nThe Renaissance brought empirical confirmation through Galileo's telescopic observations in 1610, which resolved the Milky Way's nebulous appearance into a dense congregation of individual stars, validating ancient philosophical notions and linking the term *galaxias* directly to stellar phenomena. Published in his work *Sidereus Nuncius*, these findings shifted perceptions from a singular cosmic feature to a vast stellar system encompassing the Sun.\n\nBy the 19th and early 20th centuries, the term \"galaxy\" expanded beyond the Milky Way to encompass external stellar systems, following Edwin Hubble's 1924 observations that identified the Andromeda \"nebula\" as a separate galaxy far beyond our own. This breakthrough, confirmed through Cepheid variable measurements establishing vast distances, transformed \"galaxy\" from a descriptor of our local stellar band into a general term for independent, gravitationally bound collections of stars, gas, and dust, often called \"island universes.\"\n\n### Nomenclature\n\nGalaxies are systematically classified and cataloged using standardized schemes that facilitate identification and study. The foundational classification system was developed by Edwin Hubble in 1926, categorizing galaxies primarily into ellipticals (denoted as E followed by a numerical subtype from 0 to 7, indicating increasing ellipticity) and spirals (S with subtypes a to d for tightness of spiral arms), later visualized in his 1936 tuning fork diagram that arranged these types in a fork-like sequence from ellipticals through lenticulars (S0) to spirals.\n\nHistorical catalogs provide enduring designations for many galaxies. The Messier catalog (M1 to M110), compiled by Charles Messier between 1771 and 1781, initially listed deep-sky objects including galaxies to aid comet hunting but remains a key reference for bright examples like M31 (Andromeda). The New General Catalogue (NGC), published in 1888 by J.L.E. Dreyer, enumerates over 7,800 nebulae and clusters, many now recognized as galaxies, with entries like NGC 4565. Its supplements, the Index Catalogues (IC, 1895 and 1908), added thousands more objects, such as IC 1101. Modern surveys like the Sloan Digital Sky Survey (SDSS) assign coordinate-based designations, e.g., SDSS J004137.30+405941.2, to millions of galaxies discovered since 2000.\n\nSpecial notations denote subtypes with distinct properties. Active galaxies receive prefixes like Seyfert (Sy) for spirals with bright, emission-line nuclei, as defined by Carl Seyfert in 1943, or QSO for quasi-stellar objects (quasars) identified by Maarten Schmidt in 1963. Dwarf galaxies use modifiers such as dE for dwarf ellipticals, part of the extended Hubble-de Vaucouleurs system.\n\nFor uncataloged or newly discovered galaxies, the International Astronomical Union (IAU) endorses provisional designations based on equatorial coordinates, often via databases like the Principal Galaxies Catalogue (PGC) in HYPERLEDA, where PGC numbers (e.g., PGC 10001) serve as unique identifiers until formal catalog entry.\n\n## History of Observation\n\n### Early Observations\n\nAncient civilizations observed the Milky Way, a prominent band of light across the night sky, with the naked eye long before the advent of telescopes, often interpreting it through mythological or philosophical lenses. In the 4th century BCE, Aristotle proposed in his *Meteorology* that the Milky Way was an atmospheric phenomenon resulting from the combustion of earthy exhalations in the upper regions of Earth's atmosphere, rather than a celestial feature composed of stars. Similarly, Chinese astronomers during the Warring States period (4th century BCE) recorded detailed observations of the heavens, including the Milky Way—known as the \"Silver River\" or *Tianhe*—as part of their early star catalogs and celestial mappings, attributing it to divine or natural patterns in the sky.\n\nThe invention of the telescope revolutionized these views in the early 17th century. In his 1610 publication *Sidereus Nuncius*, Galileo Galilei reported the first telescopic resolution of the Milky Way into a multitude of individual stars, demonstrating that its hazy appearance was due to the blended light of countless distant stars rather than a continuous luminous band. This observation shifted perceptions from atmospheric or mythical explanations toward a stellar interpretation, laying groundwork for understanding the Milky Way as a vast aggregation of stars.\n\nBy the late 18th century, astronomers began probing deeper into the structure of the stellar system. William Herschel conducted star gauges in the 1780s, systematically counting stars in various directions to map the distribution within what he termed the \"construction of the heavens,\" leading him to hypothesize that the Milky Way was a flattened, lens-shaped system of stars and that some faint nebulae might represent distant \"island universes\"—separate stellar systems analogous to our own. In the mid-19th century, William Parsons, the Third Earl of Rosse, employed his massive 72-inch Leviathan reflector telescope, completed in 1845, to scrutinize nebulae; his observations of Messier 51 (M51) revealed intricate spiral structures, suggesting these objects were organized systems rather than amorphous clouds.\n\nThroughout the 18th and 19th centuries, debates persisted over the true nature of nebulae, particularly whether they were gaseous clouds within the Milky Way or independent stellar aggregations. Pioneers like Herschel advocated for the stellar hypothesis, viewing unresolved nebulae as remote clusters of stars too distant to distinguish individually, while others, informed by emerging spectroscopy, argued for gaseous compositions based on emission lines observed in brighter examples. These discussions highlighted the limitations of early instrumentation and fueled ongoing efforts to classify celestial objects beyond our local stellar realm.\n\n### The Milky Way\n\nThe Milky Way has been perceived by ancient cultures as a luminous river or path across the night sky, often imbued with mythological significance. In Greek mythology, it originated from the spilled milk of the goddess Hera while nursing the infant Heracles, creating a band of light visible from Earth. Among Native American traditions, such as those of the Lakota, it served as a spirit path guiding souls to the afterlife, while the Cherokee viewed it as a trail of scattered cornmeal left by a thieving dog. These interpretations highlight its role as a celestial feature central to storytelling and cosmology long before modern astronomy.\n\nEarly telescopic observations in the 17th century, such as Galileo's 1610 resolution of the Milky Way into individual stars, began revealing its stellar nature, setting the stage for structural studies. By the early 20th century, astronomers used globular clusters to map the galaxy's extent. In 1918, Harlow Shapley analyzed the distances to 69 globular clusters, determining that the Sun lies far from the galactic center—about 50,000 light-years away—challenging the geocentric view of the cosmos. This work established the Milky Way as a vast, disk-like system with a central bulge.\n\nFurther insights into the galaxy's dynamics came from studies of stellar motions. In 1927, Jan Oort derived the first rotation curve for the Milky Way using radial velocities of nearby stars, demonstrating differential rotation where inner regions orbit faster than outer ones, consistent with a flattened disk structure. These findings confirmed the galaxy's spiral nature and provided evidence for unseen mass influencing the orbits.\n\nObserving the Milky Way from within poses significant challenges due to interstellar dust, which obscures optical light along lines of sight toward the galactic plane and center. To overcome this, astronomers rely on infrared wavelengths, which penetrate dust to reveal embedded stars and structures, and radio observations, which trace neutral hydrogen and synchrotron emission unaffected by extinction.\n\nRecent advancements have produced unprecedented maps of the galaxy. The 2025 GLEAM-X survey, conducted with the Murchison Widefield Array, delivered the largest low-frequency radio image of the Milky Way's southern plane, cataloging 98,000 sources with twice the resolution and ten times the sensitivity of prior maps. This \"radio color\" view highlights new details in galactic structures, including the Fermi bubbles—giant gamma-ray emitting lobes extending from the center.\n\n### Distinction from Nebulae\n\nIn the early 20th century, astronomers debated the nature of spiral nebulae, with some viewing them as distant, independent \"island universes\" separate from the Milky Way, while others considered them gaseous clouds within our own galaxy. This tension culminated in the Great Debate of 1920 between Heber D. Curtis, who supported the island universe hypothesis by arguing that spiral nebulae were extragalactic systems based on their resolved features and novae brightnesses, and Harlow Shapley, who contended they were intra-galactic phenomena within the vast Milky Way, citing the absence of detectable proper motions and the scale of globular clusters.\n\nThe debate was resolved decisively by Edwin Hubble's observations using the 100-inch Hooker Telescope at Mount Wilson Observatory. In 1923, Hubble identified a Cepheid variable star in the Andromeda Nebula (M31), and by 1925, he had measured distances to several such variables, establishing M31 at approximately 900,000 parsecs (about 3 million light-years) away—far beyond the Milky Way's boundaries. This confirmed that spiral nebulae were separate galaxies, validating Curtis's position and transforming the island universe hypothesis from speculation to empirical fact.\n\nFurther evidence emerged in the 1930s through spectroscopic observations revealing distinct radial velocities and redshifts for these extragalactic systems. Vesto Slipher's earlier work had measured high velocities for some nebulae, but Milton Humason's spectra from Mount Wilson in the 1930s, combined with Hubble's data, demonstrated systematic redshifts independent of Milky Way motion, indicating these were vast, receding galaxies rather than local clouds.\n\nIn 1952, Walter Baade refined these understandings by distinguishing two stellar populations—Population I (younger, brighter Cepheids in spiral arms) and Population II (older, fainter stars in halos)—which doubled previous distance estimates to galaxies like M31 by correcting the Cepheid period-luminosity relation. This adjustment solidified the extragalactic paradigm, emphasizing the immense scale of the universe beyond our galaxy.\n\n### Multi-Wavelength Techniques\n\nMulti-wavelength techniques in galaxy observations leverage the full electromagnetic spectrum to overcome limitations inherent to single-wavelength studies, providing complementary insights into stellar populations, interstellar medium, gas dynamics, and energetic processes. By combining data from optical, radio, infrared, X-ray, ultraviolet, and gamma-ray regimes, astronomers achieve a more complete understanding of galaxy structure and evolution, revealing phenomena obscured in one band but prominent in another.\n\nOptical observations of galaxies are significantly hampered by dust extinction, where interstellar dust absorbs and scatters shorter wavelengths, dimming light from distant or obscured regions and complicating measurements of star formation rates. The Hubble Space Telescope (HST) mitigates these issues through space-based imaging that avoids atmospheric distortion and enables deep-field surveys, such as the Hubble Deep Field, which capture faint, distant galaxies with reduced extinction effects and higher resolution.\n\nIn the radio domain, the 21-cm emission line from neutral hydrogen (HI) serves as a primary tool for mapping gas distribution and dynamics in galaxies, unaffected by dust and allowing probes of extended structures like spiral arms and rotation curves. Facilities like the Arecibo Observatory have historically excelled in wide-area 21-cm surveys, detecting HI in thousands of galaxies to study their kinematics and environments. The Atacama Large Millimeter/submillimeter Array (ALMA) complements this by resolving molecular gas tracers at higher angular resolution, enhancing dynamical studies in star-forming regions. Radio observations also led to the discovery of radio galaxies in the 1950s, such as Cygnus A, revealing powerful synchrotron emissions from relativistic jets powered by supermassive black holes.\n\nInfrared observations penetrate dust more effectively than optical wavelengths, enabling direct views of embedded star formation and cooler components of the interstellar medium. The Spitzer Space Telescope has been instrumental in mapping polycyclic aromatic hydrocarbons and dust-obscured starbursts, providing reliable estimates of star formation rates in galaxies like those in the Great Observatories All-Sky LIRG Survey. The James Webb Space Telescope (JWST), with its enhanced sensitivity, further advances this by resolving young stars and warm dust in dense regions; for instance, 2025 observations of Sagittarius B2 reveal massive star formation hidden behind thick dust clouds, highlighting infrared's role in uncovering obscured activity.\n\nUltraviolet and X-ray observations target high-energy processes, with ultraviolet revealing hot, young stars and X-rays detecting multimillion-degree gas. NASA's Chandra X-ray Observatory has mapped diffuse hot gas in galaxy clusters, such as in the Perseus Cluster, tracing intracluster medium dynamics and feedback from active galactic nuclei. Gamma-ray telescopes like Fermi detect emissions from relativistic jets in active galactic nuclei, probing particle acceleration and beaming effects in blazars.\n\nSynergistic multi-wavelength surveys integrate these data for holistic galaxy analyses; the Sloan Digital Sky Survey (SDSS), primarily optical, combines with infrared from Spitzer and radio from NRAO arrays to classify galaxies, measure redshifts, and study evolutionary trends across diverse populations. Such integrations, as in the SDSS-based multi-wavelength catalogs, reveal correlations between star formation, black hole activity, and large-scale structure.\n\n### Modern Research\n\nSince the 1990s, large-scale astronomical surveys have revolutionized galaxy studies by providing unprecedented volumes of data on their distribution, structure, and evolution. The Sloan Digital Sky Survey (SDSS), initiated in 2000, has mapped hundreds of millions of galaxies across vast swaths of the sky, enabling detailed analyses of their redshifts, morphologies, and clustering patterns that inform models of cosmic structure formation. Complementing this, the European Space Agency's Gaia mission, launched in 2013 and concluding its primary observations in 2025, has delivered precise astrometric data for over two billion stars, revealing the dynamical architecture of the Milky Way, including the motions of stellar streams and the galaxy's rotation curve.\n\nThe James Webb Space Telescope (JWST), operational since 2022, has profoundly impacted observations of high-redshift galaxies, challenging preconceptions about early universe formation timelines by revealing mature structures earlier than predicted by standard models. In 2024, JWST and the Atacama Large Millimeter/submillimeter Array (ALMA) identified REBELS-25, the most distant known rotating disk galaxy resembling the Milky Way, existing just 700 million years after the Big Bang and exhibiting ordered rotation despite its youth. Building on this, ALMA and JWST observations in 2025 uncovered a clumpy, rotating galaxy—nicknamed the \"Cosmic Grapes\"—at approximately 900 million years post-Big Bang, composed of at least 15 massive star-forming clumps, which suggests rapid, bursty growth mechanisms that demand revisions to galaxy assembly theories. These findings indicate that early galaxies formed and evolved more efficiently than anticipated, potentially shortening the timeline for cosmic reionization and prompting updates to ΛCDM cosmology simulations.\n\nEvidence for dark matter's role in galaxy dynamics has been bolstered by both observations and simulations. The 2006 analysis of the Bullet Cluster (1E 0657-558) used gravitational lensing to separate the distribution of dark matter from hot intracluster gas during a cluster collision, providing direct empirical proof of dark matter's gravitational influence independent of baryonic matter. More recently, 2025 supercomputer simulations predict up to 100 undetected ultra-faint satellite galaxies orbiting the Milky Way, stripped of much of their dark matter halos yet luminous enough to evade current telescopes, which could resolve tensions in the \"missing satellites\" problem within the cold dark matter paradigm.\n\nRecent discoveries have also unveiled unexpected phenomena in galactic environments. In 2025, astronomers observed the tidal disruption event AT 2024tvd, where a supermassive black hole shredded a star outside its host galaxy's center, producing the fastest-evolving radio emission recorded for such an event and indicating the presence of wandering black holes. Additionally, the object ASKAP J1832-0911, detected in 2025, emits synchronized radio and X-ray pulses every 44 minutes from within the Milky Way, defying classification as a known pulsar or magnetar and suggesting novel compact object physics.\n\n## Morphology and Classification\n\n### Elliptical Galaxies\n\nElliptical galaxies are classified within Edwin Hubble's tuning fork diagram using the \"E\" designation, ranging from E0 for nearly spherical shapes to E7 for highly elongated forms, where the numerical index approximates 10 times the ellipticity (1 - minor-to-major axis ratio). These galaxies exhibit smooth, featureless appearances dominated by older stellar populations, typically lacking significant interstellar gas and dust that would fuel ongoing star formation. Their stellar content primarily consists of low-mass, long-lived stars formed in earlier epochs, contributing to their characteristic red colors in optical wavelengths.\n\nKey physical properties of elliptical galaxies include high stellar velocity dispersions, often exceeding 200 km/s in their central regions, which reflect the random orbital motions of stars rather than organized rotation. Nearly all massive elliptical galaxies harbor supermassive black holes at their cores, with masses scaling tightly with the velocity dispersion via the relation \\( M_\\bullet \\propto \\sigma^4 \\), influencing galactic dynamics and feedback processes. A prominent example is Messier 87 (M87), a giant elliptical in the Virgo Cluster known for its powerful radio emissions from a relativistic jet powered by its central black hole.\n\nSubtypes of elliptical galaxies include cD galaxies, which are brightest cluster galaxies featuring extended stellar halos that blend into the surrounding intracluster light, likely built through repeated accretion and stripping of satellite galaxies. Another subtype comprises shell galaxies, characterized by concentric shell-like structures in their outskirts formed from tidal debris during minor mergers, serving as markers of recent dynamical interactions.\n\nFormation theories for elliptical galaxies predominantly invoke major mergers between gas-rich disk galaxies, as first proposed by Toomre and Toomre, where violent relaxation and dynamical heating produce the observed spheroidal shapes and depleted gas reservoirs. These events trigger intense but short-lived starbursts, after which feedback from supernovae and active galactic nuclei quenches further star formation, leading to the quiescent nature of modern ellipticals.\n\nDemographically, elliptical galaxies are most prevalent in the dense cores of galaxy clusters, where environmental processes like ram-pressure stripping and harassment suppress gas inflows and star formation, resulting in specific star formation rates typically below 0.01 M_\\(\\odot\\) yr\\(^{-1}\\) (M_\\(*\\))^{-1} for massive systems. This contrasts with field environments, where spirals dominate, highlighting the role of cluster dynamics in shaping elliptical populations.\n\n### Spiral Galaxies\n\nSpiral galaxies are characterized by a prominent rotating disk of stars, gas, and dust, surrounding a central bulge and often featuring distinctive spiral arms that extend from the nucleus. The central bulge consists of older, metal-rich stars concentrated in a spheroidal or ellipsoidal distribution, while the disk is a thin, flattened structure where younger stars and interstellar medium predominate. Spiral arms appear as denser regions winding through the disk, rich in star-forming regions, and are typically embedded within a diffuse stellar halo composed of older stars and globular clusters orbiting the galaxy. Approximately two-thirds of spiral galaxies exhibit a central bar structure, a elongated feature of older stars that spans the nucleus and drives gas inflows toward the center.\n\nThe morphological subtypes of spiral galaxies, as refined in the Hubble-de Vaucouleurs classification system, range from Sa to Sd based on the relative sizes of the bulge and disk as well as the openness of the spiral arms. Sa galaxies possess large, prominent bulges with tightly wound arms and minimal gas content, facilitating lower rates of star formation, whereas Sd subtypes feature small or negligible bulges, loosely wound arms, and abundant gas supporting high star formation activity. Barred spirals, denoted SBa through SBd, mirror this sequence but include a central bar; for instance, SBa types have tightly wrapped arms around a large bulge and bar, while SBd variants show flocculent, irregular arms with a minimal bulge. This classification highlights a progression from early-type (Sa, SBa) spirals with dominant bulges to late-type (Sc-Sd, SBc-SBd) ones emphasizing the disk.\n\nThe dynamics of spiral galaxies are governed by differential rotation, where inner regions orbit faster than outer ones, maintained by the density wave theory proposed by Lin and Shu. This theory posits that spiral arms are not fixed material structures but rather quasi-stationary density waves propagating through the disk, compressing gas and triggering star formation as stars and gas pass through them at different speeds. Rotation curves of spiral galaxies remain remarkably flat at large radii, indicating orbital speeds that do not decline as expected from visible mass alone, which requires an extended dark matter halo to provide the necessary gravitational potential. Exemplary cases include the Milky Way, classified as an SBbc barred spiral with a weak bar and multiple arms, and the Andromeda Galaxy (M31), an unbarred SA(s)b type with well-defined arms.\n\nA subset of spiral galaxies, known as super spirals, stands out for their exceptional luminosity and star formation rates, often exceeding 30 times that of the Milky Way, driven by their massive disks and interactions that fuel prolonged activity. These galaxies, typically late-type spirals with high gas reservoirs, challenge standard evolutionary models by sustaining disk stability at stellar masses above 10^11 solar masses, where most spirals quench. Their flat rotation curves further underscore the role of dark matter in supporting such extended, dynamically stable structures.\n\n### Irregular and Other Morphologies\n\nIrregular galaxies constitute a class of galaxies lacking the symmetric structures of elliptical or spiral forms, exhibiting chaotic distributions of stars, gas, and dust. In the Hubble classification scheme, they are denoted as Irr and subdivided into two main types based on their appearance and underlying structure. Irr I galaxies, also known as Magellanic irregulars, display some underlying disk-like or barred features with patchy, asymmetric star-forming regions, as exemplified by the Large Magellanic Cloud (LMC), a satellite of the Milky Way. These systems often host prominent HII regions and OB associations, indicating active star formation amid their disorganized morphology.\n\nIrr II galaxies, or amorphous irregulars, appear more disrupted and lack discernible organized structure, frequently resulting from gravitational interactions or mergers that distort their form. Examples include systems like M82, which shows extensive dust lanes and intense starburst activity within its irregular envelope. These galaxies tend to have unresolved stellar clusters and may exhibit redder colors due to dust obscuration or evolved stellar populations in some cases.\n\nLenticular galaxies, classified as S0 in the Hubble sequence, represent an intermediate morphology between spirals and ellipticals, featuring a prominent central bulge and a thin disk but devoid of spiral arms. Their disks are smooth and featureless, composed primarily of older stars with minimal ongoing star formation, and they often contain modest amounts of interstellar gas and dust. This transitional form suggests evolutionary links, potentially arising from the quenching of star formation in former spirals.\n\nPeculiar galaxies encompass a variety of non-standard morphologies arising from dynamical processes, such as ring galaxies formed through head-on collisions where a companion galaxy passes through a disk, expanding stellar material into a ring-like structure. Polar ring galaxies feature an orthogonal ring of gas, dust, and young stars encircling an elliptical or lenticular host, likely accreted from a disrupted companion during a merger. These configurations highlight the role of gravitational interactions in producing irregular features, though detailed mechanisms are explored in studies of galaxy collisions.\n\nRare forms include Hoag's Object, a striking example of a nearly perfect ring galaxy discovered in 1950, consisting of a bright yellow core surrounded by a blue stellar ring spanning about 100,000 light-years, with its formation mechanism still debated but possibly involving internal dynamical instabilities or minor mergers. Overall, irregular and other morphologies account for approximately 5-10% of observed galaxies, underscoring their significance in understanding evolutionary pathways beyond classical types.\n\n### Dwarf Galaxies\n\nDwarf galaxies represent the smallest and most abundant class of galactic systems, often serving as satellites to larger galaxies and playing a pivotal role in understanding cosmic structure formation.[https://arxiv.org/abs/2502.02656] These low-mass entities are typically classified into several morphological types, including dwarf ellipticals (dE), which exhibit smooth, elliptical shapes with little gas or dust; dwarf irregulars (dI), characterized by chaotic structures and ongoing star formation; and dwarf spheroidals (dSph), which are diffuse, nearly spherical collections of old stars with minimal gas content.[https://arxiv.org/abs/1709.10249] Notable examples include the Large and Small Magellanic Clouds as dI types orbiting the Milky Way, while dSph systems like the Draco Dwarf highlight the diversity within this category.[https://arxiv.org/abs/1709.10249] Dwarf ellipticals fall under the early-type classifications in the Hubble sequence, adapted for smaller scales.[https://arxiv.org/abs/1709.10249]\n\nA defining property of dwarf galaxies is their low luminosity, generally less than 1% of the Milky Way's total stellar output of approximately 5 × 10^{10} L_\\odot, with many ultra-faint examples falling below 10^5 L_\\odot.[https://ned.ipac.caltech.edu/level5/Sept18/Simon/Simon1.html] This dimness arises from their sparse stellar populations, often containing fewer than 10^8 stars compared to the Milky Way's hundreds of billions.[https://science.nasa.gov/universe/galaxies/types/] Dwarf galaxies also feature exceptionally high dark matter fractions, with mass-to-light ratios (M/L) ranging from 10 to 100 in dSph systems, far exceeding those in larger galaxies and indicating that dark matter dominates their total mass budgets.[https://ned.ipac.caltech.edu/level5/March15/Roos/Roos7.html] For instance, the Draco Dwarf, located about 250,000 light-years from Earth, demonstrates this through its stellar motions, which reveal a cusp-like dark matter distribution consistent with cosmological predictions.[https://science.nasa.gov/missions/hubble/nasas-hubble-traces-dark-matter-in-dwarf-galaxy-using-stellar-motions/]\n\nIn the hierarchical model of galaxy formation, dwarf galaxies act as fundamental building blocks, merging over cosmic time to assemble larger structures like the Milky Way.[https://www.preprints.org/manuscript/202508.0394/v1] As satellites, they orbit massive hosts and provide insights into accretion processes, with recent 2025 simulations based on the Aquarius project predicting up to 100 additional such systems around the Milky Way, for a total of around 160, including dozens of undetected \"orphaned\" dwarfs stripped of their dark matter halos.[https://www.universetoday.com/articles/the-milky-way-could-be-surrounded-by-100-satellite-galaxies] These simulations suggest that half of the satellites in the inner halo regions could be faint and elusive, challenging current observational censuses that have identified around 60 confirmed Milky Way satellites.[https://www.universetoday.com/articles/the-milky-way-could-be-surrounded-by-100-satellite-galaxies]\n\nAdvances in observations have enabled the resolution of individual stars within dwarf galaxies, revealing their star formation histories and chemical evolution. The Hubble Space Telescope (HST) has mapped stellar motions in systems like the Draco Dwarf over nearly two decades, confirming high dark matter content through velocity dispersions.[https://science.nasa.gov/missions/hubble/nasas-hubble-traces-dark-matter-in-dwarf-galaxy-using-stellar-motions/] More recently, the James Webb Space Telescope (JWST) has provided unprecedented depth in near-infrared imaging, resolving stellar populations in dwarf galaxies such as WLM at 970 kpc distance down to magnitudes fainter than the oldest main-sequence turnoff.[https://iopscience.iop.org/article/10.3847/1538-4357/ad1105] These JWST data indicate episodic star formation in dwarfs, with significant mass buildup in the last few billion years following early pauses.[https://iopscience.iop.org/article/10.3847/1538-4357/ad1105] Dwarf galaxies comprise the vast majority—estimated at over 90%—of all galaxies in the universe, underscoring their dominance in number density despite their faintness.[https://arxiv.org/abs/2502.02656]\n\n## Special Types\n\n### Interacting Galaxies\n\nInteracting galaxies are systems where two or more galaxies influence each other through gravitational forces, leading to significant morphological and dynamical changes. These interactions occur frequently in the universe, particularly in dense environments like galaxy groups and clusters, where close encounters are more likely. The primary mechanism driving these changes is tidal forces, which arise from the differential gravitational pull between the galaxies and their extended halos of dark matter and stars. As galaxies approach one another, these forces stretch and distort their structures, often producing prominent features such as tidal tails—long streams of stars, gas, and dust ejected from the outer regions—and bridges connecting the interacting pair.\n\nA classic example of such distortion is seen in the Antennae Galaxies (NGC 4038 and NGC 4039), a pair of colliding spiral galaxies located approximately 62 million light-years away in the constellation Corvus. During their initial encounter about 500 million years ago, tidal forces generated extensive tails resembling antennae, along with bridges of material linking the two galaxies. These features highlight how interactions can reshape spiral arms into chaotic structures, compressing gas clouds and facilitating the formation of new star clusters along the tidal debris. Similarly, the Mice Galaxies (NGC 4676), situated 300 million light-years away in Coma Berenices, exhibit dramatic long tails of stars and gas extending from each spiral galaxy, earned their name from these rodent-like appendages formed during a recent flyby.\n\nThe progression of interactions typically unfolds in stages, beginning with a flyby where galaxies pass close enough to exert tidal influence without immediate merger, followed by orbital decay leading to a full merger. In flybys, the galaxies may separate after the encounter, leaving behind distorted morphologies, while mergers involve the coalescence into a single entity over hundreds of millions of years. Numerical simulations, such as those using the GADGET code—a parallel N-body and hydrodynamical simulation tool—model these processes by tracking the evolution of stellar disks, gas dynamics, and dark matter halos in idealized or cosmological contexts. These simulations predict outcomes like the stripping of outer material during flybys and the central concentration of gas in mergers, providing insights into observable features in real systems.\n\nOne well-studied future interaction is the impending collision between the Milky Way and the Andromeda Galaxy (M31), our nearest large galactic neighbor approximately 2.5 million light-years away. Recent models, based on Gaia and Hubble observations as of 2025, suggest approximately a 50% chance that Andromeda's approach at about 110 kilometers per second will lead to a merger within roughly 10 billion years, after which the combined system may evolve into a single elliptical galaxy over the subsequent billions of years. This event will not destroy stars outright due to the vast empty spaces between them but will profoundly alter the galaxies' shapes through tidal disruptions.\n\nThe consequences of these interactions extend to galaxy evolution, as they often trigger bursts of star formation by funneling gas toward the centers, and mergers between spiral galaxies frequently result in the formation of elliptical galaxies. For instance, the dynamical mixing during a spiral-spiral merger dissipates the ordered rotation of disks, producing a more spheroidal, pressure-supported system characteristic of ellipticals. Such processes underscore the role of interactions in transforming galaxy populations over cosmic time, with simulations confirming that repeated mergers contribute to building the massive ellipticals observed in clusters. Interactions can also produce irregular morphologies, as seen in some dwarf systems disrupted by larger companions.\n\n### Starburst Galaxies\n\nStarburst galaxies are defined as systems experiencing an intense and elevated rate of star formation, typically exceeding 10–100 M$_\\odot$ yr$^{-1}$, in contrast to the quiescent rate of approximately 1 M$_\\odot$ yr$^{-1}$ observed in typical spiral galaxies like the Milky Way. This heightened activity represents a temporary deviation from a galaxy's long-term average, often concentrating in compact central regions or nuclear areas where gas densities are exceptionally high. Such episodes can contribute significantly to a galaxy's stellar mass buildup, sometimes accounting for up to 10–50% of its total stellar content in a brief period.\n\nThe primary triggers for starburst activity include major galaxy mergers, which gravitationally perturb gas reservoirs and funnel material toward the galactic center, and internal dynamical processes like bar instabilities that drive radial gas inflows. Interactions with companion galaxies commonly initiate these events by compressing interstellar medium and enhancing molecular cloud formation. A prominent example is Messier 82 (M82), a nearby irregular galaxy where tidal interactions with M81 have induced inflows of neutral hydrogen, fueling a central starburst with rates estimated at 10–20 M$_\\odot$ yr$^{-1}$. Ultra-luminous infrared galaxies (ULIRGs), such as Arp 220, exemplify merger-driven starbursts, where colliding gas-rich disks produce luminosities exceeding 10$^{12}$ L$_\\odot$ primarily from obscured star formation.\n\nObservationally, starburst galaxies are identified by prominent spectroscopic features, including strong forbidden emission lines like [O II] at 3727 Å and Balmer lines such as Hα, which trace the ionization of gas by massive, short-lived stars. These systems also display substantial infrared excess, as ultraviolet radiation from young stars is absorbed by dust and re-emitted at longer wavelengths, often making up over 90% of their bolometric luminosity in the far-infrared. Such signatures are detectable across multi-wavelength surveys, from optical spectroscopy to submillimeter observations.\n\nStarburst phases are short-lived on cosmic timescales, enduring roughly 10–100 million years before subsiding due to depletion of available gas or regulatory feedback. Energetic outflows from supernovae and stellar winds during these events can heat or expel interstellar gas, quenching subsequent star formation and transitioning the galaxy toward a more quiescent state. This feedback plays a crucial role in galaxy evolution, preventing indefinite star formation and influencing the overall stellar mass function.\n\n### Active Galaxies\n\nActive galaxies, also known as active galactic nuclei (AGN), are galaxies whose luminosities are dominated by energetic processes at their centers rather than by stellar emission. These centers harbor supermassive black holes with masses typically ranging from 10^6 to 10^9 solar masses, accreting surrounding gas and dust at high rates. The primary components of an AGN include a hot accretion disk formed by infalling material spiraling toward the black hole, which heats up and emits radiation primarily in ultraviolet and X-ray wavelengths; relativistic jets of plasma ejected along the black hole's spin axis, extending up to hundreds of kiloparsecs; the broad-line region (BLR), a compact zone of fast-moving gas clouds (velocities ~10^3–10^4 km/s) ionized by the disk's radiation, producing broad emission lines; and the narrow-line region (NLR), a more extended area of slower-moving gas (velocities ~100–1000 km/s) that generates narrower emission lines.\n\nThe unified model of AGN posits that the diverse observed appearances of these objects arise primarily from orientation effects relative to the observer, rather than intrinsic differences. In this framework, a central engine—comprising the black hole and accretion disk—is surrounded by a dusty torus that obscures parts of the system; when viewed face-on, the BLR and disk are visible, while edge-on views show the NLR and torus. Jets aligned toward the observer result in beaming effects that amplify emission. This model unifies various AGN subtypes by accounting for viewing angle, obscuration, and relativistic effects, with supporting evidence from multi-wavelength observations showing consistent core structures across classes.\n\nAGN are classified into several subtypes based on their spectral characteristics, luminosity, and radio properties. Seyfert galaxies, typically found in spiral hosts, are divided into Type 1 (showing broad and narrow emission lines from the BLR and NLR) and Type 2 (lacking broad lines due to obscuration by the torus), with luminosities around 10^43–10^44 erg/s. Quasars represent the high-luminosity, distant counterparts, often appearing star-like due to their brightness (up to 10^46 erg/s or more), powered by efficient accretion and visible across the electromagnetic spectrum. Radio galaxies exhibit prominent synchrotron emission from jets, classified by the Fanaroff-Riley scheme into FR I (edge-darkened, lower-power jets that fade with distance, associated with elliptical galaxies) and FR II (edge-brightened, higher-power jets terminating in hotspots and lobes). Blazars, including BL Lac objects and flat-spectrum radio quasars, are AGN with jets pointed nearly directly at Earth, causing relativistic beaming that boosts observed flux by factors of 10–100, resulting in highly variable, non-thermal spectra dominated by synchrotron and inverse Compton emission. Low-ionization nuclear emission-line regions (LINERs) show low-excitation spectra with weak forbidden lines, often in nearby galaxies, and may represent a low-luminosity AGN population or transitional states. Overall, AGN energy outputs can reach up to 10^46 erg/s in bolometric luminosity, exceeding the combined output of their host galaxy's stars by orders of magnitude.\n\nProminent examples illustrate these features. Centaurus A, a nearby elliptical galaxy, exemplifies an FR I radio galaxy with extensive radio lobes spanning over 1 million light-years, formed by its jets interacting with intergalactic medium, and a dusty disk obscuring parts of its active nucleus. In 2025, observations of the tidal disruption event (TDE) AT 2024tvd revealed an off-center supermassive black hole in a distant galaxy shredding a star, producing radio bursts that highlighted wandering black holes capable of AGN-like activity outside galactic cores. These cases underscore how AGN dynamics, including occasional TDEs, contribute to galactic evolution through feedback mechanisms.\n\n### Luminous Infrared Galaxies\n\nLuminous infrared galaxies (LIRGs) are galaxies whose total infrared luminosity, integrated over the 8–1000 μm wavelength range, exceeds $10^{11} L_\\odot$. This emission makes them the dominant population of extragalactic objects at luminosities above this threshold in the local universe (z ≲ 0.3). Within this class, ultraluminous infrared galaxies (ULIRGs) have $L_{\\rm IR} \\u003e 10^{12} L_\\odot$, while hyperluminous infrared galaxies (HyLIRGs) reach $L_{\\rm IR} \\u003e 10^{13} L_\\odot$, representing the most extreme end of infrared-luminous systems.\n\nThe infrared output of LIRGs arises from dust grains absorbing ultraviolet radiation produced by massive young stars in intense starbursts or by accretion onto supermassive black holes in active galactic nuclei (AGN), with the dust re-emitting the absorbed energy thermally in the infrared. These processes are often triggered by major mergers of gas-rich disk galaxies, which funnel dense molecular gas into compact central regions, fueling obscured activity. A prototypical example is Arp 220, a nearby ULIRG at z = 0.018 undergoing an advanced merger, where the infrared luminosity is dominated by a circumnuclear starburst embedded in thick dust. LIRGs frequently exhibit overlap with starburst galaxies through their high star formation rates or with AGN via buried nuclear activity.\n\nThe prevalence of LIRGs evolves strongly with cosmic time, peaking at redshifts z ≈ 1–2, which aligns with the maximum of the cosmic star formation rate density approximately 3.5 Gyr after the Big Bang. At these epochs, their abundance increases by factors of hundreds compared to the local universe, reflecting enhanced merger rates and gas availability. LIRGs contribute substantially to the cosmic star formation history, accounting for a large fraction of the obscured star formation that infrared surveys reveal was dominant at z \\u003e 1, helping build up the stellar mass in galaxies during the universe's most active phase.\n\nObservations of LIRGs have been advanced by space-based infrared telescopes, with the Spitzer Space Telescope's Great Observatories All-sky LIRG Survey (GOALS) providing multiwavelength data on ~200 local systems to probe their star formation and nuclear properties. The Herschel Space Observatory extended these studies to higher redshifts through far-infrared surveys, revealing the molecular gas reservoirs and dust temperatures in LIRGs up to z ≈ 2. More recently, the James Webb Space Telescope (JWST) has detected LIRGs at high redshifts (z ∼ 1–2 and beyond) using its Mid-Infrared Instrument (MIRI), uncovering extended star formation and dusty structures in the early universe that inform their role in galaxy assembly.\n\n## Physical Properties\n\n### Sizes and Diameters\n\nGalaxy sizes are typically measured in terms of angular diameters observed on the sky, which are then converted to physical diameters using the galaxy's distance. The angular diameter θ (in radians) relates to the physical diameter D via D = θ × DA, where DA is the angular diameter distance; for nearby galaxies, distances are often estimated using parallax or standard candles, while for distant ones, Hubble's law (v = H₀ d, with redshift z ≈ v/c) provides an approximation for DA ≈ c z / H₀ at low z.\n\nCommon methods for defining galaxy sizes include isophotal diameters, which measure the extent at a surface brightness contour of 25 mag arcsec⁻² in the B-band, capturing the galaxy's light down to a faint threshold but sensitive to sky background and inclination. The effective radius r_e, or half-light radius, encloses half the total light of the galaxy and is widely used for its robustness across profiles, often derived from surface photometry. Another approach is the Petrosian radius, defined where the mean surface brightness within radius r equals η times the brightness in an annulus at r (typically η=2), making it concentration-independent and scale-free, thus less affected by distance assumptions or profile shape variations.\n\nTo mitigate dust obscuration in optical bands, near-infrared observations provide dust-penetrating sizes, revealing the underlying stellar distribution more accurately, as dust absorption is minimal at wavelengths around 2-5 μm. Sizes are often modeled using the Sérsic profile, a generalized function for surface brightness I(r):\n\n$$\nI(r) = I_e \\exp\\left\\{ -k \\left[ \\left( \\frac{r}{r_e} \\right)^{1/n} - 1 \\right] \\right\\}\n$$\n\nwhere I_e is the intensity at effective radius r_e, n is the Sérsic index (n≈1 for exponential disks in spirals, n≈4 for de Vaucouleurs profiles in ellipticals), and k≈7.67 ensures half-light within r_e; fitting this profile yields r_e and total extent.\n\nTypical physical diameters vary by morphology: spiral galaxies range from ~30 to 100 kpc, reflecting their extended disks; elliptical galaxies average 10 to 50 kpc, more compact due to their stellar concentrations; dwarf galaxies are smaller, generally under 5 kpc, with minimal structural complexity.\n\nThese scales highlight the hierarchical nature of galaxy structures, influencing dynamics like rotation curves and merger outcomes.\n\n### Magnetic Fields\n\nMagnetic fields in galaxies arise from weak seed fields that are amplified through dynamo processes driven by the motion of ionized gas. Seed fields can originate from primordial cosmological fluctuations or the Biermann battery mechanism during the collapse of early stars and protogalactic structures. The primary amplification occurs via the galactic dynamo, where differential rotation (the omega effect) shears field lines to generate toroidal components, while turbulence from supernovae and stellar feedback (the alpha effect) produces poloidal fields, sustaining coherent structures on kiloparsec scales. This alpha-omega dynamo theory, developed in seminal models, explains the observed regularity of fields in spiral galaxies.\n\nTypical magnetic field strengths in galactic disks range from 1 to 10 microgauss (μG), increasing to 10–50 μG in central regions and relativistic jets. These values are inferred from equipartition assumptions in synchrotron emission and directly probed via Faraday rotation measures (RM), defined as\n\n\\[\nRM = 0.81 \\int n_e B_\\parallel \\, dl\n\\]\n\nwhere \\( n_e \\) is the thermal electron density in cm⁻³, \\( B_\\parallel \\) is the line-of-sight magnetic field in μG, and the integral is along the path in pc, yielding RM in rad m⁻². Radio observations of synchrotron polarization further map field orientations, revealing spiral patterns aligned with galactic arms and interarm regions.\n\nGalactic magnetic fields regulate star formation by exerting magnetic pressure and tension that stabilize gas clouds, delaying gravitational collapse until sufficient density is reached, and they govern cosmic ray propagation by scattering particles and confining them to diffusive paths that trace field lines. Strong fields also collimate relativistic jets in active galactic nuclei. Post-2010 numerical simulations of dynamos in stratified disks have validated these roles, reproducing observed field strengths and turbulence-driven saturation.\n\n## Cosmic Structures\n\n### Groups and Clusters\n\nGalaxy groups and clusters represent gravitationally bound aggregates of galaxies, serving as fundamental building blocks in the cosmic large-scale structure. A galaxy group typically consists of 10 to 50 member galaxies, such as the Local Group, which includes the Milky Way, Andromeda (M31), and approximately 54 other galaxies spanning a diameter of about 10 million light-years. In contrast, galaxy clusters are more massive assemblies containing 100 to 1,000 or more galaxies; notable examples include the Virgo Cluster with roughly 2,000 members located about 54 million light-years away, and the Coma Cluster with over 1,000 galaxies at a distance of approximately 320 million light-years. These structures are defined by their mutual gravitational binding, preventing dispersal over cosmic timescales.\n\nKey properties of groups and clusters include a pervasive hot intracluster medium (ICM) composed primarily of ionized hydrogen and helium gas at temperatures of 10 to 100 million kelvins, which emits X-rays through thermal bremsstrahlung and serves as a tracer of the system's total mass. Additionally, these systems are embedded within massive dark matter halos that dominate their gravitational potential, with the dark matter comprising about 85-90% of the total mass and extending to radii where the halo's density profile follows models like the Navarro-Frenk-White distribution. The internal dynamics are governed by the virial theorem, which relates the velocity dispersion \\(\\sigma_v\\) of member galaxies to the total mass \\(M\\) and characteristic radius \\(R\\) via \\(\\sigma_v^2 \\sim G M / R\\), allowing astronomers to infer masses from observed velocities that often reveal the presence of unseen dark matter.\n\nThe evolution of groups and clusters occurs primarily through hierarchical mergers, where smaller groups and individual galaxies accrete and coalesce under gravity to build larger structures over billions of years, as predicted by cold dark matter models. During these mergers, the separation of baryonic gas (which interacts via collisions) from collisionless dark matter provides direct evidence for dark matter's existence; a striking example is the Bullet Cluster, where Chandra X-ray observations show hot gas displaced from the gravitational mass centers inferred from lensing, with the dark matter halos passing through each other unimpeded. Approximately 50% of all galaxies in the universe reside in such groups and clusters, highlighting their role in shaping galactic environments and star formation histories. Clusters often exhibit a dominance of elliptical galaxies in their cores, reflecting morphological transformations driven by interactions.\n\n### Filaments and Superclusters\n\nThe cosmic web represents the largest-scale organization of matter in the universe, characterized by a network of interconnected filaments, walls, and voids that trace the distribution of galaxies and dark matter. Filaments consist of elongated strings of galaxy clusters and groups, often spanning tens to hundreds of megaparsecs (Mpc), where gravitational attraction funnels matter along these threads. Walls, or sheets, form vast planar structures where galaxies align in thin layers, typically hundreds of millions of light-years across but only about 20 million light-years thick, serving as boundaries between voids. Voids are expansive underdense regions, occupying much of the universe's volume and appearing as nearly empty bubbles amid the denser web. This hierarchical structure emerges from the uneven distribution of matter, with clusters acting as dense nodes at the intersections of filaments.\n\nA prominent example of a wall within the cosmic web is the Sloan Great Wall, a vast sheet-like arrangement of galaxies discovered through the Sloan Digital Sky Survey (SDSS), extending approximately 400 Mpc in length and representing one of the most extensive known superstructures in the nearby universe. Superclusters, in turn, are loosely bound aggregates of multiple galaxy groups, clusters, and filaments, lacking the tight gravitational cohesion of smaller structures and typically spanning scales of 100 to 500 Mpc. These diffuse ensembles contain thousands of galaxies and are shaped by the cumulative gravitational influence over cosmic time. For instance, the Laniakea Supercluster, our home supercluster, encompasses the Local Group—including the Milky Way—and spans about 160 Mpc in diameter, enclosing roughly 100,000 galaxies within a basin defined by convergent peculiar velocities.\n\nThe formation of filaments and superclusters traces back to primordial density fluctuations in the early universe, shortly after the Big Bang, when quantum variations in the plasma left tiny over- and underdensities on scales of about 0.003% in the cosmic microwave background. These fluctuations, amplified by gravity as the universe expanded, caused denser regions to collapse into filaments and walls while sparser areas expanded into voids, a process simulated and confirmed through galaxy redshift surveys like SDSS and the 2dF Galaxy Redshift Survey. On megaparsec scales, this gravitational instability grew over billions of years, with dark matter halos providing the scaffolding for baryonic matter to follow.\n\nRecent advancements in 2024 and 2025 have enhanced our mapping of these structures through large-scale galaxy surveys. The Dark Energy Spectroscopic Instrument (DESI) released its Data Release 1 in March 2025, providing a 3D map covering 18.7 million objects and spanning 11 billion years of cosmic history, and its Data Release 2 in October 2025, including baryon acoustic oscillation measurements from over 14 million galaxies and quasars for even more detailed views of filamentary networks and megastructures. These maps, combined with analyses from the Euclid mission and DESI's baryon acoustic oscillation measurements, indicate that dark energy's accelerating expansion influences the growth and stretching of filaments, with emerging evidence suggesting dark energy may evolve over time, potentially altering the long-term stability of superclusters.\n\n## Formation and Evolution\n\n### Initial Formation\n\nThe formation of the first galaxies occurred within the framework of the Lambda cold dark matter (ΛCDM) cosmological model, which predicts a hierarchical assembly process where small structures merge to form larger ones over cosmic time. In this paradigm, primordial density fluctuations in the early universe, seeded by quantum fluctuations during inflation, grow through gravitational instability, leading to the collapse of dark matter halos that serve as gravitational wells for baryonic gas. The earliest galaxies are expected to emerge at redshifts \\( z \\sim 10-15 \\), corresponding to approximately 290-480 million years after the Big Bang, when these halos reach masses sufficient to retain gas against cosmic expansion.\n\nCentral to initial galaxy formation is the gravitational collapse of neutral hydrogen gas within these dark matter halos, where the halo's potential well allows baryons to cool and fragment into stars. The critical scale for collapse is governed by the Jeans mass, the minimum mass at which gravitational forces overcome thermal pressure in the gas cloud:\n\n$$\nM_J \\sim \\left( \\frac{c_s^4}{G^3 \\rho} \\right)^{1/2}\n$$\n\nHere, \\( c_s \\) is the sound speed of the gas, \\( G \\) is the gravitational constant, and \\( \\rho \\) is the gas density; for primordial conditions with temperatures around 10-100 K, this yields \\( M_J \\) on the order of \\( 10^5 - 10^6 \\) solar masses, enabling the formation of the first Population III stars. These stars, along with early active galactic nuclei (AGN) powered by seed black holes, drive cosmic reionization, ionizing the intergalactic medium and facilitating further gas accretion onto proto-galaxies by reducing photoheating barriers.\n\nObservational evidence from the James Webb Space Telescope (JWST) supports and refines these models, revealing clumpy, irregular structures in early galaxies that indicate rapid, chaotic assembly. For instance, the galaxy dubbed the \"Cosmic Grapes\" at \\( z \\approx 6.07 \\) (about 900 million years after the Big Bang) exhibits a rotating disk composed of at least 15 dense star-forming clumps, suggesting that baryonic gas condensed quickly into substructures within a dynamically settling halo. High-redshift dwarf galaxies, observed as compact systems at \\( z \\u003e 10 \\), likely served as the initial seeds, merging hierarchically to build larger galaxies while their low metallicities preserve signatures of primordial collapse.\n\nJWST data have prompted revisions to theoretical timelines, highlighting faster-than-expected early formation rates that challenge standard ΛCDM predictions for structure growth. These observations indicate that massive galaxies assembled more rapidly at \\( z \\u003e 10 \\), possibly due to enhanced star formation efficiencies or modified feedback processes, underscoring gaps in our understanding of the primordial gas dynamics.\n\n### Evolutionary Processes\n\nGalaxies undergo significant evolutionary changes through a combination of internal and external mechanisms that regulate star formation, gas dynamics, and structural transformations over cosmic time. Internally, stellar feedback from massive stars injects energy via supernovae, stellar winds, and radiation, which disperses molecular clouds and limits further star formation in low-mass systems, while also driving outflows that can enrich the interstellar medium. Active galactic nuclei (AGN) feedback plays a crucial role in quenching star formation in massive galaxies by expelling gas through powerful outflows, reducing net gas inflows by up to 70% and lowering stellar masses by as much as 80% in systems exceeding 10¹¹ solar masses at low redshifts. Conversely, ongoing gas accretion from the cosmic web sustains star formation in spiral galaxies, providing cold gas inflows that dominate over mergers by factors of 2–4, fueling disk growth and maintaining their morphology.\n\nExternal processes further shape galaxy evolution, particularly through interactions in denser environments. Galaxy mergers, especially major ones with mass ratios greater than 1:4, drive morphological transformations by disrupting ordered rotation in spirals, leading to the formation of dispersion-dominated elliptical galaxies through chaotic stellar orbits and central mass concentration. Minor mergers (ratios 1:10 to 1:4) contribute significantly post-redshift z~1, accounting for about 33% of such transformations in massive systems. In cluster environments, strangulation halts cold gas supply to infalling galaxies, primarily affecting those below 10¹¹ solar masses, leading to a gradual shutdown of star formation over timescales of around 4 billion years, as evidenced by higher stellar metallicities and age differences in quiescent populations. Ram-pressure stripping complements this by removing existing interstellar gas, accelerating quenching in cluster cores.\n\nThese evolutionary processes are traced using observational diagnostics such as color-magnitude diagrams (CMDs), which reveal population ages and metallicities, showing a bimodality between red, quiescent early-type galaxies and blue, star-forming late-types that evolves with redshift. The cosmic star formation history, derived from integrated light and dust-corrected ultraviolet surveys, peaks at redshift z~2, reflecting the height of gas accretion and merger activity before widespread quenching dominates at lower redshifts.\n\nIllustrative examples highlight these dynamics: the Milky Way's Gaia-Sausage-Enceladus merger, occurring 8–11 billion years ago, introduced metal-poor stars and disrupted the proto-disk, contributing to the Galaxy's thick disk and bar formation while quenching the progenitor's star formation over 2 Gyr. Galactic downsizing is evident in observations where massive galaxies assemble their stars earlier than less massive ones, with spheroids in place by z~2, while lower-mass systems continue forming stars to later epochs.\n\n### Future Trends\n\nThe future evolution of galaxies is shaped by gravitational interactions within bound structures and the accelerating expansion of the universe driven by dark energy. In the Local Group, the Milky Way and Andromeda galaxies have an approximately 50% probability of merging within the next 10 billion years, forming a new elliptical galaxy often termed \"Milkomeda,\" though recent simulations incorporating the influences of other nearby galaxies like the Large Magellanic Cloud indicate significant uncertainty in the timing and occurrence. If the merger occurs, it would disrupt the spiral structures of both galaxies, redistributing stars and gas into an ellipsoidal form while the supermassive black holes at their centers eventually coalesce.\n\nSatellite galaxies orbiting the Milky Way, such as the Magellanic Clouds and Sagittarius dwarf, face ongoing tidal disruptions from the host galaxy's gravitational pull, leading to the stripping of stars and gas over billions of years and contributing material to the Milky Way's halo. These processes will accelerate during major mergers, with streams of tidal debris forming prominent structures like the anticipated \"Andromeda stream\" post-collision.\n\nOn larger scales, galaxies within gravitationally bound clusters and superclusters will continue merging, preferentially forming massive elliptical galaxies as smaller spirals and irregulars coalesce over the next 10-100 billion years. However, dark energy's dominance ensures that unbound structures beyond these clusters recede from each other, isolating galaxy groups and preventing inter-cluster mergers indefinitely.\n\nStar formation across galaxies will gradually cease as interstellar gas reservoirs are depleted through ongoing stellar processes and dynamical heating, with models projecting exhaustion in bound systems like the Local Group within roughly 10-100 billion years, marking the transition to \"red and dead\" ellipticals dominated by low-mass, long-lived stars. Farther into the future, over timescales exceeding 10^{100} years, the supermassive black holes at galactic centers will evaporate via Hawking radiation, releasing their mass-energy as thermal particles and effectively dissolving the remnants of galactic structures.\n\nUncertainties persist regarding the precise timeline of these events, particularly the role of evolving dark energy, which recent observations suggest may be weakening and could alter merger rates by slowing cosmic expansion. Additionally, 2025 dark matter simulations predict dozens more undetected satellite galaxies around the Milky Way—potentially up to 100—than previously observed, implying a richer reservoir of material for future tidal mergers and disruptions.",
  "external_references": [
    {
      "text": "Galaxy",
      "url": "https://spaceplace.nasa.gov/galaxy/",
      "domain": "spaceplace.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Galaxies",
      "url": "https://science.nasa.gov/universe/galaxies/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Large Scale Structures",
      "url": "https://science.nasa.gov/universe/galaxies/large-scale-structures/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Types",
      "url": "https://science.nasa.gov/universe/galaxies/types/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Our Milky Way Galaxy How Big Is Space",
      "url": "https://science.nasa.gov/universe/exoplanets/our-milky-way-galaxy-how-big-is-space/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "En",
      "url": "https://spaceplace.nasa.gov/dark-matter/en/",
      "domain": "spaceplace.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Dark Matter",
      "url": "https://science.nasa.gov/dark-matter/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Galaxies Over Time",
      "url": "https://science.nasa.gov/mission/webb/galaxies-over-time/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Active Galaxies1.html",
      "url": "https://imagine.gsfc.nasa.gov/science/objects/active_galaxies1.html",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Galaxy",
      "url": "https://www.etymonline.com/word/galaxy",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Word History Of Galaxy",
      "url": "https://www.merriam-webster.com/wordplay/word-history-of-galaxy",
      "domain": "merriam-webster.com",
      "type": "citation"
    },
    {
      "text": "The Myths And Lore Of The Milky Way",
      "url": "https://www.port.ac.uk/news-events-and-blogs/blogs/academic-expertise/the-myths-and-lore-of-the-milky-way",
      "domain": "port.ac.uk",
      "type": "citation"
    },
    {
      "text": "How We Learned The Shape Of The Milky Way",
      "url": "https://www.astronomy.com/science/how-we-learned-the-shape-of-the-milky-way/",
      "domain": "astronomy.com",
      "type": "citation"
    },
    {
      "text": "Milky Way Galaxy Research",
      "url": "https://fscj.pressbooks.pub/introductionastronomy/chapter/milky-way-galaxy-research/",
      "domain": "fscj.pressbooks.pub",
      "type": "citation"
    },
    {
      "text": "14.05%253a Galileo Galilei First To See The Milky Way Galaxy",
      "url": "https://phys.libretexts.org/Bookshelves/Astronomy__Cosmology/Introduction_to_Astronomy_%28Lumen%29/14%253A_The_Milky_Way_Galaxy/14.05%253A_Galileo_Galilei_First_to_See_the_Milky_Way_Galaxy",
      "domain": "phys.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Milkyway.html",
      "url": "https://www.astronomy.ohio-state.edu/pogge.1/Ast162/Unit4/milkyway.html",
      "domain": "astronomy.ohio-state.edu",
      "type": "citation"
    },
    {
      "text": "1230hubble First Galaxy Outside Milky Way",
      "url": "https://www.wired.com/2009/12/1230hubble-first-galaxy-outside-milky-way/",
      "domain": "wired.com",
      "type": "citation"
    },
    {
      "text": "100 Years After The Great Debate How Edwin Hubble Expanded The Cosmos",
      "url": "https://daily.jstor.org/100-years-after-the-great-debate-how-edwin-hubble-expanded-the-cosmos/",
      "domain": "daily.jstor.org",
      "type": "citation"
    },
    {
      "text": "1926apj....64..321h",
      "url": "https://adsabs.harvard.edu/full/1926ApJ....64..321H",
      "domain": "adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Messier.aspx",
      "url": "https://skyserver.sdss.org/dr12/en/tools/places/messier.aspx",
      "domain": "skyserver.sdss.org",
      "type": "citation"
    },
    {
      "text": "Ngc.aspx",
      "url": "https://skyserver.sdss.org/dr13/en/tools/places/ngc.aspx",
      "domain": "skyserver.sdss.org",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://ui.adsabs.harvard.edu/abs/1943ApJ....97...28S/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Buta3.html",
      "url": "https://ned.ipac.caltech.edu/level5/March14/Buta/Buta3.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Aa3772.pdf",
      "url": "https://www.aanda.org/articles/aa/pdf/2003/47/aa3772.pdf",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "Meteorology.1.i.html",
      "url": "http://classics.mit.edu/Aristotle/meteorology.1.i.html",
      "domain": "classics.mit.edu",
      "type": "citation"
    },
    {
      "text": "1962qjras...3...87n",
      "url": "https://adsabs.harvard.edu/full/1962QJRAS...3...87N",
      "domain": "adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "The Milky Way One Of The Many Galaxies",
      "url": "https://www.loc.gov/collections/finding-our-place-in-the-cosmos-with-carl-sagan/articles-and-essays/modeling-the-cosmos/the-milky-way-one-of-the-many-galaxies",
      "domain": "loc.gov",
      "type": "citation"
    },
    {
      "text": "1112.3635",
      "url": "https://arxiv.org/pdf/1112.3635",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2012jahh...15...19s",
      "url": "https://adsabs.harvard.edu/full/2012JAHH...15...19S",
      "domain": "adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "352195",
      "url": "https://www.journals.uchicago.edu/doi/pdfplus/10.1086/352195",
      "domain": "journals.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "The Myths And Lore Of The Milky Way",
      "url": "https://thereader.mitpress.mit.edu/the-myths-and-lore-of-the-milky-way/",
      "domain": "thereader.mitpress.mit.edu",
      "type": "citation"
    },
    {
      "text": "Lakota Star Knowledge Milky Way Spirit Path",
      "url": "https://www.sdpb.org/arts-culture/2018-10-03/lakota-star-knowledge-milky-way-spirit-path",
      "domain": "sdpb.org",
      "type": "citation"
    },
    {
      "text": "Milkyway.php",
      "url": "https://nativehistoryassociation.org/milkyway.php",
      "domain": "nativehistoryassociation.org",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://ui.adsabs.harvard.edu/abs/1918ApJ....48..154S/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Milkyway2.html",
      "url": "https://imagine.gsfc.nasa.gov/science/objects/milkyway2.html",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Aa54622 25.pdf",
      "url": "https://www.aanda.org/articles/aa/pdf/forth/aa54622-25.pdf",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "Gleam",
      "url": "https://www.csiro.au/en/news/All/News/2025/October/GLEAM",
      "domain": "csiro.au",
      "type": "citation"
    },
    {
      "text": "Milky Way Galaxy Radio Color Map",
      "url": "https://earthsky.org/space/milky-way-galaxy-radio-color-map/",
      "domain": "earthsky.org",
      "type": "citation"
    },
    {
      "text": "Shapley Curtis Debate",
      "url": "https://www.aps.org/apsnews/2000/04/shapley-curtis-debate",
      "domain": "aps.org",
      "type": "citation"
    },
    {
      "text": "The Great Debate Of Shapley And Curtis 100 Years Later",
      "url": "https://www.astronomy.com/science/the-great-debate-of-shapley-and-curtis-100-years-later/",
      "domain": "astronomy.com",
      "type": "citation"
    },
    {
      "text": "Hubble Views The Star That Changed The Universe",
      "url": "https://science.nasa.gov/missions/hubble/hubble-views-the-star-that-changed-the-universe/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "How Edwin Hubble Won The Great Debate",
      "url": "https://www.astronomy.com/science/how-edwin-hubble-won-the-great-debate/",
      "domain": "astronomy.com",
      "type": "citation"
    },
    {
      "text": "Island.htm",
      "url": "https://history.aip.org/exhibits/cosmology/ideas/island.htm",
      "domain": "history.aip.org",
      "type": "citation"
    },
    {
      "text": "Doppler Galaxies.html",
      "url": "https://imagine.gsfc.nasa.gov/features/yba/M31_velocity/spectrum/doppler_galaxies.html",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "135.pdf",
      "url": "http://aspbooks.org/publications/471/135.pdf",
      "domain": "aspbooks.org",
      "type": "citation"
    },
    {
      "text": "1952aspl....6..236b",
      "url": "https://adsabs.harvard.edu/full/1952ASPL....6..236B",
      "domain": "adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "1955 Poster.pdf",
      "url": "https://imagine.gsfc.nasa.gov/educators/programs/cosmictimes/downloads/posters/1955_poster.pdf",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "S1387647316300690",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S1387647316300690",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Alma Reveals Hidden Structures In The First Galaxies Of The Universe",
      "url": "https://www.almaobservatory.org/en/press-releases/alma-reveals-hidden-structures-in-the-first-galaxies-of-the-universe/",
      "domain": "almaobservatory.org",
      "type": "citation"
    },
    {
      "text": "02000000000280.pdf",
      "url": "https://library.nrao.edu/public/collection/02000000000280.pdf",
      "domain": "library.nrao.edu",
      "type": "citation"
    },
    {
      "text": "Spitzer",
      "url": "https://science.nasa.gov/mission/spitzer/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Nasas Webb Explores Largest Star Forming Cloud In Milky Way",
      "url": "https://science.nasa.gov/missions/webb/nasas-webb-explores-largest-star-forming-cloud-in-milky-way/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Program.html",
      "url": "https://cxc.harvard.edu/cdo/xgal14/program.html",
      "domain": "cxc.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Agn",
      "url": "https://fermi.gsfc.nasa.gov/science/eteu/agn/",
      "domain": "fermi.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "2004iaus 222 533o.pdf",
      "url": "http://faculty.washington.edu/ivezic/Publications/2004IAUS__222__533O.pdf",
      "domain": "faculty.washington.edu",
      "type": "citation"
    },
    {
      "text": "sdss.org",
      "url": "https://www.sdss.org/",
      "domain": "sdss.org",
      "type": "citation"
    },
    {
      "text": "Gaia S Decade Of Discoveries Unravelling The Intricacies Of Our Galaxy",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/Gaia/Gaia_s_decade_of_discoveries_unravelling_the_intricacies_of_our_galaxy",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "Eso2415",
      "url": "https://www.eso.org/public/news/eso2415/",
      "domain": "eso.org",
      "type": "citation"
    },
    {
      "text": "S41550 025 02597 5",
      "url": "https://www.nature.com/articles/s41550-025-02597-5",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "The Earliest Galaxies Formed Amazingly Fast After The Big Bang Do They Break The Universe Or Change Its Age 237416",
      "url": "https://theconversation.com/the-earliest-galaxies-formed-amazingly-fast-after-the-big-bang-do-they-break-the-universe-or-change-its-age-237416",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "0608407",
      "url": "https://arxiv.org/abs/astro-ph/0608407",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "250713031445.htm",
      "url": "https://www.sciencedaily.com/releases/2025/07/250713031445.htm",
      "domain": "sciencedaily.com",
      "type": "citation"
    },
    {
      "text": "Black Hole Caught Snacking On Star Far From Host Galaxys Center",
      "url": "https://www.astronomy.com/science/black-hole-caught-snacking-on-star-far-from-host-galaxys-center/",
      "domain": "astronomy.com",
      "type": "citation"
    },
    {
      "text": "Eccentric Star Defies Easy Explanation Nasas Chandra Finds",
      "url": "https://www.nasa.gov/image-article/eccentric-star-defies-easy-explanation-nasas-chandra-finds/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "The Hubble Tuning Fork Classification Of Galaxies",
      "url": "https://science.nasa.gov/asset/hubble/the-hubble-tuning-fork-classification-of-galaxies/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Hubble Galaxies",
      "url": "https://science.nasa.gov/mission/hubble/science/universe-uncovered/hubble-galaxies/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Annurev.astro.44.051905.092450",
      "url": "https://www.annualreviews.org/doi/10.1146/annurev.astro.44.051905.092450",
      "domain": "annualreviews.org",
      "type": "citation"
    },
    {
      "text": "Heic1607a.pdf",
      "url": "https://esahubble.org/static/archives/releases/science_papers/heic1607a.pdf",
      "domain": "esahubble.org",
      "type": "citation"
    },
    {
      "text": "1050171",
      "url": "https://academic.oup.com/mnras/article/378/4/1575/1050171",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://iopscience.iop.org/article/10.1086/590235/fulltext/",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "1215246",
      "url": "https://academic.oup.com/mnras/article/366/2/499/1215246",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "2401.08906v1",
      "url": "https://arxiv.org/html/2401.08906v1",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "S41550 023 02130 6",
      "url": "https://www.nature.com/articles/s41550-023-02130-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "A:1017025820201",
      "url": "https://doi.org/10.1023/A:1017025820201",
      "domain": "doi.org",
      "type": "citation"
    },
    {
      "text": "Classify.html",
      "url": "https://pages.astronomy.ua.edu/keel/galaxies/classify.html",
      "domain": "pages.astronomy.ua.edu",
      "type": "citation"
    },
    {
      "text": "Physrevlett.95.171302",
      "url": "https://link.aps.org/doi/10.1103/PhysRevLett.95.171302",
      "domain": "link.aps.org",
      "type": "citation"
    },
    {
      "text": "Lecture26.html",
      "url": "https://www.astronomy.ohio-state.edu/thompson.1847/1144/Lecture26.html",
      "domain": "astronomy.ohio-state.edu",
      "type": "citation"
    },
    {
      "text": "Aa53067 24.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2025/03/aa53067-24/aa53067-24.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "109",
      "url": "https://iopscience.iop.org/article/10.3847/0004-637X/817/2/109",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Astronomers Discover Colossal Super Spiral Galaxies",
      "url": "https://www.jpl.nasa.gov/news/astronomers-discover-colossal-super-spiral-galaxies/",
      "domain": "jpl.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Aa45675 22.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2023/05/aa45675-22/aa45675-22.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "19860019420.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/19860019420/downloads/19860019420.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Hubbles Sweeping View Of The Coma Cluster Of Galaxies",
      "url": "https://science.nasa.gov/missions/hubble/hubbles-sweeping-view-of-the-coma-cluster-of-galaxies/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Appleton2.html",
      "url": "https://ned.ipac.caltech.edu/level5/Sept01/Appleton/Appleton2.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Ring Of Hot Blue Stars Pinwheels Around Yellow Nucleus Of Hoags Object Galaxy",
      "url": "https://science.nasa.gov/asset/hubble/ring-of-hot-blue-stars-pinwheels-around-yellow-nucleus-of-hoags-object-galaxy/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Nasas Hubble Traces String Of Pearls Star Clusters In Galaxy Collisions",
      "url": "https://science.nasa.gov/missions/hubble/nasas-hubble-traces-string-of-pearls-star-clusters-in-galaxy-collisions/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "1008.0331",
      "url": "https://arxiv.org/abs/1008.0331",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Antennae Galaxies Fertile Marriage",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/Antennae_galaxies_fertile_marriage",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "A Galactic Spectacle",
      "url": "https://science.nasa.gov/missions/hubble/a-galactic-spectacle/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "The Mice Ngc 4676 Colliding Galaxies With Tails Of Stars And Gas",
      "url": "https://science.nasa.gov/asset/hubble/the-mice-ngc-4676-colliding-galaxies-with-tails-of-stars-and-gas/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "0805.1246",
      "url": "https://arxiv.org/abs/0805.1246",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "0003162",
      "url": "https://arxiv.org/pdf/astro-ph/0003162",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "S41550 025 02563 1",
      "url": "https://www.nature.com/articles/s41550-025-02563-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Gaia Clocks New Speeds For Milky Way Andromeda Collision",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/Gaia/Gaia_clocks_new_speeds_for_Milky_Way-Andromeda_collision",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "Crash Of The Titans Andromeda Galaxy And The Milky Way Collision",
      "url": "https://science.nasa.gov/asset/hubble/crash-of-the-titans-andromeda-galaxy-and-the-milky-way-collision/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "9708263",
      "url": "https://arxiv.org/pdf/astro-ph/9708263",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Starburst Galaxies",
      "url": "https://www.cfa.harvard.edu/research/topic/starburst-galaxies",
      "domain": "cfa.harvard.edu",
      "type": "citation"
    },
    {
      "text": "2012.12378",
      "url": "https://arxiv.org/abs/2012.12378",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "49",
      "url": "https://iopscience.iop.org/article/10.1088/0004-637X/724/1/49",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Dynamical Triggering Of Starbursts",
      "url": "https://pubs.aip.org/aip/acp/article/783/1/43/632443/Dynamical-Triggering-of-Starbursts",
      "domain": "pubs.aip.org",
      "type": "citation"
    },
    {
      "text": "30856",
      "url": "https://svs.gsfc.nasa.gov/30856/",
      "domain": "svs.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Frames.html",
      "url": "https://ned.ipac.caltech.edu/level5/Sept06/Lonsdale/frames.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "9908180",
      "url": "https://arxiv.org/abs/astro-ph/9908180",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "561",
      "url": "https://iopscience.iop.org/article/10.1088/0004-637X/695/1/561",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "84",
      "url": "https://iopscience.iop.org/article/10.1088/0004-637X/792/2/84",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "0809.2592",
      "url": "https://arxiv.org/abs/0809.2592",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1505.00811",
      "url": "https://arxiv.org/abs/1505.00811",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "9506063",
      "url": "https://arxiv.org/abs/astro-ph/9506063",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Acf21a",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/acf21a",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Essay Fanaroff.html",
      "url": "https://ned.ipac.caltech.edu/level5/Glossary/Essay_fanaroff.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Investigation Of The First Radio Bright Off Nuclear Tidal Disruption Event",
      "url": "https://aasnova.org/2025/10/15/investigation-of-the-first-radio-bright-off-nuclear-tidal-disruption-event/",
      "domain": "aasnova.org",
      "type": "citation"
    },
    {
      "text": "Paper.pdf",
      "url": "https://ned.ipac.caltech.edu/level5/Sanders/paper.pdf",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Lonsdale1.html",
      "url": "https://ned.ipac.caltech.edu/level5/Sept06/Lonsdale/Lonsdale1.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "2009aspc..408..105a",
      "url": "https://adsabs.harvard.edu/full/2009ASPC..408..105A",
      "domain": "adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "1403.0007",
      "url": "https://arxiv.org/pdf/1403.0007",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Adee1d",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/adee1d",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "1909.06712",
      "url": "https://arxiv.org/pdf/1909.06712",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Hubbles Law Procedure.html",
      "url": "https://depts.washington.edu/astroed/HubbleLaw/hubbles_law_procedure.html",
      "domain": "depts.washington.edu",
      "type": "citation"
    },
    {
      "text": "Dog.html",
      "url": "https://ned.ipac.caltech.edu/level5/PROPERTIES/dog.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Half Light%2bradius",
      "url": "https://astronomy.swin.edu.au/cosmos/h/Half-light%2BRadius",
      "domain": "astronomy.swin.edu.au",
      "type": "citation"
    },
    {
      "text": "Petro.html",
      "url": "http://spiff.rit.edu/classes/phys443/lectures/gal_1/petro/petro.html",
      "domain": "spiff.rit.edu",
      "type": "citation"
    },
    {
      "text": "Galmorph",
      "url": "https://www.ipac.caltech.edu/2mass/gallery/galmorph/",
      "domain": "ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Graham2.html",
      "url": "https://ned.ipac.caltech.edu/level5/March05/Graham/Graham2.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "Galaxies Types And Classifications",
      "url": "https://www.cliffsnotes.com/study-guides/astronomy/galaxies/galaxies-types-and-classifications",
      "domain": "cliffsnotes.com",
      "type": "citation"
    },
    {
      "text": "6219090",
      "url": "https://academic.oup.com/mnras/article/504/2/2517/6219090",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "S037015730500267x",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S037015730500267X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "0310287",
      "url": "https://arxiv.org/abs/astro-ph/0310287",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1043490",
      "url": "https://academic.oup.com/mnras/article/414/3/2540/1043490",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/astronomy-and-space-sciences/articles/10.3389/fspas.2019.00007/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "0212288",
      "url": "https://arxiv.org/abs/astro-ph/0212288",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Aa37835 20.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2020/09/aa37835-20/aa37835-20.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "2211.03476",
      "url": "https://arxiv.org/abs/2211.03476",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Local Group.html",
      "url": "https://www.physics.unlv.edu/~jeffery/astro/galaxies/local_group.html",
      "domain": "physics.unlv.edu",
      "type": "citation"
    },
    {
      "text": "Local Group Info.html",
      "url": "https://imagine.gsfc.nasa.gov/features/cosmic/local_group_info.html",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Galaxy Cluster",
      "url": "https://en.wikipedia.org/wiki/Galaxy_cluster",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Galaxy Groups",
      "url": "https://fiveable.me/key-terms/astrophysics-i/galaxy-groups",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Intra Cluster%2bmedium",
      "url": "https://astronomy.swin.edu.au/cosmos/i/intra-cluster%2Bmedium",
      "domain": "astronomy.swin.edu.au",
      "type": "citation"
    },
    {
      "text": "Dark Energy And Dark Matter",
      "url": "https://www.cfa.harvard.edu/research/topic/dark-energy-and-dark-matter",
      "domain": "cfa.harvard.edu",
      "type": "citation"
    },
    {
      "text": "18%253a Using The Virial Theorem Mass Of A Cluster Of Galaxies",
      "url": "https://phys.libretexts.org/Bookshelves/Astronomy__Cosmology/Supplemental_Modules_%28Astronomy_and_Cosmology%29/Cosmology/Astrophysics_%28Richmond%29/18%253A_Using_the_Virial_Theorem_-_Mass_of_a_Cluster_of_Galaxies",
      "domain": "phys.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Hierarchical%2bmerging",
      "url": "https://astronomy.swin.edu.au/cosmos/h/hierarchical%2Bmerging",
      "domain": "astronomy.swin.edu.au",
      "type": "citation"
    },
    {
      "text": "Bullet Lithos.pdf",
      "url": "https://chandra.harvard.edu/graphics/resources/handouts/lithos/bullet_lithos.pdf",
      "domain": "chandra.harvard.edu",
      "type": "citation"
    },
    {
      "text": "9908050",
      "url": "https://arxiv.org/pdf/astro-ph/9908050",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Mihos1.html",
      "url": "https://ned.ipac.caltech.edu/level5/March07/Mihos/Mihos1.html",
      "domain": "ned.ipac.caltech.edu",
      "type": "citation"
    },
    {
      "text": "1409.0880",
      "url": "https://arxiv.org/abs/1409.0880",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1608.04988",
      "url": "https://arxiv.org/abs/1608.04988",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Bb Cosmo Struct.html",
      "url": "https://map.gsfc.nasa.gov/universe/bb_cosmo_struct.html",
      "domain": "map.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Desi Opens Access To The Largest 3d Map Of The Universe Yet",
      "url": "https://newscenter.lbl.gov/2025/03/19/desi-opens-access-to-the-largest-3d-map-of-the-universe-yet/",
      "domain": "newscenter.lbl.gov",
      "type": "citation"
    },
    {
      "text": "Desi Dr2 Cosmology Chains And Data Products Released",
      "url": "https://www.desi.lbl.gov/2025/10/06/desi-dr2-cosmology-chains-and-data-products-released/",
      "domain": "desi.lbl.gov",
      "type": "citation"
    },
    {
      "text": "2603922",
      "url": "https://academic.oup.com/mnras/article/117/1/104/2603922",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "6521455",
      "url": "https://academic.oup.com/mnras/article/511/3/3657/6521455",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "2402.18543",
      "url": "https://arxiv.org/abs/2402.18543",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Ad834d",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/ad834d",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "0708.0949",
      "url": "https://arxiv.org/pdf/0708.0949",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1701.07838",
      "url": "https://arxiv.org/pdf/1701.07838",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2506.09136",
      "url": "https://arxiv.org/pdf/2506.09136",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Nature14439",
      "url": "https://www.nature.com/articles/nature14439",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "1403.2783",
      "url": "https://arxiv.org/pdf/1403.2783",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "1212.5641",
      "url": "https://arxiv.org/pdf/1212.5641",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "The Andromeda And Milky Way Collision Explained",
      "url": "https://www.astronomy.com/science/the-andromeda-and-milky-way-collision-explained/",
      "domain": "astronomy.com",
      "type": "citation"
    },
    {
      "text": "11011",
      "url": "https://svs.gsfc.nasa.gov/11011/",
      "domain": "svs.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "The Milky Way May Have Just Lost A Whole Bunch Of Satellite Dwarf Galaxies",
      "url": "https://www.sciencealert.com/the-milky-way-may-have-just-lost-a-whole-bunch-of-satellite-dwarf-galaxies",
      "domain": "sciencealert.com",
      "type": "citation"
    },
    {
      "text": "8222504",
      "url": "https://academic.oup.com/mnras/article/542/2/1109/8222504",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "If The Universe Is Expanding Why Are Galaxies Still Merging",
      "url": "https://bigthink.com/starts-with-a-bang/if-the-universe-is-expanding-why-are-galaxies-still-merging/",
      "domain": "bigthink.com",
      "type": "citation"
    },
    {
      "text": "Dark Energy",
      "url": "https://science.nasa.gov/dark-energy/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "The Far Far Future Of Stars",
      "url": "https://www.scientificamerican.com/article/the-far-far-future-of-stars/",
      "domain": "scientificamerican.com",
      "type": "citation"
    },
    {
      "text": "Hawking Radiation Black Hole Evaporation",
      "url": "https://bigthink.com/starts-with-a-bang/hawking-radiation-black-hole-evaporation/",
      "domain": "bigthink.com",
      "type": "citation"
    },
    {
      "text": "The Expansion Of Our Universe May Be Slowing Down What Does That Mean For Dark Energy",
      "url": "https://www.space.com/astronomy/dark-universe/the-expansion-of-our-universe-may-be-slowing-down-what-does-that-mean-for-dark-energy",
      "domain": "space.com",
      "type": "citation"
    },
    {
      "text": "2025 07 Milky Teeming Satellite Galaxies Previously.html",
      "url": "https://phys.org/news/2025-07-milky-teeming-satellite-galaxies-previously.html",
      "domain": "phys.org",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "stars",
      "page": "Stars!"
    },
    {
      "text": "dark matter",
      "page": "Dark_matter"
    },
    {
      "text": "planets",
      "page": "The_Planets"
    },
    {
      "text": "universe",
      "page": "Universe"
    },
    {
      "text": "Edwin Hubble",
      "page": "Edwin_Hubble"
    },
    {
      "text": "Milky Way",
      "page": "Milky_Way"
    },
    {
      "text": "Magellanic Clouds",
      "page": "Magellanic_Clouds"
    },
    {
      "text": "star formation",
      "page": "Star_formation"
    },
    {
      "text": "barred spiral galaxy",
      "page": "Barred_spiral_galaxy"
    },
    {
      "text": "Andromeda Galaxy",
      "page": "Andromeda_Galaxy"
    },
    {
      "text": "observable universe",
      "page": "Observable_universe"
    },
    {
      "text": "mass",
      "page": "Mass"
    },
    {
      "text": "gravitational collapse",
      "page": "Gravitational_collapse"
    },
    {
      "text": "electromagnetic spectrum",
      "page": "Electromagnetic_spectrum"
    },
    {
      "text": "Democritus",
      "page": "Democritus"
    },
    {
      "text": "naked eye",
      "page": "Naked_eye"
    },
    {
      "text": "Anaxagoras",
      "page": "Anaxagoras"
    },
    {
      "text": "Renaissance",
      "page": "Renaissance"
    },
    {
      "text": "Sidereus Nuncius",
      "page": "Sidereus_Nuncius"
    },
    {
      "text": "the Sun",
      "page": "The_Sun"
    },
    {
      "text": "Andromeda",
      "page": "Andromeda"
    },
    {
      "text": "nebula",
      "page": "Nebula"
    },
    {
      "text": "Cepheid variable",
      "page": "Cepheid_variable"
    },
    {
      "text": "tuning fork",
      "page": "Tuning_fork"
    },
    {
      "text": "Charles Messier",
      "page": "Charles_Messier"
    },
    {
      "text": "New General Catalogue",
      "page": "New_General_Catalogue"
    },
    {
      "text": "Sloan Digital Sky Survey",
      "page": "Sloan_Digital_Sky_Survey"
    },
    {
      "text": "dE",
      "page": "DE"
    },
    {
      "text": "International Astronomical Union",
      "page": "International_Astronomical_Union"
    },
    {
      "text": "night sky",
      "page": "Night_sky"
    },
    {
      "text": "Aristotle",
      "page": "Aristotle"
    },
    {
      "text": "Meteorology",
      "page": "Meteorology"
    },
    {
      "text": "Warring States period",
      "page": "Warring_States_period"
    },
    {
      "text": "telescope",
      "page": "Telescope"
    },
    {
      "text": "17th century",
      "page": "17th_century"
    },
    {
      "text": "Galileo Galilei",
      "page": "Galileo_Galilei"
    },
    {
      "text": "18th century",
      "page": "18th_century"
    },
    {
      "text": "William Herschel",
      "page": "William_Herschel"
    },
    {
      "text": "counting stars",
      "page": "Counting_Stars"
    },
    {
      "text": "map",
      "page": "Map"
    },
    {
      "text": "distribution",
      "page": "Distribution"
    },
    {
      "text": "Leviathan",
      "page": "Leviathan"
    },
    {
      "text": "spectroscopy",
      "page": "Spectroscopy"
    },
    {
      "text": "Greek mythology",
      "page": "Greek_mythology"
    },
    {
      "text": "Hera",
      "page": "Hera"
    },
    {
      "text": "Heracles",
      "page": "Heracles"
    },
    {
      "text": "Earth",
      "page": "Earth"
    },
    {
      "text": "Lakota",
      "page": "Lakota"
    },
    {
      "text": "afterlife",
      "page": "Afterlife"
    },
    {
      "text": "Cherokee",
      "page": "Cherokee"
    },
    {
      "text": "cornmeal",
      "page": "Cornmeal"
    },
    {
      "text": "dog",
      "page": "Dog"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "Harlow Shapley",
      "page": "Harlow_Shapley"
    },
    {
      "text": "galactic center",
      "page": "Galactic_Center"
    },
    {
      "text": "cosmos",
      "page": "Cosmos"
    },
    {
      "text": "Jan Oort",
      "page": "Jan_Oort"
    },
    {
      "text": "differential rotation",
      "page": "Differential_rotation"
    },
    {
      "text": "galactic plane",
      "page": "Galactic_plane"
    },
    {
      "text": "infrared",
      "page": "Infrared"
    },
    {
      "text": "extinction",
      "page": "Extinction"
    },
    {
      "text": "the center",
      "page": "The_Center"
    },
    {
      "text": "Mount Wilson Observatory",
      "page": "Mount_Wilson_Observatory"
    },
    {
      "text": "Walter Baade",
      "page": "Walter_Baade"
    },
    {
      "text": "period-luminosity relation",
      "page": "Period-luminosity_relation"
    },
    {
      "text": "interstellar medium",
      "page": "Interstellar_medium"
    },
    {
      "text": "X-ray",
      "page": "X-ray"
    },
    {
      "text": "ultraviolet",
      "page": "Ultraviolet"
    },
    {
      "text": "Hubble Space Telescope",
      "page": "Hubble_Space_Telescope"
    },
    {
      "text": "HST",
      "page": "HST"
    },
    {
      "text": "Hubble Deep Field",
      "page": "Hubble_Deep_Field"
    },
    {
      "text": "resolution",
      "page": "Resolution"
    },
    {
      "text": "hydrogen",
      "page": "Hydrogen"
    },
    {
      "text": "HI",
      "page": "HI"
    },
    {
      "text": "Arecibo Observatory",
      "page": "Arecibo_Observatory"
    },
    {
      "text": "ALMA",
      "page": "Alma"
    },
    {
      "text": "angular resolution",
      "page": "Angular_resolution"
    },
    {
      "text": "synchrotron",
      "page": "Synchrotron"
    },
    {
      "text": "Chandra X-ray Observatory",
      "page": "Chandra_X-ray_Observatory"
    },
    {
      "text": "Perseus Cluster",
      "page": "Perseus_Cluster"
    },
    {
      "text": "intracluster medium",
      "page": "Intracluster_medium"
    },
    {
      "text": "black hole",
      "page": "Black_hole"
    },
    {
      "text": "structure formation",
      "page": "Structure_formation"
    },
    {
      "text": "Gaia",
      "page": "Gaia"
    },
    {
      "text": "James Webb Space Telescope",
      "page": "James_Webb_Space_Telescope"
    },
    {
      "text": "Big Bang",
      "page": "Big_Bang"
    },
    {
      "text": "Bullet Cluster",
      "page": "Bullet_Cluster"
    },
    {
      "text": "cold dark matter",
      "page": "Cold_dark_matter"
    },
    {
      "text": "tidal disruption event",
      "page": "Tidal_disruption_event"
    },
    {
      "text": "supermassive black hole",
      "page": "Supermassive_black_hole"
    },
    {
      "text": "star",
      "page": "Star+"
    },
    {
      "text": "center",
      "page": "Center"
    },
    {
      "text": "pulsar",
      "page": "Pulsar"
    },
    {
      "text": "magnetar",
      "page": "Magnetar"
    },
    {
      "text": "compact object",
      "page": "Compact_object"
    },
    {
      "text": "E0",
      "page": "E0"
    },
    {
      "text": "velocity",
      "page": "Velocity"
    },
    {
      "text": "relation",
      "page": "Relation"
    },
    {
      "text": "dynamics",
      "page": "Dynamics"
    },
    {
      "text": "feedback",
      "page": "Feedback"
    },
    {
      "text": "Messier 87",
      "page": "Messier_87"
    },
    {
      "text": "Virgo Cluster",
      "page": "Virgo_Cluster"
    },
    {
      "text": "jet",
      "page": "Jet"
    },
    {
      "text": "cluster",
      "page": "Cluster"
    },
    {
      "text": "satellite",
      "page": "Satellite"
    },
    {
      "text": "harassment",
      "page": "Harassment"
    },
    {
      "text": "dust",
      "page": "Dust"
    },
    {
      "text": "nucleus",
      "page": "Nucleus"
    },
    {
      "text": "structure",
      "page": "Structure"
    },
    {
      "text": "halo",
      "page": "Halo"
    },
    {
      "text": "bar",
      "page": "Bar"
    },
    {
      "text": "density wave theory",
      "page": "Density_wave_theory"
    },
    {
      "text": "dark matter halo",
      "page": "Dark_matter_halo"
    },
    {
      "text": "gravitational potential",
      "page": "Gravitational_potential"
    },
    {
      "text": "Large Magellanic Cloud",
      "page": "Large_Magellanic_Cloud"
    },
    {
      "text": "Hubble sequence",
      "page": "Hubble_sequence"
    },
    {
      "text": "thin disk",
      "page": "Thin_disk"
    },
    {
      "text": "interstellar",
      "page": "Interstellar"
    },
    {
      "text": "quenching",
      "page": "Quenching"
    },
    {
      "text": "companion",
      "page": "Companion"
    },
    {
      "text": "lenticular",
      "page": "Lenticular"
    },
    {
      "text": "Hoag's Object",
      "page": "Hoag's_Object"
    },
    {
      "text": "yellow",
      "page": "Yellow"
    },
    {
      "text": "cosmic time",
      "page": "Cosmic_time"
    },
    {
      "text": "number density",
      "page": "Number_density"
    },
    {
      "text": "Interacting galaxies",
      "page": "Interacting_galaxy"
    },
    {
      "text": "tidal",
      "page": "Tidal"
    },
    {
      "text": "orbital decay",
      "page": "Orbital_decay"
    },
    {
      "text": "GADGET",
      "page": "Gadget"
    },
    {
      "text": "elliptical galaxy",
      "page": "Elliptical_galaxy"
    },
    {
      "text": "rotation",
      "page": "Rotation"
    },
    {
      "text": "dwarf",
      "page": "Dwarf"
    },
    {
      "text": "nuclear",
      "page": "Nuclear"
    },
    {
      "text": "stellar mass",
      "page": "Stellar_mass"
    },
    {
      "text": "molecular cloud",
      "page": "Molecular_cloud"
    },
    {
      "text": "Messier 82",
      "page": "Messier_82"
    },
    {
      "text": "irregular galaxy",
      "page": "Irregular_galaxy"
    },
    {
      "text": "Å",
      "page": "Å"
    },
    {
      "text": "ionization",
      "page": "Ionization"
    },
    {
      "text": "luminosity",
      "page": "Luminosity"
    },
    {
      "text": "accretion disk",
      "page": "Accretion_disk"
    },
    {
      "text": "radiation",
      "page": "Radiation"
    },
    {
      "text": "plasma",
      "page": "Plasma"
    },
    {
      "text": "engine",
      "page": "Engine"
    },
    {
      "text": "torus",
      "page": "Torus"
    },
    {
      "text": "viewing angle",
      "page": "Viewing_angle"
    },
    {
      "text": "core",
      "page": "Core"
    },
    {
      "text": "Centaurus A",
      "page": "Centaurus_A"
    },
    {
      "text": "total",
      "page": "Total"
    },
    {
      "text": "wavelength",
      "page": "Wavelength"
    },
    {
      "text": "range",
      "page": "Range"
    },
    {
      "text": "z",
      "page": "Z"
    },
    {
      "text": "Herschel Space Observatory",
      "page": "Herschel_Space_Observatory"
    },
    {
      "text": "Mid-Infrared Instrument",
      "page": "Mid-Infrared_Instrument"
    },
    {
      "text": "surface brightness",
      "page": "Surface_brightness"
    },
    {
      "text": "seed",
      "page": "Seed"
    },
    {
      "text": "dynamo",
      "page": "Dynamo"
    },
    {
      "text": "primordial",
      "page": "Primordial"
    },
    {
      "text": "Biermann battery",
      "page": "Battery"
    },
    {
      "text": "collapse",
      "page": "Collapse"
    },
    {
      "text": "omega",
      "page": "Omega"
    },
    {
      "text": "turbulence",
      "page": "Turbulence"
    },
    {
      "text": "dynamo theory",
      "page": "Dynamo_theory"
    },
    {
      "text": "magnetic field",
      "page": "Magnetic_field"
    },
    {
      "text": "RM",
      "page": "RM"
    },
    {
      "text": "electron density",
      "page": "Electron_density"
    },
    {
      "text": "integral",
      "page": "Integral"
    },
    {
      "text": "magnetic fields",
      "page": "The_Magnetic_Fields"
    },
    {
      "text": "cosmic ray",
      "page": "Cosmic_ray"
    },
    {
      "text": "Local Group",
      "page": "Local_Group"
    },
    {
      "text": "diameter",
      "page": "Diameter"
    },
    {
      "text": "Chandra",
      "page": "Chandra"
    },
    {
      "text": "network",
      "page": "Network"
    },
    {
      "text": "Sloan Great Wall",
      "page": "Sloan_Great_Wall"
    },
    {
      "text": "Laniakea Supercluster",
      "page": "Laniakea_Supercluster"
    },
    {
      "text": "cosmic microwave background",
      "page": "Cosmic_microwave_background"
    },
    {
      "text": "redshift",
      "page": "Redshift"
    },
    {
      "text": "Dark Energy Spectroscopic Instrument",
      "page": "Dark_Energy_Spectroscopic_Instrument"
    },
    {
      "text": "baryon",
      "page": "Baryon"
    },
    {
      "text": "oscillation",
      "page": "Oscillation"
    },
    {
      "text": "Euclid",
      "page": "Euclid"
    },
    {
      "text": "dark energy",
      "page": "Dark_energy"
    },
    {
      "text": "paradigm",
      "page": "Paradigm"
    },
    {
      "text": "inflation",
      "page": "Inflation"
    },
    {
      "text": "potential well",
      "page": "Potential_well"
    },
    {
      "text": "gravitational constant",
      "page": "Gravitational_constant"
    },
    {
      "text": "solar",
      "page": "Solar"
    },
    {
      "text": "reionization",
      "page": "Reionization"
    },
    {
      "text": "thick disk",
      "page": "Thick_disk"
    },
    {
      "text": "accelerating expansion of the universe",
      "page": "Accelerating_expansion_of_the_universe"
    },
    {
      "text": "Sagittarius",
      "page": "Sagittarius"
    },
    {
      "text": "Hawking radiation",
      "page": "Hawking_radiation"
    }
  ],
  "fetched_at": "2025-12-07T07:29:15.940048",
  "elapsed_ms": 908877
}