{
  "topic": "Gender",
  "title": "Gender",
  "slug": "gender",
  "grokipedia_slug": "Gender",
  "grokipedia_url": "https://grokipedia.com/page/Gender",
  "source": "grokipedia",
  "content": "# Gender\n\n) )\n\nGender refers to the binary classification of humans as male or female based on biological sex, defined by the type of gametes produced—small motile sperm in males or large immobile ova in females—and associated reproductive anatomy, a dimorphism fundamental to sexual reproduction in mammals including humans. The term originates from the Latin *genus*, meaning \"kind\" or \"sort,\" and was historically synonymous with sex, denoting these reproductive categories. Empirical evidence establishes gender as inherently binary and tied to biological sex: evolutionary dimorphism drives gender roles (heritability exceeding 50%), historical synonymy aligns it with binary anatomy, over 99% natal alignment with 80-90% desistance of childhood gender dysphoria cases, while an apparent spectrum arises from social flexibility, not biological variance.\n\nIn mid-20th-century medical and social scientific contexts, gender became distinguished from sex to describe psychosocial roles, behaviors, and identities potentially independent of biology, a conceptual shift originating in clinical observations of atypical cases. Empirical evidence, however, supports biological sex as a strict binary in humans, with disorders of sex development (intersex conditions) affecting roughly 0.018% of births and representing developmental anomalies rather than viable third sexes or a spectrum undermining dimorphism.\n\nGender roles—social expectations and behavioral tendencies linked to each sex—exhibit cross-cultural consistencies rooted in evolutionary pressures, such as higher male investment in mating effort versus female parental care, yielding differences in aggression, spatial abilities, and mate preferences. These patterns, while modulated by culture, demonstrate a biological foundation, with gender primacy as a perceptual category appearing universal across societies.\n\nContemporary expansions of gender to include fluid identities and expressions, decoupled from sex, have generated significant controversies, particularly around gender dysphoria—a condition of distress over perceived mismatch between identity and sex—whose reported prevalence has risen sharply among youth, from near rarity to notable increases amid social contagions and institutional affirmation. Critiques from biological perspectives argue the sex-gender distinction obscures causal realities of dimorphism, fostering policies that prioritize subjective identity over objective sex differences in domains like athletics, where male physiological advantages persist post-puberty regardless of identity. Such debates highlight tensions between empirical data on sex-based traits and ideologically driven narratives, often amplified by biases in academic and media sources favoring non-biological interpretations.\n## Etymology and Historical Development\n\n### Etymology and Early Usage\n\nThe English word *gender* derives from the Latin *genus* (stem *gener-*), meaning \"kind,\" \"sort,\" \"race,\" or \"birth,\" which entered Middle English around 1300 via Old French *gendre* or Anglo-Norman *gendre*, primarily to describe grammatical classifications of nouns into categories such as masculine, feminine, or neuter. This linguistic application mirrored the Latin use of *genus* as a translation of ancient Greek *γένος* (genos), denoting type or class, without inherent ties to biological reproduction or social roles.\n\nIn early modern English dictionaries, *gender* retained its strictly grammatical connotation. Samuel Johnson's *A Dictionary of the English Language* (1755) defined it in terms of noun classification and syntactic agreement, reflecting prevailing usage in discussions of inflected languages like Latin, French, and German, where pronouns and adjectives concord with noun genders irrespective of natural sex. The term's application to human or animal sex appeared sporadically from the late 14th century but remained uncommon and secondary to its grammatical sense until the 20th century, with no established link to societal roles or identities.\n\nBy the 18th century, scientific disciplines occasionally extended analogous grammatical terminology to biological categorization, as in botany, where Carl Linnaeus's 1735 *Systema Naturae* classified plants using a sexual system based on stamen (male) and pistil (female) structures, drawing parallels to gendered noun classes while grounding distinctions in observable reproductive morphology. This usage preserved *gender*'s roots in categorical sorting tied to empirical traits, predating any abstract social interpretations.\n\n### Grammatical Gender in Languages\n\nGrammatical gender constitutes a system of noun classification in linguistics, wherein nouns are grouped into categories—typically masculine, feminine, and/or neuter—that govern agreement patterns with modifiers such as articles, adjectives, and pronouns. This feature, distinct from biological sex, primarily facilitates syntactic structure rather than semantic content related to referents' attributes. In the Indo-European language family, grammatical gender originated in Proto-Indo-European, which exhibited three genders: masculine for active or male-associated animates, feminine for female-associated or certain collectives, and neuter for inanimates or abstracts.\n\nThe categories often assign genders arbitrarily to inanimate nouns, decoupling them from biological sex. In French, \"table\" receives feminine gender as \"la table,\" dictating feminine forms for agreeing elements like adjectives (e.g., \"une grande table\"). In German, \"Mädchen\" (girl) is neuter (\"das Mädchen\") owing to its diminutive ending \"-chen,\" which neutralizes nouns regardless of the referent's sex, requiring neuter agreement. These conventions underscore the system's syntactic utility over any mimetic representation of natural properties.\n\nLanguages with natural gender, by comparison, tie pronoun and agreement distinctions more closely to biological sex for animates while eschewing broad noun classification. English employs \"he\" for males, \"she\" for females, and \"it\" for inanimates or unspecified sex, without requiring gender agreement on inanimate nouns. Danish maintains a grammatical common-neuter distinction for nouns (e.g., \"en bil\" common for car, \"et hus\" neuter for house) but defaults pronouns to natural gender patterns for humans, reflecting a partial shift from fuller Proto-Indo-European systems.\n\nEvolutionary linguistics views grammatical gender as an emergent cognitive adaptation for partitioning lexical items into manageable classes, aiding memory, reference tracking, and phrase-level predictability via agreement, rather than deriving from or causally influencing social gender constructs. Proto-Indo-European gender likely expanded from an animate-inanimate binary to three classes for finer nominal organization, with subsequent languages retaining or simplifying it for processing efficiency.\n\n### Emergence of Social Gender Concept\n\nThe concept of gender as a social phenomenon distinct from biological sex gained traction in the mid-20th century, initially through philosophical and psychological lenses rather than empirical validation. In her 1949 book *The Second Sex*, Simone de Beauvoir articulated an existentialist view that women's social position arises not from innate biology but from cultural conditioning, famously stating, \"One is not born, but rather becomes, a woman,\" thereby laying groundwork for later constructionist theories that emphasized socialization over biological determinism. This perspective, rooted in phenomenological analysis rather than controlled studies, influenced subsequent feminist thought by prioritizing lived experience and societal roles, though it faced criticism for overlooking cross-cultural biological universals in sex differences.\n\nPsychologist John Money operationalized the distinction in clinical contexts, coining the term \"gender role\" in 1955 to describe the behavioral and psychological attributes adopted by individuals with intersex conditions, separate from their chromosomal or anatomical sex. Money extended this to \"gender identity\" by the 1960s, arguing that identity could be shaped environmentally if interventions occurred early, as in cases of ambiguous genitalia where he advocated surgical reassignment and upbringing aligned with the chosen role. However, his theories rested on limited case studies with methodological flaws, including non-representative samples from intersex populations that comprised less than 0.02% of births, and lacked longitudinal controls to isolate nurture from nature.\n\nThe 1970s saw feminist anthropologists like Gayle Rubin formalize the separation through the \"sex/gender system,\" defined in her 1975 essay \"The Traffic in Women\" as societal mechanisms converting biological sexuality into gendered products of human activity, such as kinship roles and labor divisions. This framework, drawing on Marxist and structuralist ideas, promoted gender as a cultural overlay amenable to deconstruction, influencing academic disciplines amid second-wave feminism's push against perceived patriarchal biology. Yet, early empirical support was scant, with Rubin's model relying on ethnographic analogies rather than falsifiable data, and it contrasted with emerging evolutionary psychology critiques that highlighted innate, heritable sex differences in behavior observable in infants and primates, predating socialization.\n\nMoney's claims were dramatically undermined by the David Reimer case, where a biologically male twin (born 1965) underwent reassignment after a botched circumcision in 1966, raised as \"Brenda\" under Money's protocol from 1967 onward; despite intensive therapy, Reimer rejected the female identity by adolescence, reverting to male at age 14 in the 1980s, and later died by suicide in 2004, exposing the limits of environmental determinism. This outcome, publicized in the 1990s, revealed ethical lapses like coerced compliance in Money's reports and underscored that gender concepts often outpaced rigorous testing, with constructionist views persisting in activist circles despite biological counterevidence from twin studies showing 50-80% heritability in gender-typical behaviors. These constructivist views, foundational to gender ideology, emphasize cultural flexibility over biological dimorphism but face critiques for evidentiary gaps (e.g., Money's Reimer case failure).\n## Biological Basis of Sex and Gender\n\n### Genetic and Chromosomal Foundations\n\nIn humans, biological sex is primarily determined by the chromosomal complement at fertilization, with typical females possessing a 46,XX karyotype and males a 46,XY karyotype. The presence of the Y chromosome distinguishes males, as it contains the SRY (sex-determining region Y) gene, which encodes a transcription factor that initiates the differentiation of the bipotential gonad into testes around the 6th to 7th week of embryonic development.  In the absence of SRY, as in XX individuals, the default developmental pathway leads to ovarian formation.\n\nThe SRY protein achieves this by binding to DNA and activating downstream genes such as SOX9, which promote Sertoli cell differentiation and subsequent testicular morphogenesis, establishing the binary trajectory of sexual dimorphism. This mechanism underscores the chromosomal foundation as the primary causal driver, with over 99% of individuals conforming to these XX/XY patterns and producing anisogamous gametes—small, mobile sperm in males or large, sessile ova in females—as the evolutionary hallmark of sex. No viable chromosomal configuration in humans or other sexually reproducing species generates a third gamete type capable of fusing with either sperm or ova to propagate reproduction.\n\nDisorders of sex development (DSDs), including chromosomal aneuploidies, occur in approximately 1 in 4,500 to 5,500 births and represent deviations that do not negate the binary framework, as affected individuals align with one sex based on gamete production potential or default to sterility without intermediate functionality. For instance, Klinefelter syndrome (47,XXY) results in a male phenotype with testicular dysgenesis, elevated gonadotropins, and near-universal infertility due to azoospermia, though rare mosaic cases may produce limited sperm; these individuals do not develop ovaries or ova.  Similarly, Turner syndrome (45,X or mosaics) yields a female phenotype with streak gonads, ovarian dysgenesis, and infertility, lacking functional spermatogenesis.  Such conditions, comprising less than 0.02% of the population for those severely disrupting gonadal development, reinforce gametic dimorphism as the definitive criterion, as no DSD enables production of both sperm and ova or a novel gamete class.\n\n### Hormonal and Physiological Dimorphism\n\nIn male fetuses, testosterone production surges between approximately weeks 8 and 24 of gestation, peaking around weeks 10 to 20, driven initially by human chorionic gonadotropin from the placenta. This prenatal androgen exposure organizes the differentiation of male external genitalia, including the formation of the penis and scrotum from genital tubercle and folds, as well as internal structures like the prostate and seminal vesicles. It also influences skeletal development, promoting greater male-typical bone growth patterns evident in later dimorphisms such as broader shoulders and denser long bones.\n\nCausal evidence for these effects comes from congenital adrenal hyperplasia (CAH), a disorder causing excess adrenal androgen production in XX fetuses; affected females exhibit virilization of external genitalia, including clitoral enlargement and labial fusion resembling male structures, directly attributable to elevated prenatal androgens rather than genetic sex. Studies of opposite-sex twins further isolate hormonal influences, showing that female co-twins of males experience prenatal testosterone transfer via shared placental circulation, resulting in subtle physical shifts like reduced female-typical ovarian follicle counts, independent of genetic confounding.\n\nDuring puberty, circulating testosterone in males rises 20- to 30-fold, far exceeding estrogen-driven changes in females, amplifying dimorphisms in muscle, bone, and cardiovascular capacity. Males develop approximately 40% greater total skeletal muscle mass than females by adulthood, with lean body mass increasing disproportionately in boys due to androgen receptor activation in muscle fibers. This contributes to males averaging 15% to 30% higher maximal oxygen uptake (VO2 max), reflecting enhanced aerobic capacity tied to larger hearts, higher hemoglobin levels, and greater mitochondrial density in muscle, as isolated in twin studies controlling for shared genetics. Females, conversely, accrue more adipose tissue and develop wider pelvic structures optimized for gestation, with estrogens promoting fat deposition in hips and thighs while inhibiting excessive muscle hypertrophy.\n\nThese hormonal divergences underpin lifespan health disparities. Estrogens in females enhance immune responsiveness but predispose to autoimmunity, with women comprising 75% to 80% of cases across diseases like rheumatoid arthritis and systemic lupus erythematosus, as evidenced by disease flares during high-estrogen phases like pregnancy. In males, sustained testosterone supports higher bone mineral density and muscle power but correlates with elevated injury rates, including 2- to 3-fold higher trauma incidence in young adults, linked to androgen effects on tissue resilience and biomechanics rather than purely behavioral factors. Twin data reinforce hormonal causality by showing that prenatal androgen exposure predicts later physical vigor in males beyond genetic baselines.\n\n### Neurological and Brain Sex Differences\n\nMales possess larger total brain volumes than females, with meta-analyses reporting an average difference of approximately 11% in adults after adjusting for body size. This dimorphism emerges early, as newborn males exhibit greater subcortical volumes and overall brain size compared to females, even after controlling for total intracranial volume. Females, in turn, demonstrate relatively greater cortical gray matter volumes and enhanced interhemispheric connectivity, including stronger co-activation patterns between brain hemispheres during functional tasks.\n\nPrenatal androgen exposure influences early behavioral indicators of brain dimorphism, correlating with sex-typical toy preferences in toddlers; higher androgen levels predict preferences for wheeled toys and mechanical objects, observed across genetic sexes in conditions like congenital adrenal hyperplasia. Transcriptomic analyses of early fetal brains, conducted in April 2025, reveal sex-specific gene expression differences detectable from the first trimester, involving over 3,000 genes with divergent activity patterns driven by both chromosomal and hormonal factors, though the magnitude remains limited.\n\nFunctional neuroimaging, including fMRI, demonstrates sex-differentiated activation patterns in cognitive domains: females exhibit stronger responses in regions associated with empathy, such as the mirror neuron system, while males show heightened activity in areas linked to systemizing, like visuospatial processing networks, patterns that align with the empathizing-systemizing framework and persist independent of cultural context.\n\nA May 2025 investigation uncovered marked sex differences in mitochondrial gene activity within brain cells, with males displaying elevated expression across all protein-coding mitochondrial genes compared to females, potentially contributing to divergent energy metabolism and cellular resilience. Longitudinal studies further indicate that brain aging proceeds faster in males, with greater volume loss across multiple regions—including frontal and temporal lobes—relative to females, despite females' higher incidence of certain neurodegenerative conditions.\n\n### Comparative Evidence from Non-Human Animals\n\nIn non-human animals, sex-linked behaviors exhibit strong dimorphism tied to reproductive roles and hormonal profiles, providing evidence for evolutionarily conserved traits that parallel human gender-typical patterns independent of cultural influences. Observations across species demonstrate that males often engage in competitive displays or territorial defense to attract mates, while females select partners based on these signals, a pattern driven by gamete asymmetry and parental investment differences.\n\nMate selection behaviors highlight this dimorphism, as seen in avian species where males perform elaborate courtship displays, such as the acrobatic leaps and snaps of golden-collared manakins (Manacus vitellinus), which females evaluate for motor precision and vigor. These displays, absent in females, correlate with mating success and are modulated by sex-specific neural and hormonal circuits. In mammals, testosterone facilitates territorial aggression; for instance, in seasonally breeding birds and rodents, elevated testosterone levels during breeding seasons enhance defense of resources critical for reproduction, with experimental implants increasing territorial responses in males.\n\nCastration experiments further causally link hormones to these behaviors: in male rats, orchiectomy reduces mounting, aggression toward intruders, and shock-induced fighting, effects reversed by testosterone administration, indicating that gonadal androgens organize and activate male-typical patterns post-puberty. Similar reversals occur in other mammals, where androgen deprivation diminishes competitive and exploratory tendencies otherwise prominent in intact males.\n\nParental roles also show sex-specificity, with females in primates like common marmosets (Callithrix jacchus) exclusively providing nursing due to lactation, while males contribute carrying and grooming, behaviors essential for twin offspring survival in cooperative breeding systems. Same-sex pairings in captivity rarely replicate these dimorphic roles without biological surrogacy, as males cannot lactate and females lack the same provisioning capacity, underscoring the necessity of physiological dimorphism for functional caregiving division.\n\nWild populations exhibit no systematic evidence of innate gender fluidity, where individuals persistently adopt opposite-sex behavioral repertoires decoupled from morphology; transient same-sex mounting occurs for dominance or alliance but does not entail role reversal or identity shifts akin to human claims. Anomalies like intersex traits in fish, such as oocyte development in male roach (Rutilus rutilus), correlate with exposure to anthropogenic endocrine disruptors like alkylphenols and estrogens from wastewater, rather than adaptive variation, and prevalence declines in uncontaminated habitats.\n\n## Psychological Aspects of Gender\n\n### Development of Gender Identity\n\nGender identity in typically developing children emerges early in life, with basic awareness of one's own sex appearing by around age 2 years, as children begin to label themselves and others using sex-based categories such as \"boy\" or \"girl.\" This initial gender self-concept aligns with biological sex in the vast majority of cases and precedes explicit parental instruction or broader socialization, as evidenced by longitudinal observations showing spontaneous categorization without cognitive prerequisites like gender constancy. By ages 2-3, over 90% of children demonstrate sex-typical behavioral preferences, including strong inclinations toward gender-congruent toys—girls favoring dolls and boys preferring vehicles or construction items—with meta-analyses of free-play studies reporting large effect sizes (Cohen's *d* ≈ 1.0-1.6) indicative of near-universal patterns in unselected populations.\n\nThese preferences stabilize and intensify through middle childhood, correlating with biological markers like prenatal androgen exposure rather than cultural reinforcement alone, as cross-cultural consistencies and animal analogs suggest innate drivers. In cases of early gender nonconformity, longitudinal clinic data from pre-2010s cohorts indicate high rates of resolution, with 80-95% of children diagnosed with gender dysphoria desisting by adolescence or adulthood without intervention, often aligning with their natal sex following puberty. Persistence is rarer and linked to intensity of early symptoms and comorbidities like autism spectrum traits, rather than isolated nonconformity.\n\nTwin studies further illuminate etiology, estimating moderate heritability for childhood gender nonconformity (30-70% of variance), as seen in Dutch and U.S. cohorts where monozygotic concordance exceeds dizygotic but shared environment plays a minimal role. However, genetic influences do not predict long-term persistence absent additional factors, with desistance predominant in uncomplicated cases, underscoring developmental plasticity aligned with biological sex. These patterns hold in data from specialized clinics prior to widespread social transitioning, which newer evidence suggests may reduce desistance rates.\n\n### Gender Dysphoria: Etiology and Persistence\n\nGender dysphoria, which evolved from \"gender identity disorder\" added in DSM-III (1980) for clinical treatment of persistent cross-gender identification and renamed in DSM-5 (2013) to emphasize distress and incongruence while reducing pathologization of identity itself, as defined in the DSM-5 published in 2013, involves a marked incongruence between one's experienced or expressed gender and primary or secondary sex characteristics or biological sex, lasting at least six months and accompanied by clinically significant distress or impairment in social, occupational, or other important areas of functioning. This diagnosis requires evidence of at least two indicators, such as a strong desire to be rid of one's sex characteristics, a conviction that one's feelings and reactions align with the opposite gender, or a desire to live as that gender, distinguishing it from mere gender nonconformity without distress.\n\nEmpirical studies indicate substantial comorbidities with gender dysphoria, including elevated rates of autism spectrum disorder (ASD), with meta-analyses estimating a pooled prevalence of 11% among individuals with gender dysphoria, far exceeding general population rates of around 1-2%. Clinical overlap reaches 20-26% in some youth cohorts referred to gender clinics, potentially linked to shared neurodevelopmental factors or difficulties in social cue interpretation that may amplify body-related distress. Additional associations include histories of trauma, with gender-dysphoric individuals reporting higher rates of adverse childhood experiences compared to non-dysphoric peers, and overlaps with body dysmorphic disorder, where preoccupation with perceived bodily flaws exacerbates incongruence-related anxiety.\n\nReferrals for gender dysphoria, particularly adolescent-onset cases, surged post-2010, exemplified by the UK's Gender Identity Development Service (GIDS) at Tavistock, where total referrals rose from 77 in 2009 to 2,590 in 2018-19, with female referrals increasing over 4,000% from 40 in 2009-10 to 1,806 in 2017-18. This shift toward predominantly adolescent females contrasts with historical patterns dominated by pre-pubertal boys and aligns with evidence of social contagion, including cluster outbreaks within friend groups and sudden onsets reported by parents in surveys of over 1,600 cases. The rapid-onset gender dysphoria (ROGD) phenomenon, described in parental reports, features abrupt declarations during or after puberty, often following increased online exposure or peer identification, challenging traditional etiological models rooted in innate cross-sex identification.\n\nPersistence of gender dysphoria from childhood into adulthood remains low, with longitudinal studies reporting desistance rates of 73-98% among pre-pubertal cases, meaning fewer than 15-27% maintain dysphoria post-puberty without intervention. Early-onset cases without social transition show even higher resolution, often resolving alongside puberty's hormonal changes, whereas adolescent or rapid-onset subtypes exhibit variable trajectories, with parental reports indicating higher reversal rates in non-medicalized contexts, potentially due to external influences dissipating over time. These patterns suggest etiological heterogeneity, where pre-pubertal dysphoria may stem more from transient developmental factors and adolescent surges from psychosocial amplifiers, underscoring the need for causal discernment beyond affirmation assumptions prevalent in biased clinical reporting.\n\n### Associated Mental Health Factors\n\nIndividuals with gender dysphoria exhibit markedly elevated rates of suicidal ideation and attempts compared to the general population, with lifetime suicide attempt rates often exceeding 40% among transgender adults and youth cohorts prior to medical interventions. In adolescent samples, female-to-male identifying individuals have reported attempt rates as high as 51%. These figures persist even after accounting for demographic factors, underscoring a baseline psychiatric vulnerability in this group.\n\nComorbid mental health conditions are prevalent, with 60-70% of individuals diagnosed with gender dysphoria also experiencing depression or anxiety disorders. Over 70% of youth with gender dysphoria present with additional psychiatric comorbidities, including mood disorders and trauma-related conditions. Autism spectrum disorder (ASD) co-occurs at rates 3-6 times higher than in the general population, potentially indicating that gender-related distress in some cases reflects broader neurodevelopmental challenges rather than isolated incongruence with biological sex. This overlap suggests misattribution risks, where underlying ASD traits may amplify perceptions of body incongruence or social discomfort.\n\nLong-term cohort data reveal that psychiatric risks do not substantially abate following gender-affirming surgeries or hormones. A Swedish nationwide study tracking 324 individuals post-sex reassignment from 1973 to 2003 found suicide mortality rates 19.1 times higher than matched controls, alongside elevated overall mortality and psychiatric inpatient admissions; the authors noted that results should not be interpreted as sex reassignment per se increasing morbidity and mortality, but rather that the patient group is at high risk, and outcomes might have been worse without intervention. Recent analyses, including a 2024 review of surgical outcomes, confirm persistently higher self-harm and suicide risks post-intervention, challenging assumptions that transition causally resolves underlying distress. These patterns imply that gender dysphoria often signals deeper, untreated psychopathologies, with affirmative treatments showing limited efficacy in mitigating long-term harms.\n\n## Social and Cultural Influences\n\n### Evolutionary Origins of Gender Roles\n\nEvolutionary theories posit that sex differences in human behavior originated from asymmetries in reproductive costs and parental investment between males and females, shaping adaptive strategies over deep time. In Robert Trivers' 1972 parental investment theory, the sex facing greater obligatory investment—typically females due to internal gestation, lactation, and initial offspring care—evolves greater selectivity in mate choice and risk aversion to protect reproductive efforts, while the lower-investing sex, males, pursues multiple matings through intrasexual competition and risk-taking.  This framework predicts and explains patterns observed across species, where male-male competition for mates manifests in traits like aggression and territoriality, contrasted with female choosiness and neophobia to safeguard higher-stakes investments.\n\nCross-species evidence supports these origins, as in the vast majority of vertebrates and invertebrates, males exhibit greater variance in reproductive success through competitive strategies, while females prioritize quality over quantity in partners. For instance, in polygynous mammals such as elephants and gorillas, males engage in lethal combats for harems, reflecting evolved risk tolerance absent in females focused on sustaining pregnancies and nursing. These patterns extend to behavioral dimorphisms, with males often displaying exploratory and aggressive tendencies tied to mate access, while females emphasize caution and provisioning—dynamics that parallel human universals without invoking cultural invention alone.\n\nIn ancestral human environments, such as hunter-gatherer societies representing over 95% of hominid history, these pressures manifested in a near-universal sexual division of labor: men predominantly hunted large game requiring strength, endurance, and group coordination for high-risk, high-reward returns, while women focused on gathering reliable plant resources and childcare compatible with mobility constraints of infancy. Ethnographic surveys, including Ember's 1978 analysis of 179 foraging groups, found men as sole or primary big-game hunters in 93% of cases (166 societies), linked to average male physical advantages in upper-body strength and aerobic capacity suiting variable-distance pursuits.  This division maximized caloric efficiency and offspring survival, with women's contributions stable yet proximate to camps to minimize predation risks during vulnerable reproductive phases.\n\nContemporary deviations from these roles correlate with evolutionary mismatches, including fertility declines and well-being disparities. In developed nations, women's mass workforce entry since the 1970s has coincided with fertility rates dropping below replacement levels (e.g., 1.6 births per woman in the U.S. by 2023), as egalitarian shifts delay partnering and childbearing, conflicting with peak reproductive windows.  Studies link traditional gender attitudes to higher fertility intentions, with acceptance of role specialization predicting more children via complementary investments. Similarly, General Social Survey data from 1972–2006 reveal women's self-reported happiness declining relative to men's, with the gender gap reversing amid expanded options that amplify trade-offs between career and family demands.  These trends suggest costs to overriding evolved predispositions, though adaptive flexibility allows variation within sex-typical ranges.\n\n### Cross-Cultural Patterns and Variations\n\nCross-cultural ethnographic databases, such as George P. Murdock's Ethnographic Atlas covering 1,291 societies, reveal consistent sex-based divisions of labor, with men performing warfare, big-game hunting, and tool-making in over 90% of cases, while women undertake childcare, cooking, and gathering of vegetable foods or small game in nearly all societies.  In the Standard Cross-Cultural Sample of 186 societies derived from Murdock's work, these assignments show probabilistic entailments rather than strict universals, yet exceptions are rare and never involve wholesale reversals, such as women dominating warfare or men assuming primary infant caregiving roles. \n\nThe Human Relations Area Files (HRAF), aggregating data from hundreds of societies, confirm that factors like task distance from home or physical demands predict sex-typical allocations, with women contributing more to nearby, low-risk subsistence in horticultural groups, but retaining primary responsibility for kin care across subsistence types.  No documented society features reversed dimorphisms, such as female-led raiding parties or male-dominated childcare, underscoring the robustness of these patterns against cultural variation. \n\nIn matrilineal societies like the Mosuo of southwestern China, where women inherit property and manage households through \"walking marriages\" without formal cohabitation, flexibility in roles does not erase sex differences; women remain focused on maternal kin and exhibit choosier mate selection based on traits like physical attractiveness, while men display competitive behaviors in social networks.  These modulations highlight cultural influences on role expression but preserve underlying behavioral dimorphisms, as Mosuo women show muted but persistent preferences aligning with broader cross-cultural female patterns in partner evaluation.\n\nImmigration data further illustrate persistence: among migrants to Western countries, origin-country sex gaps in religiosity endure, with women maintaining higher attendance and traditional attitudes linked to individual piety, even after generations, as seen in Muslim and Latin American groups where female religiosity exceeds male by 10-20 percentage points in surveys.  Occupational segregation similarly holds, with religious immigrant women from conservative origins participating less in the labor market (e.g., 15-25% lower employment rates than nonreligious peers) and clustering in care-oriented fields, resisting full assimilation to host norms. Such evidence from over 100 societies and migrant cohorts refutes pure social constructionism, revealing invariant cores modulated by ecology and tradition rather than arbitrarily invented.\n\n### Impacts of Language, Religion, and Tradition\n\nEmpirical investigations into the Sapir-Whorf hypothesis, which posits that language structure influences thought, have tested whether grammatical gender systems—present in languages like Spanish, German, and French—shape perceptions of gender norms or identity. Studies demonstrate weak effects on object categorization: for instance, German speakers, who assign feminine gender to \"bridge\" (*Brücke*), describe it with attributes like \"elegant\" more often than Spanish speakers, who use masculine \"puente\" and favor terms like \"strong.\" However, these biases are subtle, context-dependent, and confined to inanimate objects, with no robust evidence extending to human gender identity or overriding biological sex differences in self-perception. A systematic review of 43 studies involving nearly 6,000 participants found inconsistent and small-scale influences, suggesting language reinforces rather than causally determines gender-related cognition.\n\nAbrahamic religions, drawing from creation accounts in Genesis 1:27—\"So God created man in his own image... male and female he created them\"—emphasize a binary sexual dimorphism as divinely ordained, which correlates with reduced gender nonconformity in adherent populations. Surveys indicate that individuals in conservative Christian, Jewish, and Muslim communities exhibit lower rates of transgender identification compared to secular groups; for example, U.S. data show religiously affiliated adults are more likely to affirm that gender aligns with biological sex at birth (62% among Catholics in 2022, up from 52% in 2021), reflecting normative pressures that align with observed lower self-reported dysphoria. This pattern holds in global comparisons, where high-religiosity societies report transgender prevalence below 0.5% versus 1-2% in secular Western contexts, though causation remains correlative and intertwined with cultural enforcement of biological norms rather than suppression of innate variance.\n\nTraditional practices exaggerating gender roles, such as Chinese foot-binding (prevalent from the 10th to early 20th century) and female genital mutilation (FGM) in parts of Africa and the Middle East, impose physical modifications to enforce female subservience but fail to alter underlying biological preferences. Foot-binding, which deformed feet to symbolize beauty and immobility, affected up to 50% of Chinese women by the 19th century yet ended rapidly after 1912 bans without shifting persistent sex differences in occupational interests or mate selection criteria observed cross-culturally. Similarly, FGM—performed on over 200 million girls as of 2023—increases risks like postpartum hemorrhage by 55% and neonatal death by 15%, per systematic reviews, yet longitudinal data from migrant communities show no diminishment of innate female preferences for nurturing roles post-avoidance, indicating these customs amplify but do not reprogram evolved dimorphisms. Such interventions highlight cultural limits in overriding physiology, often yielding net harms without evidence of sustained psychological reconfiguration.\n\n## Gender in Contemporary Society\n\n### Educational and Cognitive Sex Differences\n\nSex differences in cognitive abilities manifest in average group performance across academic domains, with males exhibiting advantages in spatial reasoning and mathematical aptitude at the extremes, while females show superior verbal abilities. The greater male variability hypothesis posits that males display larger standard deviations in cognitive traits, leading to overrepresentation at both high and low tails of distributions. This pattern is evident in fields requiring exceptional quantitative skills, where males comprise approximately 92% of International Mathematical Olympiad winners since 1988, reflecting a 12:1 male-to-female ratio among top performers. Similarly, in scientific Nobel Prizes (physics, chemistry, and physiology or medicine), fewer than 6% of laureates have been female as of 2024, yielding ratios exceeding 15:1 in favor of males. In contrast, females outperform males in reading comprehension, with gaps ranging from 0.13 to 0.34 standard deviations in assessments like PISA and NAEP, where girls score 22-24 points higher on average in OECD countries.\n\nThese disparities in STEM-related domains correlate strongly with biological factors, particularly sex differences in mental rotation and spatial visualization, which meta-analyses attribute to males' consistent outperformance by 0.5-1.0 standard deviations. Such abilities explain over 50% of variance in mathematical and engineering performance, as spatial tasks predict success in these fields beyond general intelligence. Twin studies reinforce a genetic etiology, revealing higher heritability for spatial and quantitative traits in males (up to 66% in adolescence) compared to shared environmental influences, with sex-specific genetic effects persisting into adulthood. For verbal abilities, heritability estimates similarly favor genetic over environmental factors, though female advantages emerge earlier and show less variability.\n\nIntervention efforts, including affirmative action quotas in STEM admissions and scholarships, have increased female enrollment but failed to eliminate performance gaps or boost representation at elite levels. Despite such policies, women constitute only 29% of the global STEM workforce as of 2024, with persistent underrepresentation in high-variance domains like mathematics competitions and patenting. Studies of quota implementations show short-term enrollment gains but no proportional rise in degree completions or innovation outputs, suggesting intrinsic cognitive variances limit equalization.\n\nEmerging neuroimaging and experimental data from 2025 highlight sex-specific neural mechanisms underlying learning optima. Males rely more on NMDA receptors for synaptic strengthening in spatial tasks, while females utilize estrogen modulation, leading to superior episodic memory for contextual details but differential handling of quantitative loads. These findings, derived from controlled brain imaging, indicate tailored educational approaches—such as optimized nutrition influencing fatty acid sensitivity via estrogen—could address variances without overriding biological baselines.\n\n### Occupational Segregation and Economic Outcomes\n\nOccupational segregation by sex remains pronounced globally, with women comprising over 90% of workers in nursing and childcare roles, while men hold over 80% of positions in engineering fields. This horizontal segregation aligns with persistent differences in vocational interests: women disproportionately select people-oriented occupations, and men things-oriented ones, patterns observed across cultures and economic systems.\n\nLongitudinal research indicates these preferences emerge early and drive career trajectories independently of socialization or exposure. For instance, gender-typed interests measured in adolescence bidirectionally predict skills and occupational outcomes in adulthood, with male-typed interests (e.g., mechanical) preceding entry into technical fields. Prenatal androgen exposure further correlates with object-oriented interests that forecast STEM career choices, suggesting biological influences on revealed preferences over discriminatory barriers.\n\nThe gender pay gap, often cited as 16-20% unadjusted in the U.S. (women earning 83.6% of men's median weekly earnings in 2023), shrinks to near zero when accounting for occupational choices, hours worked, and experience. Decompositions attribute 70-80% of the gap to voluntary factors, including women's preferences for flexible, lower-hour roles and the motherhood trade-off, where reduced labor supply reflects prioritized family commitments rather than coercion.\n\nThis dynamic intensifies in egalitarian settings, as evidenced by the Nordic paradox: despite policies promoting equality, occupational segregation and pay gaps are larger in Sweden and Norway than in less interventionist nations, implying that reduced external pressures allow innate preferences to diverge more freely.\n\nMen's higher propensity for risk manifests in entrepreneurship, where they found approximately 87% of startups, driven by adaptive strategies favoring high-variance pursuits despite elevated failure rates. Women's underrepresentation (around 13%) in founding teams persists even in funded ventures, underscoring sex differences in tolerance for uncertainty over access barriers.\n\n### Family Dynamics and Reproductive Roles\n\nSex differences in reproductive biology impose distinct constraints on family formation and stability. Women experience peak fertility between ages 20 and 30, after which fecundity declines sharply due to diminishing oocyte quality and quantity, whereas men maintain higher fertility into later decades with a more gradual decline beginning around age 30. This asymmetry influences partnering patterns, as women's narrower reproductive window incentivizes earlier family establishment, while men's extended potential allows deferred paternity but raises risks of age-related genetic mutations in offspring. Delayed childbearing among women, increasingly common in developed nations, elevates aneuploidy risks, such as trisomy 21 (Down syndrome), with incidence rising from approximately 1 in 1,500 births for mothers under 25 to 1 in 100 for those aged 40 and older.\n\nIn family dynamics, these biological imperatives manifest in patterns of marital dissolution and parenting roles. In the United States, women initiate approximately 69% of divorces in heterosexual marriages, a figure derived from longitudinal analyses of marital histories. This propensity contributes to the prevalence of single-mother households, which comprise about 80% of single-parent families and are associated with elevated child adversity. Children in such households face heightened risks of delinquency and incarceration; for instance, father-absent homes correlate with juvenile violent crime rates up to 17% higher than intact families, and youth from single-mother families represent a disproportionate share—around 70%—of juvenile delinquents in some datasets.\n\nPaternal investment plays a critical role in mitigating these risks, aligning with evolutionary models positing that male provisioning enhances offspring survival and competitiveness. Empirical studies confirm that father presence and involvement improve child developmental outcomes, including reduced behavioral problems and better socioeconomic attainment, independent of maternal effects. In species-typical human pair-bonding, biparental care buffers against instability, as single-mother arrangements often strain resources and supervision, amplifying delinquency odds through mechanisms like reduced monitoring and economic hardship. These patterns underscore causal linkages between intact dual-parent structures—facilitated by complementary sex roles—and favorable child trajectories, with disruptions disproportionately affecting outcomes via absent male investment.\n\n## Legal and Policy Frameworks\n\n2025 U.S. Executive Order 14168 (Jan 20) mandates federal recognition of sex as immutable binary (male/female).\n### Definitions of Sex in Law and Policy\n\nPrior to the 2000s, legal frameworks in many jurisdictions defined sex as a binary, immutable biological classification distinguishing males from females based on reproductive anatomy and chromosomes. This understanding underpinned anti-discrimination laws, such as the U.S. Equal Protection Clause of the Fourteenth Amendment, which applies intermediate scrutiny to classifications based on biological sex as an objective trait. In the United States, Title IX of the Education Amendments of 1972 prohibited discrimination \"on the basis of sex\" in federally funded education programs, with \"sex\" originally grounded in biology at the time of enactment, enabling sex-segregated facilities and sports to address historical disparities faced by females.\n\nEmerging policies in the early 2000s introduced mechanisms to alter legal sex markers, diverging from strict biological anchoring. The United Kingdom's Gender Recognition Act 2004 established a process for obtaining a Gender Recognition Certificate, which retroactively changes a person's legal sex for most purposes, converting their birth-registered sex to the acquired gender. This shift facilitated civil recognition of gender identity over biology in documents like birth certificates, though it required medical evidence and did not fully override all contexts, such as certain sporting regulations.\n\nRecent judicial and executive actions have reaffirmed biological sex as the operative definition in key policies, countering expansions incorporating gender identity. In April 2025, the UK Supreme Court ruled unanimously that \"sex,\" \"man,\" and \"woman\" in the Equality Act 2010 refer to biological sex recorded at birth, unaffected by a Gender Recognition Certificate for anti-discrimination purposes. In the U.S., a February 2025 executive order defined sex as \"an individual's immutable biological classification as either male or female,\" directing enforcement of Title IX based on biology to protect women's opportunities in education and sports. Federal courts in 2024 and 2025 invalidated Biden administration rules redefining \"sex\" under Title IX to include gender identity, holding that such interpretations exceeded statutory authority and undermined biological protections.\n\nPolicies permitting self-identification without biological verification have correlated with safety compromises in single-sex spaces, prompting empirical scrutiny and legal reversals. UK Ministry of Justice data and analogous international reports document increased sexual offenses in female facilities following self-ID access, including a sharp rise in rapes attributed to \"female\" offenders after self-declaration reforms in jurisdictions like Ireland. U.S. sports cases before the Supreme Court in 2025 highlight how gender identity overrides erode fairness, with courts recognizing biological differences in strength and performance as necessitating sex-based segregation under Title IX. These developments underscore causal links between policy detachment from biology and tangible harms, informing ongoing efforts to restore immutable sex as the legal baseline for protections.\nPolicy debates often pit ideological affirmation against empirical caution, as in the Cass Review's (2024) findings of weak youth intervention evidence; see Opposition to Gender Ideology for global pushback dynamics.\n### Transgender Recognition and Rights\n\nIn the United States, the Supreme Court's 6-3 decision in *Bostock v. Clayton County* on June 15, 2020, ruled that Title VII of the Civil Rights Act of 1964 prohibits employment discrimination against individuals based on transgender status, interpreting it as discrimination on the basis of sex. This landmark ruling extended federal protections to transgender employees in hiring, firing, promotions, and workplace conditions, influencing subsequent interpretations under fair housing laws to bar discrimination in housing based on gender identity. However, these accommodations have raised concerns over privacy in sex-segregated facilities, with some employers and jurisdictions facing challenges in balancing transgender access rights against the privacy expectations of others, particularly in restrooms and changing areas.\n\nTransgender recognition often includes provisions for changing legal gender markers on identification documents, with varying requirements across jurisdictions; for instance, some U.S. states permit self-attestation without medical intervention, while others mandate surgery or hormone therapy. Proponents cite low reported detransition rates—ranging from 1% to 8% in recent studies—as evidence supporting expansive rights, with many cases attributed to external pressures like discrimination rather than internal regret.  Yet, methodological limitations, including loss to follow-up and stigma discouraging disclosure, suggest potential underreporting, as highlighted in critiques of long-term outcome tracking. \n\nRising litigation by detransitioners underscores tensions in recognition policies, with multiple malpractice suits filed since 2022 alleging inadequate evaluation and informed consent in gender transitions, including cases like those of Chloe Cole and Prisha Mosley against medical providers.  These actions, often citing failures in mental health assessments, have prompted extended statutes of limitations in states like North Carolina to allow claims for harms from transition procedures.\n\nInternationally, approaches to transgender rights vary, with some nations adopting self-identification for legal gender changes while imposing evidence-based limits on associated medical interventions. In Sweden, following a 2022 review by the National Board of Health and Welfare deeming youth hormone treatments experimental due to insufficient evidence of benefits outweighing risks, policies restricted such interventions for minors, prioritizing psychotherapy.  Finland's 2020 systematic review similarly classified hormonal transitions for adolescents as experimental, leading to guidelines favoring non-medical approaches amid high comorbidity rates in gender-dysphoric youth. These shifts reflect causal assessments of low-quality evidence supporting rapid affirmation, balancing anti-discrimination frameworks with protections against irreversible harms, though adult recognition remains accessible under regulated conditions.\n\n### Intersex Conditions and Medical Interventions\n\nIntersex conditions, medically classified as disorders of sex development (DSDs), encompass congenital anomalies in chromosomal, gonadal, or anatomical sex differentiation, resulting from genetic or hormonal disruptions rather than evidence of innate sexual ambiguity or spectra beyond the binary. These disorders affect a narrow subset of births; the true prevalence of neonates with ambiguous genitalia requiring expert multidisciplinary evaluation is 0.018%, far lower than inflated estimates of 1.7% that incorporate non-ambiguous conditions like mild late-onset congenital adrenal hyperplasia (CAH) or chromosomal variations without phenotypic incongruence. Such broad figures, often promoted in advocacy contexts, conflate treatable medical variances with normative sex development, but empirical data confirm that genuine genital ambiguity—where sex cannot be readily identified at birth—occurs in roughly 1 in 5,500 cases, underscoring DSDs as rare pathologies, not validations of gender fluidity.\n\nThe most prevalent DSD, CAH due to 21-hydroxylase deficiency, primarily impacts XX individuals with prenatal androgen excess leading to virilized genitalia, yet genetic sex remains female; treatments prioritize glucocorticoid replacement to manage cortisol deficiency and surgical correction of clitoromegaly or labial fusion to align anatomy with chromosomes, thereby enabling fertility, sexual function, and reduced long-term health risks like adrenal crisis. Hormone therapy alone often suffices for milder cases, but early genitoplasty in severe virilization improves urinary continence and psychosexual outcomes without compromising ovarian function, with fertility rates approaching 90% in optimized classic CAH cases. Interventions focus on biological normalization for physical health and functionality, distinct from identity-based approaches, as DSDs involve deterministic developmental errors amenable to causal correction rather than psychosocial affirmation.\n\nMedical protocols for DSDs originated in the 1950s at Johns Hopkins Hospital, where multidisciplinary teams, influenced by figures like John Money, standardized early surgical normalization to mitigate stigma and facilitate rearing congruent with underlying gonadal/chromosomal sex, emphasizing anatomical and functional repair over deferred decision-making. These approaches faced criticism amid isolated failures, such as mismanaged gender assignments, yet longitudinal data reveal low regret rates below 1% among treated cohorts, with high satisfaction tied to restored typical morphology, psychosexual adaptation, and avoidance of complications like infertility or gonad cancer risk in discordant gonads. Recent scrutiny from activist sources highlights potential over-intervention, but evidence from followed cases supports efficacy in reducing morbidity when guided by genetic etiology, not emergent self-identification, which lacks causal linkage to DSD pathophysiology.\n\nAdvancements in diagnostics mitigate invasive procedures; in 2024, researchers at the Hudson Institute developed a technique reprogramming patient skin fibroblasts into Sertoli cells—key testicular support cells—to model and diagnose DSDs like 46,XY gonadal dysgenesis without gonadal biopsies, enabling precise genetic assessment and tailored interventions while preserving tissue integrity. This innovation underscores a shift toward molecular precision, affirming DSD management as restorative medicine aligned with binary sex determination, where deviations are aberrations correctable for health optima rather than celebrated diversities.\n### Non-Binary and Third Gender Categories\n\nNon-binary identities encompass self-perceptions that reject strict male or female classification, while third gender categories often denote culturally or legally recognized positions outside the binary, typically without a basis in reproductive biology. Biologically, human sex remains dimorphic, defined by the production of either small, mobile gametes (sperm) or large, immobile gametes (ova), with no third gamete type observed in any sexually reproducing species, rendering third sex claims incompatible with anisogamy as the foundation of sexual dimorphism.  Evolutionary psychology frames gender roles as extensions via parental investment theory (Trivers 1972): females' ova costs promote selectivity/nurturing, males' sperm variance competition/risk-taking (\\u003e50% heritable per twin studies). Studies link cultural patterns like polygyny to these strategies, underscoring binary reproductive ties with environmental flexibility. \n\nIn South Asia, third gender recognition has historical roots in roles like India's hijras, a traditional category involving eunuch-like figures who undergo castration and adopt feminine presentations but do not produce gametes aligning with male or female reproductive functions. India's Supreme Court formalized this in a 2014 ruling on April 15, declaring transgender persons, including hijras, a \"third gender\" entitled to self-identification and affirmative actions, such as reservations in education and employment, to address longstanding social marginalization.  This recognition applies to official documents like passports, using codes such as \"O\" for other, but remains tied to specific cultural practices rather than a universal biological category.\n\nWestern legal adoptions of non-binary or third options contrast with such cultural specificity, often emphasizing self-identification over traditional roles. Germany's 2018 Civil Status Act introduced a \"diverse\" (div) marker on birth certificates for individuals with intersex variations or those opting out of binary classification, requiring a medical certificate initially but shifting toward self-declaration in later implementations; uptake has remained minimal, with fewer than 0.1% of births recorded as diverse by 2023, reflecting limited demand amid administrative hurdles like court approvals for changes.  Similar provisions in countries like Australia (X passport marker since 2011) and Canada show low utilization rates under 0.5% of the population seeking formal changes, often linked to transient identifications rather than fixed traits.\n\nEmpirical data on non-binary identifications indicate high fluidity, particularly among youth, challenging their stability as enduring categories. Longitudinal studies of transgender and non-binary youth report gender identity changes in up to 30% over short periods (e.g., 3 months to 1.5 years), with equal likelihood of shifting toward binary or non-binary labels, and overall fluidity rates exceeding 50% when including sexual orientation intersections by 2025 analyses.  Such patterns suggest many non-binary self-reports represent exploratory phases rather than immutable states, with desistance common post-adolescence, though policy frameworks rarely account for this variability.\n\nCritiques of third gender policies highlight increased administrative burdens, including document revisions, database overhauls, and verification processes, which strain public systems without commensurate gains in rights or equity. For instance, Germany's diverse option has prompted debates over categorization ambiguity in censuses and welfare allocation, imposing compliance costs on individuals and bureaucracies while yielding negligible population-level impacts given low adoption.  Policy evaluations note that these categories often fail to resolve underlying discrimination, as evidenced by persistent socioeconomic disparities among hijras in India despite 2014 reforms, underscoring their role as symbolic rather than causally effective measures.\n## Controversies and Scientific Debates\nAffirming policies like Belgium's 2017 self-ID law prioritize subjective declaration over gamete dimorphism, despite Cass Review (2024) evidentiary gaps in youth interventions and desistance rates (80-90%). This enables non-binary markers without biological alignment checks (\\u003e99% natal via chromosomes).\n### Biological Essentialism vs. Social Constructionism\n\nBiological essentialism asserts that observed differences between males and females in behavior, interests, and cognition are primarily driven by innate biological factors, including genetics and prenatal hormones, rather than socialization alone. In contrast, social constructionism posits that gender roles and differences are largely products of cultural norms and environmental influences, malleable through societal change. Empirical evidence from twin studies supports essentialism by estimating heritability of personality traits, including those showing sex differences like masculinity-femininity, at around 50% or higher, indicating substantial genetic contributions beyond shared environments.\n\nThe case of David Reimer, born male but raised as female after a botched circumcision in 1966, exemplifies the limits of constructionist interventions. Psychologist John Money's attempt to socially construct female gender identity failed; Reimer exhibited male-typical behaviors, rejected the imposed identity, and ultimately transitioned back to male before dying by suicide in 2004, underscoring biology's resistance to override via upbringing. Cross-cultural studies reveal universals in sex differences, such as men's greater emphasis on physical attractiveness in mates and women's on resources, observed consistently across 45 countries, alongside male mate competition patterns linked to evolutionary pressures.\n\nConstructionist predictions falter under scrutiny; for instance, the gender-equality paradox shows larger sex differences in vocational interests—men favoring realistic and investigative fields, women social ones—in more egalitarian nations, contradicting expectations of convergence through reduced stereotypes or barriers. Causal tests for constructionism remain scarce, with no robust evidence of reversing innate differences via policy or education, while essentialist accounts align with persistent gaps post-feminist reforms.\n\nIn academia as of 2025, essentialist research faces challenges from institutional biases favoring constructionist views, including reports of universities failing to shield gender-critical scholars from bullying and research restrictions for questioning gender fluidity. Cases like pressure on UK faculty to affirm ideological positions highlight self-censorship risks, potentially skewing discourse away from data-driven inquiry.\n\n### Efficacy and Risks of Gender-Affirming Interventions\n\nThe evidence supporting the efficacy of gender-affirming interventions, including puberty blockers, cross-sex hormones, and surgeries, has been characterized as low quality in multiple systematic reviews. The 2024 Cass Review, commissioned by the UK's National Health Service, analyzed over 100 studies and concluded that the evidence base for puberty suppression in youth is \"remarkably weak,\" with most research rated as low or very low quality due to methodological flaws such as small sample sizes, lack of controls, and short follow-up periods. Similarly, a 2025 U.S. Department of Health and Human Services (HHS) review of pediatric gender dysphoria treatments found the evidence for benefits \"very low across all intervention types,\" emphasizing insufficient demonstration of long-term improvements in mental health or dysphoria while highlighting risks like reduced bone density from puberty blockers and potential infertility from hormones. These reviews underscore that interventions often proceed despite uncertain causal links between treatments and reduced distress or suicide risk.\n\nFor youth, puberty blockers and hormones carry documented physical risks without robust proof of net benefits. The Cass Review noted potential harms including impacts on growth, bone health, and fertility, with no high-quality randomized trials available to confirm safety or efficacy; it recommended restricting blockers outside research settings. The HHS review echoed this, citing evidence of bone mineral density loss (up to 1-2 standard deviations below norms after 2-3 years of blockers) and irreversible fertility impairment from subsequent hormones, while cautioning against routine use due to elevated risks of adverse outcomes like cardiovascular issues and cancer in limited adult extrapolations. Mental health improvements, such as reduced suicidality, remain unproven in controlled studies, with pre-existing comorbidities often confounding results.\n\nIn adults, long-term follow-up studies indicate persistent elevated morbidity post-transition without suicide rate reductions. A 2011 Swedish cohort study of 324 individuals post-sex reassignment surgery found 19.1 times higher suicide rates and substantially increased psychiatric hospitalization risks compared to matched controls, persisting 10-30 years later, attributing this to unresolved underlying factors rather than treatment failure per se. Dutch protocol evaluations, foundational to many guidelines, reported in 2023 analyses no sustained mental health gains decades post-hormones and surgery, with ongoing gender dysphoria in subsets and unaddressed physical complications like osteoporosis. These findings challenge assumptions of interventions as curative, as elevated morbidity (e.g., 6-10 times higher for mood disorders) suggests treatments may not address root causes like trauma or autism comorbidities.\n\nDetransition rates, though variably reported, appear undercounted due to loss to follow-up, with recent estimates ranging from 5-10% driven by resolution of dysphoria or external pressures. A 2024 analysis of high-quality studies pegged true detransition at 5-10%, higher than clinic-reported 1%, as many do not return for documentation; visibility has risen, prompting a 2025 NIH directive under executive order to fund research on regret and detransition effects, including physical reversibility limits like voice deepening or skeletal changes. This follows patterns where 82.5% of detransitioners cite external factors like discrimination but also internal realizations of misaligned identity.\n\nUnderlying ideological premises, such as an innate cross-sex identity amenable to affirmation, lack empirical substantiation and may reflect social influences. Parent surveys in a 2018 study documented \"rapid-onset gender dysphoria\" clusters, where 60-80% of cases emerged in adolescence amid friend-group contagions, with multiple members transitioning simultaneously, often alongside social media exposure and prior mental health issues. This aligns with peer contagion models observed in other youth behaviors, suggesting environmental amplification over fixed biology, though contested by pro-affirming sources favoring individual autonomy narratives.\n\n### Impacts on Fairness in Sports, Prisons, and Women's Spaces\n\nIn sports competitions segregated by sex, policies permitting males who identify as women to compete in the female category have led to documented performance disparities. Studies indicate that even after hormone therapy, transgender women retain significant physical advantages over biological women, including 9-17% greater grip strength and muscle mass that exceeds female norms by up to 50% in some metrics, persisting beyond 12-36 months of treatment. A 2023 analysis found that transgender women maintained 20% greater strength and cardiorespiratory capacity compared to biological women, even 14 years post-transition. The case of swimmer Lia Thomas, who competed as a male for three years before transitioning and winning the 2022 NCAA women's 500-yard freestyle title, exemplifies this: Thomas' post-transition times ranked him 1st among women but would have placed him 462nd against men, thereby displacing female competitors and prompting backlash from athletes citing retained male physiological edges in height, reach, and power. By mid-2025, 27 U.S. states had enacted laws restricting transgender women from female sports categories to preserve competitive fairness, reflecting empirical concerns over unmitigated male advantages in strength-based events.\n\nIn prison systems, housing biologically male inmates who identify as women in female facilities has resulted in safety risks for female prisoners, driven by sex-based differences in violence patterns where males commit 80-90% of sexual assaults. The 2018 Karen White case in the UK highlighted this: a male rapist transferred to a women's prison assaulted four female inmates, including two rapes, despite prior convictions, underscoring failures in risk assessment that prioritize identity over offense history and physicality. Similar incidents include Isla Bryson, convicted in 2023 of raping two women pre-transition and initially housed in a Scottish female prison, sparking policy reversals; and reports of female inmates facing elevated sexual assault risks from transgender prisoners, with one 2021 UK lawsuit alleging assault by a male-bodied inmate in a women's facility. These cases reveal a mismatch: female prisoners, often vulnerable due to trauma histories, experience heightened predation without evidence that identity-based transfers reduce overall male violence rates, prompting 2023 UK guidance to segregate high-risk transgender inmates.\n\nAccess to sex-segregated women's spaces like shelters and changing rooms has faced disruptions from policies allowing male entry based on gender identity, leading to privacy invasions and assaults that erode female-only protections. In shelters, a 2023 Canadian incident involved a transgender woman crawling into a female resident's bed and sexually assaulting her, resulting in the perpetrator's arrest and highlighting vulnerabilities in trauma-recovery environments designed for female safety. U.S. cases include evictions of female residents objecting to shared quarters with males, as in a 2017 shelter where women were removed for raising assault concerns amid a pattern of male predators exploiting inclusive policies. In changing rooms, multiple school incidents—such as a 2023 Wisconsin case where a biologically male student exposed genitalia to four underage girls in a female locker room—have prompted lawsuits and parental complaints over non-consensual exposure, with no reciprocal safeguards for females. These events, logged in incident reports and tribunals (e.g., a 2025 UK nurse distressed by a transgender colleague's intrusive queries in a changing area), demonstrate how overriding sex-based boundaries compromises female autonomy without verifiable safety gains for transgender individuals, as male-pattern intrusions persist regardless of identity claims.\n### Empirical Critiques and Academic Freedom Issues\n\nEmpirical critiques of gender ideology emphasize the absence of robust evidence supporting the innateness or immutability of gender identity, with organizations like the Society for Evidence-Based Gender Medicine (SEGM) arguing that claims of biological fixedness lack longitudinal data and rely on low-quality studies prone to bias. SEGM's analyses from 2022 to 2025 highlight that persistence rates for youth gender dysphoria diagnoses drop significantly over time, as seen in a 2024 German study where only 36.4% retained the diagnosis after five years, challenging assumptions of inherent stability. These critiques extend to pediatric interventions, noting that high desistance rates—ranging from 61% to 98% in pre-pubertal children without medical transition—have been systematically downplayed in favor of affirmative models, despite evidence from watchful waiting approaches showing 75-95% resolution without harm.\n\nThe rapid-onset gender dysphoria (ROGD) phenomenon, identified in parent reports of sudden adolescent identifications linked to social influences, further underscores potential iatrogenic harms from uncritical affirmation, with SEGM citing social contagion patterns among peer groups and online communities as maladaptive coping mechanisms rather than innate traits. The 2024 Cass Review in the UK, while contested by some for methodological exclusions, prompted empirical-driven policy shifts, including NHS England's halt to routine puberty blockers for minors due to insufficient evidence of benefits outweighing risks like bone density loss and fertility impacts, rejecting ideologically driven misrepresentations that overstated affirmation's efficacy. Recent studies, such as a 2025 longitudinal analysis of over 7,700 couples, reveal parenthood often realigns views toward traditional roles, with new mothers adopting more conservative gender ideologies post-childbirth, particularly when partnered with higher-income men holding similar beliefs, suggesting experiential causality over abstract innateness claims.\n\nAcademic freedom in gender research faces intensifying suppression, exemplified by a July 2025 UK report documenting censorship, professional pressures, and threats against scholars questioning ideological premises on sex and gender, including demands to affirm non-empirical identity constructs in curricula. In universities like UCL, staff reported coercion to promote gender ideology under threat of disciplinary action, reflecting broader institutional biases where left-leaning dominance in academia stifles causal inquiries into biological sex realities. Philosophers, despite tools for dissecting identity claims, largely evade debates, as critiqued in an August 2025 City Journal analysis, where elite thinkers proffer unsubstantiated support for gender fluidity while shunning dissenters, prioritizing conformity over rigorous first-principles scrutiny. Classroom environments amplify these issues, with monitoring of faculty for \"gender-critical\" views leading to self-censorship, as physical intimidation and ideological vetting erode open discourse on desistance data or ROGD evidence.",
  "external_references": [
    {
      "text": "Bies.202200173",
      "url": "https://onlinelibrary.wiley.com/doi/full/10.1002/bies.202200173",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Gender",
      "url": "https://www.etymonline.com/word/gender",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Gender N",
      "url": "https://www.oed.com/dictionary/gender_n",
      "domain": "oed.com",
      "type": "citation"
    },
    {
      "text": "23702447",
      "url": "https://pubmed.ncbi.nlm.nih.gov/23702447/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Author Interview Sandra Eder How Clinic Made Gender",
      "url": "https://ls.berkeley.edu/news/author-interview-sandra-eder-how-clinic-made-gender",
      "domain": "ls.berkeley.edu",
      "type": "citation"
    },
    {
      "text": "What Do We Mean By Sex And Gender",
      "url": "https://medicine.yale.edu/news-article/what-do-we-mean-by-sex-and-gender/",
      "domain": "medicine.yale.edu",
      "type": "citation"
    },
    {
      "text": "12476264",
      "url": "https://pubmed.ncbi.nlm.nih.gov/12476264/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "In Humans Sex Is Binary And Immutable",
      "url": "https://www.nas.org/academic-questions/33/2/in-humans-sex-is-binary-and-immutable",
      "domain": "nas.org",
      "type": "citation"
    },
    {
      "text": "Eagly Wood 1999.pdf",
      "url": "https://labs.psych.ucsb.edu/roney/james/other%2520pdf%2520readings/Eagly_Wood_1999.pdf",
      "domain": "labs.psych.ucsb.edu",
      "type": "citation"
    },
    {
      "text": "Psychological Sex Differences 1995.pdf",
      "url": "https://labs.la.utexas.edu/buss/files/2015/09/Psychological_Sex_Differences_1995.pdf",
      "domain": "labs.la.utexas.edu",
      "type": "citation"
    },
    {
      "text": "Pnas.2401919121",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2401919121",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "612",
      "url": "https://adc.bmj.com/content/110/8/612",
      "domain": "adc.bmj.com",
      "type": "citation"
    },
    {
      "text": "Nbk532313",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK532313/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Sex Gender Distinction",
      "url": "https://fairerdisputations.org/sex-gender-distinction/",
      "domain": "fairerdisputations.org",
      "type": "citation"
    },
    {
      "text": "Understanding The Sex Binary",
      "url": "https://www.city-journal.org/article/understanding-the-sex-binary",
      "domain": "city-journal.org",
      "type": "citation"
    },
    {
      "text": "Pmc10480807",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10480807/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gender",
      "url": "https://www.merriam-webster.com/dictionary/gender",
      "domain": "merriam-webster.com",
      "type": "citation"
    },
    {
      "text": "Random Thoughts On Mr Gwynne Sex And.html",
      "url": "http://random-idea-english.blogspot.com/2014/01/random-thoughts-on-mr-gwynne-sex-and.html",
      "domain": "random-idea-english.blogspot.com",
      "type": "citation"
    },
    {
      "text": "9b01d6db34e9af8da685c36cb9f6297d",
      "url": "https://www.cambridge.org/core/books/reproduction/linnaeus-and-the-love-lives-of-plants/9B01D6DB34E9AF8DA685C36CB9F6297D",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "345535241 Linnaeus And The Love Lives Of Plants",
      "url": "https://www.researchgate.net/publication/345535241_Linnaeus_and_the_Love_Lives_of_Plants",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "7623489",
      "url": "https://academic.oup.com/jole/article/8/2/120/7623489",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "French Word Gender",
      "url": "https://storylearning.com/learn/french/french-tips/french-word-gender/",
      "domain": "storylearning.com",
      "type": "citation"
    },
    {
      "text": "Why Is Girl Neutral In German On Gender Rules In The Language",
      "url": "https://www.olesentuition.co.uk/single-post/why-is-girl-neutral-in-german-on-gender-rules-in-the-language",
      "domain": "olesentuition.co.uk",
      "type": "citation"
    },
    {
      "text": "Evolution Of Grammatical Genders Why French Has Two Genders German Has Three And English Does Not Care",
      "url": "https://www.babbel.com/en/magazine/evolution-of-grammatical-genders-why-french-has-two-genders-german-has-three-and-english-does-not-care",
      "domain": "babbel.com",
      "type": "citation"
    },
    {
      "text": "Pmc6644918",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6644918/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Danish",
      "url": "https://www.genderinlanguage.com/danish",
      "domain": "genderinlanguage.com",
      "type": "citation"
    },
    {
      "text": "Evolutionofgender.pdf",
      "url": "https://www.foundalis.com/res/EvolutionOfGender.pdf",
      "domain": "foundalis.com",
      "type": "citation"
    },
    {
      "text": "Beauvoir",
      "url": "https://plato.stanford.edu/entries/beauvoir/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "One Is Not Born But Becomes A Woman",
      "url": "https://www.torch.ox.ac.uk/article/one-is-not-born-but-becomes-a-woman",
      "domain": "torch.ox.ac.uk",
      "type": "citation"
    },
    {
      "text": "10.06%253a Gender Role",
      "url": "https://socialsci.libretexts.org/Bookshelves/Anthropology/Cultural_Anthropology/Cultural_Anthropology_%28Evans%29/10%253A_Sex_and_Gender/10.06%253A_Gender_Role",
      "domain": "socialsci.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Byrtoo 7.pdf",
      "url": "https://philpapers.org/archive/BYRTOO-7.pdf",
      "domain": "philpapers.org",
      "type": "citation"
    },
    {
      "text": "158712658",
      "url": "https://academic.oup.com/book/10672/chapter/158712658",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Sexgender.htm",
      "url": "https://www.umsl.edu/~gradyf/theory/sexgender.htm",
      "domain": "umsl.edu",
      "type": "citation"
    },
    {
      "text": "Evolutionary Psychology Gender Construction",
      "url": "https://whyevolutionistrue.com/2011/01/31/evolutionary-psychology-gender-construction/",
      "domain": "whyevolutionistrue.com",
      "type": "citation"
    },
    {
      "text": "David Reimer And John Money Gender Reassignment Controversy Johnjoan Case",
      "url": "https://embryo.asu.edu/pages/david-reimer-and-john-money-gender-reassignment-controversy-johnjoan-case",
      "domain": "embryo.asu.edu",
      "type": "citation"
    },
    {
      "text": "David Reimer.html",
      "url": "https://www.simplypsychology.org/david-reimer.html",
      "domain": "simplypsychology.org",
      "type": "citation"
    },
    {
      "text": "Nbk279001",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK279001/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Sry",
      "url": "https://medlineplus.gov/genetics/gene/sry/",
      "domain": "medlineplus.gov",
      "type": "citation"
    },
    {
      "text": "Sry The Master Switch In Mammalian Sex",
      "url": "https://journals.biologists.com/dev/article/137/23/3921/44191/Sry-the-master-switch-in-mammalian-sex",
      "domain": "journals.biologists.com",
      "type": "citation"
    },
    {
      "text": "Understanding The Sex Binary",
      "url": "https://www.realityslaststand.com/p/understanding-the-sex-binary",
      "domain": "realityslaststand.com",
      "type": "citation"
    },
    {
      "text": "Colin Wright Gives A History Of The Gametic Definition Of Biological Sex",
      "url": "https://whyevolutionistrue.com/2025/04/03/colin-wright-gives-a-history-of-the-gametic-definition-of-biological-sex/",
      "domain": "whyevolutionistrue.com",
      "type": "citation"
    },
    {
      "text": "Differencesdisorder Sex Development",
      "url": "https://pedpsych.org/fact_sheets/differencesdisorder-sex-development/",
      "domain": "pedpsych.org",
      "type": "citation"
    },
    {
      "text": "Nbk482314",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK482314/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "P2259.html",
      "url": "https://www.aafp.org/pubs/afp/issues/2005/1201/p2259.html",
      "domain": "aafp.org",
      "type": "citation"
    },
    {
      "text": "Nbk554621",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK554621/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Syc 20360782",
      "url": "https://www.mayoclinic.org/diseases-conditions/turner-syndrome/symptoms-causes/syc-20360782",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Pmc4350266",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4350266/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9202699",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9202699/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk448098",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK448098/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Syc 20355205",
      "url": "https://www.mayoclinic.org/diseases-conditions/congenital-adrenal-hyperplasia/symptoms-causes/syc-20355205",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Pnas.1812786116",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1812786116",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Biological Basis Sex Differences Athletic Performance",
      "url": "https://acsm.org/biological-basis-sex-differences-athletic-performance/",
      "domain": "acsm.org",
      "type": "citation"
    },
    {
      "text": "The Biological Basis Of Sex Differences In Athletic Performance.pdf",
      "url": "https://acsm.org/wp-content/uploads/2025/04/The-Biological-Basis-of-Sex-Differences-in-Athletic-Performance.pdf",
      "domain": "acsm.org",
      "type": "citation"
    },
    {
      "text": "S1521690x07000371",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S1521690X07000371",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Vo2max Charts By Age Gender Sport",
      "url": "https://inscyd.com/article/vo2max-charts-by-age-gender-sport/",
      "domain": "inscyd.com",
      "type": "citation"
    },
    {
      "text": "Pmc5198313",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5198313/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "180076",
      "url": "https://www.jci.org/articles/view/180076",
      "domain": "jci.org",
      "type": "citation"
    },
    {
      "text": "Pmc9923181",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9923181/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "5680335",
      "url": "https://academic.oup.com/burnstrauma/article/doi/10.1186/s41038-017-0093-9/5680335",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Pmc6949417",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6949417/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0149763421000804",
      "url": "https://www.sciencedirect.com/science/article/pii/S0149763421000804",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S13293 024 00657 5",
      "url": "https://bsd.biomedcentral.com/articles/10.1186/s13293-024-00657-5",
      "domain": "bsd.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc9618505",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9618505/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2024.06.20.599872v1.full.pdf",
      "url": "https://www.biorxiv.org/content/10.1101/2024.06.20.599872v1.full.pdf",
      "domain": "biorxiv.org",
      "type": "citation"
    },
    {
      "text": "Pmc7856278",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7856278/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S014976342400085x",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S014976342400085X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S42003 025 08070 3",
      "url": "https://www.nature.com/articles/s42003-025-08070-3",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "2025 05 Fetal Brain Wiring Life Sex.html",
      "url": "https://medicalxpress.com/news/2025-05-fetal-brain-wiring-life-sex.html",
      "domain": "medicalxpress.com",
      "type": "citation"
    },
    {
      "text": "Pmc6275492",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6275492/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.1811032115",
      "url": "https://www.pnas.org/doi/abs/10.1073/pnas.1811032115",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "250513112259.htm",
      "url": "https://www.sciencedaily.com/releases/2025/05/250513112259.htm",
      "domain": "sciencedaily.com",
      "type": "citation"
    },
    {
      "text": "Mens Brains Shrink Faster Than Womens What That Means For Alzheimers",
      "url": "https://www.scientificamerican.com/article/mens-brains-shrink-faster-than-womens-what-that-means-for-alzheimers/",
      "domain": "scientificamerican.com",
      "type": "citation"
    },
    {
      "text": "Male Brains Shrink Faster Than Female Brains Study Finds",
      "url": "https://www.sciencealert.com/male-brains-shrink-faster-than-female-brains-study-finds",
      "domain": "sciencealert.com",
      "type": "citation"
    },
    {
      "text": "Pmc4359619",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4359619/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "33885763",
      "url": "https://pubmed.ncbi.nlm.nih.gov/33885763/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2954190",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2954190/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2028",
      "url": "https://mjm.mcgill.ca/article/download/559/381/2028",
      "domain": "mjm.mcgill.ca",
      "type": "citation"
    },
    {
      "text": "S0166432822000158",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0166432822000158",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "7195590",
      "url": "https://pubmed.ncbi.nlm.nih.gov/7195590/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5030771",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5030771/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0168010214003289",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0168010214003289",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "C Jacchus Social Organization And Behavior",
      "url": "https://primate.wisc.edu/primate-info-net/callicam/c-jacchus-social-organization-and-behavior/",
      "domain": "primate.wisc.edu",
      "type": "citation"
    },
    {
      "text": "Transgender Proclivities In Animals",
      "url": "https://daily.jstor.org/transgender-proclivities-in-animals/",
      "domain": "daily.jstor.org",
      "type": "citation"
    },
    {
      "text": "S41467 023 41290 X",
      "url": "https://www.nature.com/articles/s41467-023-41290-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "14667177",
      "url": "https://pubmed.ncbi.nlm.nih.gov/14667177/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "24262030",
      "url": "https://pubmed.ncbi.nlm.nih.gov/24262030/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "11341636 Sex Typed Preferences In Three Domains Do Two Year Olds Need Cognitive Variables",
      "url": "https://www.researchgate.net/publication/11341636_Sex-typed_preferences_in_three_domains_Do_two-year-olds_need_cognitive_variables",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Icd.2064",
      "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/icd.2064",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc7031194",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7031194/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "J.1743 6109.2008.00870.x",
      "url": "https://onlinelibrary.wiley.com/doi/full/10.1111/j.1743-6109.2008.00870.x",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "15532739.2018.1468293",
      "url": "https://www.tandfonline.com/doi/full/10.1080/15532739.2018.1468293",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "11176720 The Heritability Of Gender Identity Disorder In A Child And Adolescent Twin Sample",
      "url": "https://www.researchgate.net/publication/11176720_The_Heritability_of_Gender_Identity_Disorder_in_a_Child_and_Adolescent_Twin_Sample",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "6689056 Genetic And Environmental Influences On Cross Gender Behavior And Relation To Behavior Problems A Study Of Dutch Twins At Ages 7 And 10 Years",
      "url": "https://www.researchgate.net/publication/6689056_Genetic_and_Environmental_Influences_on_Cross-Gender_Behavior_and_Relation_to_Behavior_Problems_A_Study_of_Dutch_Twins_at_Ages_7_and_10_Years",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Early Social Gender Transition Persistence",
      "url": "https://segm.org/early-social-gender-transition-persistence",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Gender Dysphoria Diagnosis",
      "url": "https://www.psychiatry.org/psychiatrists/diversity/education/transgender-and-gender-nonconforming-patients/gender-dysphoria-diagnosis",
      "domain": "psychiatry.org",
      "type": "citation"
    },
    {
      "text": "What Is Gender Dysphoria",
      "url": "https://www.psychiatry.org/patients-families/gender-dysphoria/what-is-gender-dysphoria",
      "domain": "psychiatry.org",
      "type": "citation"
    },
    {
      "text": "Pediat Transgender.t.dsm5 Criteria For G",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK577212/table/pediat_transgender.T.dsm5_criteria_for_g/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0165178125002392",
      "url": "https://www.sciencedirect.com/science/article/pii/S0165178125002392",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc10313553",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10313553/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7932037",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7932037/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Why Gender Dysphoria And Eating Disorders Are Often Connected",
      "url": "https://www.psychiatrist.com/news/why-gender-dysphoria-and-eating-disorders-are-often-connected/",
      "domain": "psychiatrist.com",
      "type": "citation"
    },
    {
      "text": "Nhs To Hold Review Into Gender Identity Services For Children And Young People",
      "url": "https://www.theguardian.com/society/2020/sep/22/nhs-to-hold-review-into-gender-identity-services-for-children-and-young-people",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Minister Orders Inquiry 4000 Per Cent Rise Children Wanting",
      "url": "https://www.telegraph.co.uk/politics/2018/09/16/minister-orders-inquiry-4000-per-cent-rise-children-wanting/",
      "domain": "telegraph.co.uk",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0202330",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Study Of 1655 Cases Lends Support To Rogd",
      "url": "https://segm.org/study-of-1655-cases-lends-support-to-ROGD",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "1359104510378303",
      "url": "https://journals.sagepub.com/doi/10.1177/1359104510378303",
      "domain": "journals.sagepub.com",
      "type": "citation"
    },
    {
      "text": "Pmc11588760",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11588760/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "The Social Contagion Of Gender Dysphoria",
      "url": "https://diannakenny.com.au/the-social-contagion-of-gender-dysphoria/",
      "domain": "diannakenny.com.au",
      "type": "citation"
    },
    {
      "text": "Transpop Suicide Press Release",
      "url": "https://williamsinstitute.law.ucla.edu/press/transpop-suicide-press-release/",
      "domain": "williamsinstitute.law.ucla.edu",
      "type": "citation"
    },
    {
      "text": "Pmc9746123",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9746123/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10027312",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10027312/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10000997",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10000997/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gender Dysphoria Diagnosis Desistance Germany",
      "url": "https://segm.org/gender-dysphoria-diagnosis-desistance-germany",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Largest Study To Date Confirms Overlap Between Autism And Gender Diversity",
      "url": "https://www.thetransmitter.org/spectrum/largest-study-to-date-confirms-overlap-between-autism-and-gender-diversity/",
      "domain": "thetransmitter.org",
      "type": "citation"
    },
    {
      "text": "Mental Health Of Youth With Autism Spectrum",
      "url": "https://publications.aap.org/pediatrics/article/152/6/e2023063289/194577/Mental-Health-of-Youth-With-Autism-Spectrum",
      "domain": "publications.aap.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0016885",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Pmc11063965",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11063965/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Suicide Gender Dysphoric Adolescent Young Adult Finland 2024",
      "url": "https://segm.org/Suicide-Gender-Dysphoric-Adolescent-Young-Adult-Finland-2024",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "288653750 Parental Investment And Sexual Selection",
      "url": "https://www.researchgate.net/publication/288653750_Parental_Investment_and_Sexual_Selection",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Trivers72 Parentalinvestment.pdf",
      "url": "https://joelvelasco.net/teaching/3330/trivers72-parentalinvestment.pdf",
      "domain": "joelvelasco.net",
      "type": "citation"
    },
    {
      "text": "3ff01cf8af3b165bf1f09b4a25246f2f",
      "url": "https://www.cambridge.org/core/books/cambridge-handbook-of-evolutionary-perspectives-on-sexual-psychology/parental-investment-theory/3FF01CF8AF3B165BF1F09B4A25246F2F",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Eagly Wood 1999 The Origins Of Human Sex Differences.pdf",
      "url": "https://dornsife.usc.edu/wendy-wood/wp-content/uploads/sites/183/2023/10/Eagly_Wood_1999_the_origins_of_human_sex_differences.pdf",
      "domain": "dornsife.usc.edu",
      "type": "citation"
    },
    {
      "text": "Pmc5486514",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5486514/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Sciadv.abd0310",
      "url": "https://www.science.org/doi/10.1126/sciadv.abd0310",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0287101",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Pmc4387654",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4387654/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "New Economics Of Fertility Doepke Hannusch Kindermann Tertilt",
      "url": "https://www.imf.org/en/Publications/fandd/issues/Series/Analytical-Series/new-economics-of-fertility-doepke-hannusch-kindermann-tertilt",
      "domain": "imf.org",
      "type": "citation"
    },
    {
      "text": "Stevenson.pdf",
      "url": "https://eml.berkeley.edu/~cle/laborlunch/stevenson.pdf",
      "domain": "eml.berkeley.edu",
      "type": "citation"
    },
    {
      "text": "Stevenson Paradoxdecliningfemalehappiness Dec08.pdf",
      "url": "https://law.yale.edu/sites/default/files/documents/pdf/Intellectual_Life/Stevenson_ParadoxDecliningFemaleHappiness_Dec08.pdf",
      "domain": "law.yale.edu",
      "type": "citation"
    },
    {
      "text": "Ea",
      "url": "https://d-place.org/contributions/EA",
      "domain": "d-place.org",
      "type": "citation"
    },
    {
      "text": "A Cross Cultural Analysis Of The Behavior Of Women And Men Implications For The Origins Of Sex Differences",
      "url": "https://www.academia.edu/1054635/A_cross_cultural_analysis_of_the_behavior_of_women_and_men_Implications_for_the_origins_of_sex_differences",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "2575100 Pre Coded Variables For The Standard Cross Cultural Sample",
      "url": "https://www.researchgate.net/publication/2575100_Pre-Coded_Variables_for_the_Standard_Cross-Cultural_Sample",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Qt7sj5c547 Nosplash 15bc109f7e1da9107baee37641232fba.pdf",
      "url": "https://escholarship.org/content/qt7sj5c547/qt7sj5c547_noSplash_15bc109f7e1da9107baee37641232fba.pdf",
      "domain": "escholarship.org",
      "type": "citation"
    },
    {
      "text": "Gender.pdf",
      "url": "https://hraf.yale.edu/ehc/assets/summaries/pdfs/gender.pdf",
      "domain": "hraf.yale.edu",
      "type": "citation"
    },
    {
      "text": "280",
      "url": "https://hraf.yale.edu/ehc/documents/280",
      "domain": "hraf.yale.edu",
      "type": "citation"
    },
    {
      "text": "Wood.eagly .2012.advances.pdf",
      "url": "https://dornsife.usc.edu/wendy-wood/wp-content/uploads/sites/183/2023/10/wood.eagly_.2012.Advances.pdf",
      "domain": "dornsife.usc.edu",
      "type": "citation"
    },
    {
      "text": "Article P22.xml",
      "url": "https://akjournals.com/view/journals/2055/19/1/article-p22.xml",
      "domain": "akjournals.com",
      "type": "citation"
    },
    {
      "text": "Pmc9703220",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9703220/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://ink.library.smu.edu.sg/cgi/viewcontent.cgi?article=4989\\u0026context=soss_research",
      "domain": "ink.library.smu.edu.sg",
      "type": "citation"
    },
    {
      "text": "271667286 Explaining Religious Differences In Immigrants%27 Gender Role Attitudes The Changing Impact Of Origin Country And Individual Religiosity",
      "url": "https://www.researchgate.net/publication/271667286_Explaining_religious_differences_in_immigrants%27_gender_role_attitudes_the_changing_impact_of_origin_country_and_individual_religiosity",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "01979183211008867",
      "url": "https://journals.sagepub.com/doi/10.1177/01979183211008867",
      "domain": "journals.sagepub.com",
      "type": "citation"
    },
    {
      "text": "Boroditsky Ea 2003.pdf",
      "url": "https://web.stanford.edu/class/linguist156/Boroditsky_ea_2003.pdf",
      "domain": "web.stanford.edu",
      "type": "citation"
    },
    {
      "text": "S13423 019 01652 3",
      "url": "https://link.springer.com/article/10.3758/s13423-019-01652-3",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Attitudes About Transgender Issues Vary Widely Among Christians Religious Nones In U S",
      "url": "https://www.pewresearch.org/short-reads/2022/07/07/attitudes-about-transgender-issues-vary-widely-among-christians-religious-nones-in-u-s/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Pmc6830999",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6830999/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "09589236.2012.681182",
      "url": "https://www.tandfonline.com/doi/full/10.1080/09589236.2012.681182",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Revue Autrepart 2018 1 Page 19",
      "url": "https://shs.cairn.info/revue-autrepart-2018-1-page-19?lang=en",
      "domain": "shs.cairn.info",
      "type": "citation"
    },
    {
      "text": "Pmc7423667",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7423667/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Stats Nobel Sexxcat.htm",
      "url": "https://stats.areppim.com/stats/stats_nobel_sexxcat.htm",
      "domain": "stats.areppim.com",
      "type": "citation"
    },
    {
      "text": "The Gender Gap In Reading",
      "url": "https://www.brookings.edu/articles/the-gender-gap-in-reading/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Indicatorexplorer",
      "url": "https://gpseducation.oecd.org/IndicatorExplorer?query=2\\u0026indicators=M000%2AR000%2AS000%2AM002%2AM003%2AM004%2AM006%2AM007%2AM008%2AM009%2AM010%2AM011%2AM012%2AR002%2AR003%2AR004%2AR006%2AR007%2AR008%2AR009%2AR010%2AR011%2AR012%2AS002%2AS003%2AS004%2AS006%2AS007%2AS008%2AS009%2AS010%2AS011%2AS012%2AM013%2AM014%2AM015%2AM016%2AM017%2AM018%2AM019%2AM020%2AM021%2AM022%2AM023%2AN001%2AN002%2AM024%2AM025%2AM026%2AM027%2AN003%2AN004%2AN005%2AM028%2AN006%2AN007%2AM029%2AM030%2AM031%2AM032%2AM033%2AM034%2AM035%2AM036%2AM037%2AM038%2AM039%2AN008%2AN009%2AN010%2AN011%2AN012%2AN013%2AN014%2AN015%2AN016%2AN017%2AN018%2AN019%2AM040%2AM041%2AM042%2AN020%2AN021%2AN022%2AN023%2AN024%2AN025%2AN026%2AN027%2AN028%2AN029%2AO000%2AO001%2AO002%2AO003%2AO004%2AO005%2AO006%2AO007%2AO008%2AO009%2AO010%2AO011%2AO012%2AO013%2AO014%2520",
      "domain": "gpseducation.oecd.org",
      "type": "citation"
    },
    {
      "text": "Amp Amp0000356.pdf",
      "url": "https://www.apa.org/pubs/journals/releases/amp-amp0000356.pdf",
      "domain": "apa.org",
      "type": "citation"
    },
    {
      "text": "7724690",
      "url": "https://pubmed.ncbi.nlm.nih.gov/7724690/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1995 20087 001",
      "url": "https://psycnet.apa.org/record/1995-20087-001",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Pmc2889158",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2889158/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "16670182",
      "url": "https://pubmed.ncbi.nlm.nih.gov/16670182/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "644525",
      "url": "https://academic.oup.com/psychsocgerontology/article/61/3/P137/644525",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Affirmative Action For Women In Stem Closing Gaps Or Creating N",
      "url": "https://blogs.worldbank.org/en/impactevaluations/affirmative-action-for-women-in-stem--closing-gaps-or-creating-n",
      "domain": "blogs.worldbank.org",
      "type": "citation"
    },
    {
      "text": "Is Affirmative Action The Answer To The Gender Gaps In Stem Majors",
      "url": "https://www.econthatmatters.com/2024/12/is-affirmative-action-the-answer-to-the-gender-gaps-in-stem-majors/",
      "domain": "econthatmatters.com",
      "type": "citation"
    },
    {
      "text": "S0272775715301321",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0272775715301321",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Groundbreaking Uc Irvine Research Reveals Significant Sex Differences Learning Based Brain",
      "url": "https://medschool.uci.edu/news/groundbreaking-uc-irvine-research-reveals-significant-sex-differences-learning-based-brain",
      "domain": "medschool.uci.edu",
      "type": "citation"
    },
    {
      "text": "The Latest Scientific Research On Sex Differences In Nutrition",
      "url": "https://www.physiology.org/detail/news/2025/10/24/the-latest-scientific-research-on-sex-differences-in-nutrition",
      "domain": "physiology.org",
      "type": "citation"
    },
    {
      "text": "Where Women Work Female Dominated Occupations And Sectors",
      "url": "https://ilostat.ilo.org/where-women-work-female-dominated-occupations-and-sectors/",
      "domain": "ilostat.ilo.org",
      "type": "citation"
    },
    {
      "text": "Cpsaat11.htm",
      "url": "https://www.bls.gov/cps/cpsaat11.htm",
      "domain": "bls.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4383179",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4383179/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3166361",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3166361/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Womens Earnings Were 83 6 Percent Of Mens In 2023.htm",
      "url": "https://www.bls.gov/opub/ted/2024/womens-earnings-were-83-6-percent-of-mens-in-2023.htm",
      "domain": "bls.gov",
      "type": "citation"
    },
    {
      "text": "Harvard Study Gender Pay Gap Explained Entirely By Work Choices Of Men And Women",
      "url": "https://fee.org/articles/harvard-study-gender-pay-gap-explained-entirely-by-work-choices-of-men-and-women/",
      "domain": "fee.org",
      "type": "citation"
    },
    {
      "text": "Details In Bls Report Suggest That The Gender Earnings Gap Can Be Explained By Age Marital Status Children Hours Worked Etc",
      "url": "https://www.aei.org/carpe-diem/details-in-bls-report-suggest-that-the-gender-earnings-gap-can-be-explained-by-age-marital-status-children-hours-worked-etc/",
      "domain": "aei.org",
      "type": "citation"
    },
    {
      "text": "The Gender Segregated Labour Market A Nordic Paradox",
      "url": "https://nikk.no/en/the-gender-segregated-labour-market-a-nordic-paradox/",
      "domain": "nikk.no",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://creativematter.skidmore.edu/cgi/viewcontent.cgi?article=1124\\u0026context=econ_studt_schol",
      "domain": "creativematter.skidmore.edu",
      "type": "citation"
    },
    {
      "text": "Gender Gap By Sector 2023",
      "url": "https://carta.com/data/gender-gap-by-sector-2023/",
      "domain": "carta.com",
      "type": "citation"
    },
    {
      "text": "Gender And Race Gaps Path Startup Success",
      "url": "https://www.nber.org/be/20231/gender-and-race-gaps-path-startup-success",
      "domain": "nber.org",
      "type": "citation"
    },
    {
      "text": "Age Affects Male And Female Fertility",
      "url": "https://pathfertility.com/age-affects-male-and-female-fertility/",
      "domain": "pathfertility.com",
      "type": "citation"
    },
    {
      "text": "Pmc5712257",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5712257/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Down Syndrome.html",
      "url": "https://www.cdc.gov/birth-defects/about/down-syndrome.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Trisomy21.html",
      "url": "https://www-doh.nj.gov/doh-shad/indicator/view/Trisomy21.html",
      "domain": "www-doh.nj.gov",
      "type": "citation"
    },
    {
      "text": "Women More Likely Men Initiate Divorces Not Non Marital Breakups",
      "url": "https://www.asanet.org/women-more-likely-men-initiate-divorces-not-non-marital-breakups/",
      "domain": "asanet.org",
      "type": "citation"
    },
    {
      "text": "The Real Root Causes Violent Crime The Breakdown Marriage Family And",
      "url": "https://www.heritage.org/crime-and-justice/report/the-real-root-causes-violent-crime-the-breakdown-marriage-family-and",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "Single Parent Families Cause Juvenile Crime Juvenile Crime Opposing",
      "url": "https://www.ojp.gov/ncjrs/virtual-library/abstracts/single-parent-families-cause-juvenile-crime-juvenile-crime-opposing",
      "domain": "ojp.gov",
      "type": "citation"
    },
    {
      "text": "Evolution Of Paternal Investment.pdf",
      "url": "https://www.researchgate.net/profile/David-Geary/publication/319341121_Evolution_of_Paternal_Investment/links/617c36e0eef53e51e102cd37/Evolution-of-Paternal-Investment.pdf",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/ecology-and-evolution/articles/10.3389/fevo.2018.00142/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "1068316x.2020.1774589",
      "url": "https://www.tandfonline.com/doi/full/10.1080/1068316X.2020.1774589",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Pmc5226056",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5226056/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Defending Women From Gender Ideology Extremism And Restoring Biological Truth To The Federal Government",
      "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/",
      "domain": "whitehouse.gov",
      "type": "citation"
    },
    {
      "text": "Ben Asher Finalforprint.pdf",
      "url": "http://northcarolinalawreview.org/wp-content/uploads/sites/5/2024/02/Ben-Asher_FinalforPrint.pdf",
      "domain": "northcarolinalawreview.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.unc.edu/cgi/viewcontent.cgi?article=6957\\u0026context=nclr",
      "domain": "scholarship.law.unc.edu",
      "type": "citation"
    },
    {
      "text": "20250912154628466 Hecox%2520merits%2520opening%2520brief.pdf",
      "url": "https://www.supremecourt.gov/DocketPDF/24/24-38/374543/20250912154628466_Hecox%2520Merits%2520Opening%2520Brief.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Lsb11175",
      "url": "https://www.congress.gov/crs-product/LSB11175",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Hld0159f00f1093374f019ff93cdea1b94890",
      "url": "https://www.vitallaw.com/news/health-care-reform-s-d-miss-hhs-final-rule-prohibiting-gender-identity-discrimination-overstepped-title-ix-statutory-authority/hld0159f00f1093374f019ff93cdea1b94890",
      "domain": "vitallaw.com",
      "type": "citation"
    },
    {
      "text": "9",
      "url": "https://www.legislation.gov.uk/ukpga/2004/7/section/9",
      "domain": "legislation.gov.uk",
      "type": "citation"
    },
    {
      "text": "Cvgq9ejql39t",
      "url": "https://www.bbc.com/news/live/cvgq9ejql39t",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Critics Of Trans Rights Win Uk Supreme Court Case Over Definition Of Woman",
      "url": "https://www.theguardian.com/society/2025/apr/16/critics-of-trans-rights-win-uk-supreme-court-case-over-definition-of-woman",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Title Ix Shake Up Understanding The New Executive Orders And Guidance",
      "url": "https://civilrightsclassroom.com/title-ix-shake-up-understanding-the-new-executive-orders-and-guidance/",
      "domain": "civilrightsclassroom.com",
      "type": "citation"
    },
    {
      "text": "Breaking Federal Court Rejects Biden",
      "url": "https://www.realityslaststand.com/p/breaking-federal-court-rejects-biden",
      "domain": "realityslaststand.com",
      "type": "citation"
    },
    {
      "text": "20250919151159668 2025.09.19%2520%2520amicus%2520brief%252024 43.pdf",
      "url": "https://www.supremecourt.gov/DocketPDF/24/24-43/375281/20250919151159668_2025.09.19%2520%2520Amicus%2520Brief%252024-43.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Gender Recognition Reform In An International Context",
      "url": "https://murrayblackburnmackenzie.org/2022/06/20/gender-recognition-reform-in-an-international-context/",
      "domain": "murrayblackburnmackenzie.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court Will Weigh In On Transgender Athletes As New Term Begins",
      "url": "https://edsource.org/updates/supreme-court-will-weigh-in-on-transgender-athletes-as-new-term-begins",
      "domain": "edsource.org",
      "type": "citation"
    },
    {
      "text": "Keeping Men Out Of Womens Sports",
      "url": "https://www.whitehouse.gov/presidential-actions/2025/02/keeping-men-out-of-womens-sports/",
      "domain": "whitehouse.gov",
      "type": "citation"
    },
    {
      "text": "20250915140905330 24 38%2520brief.pdf",
      "url": "https://www.supremecourt.gov/DocketPDF/24/24-38/374654/20250915140905330_24-38%2520Brief.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Final Report",
      "url": "https://cass.independent-review.uk/final-report/",
      "domain": "cass.independent-review.uk",
      "type": "citation"
    },
    {
      "text": "17 1618 Hfci.pdf",
      "url": "https://www.supremecourt.gov/opinions/19pdf/17-1618_hfci.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "17 1618",
      "url": "https://www.oyez.org/cases/2019/17-1618",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Best Ways To Handle Coworker Concerns About Transgender Employee",
      "url": "https://hrwatchdog.calchamber.com/2025/09/best-ways-to-handle-coworker-concerns-about-transgender-employee/",
      "domain": "hrwatchdog.calchamber.com",
      "type": "citation"
    },
    {
      "text": "Know Your Rights Employment",
      "url": "https://transequality.org/resources/know-your-rights-employment",
      "domain": "transequality.org",
      "type": "citation"
    },
    {
      "text": "Detransition Facts",
      "url": "https://www.gendergp.com/detransition-facts/",
      "domain": "gendergp.com",
      "type": "citation"
    },
    {
      "text": "How Common Is Detransitioning",
      "url": "https://benryan.substack.com/p/how-common-is-detransitioning",
      "domain": "benryan.substack.com",
      "type": "citation"
    },
    {
      "text": "Regret Detransition Rate Unknown",
      "url": "https://segm.org/regret-detransition-rate-unknown",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Pmc10322769",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10322769/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gender Detransition Lawsuits",
      "url": "https://purposedrivenlawyers.com/gender-detransition-lawsuits/",
      "domain": "purposedrivenlawyers.com",
      "type": "citation"
    },
    {
      "text": "Pmc12456709",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12456709/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Lawsuit Revived After Statute Of Limitations For Detransitioners Extended",
      "url": "https://www.carolinajournal.com/lawsuit-revived-after-statute-of-limitations-for-detransitioners-extended/",
      "domain": "carolinajournal.com",
      "type": "citation"
    },
    {
      "text": "Swedish 2022 Trans Guidelines Youth Experimental",
      "url": "https://segm.org/Swedish-2022-trans-guidelines-youth-experimental",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Segm Summary Sweden Prioritizes Therapy Curbs Hormones For Gender Dysphoric Youth",
      "url": "https://segm.org/segm-summary-sweden-prioritizes-therapy-curbs-hormones-for-gender-dysphoric-youth",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Gender Medicine Developments 2022 Summary",
      "url": "https://segm.org/gender-medicine-developments-2022-summary",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "17405629.2025.2533168",
      "url": "https://www.tandfonline.com/doi/full/10.1080/17405629.2025.2533168",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "How Common Is Intersex A Response To Anne Fausto Sterling",
      "url": "https://www.leonardsax.com/how-common-is-intersex-a-response-to-anne-fausto-sterling/",
      "domain": "leonardsax.com",
      "type": "citation"
    },
    {
      "text": "919218 Overview",
      "url": "https://emedicine.medscape.com/article/919218-overview",
      "domain": "emedicine.medscape.com",
      "type": "citation"
    },
    {
      "text": "Fertility Considerations With Classic Congenital Adrenal Hyperplasia Cah",
      "url": "https://mcpress.mayoclinic.org/cah/fertility-considerations-with-classic-congenital-adrenal-hyperplasia-cah/",
      "domain": "mcpress.mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Pmc5836525",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5836525/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7597036",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7597036/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Breakthrough In Diagnosing Sex Development Disorders",
      "url": "https://hudson.org.au/news/breakthrough-in-diagnosing-sex-development-disorders/",
      "domain": "hudson.org.au",
      "type": "citation"
    },
    {
      "text": "S10508 025 03216 0",
      "url": "https://link.springer.com/article/10.1007/s10508-025-03216-0",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Ng.3285",
      "url": "https://www.nature.com/articles/ng.3285",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "In India Landmark Ruling Recognizes Transgender Citizens",
      "url": "https://www.npr.org/sections/thetwo-way/2014/04/15/303408581/in-india-landmark-ruling-recognizes-transgender-citizens",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "World Asia India 27031180",
      "url": "https://www.bbc.com/news/world-asia-india-27031180",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "11300",
      "url": "https://www.equaldex.com/log/11300",
      "domain": "equaldex.com",
      "type": "citation"
    },
    {
      "text": "331619964 Beyond The Binary Towards A Third Sex Category In Germany",
      "url": "https://www.researchgate.net/publication/331619964_Beyond_the_Binary_Towards_a_Third_Sex_Category_in_Germany",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "09589236.2023.2258077",
      "url": "https://www.tandfonline.com/doi/full/10.1080/09589236.2023.2258077",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "X Marker Trans Nonbinary Travelers",
      "url": "https://www.migrationpolicy.org/article/x-marker-trans-nonbinary-travelers",
      "domain": "migrationpolicy.org",
      "type": "citation"
    },
    {
      "text": "00224499.2023.2244926",
      "url": "https://www.tandfonline.com/doi/abs/10.1080/00224499.2023.2244926",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Mono.12479",
      "url": "https://srcd.onlinelibrary.wiley.com/doi/10.1111/mono.12479",
      "domain": "srcd.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc12260785",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12260785/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "335787731 A Third Option Understanding And Assessing Non Binary Gender Policies In The United States",
      "url": "https://www.researchgate.net/publication/335787731_A_Third_Option_Understanding_and_Assessing_Non-binary_Gender_Policies_in_the_United_States",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Third Gender And Hijras",
      "url": "https://rpl.hds.harvard.edu/religion-context/case-studies/gender/third-gender-and-hijras",
      "domain": "rpl.hds.harvard.edu",
      "type": "citation"
    },
    {
      "text": "New Legislation For Transgender Persons",
      "url": "https://justice.belgium.be/en/themes_and_files/people_and_families/new_legislation_for_transgender_persons",
      "domain": "justice.belgium.be",
      "type": "citation"
    },
    {
      "text": "cass.independent-review.uk",
      "url": "https://cass.independent-review.uk/",
      "domain": "cass.independent-review.uk",
      "type": "citation"
    },
    {
      "text": "Rainbow Map 2025",
      "url": "https://www.ilga-europe.org/report/rainbow-map-2025/",
      "domain": "ilga-europe.org",
      "type": "citation"
    },
    {
      "text": "Pmc2593100",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2593100/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "C5c72dbfd24fa1e7d9b460b9047f43fc",
      "url": "https://www.cambridge.org/core/journals/twin-research-and-human-genetics/article/individual-differences-in-personality-masculinityfemininity-examining-the-effects-of-genes-environment-and-prenatal-hormone-transfer/C5C72DBFD24FA1E7D9B460B9047F43FC",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "A Boy Raised As A Girl Killed Himself 19 Years Ago Today",
      "url": "https://www.psychologytoday.com/us/blog/governing-behavior/202305/a-boy-raised-as-a-girl-killed-himself-19-years-ago-today",
      "domain": "psychologytoday.com",
      "type": "citation"
    },
    {
      "text": "32196435",
      "url": "https://pubmed.ncbi.nlm.nih.gov/32196435/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Sex Differences In Mate Preferences Across 45 Nations 2020.pdf",
      "url": "https://labs.la.utexas.edu/buss/files/2020/03/Sex-Differences-in-Mate-Preferences-Across-45-Nations-2020.pdf",
      "domain": "labs.la.utexas.edu",
      "type": "citation"
    },
    {
      "text": "19485506241280321",
      "url": "https://journals.sagepub.com/doi/abs/10.1177/19485506241280321",
      "domain": "journals.sagepub.com",
      "type": "citation"
    },
    {
      "text": "Pnas.2008704117",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2008704117",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Uk Universities Have Failed To Protect Gender Critical Academics Report Finds",
      "url": "https://www.theguardian.com/education/2025/jul/02/uk-universities-have-failed-to-protect-gender-critical-academics-report-finds",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Ucl Staff Under Pressure To Promote Gender Ideology",
      "url": "https://afcomm.org.uk/2025/10/06/ucl-staff-under-pressure-to-promote-gender-ideology/",
      "domain": "afcomm.org.uk",
      "type": "citation"
    },
    {
      "text": "Worst Practices For Academic Freedom",
      "url": "https://thecritic.co.uk/worst-practices-for-academic-freedom/",
      "domain": "thecritic.co.uk",
      "type": "citation"
    },
    {
      "text": "Final Report",
      "url": "https://cass.independent-review.uk/home/publications/final-report/",
      "domain": "cass.independent-review.uk",
      "type": "citation"
    },
    {
      "text": "Gender Dysphoria Report Release.html",
      "url": "https://www.hhs.gov/press-room/gender-dysphoria-report-release.html",
      "domain": "hhs.gov",
      "type": "citation"
    },
    {
      "text": "Gender Dysphoria Report.pdf",
      "url": "https://opa.hhs.gov/sites/default/files/2025-05/gender-dysphoria-report.pdf",
      "domain": "opa.hhs.gov",
      "type": "citation"
    },
    {
      "text": "2011 04014 001",
      "url": "https://psycnet.apa.org/record/2011-04014-001",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Dutch Studies Critically Flawed",
      "url": "https://segm.org/Dutch-studies-critically-flawed",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Kinnon Mackinnon Detransition Research.html",
      "url": "https://www.nytimes.com/2024/10/26/health/kinnon-mackinnon-detransition-research.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Trump Nih Trans Regret Detransition Research",
      "url": "https://www.npr.org/sections/shots-health-news/2025/04/10/nx-s1-5355126/trump-nih-trans-regret-detransition-research",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Pmc8311086",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8311086/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S40279 020 01389 3",
      "url": "https://link.springer.com/article/10.1007/s40279-020-01389-3",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "New Study Scientists Find Transgender Women Retain Physical Benefits Long After Transitioning",
      "url": "https://www.swimmingworldmagazine.com/news/new-study-scientists-find-transgender-women-retain-physical-benefits-long-after-transitioning/",
      "domain": "swimmingworldmagazine.com",
      "type": "citation"
    },
    {
      "text": "A Look At The Numbers And Times No Denying The Advantages Of Lia Thomas",
      "url": "https://www.swimmingworldmagazine.com/news/a-look-at-the-numbers-and-times-no-denying-the-advantages-of-lia-thomas/",
      "domain": "swimmingworldmagazine.com",
      "type": "citation"
    },
    {
      "text": "Supreme Transgender Sports Cases",
      "url": "https://www.npr.org/2025/07/03/nx-s1-5455793/supreme-transgender-sports-cases",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Pdf",
      "url": "https://committees.parliament.uk/writtenevidence/18973/pdf/",
      "domain": "committees.parliament.uk",
      "type": "citation"
    },
    {
      "text": "Sexual Assaults In Womens Prison Reignite Debate Over Transgender Inmates Karen White",
      "url": "https://www.theguardian.com/uk-news/2018/sep/09/sexual-assaults-in-womens-prison-reignite-debate-over-transgender-inmates-karen-white",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Trans Woman Isla Bryson Guilty Raping Two Women Remanded In Female Prison Scotland",
      "url": "https://www.theguardian.com/uk-news/2023/jan/25/trans-woman-isla-bryson-guilty-raping-two-women-remanded-in-female-prison-scotland",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Female Prisoners Greater Risk Sexual Assault Transgender Inmates",
      "url": "https://www.telegraph.co.uk/news/2021/03/02/female-prisoners-greater-risk-sexual-assault-transgender-inmates/",
      "domain": "telegraph.co.uk",
      "type": "citation"
    },
    {
      "text": "Uk Scotland 67613441",
      "url": "https://www.bbc.com/news/uk-scotland-67613441",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Trans Woman Crawled Bed Assaulted Female Resident Womens Shelter Police",
      "url": "https://www.foxnews.com/world/trans-woman-crawled-bed-assaulted-female-resident-womens-shelter-police",
      "domain": "foxnews.com",
      "type": "citation"
    },
    {
      "text": "Whats Current Two Women Kicked Shelter Voicing Concerns Sharing Room Trans Identified Male",
      "url": "https://www.feministcurrent.com/2017/03/10/whats-current-two-women-kicked-shelter-voicing-concerns-sharing-room-trans-identified-male/",
      "domain": "feministcurrent.com",
      "type": "citation"
    },
    {
      "text": "After Trans Woman Exposed Genitalia To Freshman Girls In Locker Room Shower School District Faces Legal Scrutiny",
      "url": "https://wlos.com/news/nation-world/after-trans-woman-exposed-genitalia-to-freshman-girls-in-locker-room-shower-school-district-faces-legal-scrutiny",
      "domain": "wlos.com",
      "type": "citation"
    },
    {
      "text": "25563849.nurse Broke Tears Changing Room Encounter Trans Colleague",
      "url": "https://www.edp24.co.uk/news/national/25563849.nurse-broke-tears-changing-room-encounter-trans-colleague/",
      "domain": "edp24.co.uk",
      "type": "citation"
    },
    {
      "text": "segm.org",
      "url": "https://segm.org/",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "German Guidelines Gender Dysphoria Youth 2025",
      "url": "https://segm.org/German-guidelines-gender-dysphoria-youth-2025",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "False Assumptions Gender Affirmation Minors",
      "url": "https://segm.org/false-assumptions-gender-affirmation-minors",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Bjp.12944",
      "url": "https://onlinelibrary.wiley.com/doi/10.1111/bjp.12944",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Final Cass Report 2024 Nhs Response Summary",
      "url": "https://segm.org/Final-Cass-Report-2024-NHS-Response-Summary",
      "domain": "segm.org",
      "type": "citation"
    },
    {
      "text": "Pmc12013558",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12013558/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Parenthood Linked To Shifts In Gender Ideology Study Finds",
      "url": "https://www.psypost.org/parenthood-linked-to-shifts-in-gender-ideology-study-finds/",
      "domain": "psypost.org",
      "type": "citation"
    },
    {
      "text": "New Report Highlights Threats To Academic Freedom In The Study Of Sex And Gender",
      "url": "https://afcomm.org.uk/2025/07/22/new-report-highlights-threats-to-academic-freedom-in-the-study-of-sex-and-gender/",
      "domain": "afcomm.org.uk",
      "type": "citation"
    },
    {
      "text": "Gender Identity Debate Philosophers United States V Skrmetti",
      "url": "https://www.city-journal.org/article/gender-identity-debate-philosophers-united-states-v-skrmetti",
      "domain": "city-journal.org",
      "type": "citation"
    },
    {
      "text": "The Gender Wars And Academic Freedom.html",
      "url": "https://www.bristol.ac.uk/sps/events/2025/the-gender-wars-and-academic-freedom.html",
      "domain": "bristol.ac.uk",
      "type": "citation"
    },
    {
      "text": "The Gender Wars And Academic Freedom",
      "url": "https://philosophersmag.com/the-gender-wars-and-academic-freedom/",
      "domain": "philosophersmag.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "biological sex",
      "page": "Biological_sex"
    }
  ],
  "fetched_at": "2025-12-07T07:28:56.548458",
  "elapsed_ms": 889485
}