{
  "topic": "Great Wall of China",
  "title": "Great Wall of China",
  "slug": "great-wall-of-china",
  "grokipedia_slug": "Great_Wall_of_China",
  "grokipedia_url": "https://grokipedia.com/page/Great_Wall_of_China",
  "source": "grokipedia",
  "content": "# Great Wall of China\n\nThe Great Wall of China is an extensive network of walls, trenches, towers, barracks, and other fortifications designed as a defensive barrier along China's historical northern borders, recognized as the longest man-made structure in the world at approximately 21,196 kilometers (13,171 miles) in total length, including all branches and natural barriers. Constructed over more than two millennia primarily to protect Chinese states and empires from invasions by nomadic tribes such as the Xiongnu and Mongols, it represents a profound engineering achievement that unified disparate regional defenses into a cohesive system. The wall's core development began in the 3rd century BC under the Qin dynasty, when Emperor Qin Shi Huang connected earlier fortifications, but its most iconic and well-preserved sections date to the Ming dynasty (1368–1644), which rebuilt much of it using stone and brick for enhanced durability.\n\nThe origins of the Great Wall trace back to as early as the late Western Zhou dynasty (1046–771 BC), with a 2025 archaeological discovery uncovering the oldest known sections in Shandong Province. Subsequent developments occurred during the Spring and Autumn period (770–476 BC), when rival states like Qi, Yan, and Zhao independently erected earthen walls to defend against each other and northern raiders. Following the unification of China in 221 BC, the Qin dynasty mobilized hundreds of thousands of soldiers, conscripted laborers, and convicts to link these walls into a single barrier spanning over 5,000 kilometers, though much of the early structure used rammed earth and wood that eroded over time. Subsequent dynasties, including the Han (206 BC–220 AD), Northern Wei (386–534), Sui (581–618), and Jin (1115–1234), extended and repaired sections to secure trade routes like the Silk Road and counter persistent threats, but the Ming era marked the peak of construction with an estimated 25,000 watchtowers and passes integrated into the design.\n\nBeyond its military role, the Great Wall facilitated border control, signaling, and cultural demarcation, symbolizing China's resilience and imperial ambition while influencing military architecture across Eurasia. Inscribed as a UNESCO World Heritage Site in 1987 for its outstanding universal value in criteria (i), (ii), (iii), (iv), and (vi), it exemplifies exceptional human creative genius, historical testimony to exchanges between nomadic and sedentary civilizations, and enduring cultural significance. Today, only about 8,850 kilometers of the wall remain, with roughly 30% in ruins due to natural decay and human activity, prompting ongoing preservation efforts by China's National Cultural Heritage Administration to protect this iconic testament to ancient engineering.\n\n## Overview\n\n### Description and Significance\n\nThe Great Wall of China comprises a vast network of fortifications, including walls, trenches, and natural barriers such as rivers and mountains, constructed across northern China primarily to defend against invasions by nomadic tribes from the steppes. These defenses were built by successive dynasties to safeguard agricultural heartlands, control borders, and preserve Chinese cultural integrity from external influences.\n\nThe entire system, encompassing remnants from multiple eras, measures 21,196.18 kilometers (13,170.7 miles) in total length, spanning 15 provinces and incorporating over 43,000 heritage sites. Recognized for its outstanding universal value as a testament to ancient engineering and military strategy, it was inscribed on the UNESCO World Heritage List in 1987.\n\nBeyond its defensive role, the Great Wall embodies Chinese ingenuity in architecture and labor organization, as well as the endurance required to maintain it over centuries, evolving into a profound symbol of national identity and resilience. Initial construction of separate wall segments began in the 7th century BCE during the Spring and Autumn Period, with major unifications and expansions continuing through the Qin Dynasty and up to the Ming Dynasty in the 17th century CE.\n\n### Names and Etymology\n\nThe fortifications now collectively known as the Great Wall of China were originally referred to by regional designations during the Warring States period (475–221 BCE), when individual states constructed defensive walls against nomadic incursions. For instance, the state of Zhao built both northern and southern walls, simply termed \"long walls\" (cháng chéng, 長城) to denote their extended linear form as barriers rather than enclosed structures. Similarly, the state of Yan erected a \"long wall\" extending over 1,000 li (approximately 500 km) from Zaoyang to Xiangping, emphasizing its role as a prolonged frontier defense. These early terms highlighted the walls' primary characteristic of length, distinguishing them from typical city walls (chéng, 城) that encircled settlements.\n\nFollowing the unification under the Qin dynasty in 221 BCE, the emperor ordered the connection of existing state walls into a more cohesive system, marking a shift toward a singular conceptual entity. The historian Sima Qian (c. 145–86 BCE) first documented this extended barrier in his *Records of the Grand Historian* (Shǐjì, 史記), describing it as a vast structure built by General Meng Tian that spanned immeasurable distances, though he did not explicitly use the full phrase. The descriptive term Wànlǐ Chángchéng (萬里長城, \"Ten-Thousand-Li Long Wall\")—where wànlǐ implies an immense, almost mythical scale equivalent to about 5,000 km—emerged from Sima Qian's accounts, symbolizing the wall's extraordinary extent as a hyperbolic expression of imperial ambition rather than a precise measurement. This name evolved into the standard Chinese reference by the Han dynasty (206 BCE–220 CE), unifying disparate regional walls under a national emblem of defense.\n\nIn European languages, the concept of a singular \"Chinese wall\" appeared in travelogues during the early modern period, drawing from Jesuit missionaries and traders who encountered Ming dynasty fortifications in the 16th and 17th centuries. The English phrase \"Great Wall of China\" first gained currency in Samuel Purchas's 1625 compilation *Hakluytus Posthumus, or Purchas His Pilgrimes*, which incorporated accounts of the wall's imposing scale from European observers, adapting the Chinese chángchéng to emphasize its grandeur and uniqueness. By the 19th century, this terminology had standardized in Western scholarship and literature, reflecting a romanticized view of the structure as an unparalleled engineering feat. Today, the official Chinese name remains Chángchéng (长城, \"Long Wall\"), a concise evolution from its ancient roots that underscores continuity in linguistic tradition.\n\n## History\n\n### Pre-Ming Walls\n\nThe earliest fortifications that would contribute to the later Great Wall originated in the 7th century BCE during China's Spring and Autumn Period, when various warring states constructed defensive walls primarily to protect against nomadic incursions from the north and to secure their territories against rival Chinese states. States such as Qi in the east built extensive walls around 650 BCE, stretching over several hundred kilometers to guard against tribes like the Donghu, while Yan and Zhao in the north erected barriers in the mid-7th to 5th centuries BCE using rammed earth to counter threats from nomadic groups including the Xiongnu and Lin Hu. These early structures were fragmented and regionally focused, often serving dual purposes of defense and territorial expansion, with materials like compacted soil and stone adapted to local terrain.\n\nThe Qin Dynasty marked the first major unification of these disparate walls under Emperor Qin Shi Huang following his conquest of the other states in 221 BCE, creating a cohesive barrier system to defend the newly formed empire against northern nomads, particularly the Xiongnu. This ambitious project involved connecting existing fortifications from the states of Yan, Zhao, and Qin, spanning approximately 5,000 kilometers from Lintao in the west to the Liaodong Peninsula in the east, and was overseen by General Meng Tian. Around 300,000 soldiers and conscripted laborers, including peasants and convicts, were mobilized for the construction, which relied on rammed earth, wood, and stone, though it exacted a heavy toll in lives due to harsh conditions and forced labor. The resulting wall system, while rudimentary and prone to erosion, symbolized imperial centralization and provided a strategic frontier for controlling trade and military movements.\n\nDuring the Han Dynasty from 206 BCE to 220 CE, the fortifications were significantly extended westward to safeguard the emerging Silk Road trade routes and to counter ongoing threats from the Xiongnu and other steppe nomads, pushing the defensive line into regions like Gansu and Xinjiang. Emperors such as Wu (r. 141–87 BCE) ordered these expansions, which added thousands of kilometers using locally available materials like wood for palisades, rammed earth mixed with gravel and reeds for stability, and strategic placement along river valleys such as the Shule and Kongque. Beacon towers were a key innovation in this era, constructed as elevated structures for smoke and fire signaling to transmit warnings of invasions rapidly across the frontier, enhancing the wall's role in military coordination and caravan protection. These Han segments, often built on Qin foundations, emphasized adaptability to arid environments and integrated garrisons to maintain imperial influence over Central Asian commerce.\n\nIn the subsequent Northern and Southern Dynasties period, particularly under the Northern Wei (386–534 CE), Northern Qi (550–577 CE), and Sui (581–618 CE), the walls underwent repairs and selective expansions to address renewed nomadic pressures from groups like the Rouran and Göktürks, reflecting the era's political fragmentation and defensive necessities. The Northern Wei, for instance, constructed the Taichang Wall in 422 CE from Chicheng County in Hebei to Wuyuan in Inner Mongolia, and the Jishang Saiwei Wall in 446 CE from Badaling in Beijing to Xing County in Shanxi, incorporating trenches to impede cavalry charges during Emperor Xiaowen's reign. Northern Qi built an extensive dual-wall system, including the inner wall from Lyuliang in Shanxi to Suizhong in Liaoning and the outer wall to the Daling River, with seven major projects between 543 and 577 CE aimed at repelling Rouran incursions, though these ultimately failed against the Northern Zhou. The Sui Dynasty, seeking to consolidate the north, repaired and utilized these existing segments without major new constructions, focusing on integrating them into a broader frontier defense strategy against the Göktürks. These efforts, primarily using rammed earth and strategic garrisons, maintained the walls' functionality amid shifting alliances and invasions until the Tang Dynasty's rise diminished their immediate need.\n\nFollowing the Tang Dynasty, during the Five Dynasties and Ten Kingdoms period (907–960 CE) and the Song Dynasty (960–1279 CE), additional fortifications were built amid conflicts with northern regimes like the Liao Dynasty (907–1125 CE), which itself constructed walls to delineate territories. The most notable pre-Ming expansions occurred under the Jin Dynasty (1115–1234 CE), which built an extensive network of border fortifications totaling approximately 4,010 kilometers, primarily using rammed earth and stone to defend against Mongol incursions from the north. These Jin walls connected and reinforced earlier segments, spanning from the western deserts to the eastern coasts and incorporating trenches, watchtowers, and garrisons, reflecting the era's intense frontier warfare.\n\n### Ming Construction\n\nThe Ming dynasty's efforts to rebuild and expand the Great Wall commenced in 1368 under the Hongwu Emperor, Zhu Yuanzhang, immediately after the dynasty's founding and the expulsion of the Mongol Yuan rulers, with the explicit goal of fortifying northern borders against persistent Mongol threats. This initiative marked a shift from the fragmented defenses of prior eras, focusing on a more unified structure to secure agricultural heartlands and trade routes. Early phases involved repairing and connecting existing wall segments while incorporating stone and brick for enhanced durability, laying the groundwork for the most extensive phase of construction in Chinese history.\n\nConstruction intensified during the reign of the Yongle Emperor (1402–1424), who prioritized northern defenses amid ongoing Mongol raids, overseeing the relocation of the capital to Beijing and the integration of the wall into a broader strategic network. The total length of the Ming Great Wall, encompassing walls, trenches, and natural barriers, measures 8,851.8 kilometers, as determined by a comprehensive survey conducted by China's State Administration of Cultural Heritage. This monumental endeavor mobilized millions of laborers, comprising soldiers from the imperial army, conscripted civilians, and dispossessed peasants, who toiled under harsh conditions to haul materials across rugged terrain.\n\nCentral to the Ming approach were the wei-suo garrison systems, which embedded military units within self-sustaining agricultural settlements along the wall, ensuring long-term defense without over-relying on central supply lines. These garrisons, organized into hierarchical units from wei (regiments) to suo (outposts), facilitated ongoing repairs and patrols while promoting land reclamation in frontier zones. By the mid-16th century, major extensions had been completed in both eastern and western sectors, such as the reinforcement of the Shanhai Pass in the east and the Jiayu Pass in the west, creating a continuous barrier that spanned diverse landscapes from deserts to mountains.\n\nFollowing the 16th century, as Mongol incursions waned and new pressures emerged from eastern nomadic groups, investment in wall maintenance diminished, leading to gradual deterioration in less strategic sections despite sporadic reinforcements.\n\n### Qing Dynasty and Later\n\nFollowing the Manchu conquest of China in 1644, which marked the establishment of the Qing dynasty, the Great Wall lost its primary defensive function as the new rulers incorporated the northern steppes into their empire, eliminating the need for a border barrier against nomadic threats. The Manchus, originating from beyond the wall, viewed it as an obsolete symbol of Han resistance rather than a strategic asset, leading to widespread neglect and the repurposing of materials from its sections for local construction and agriculture. Under Qing rule, maintenance efforts ceased, and portions were dismantled to provide bricks and earth for villages, accelerating decay through natural erosion and human reuse.\n\nIn the 19th and early 20th centuries, the wall suffered further damage amid internal conflicts and modernization projects, including the widespread devastation caused by rebellions that ravaged infrastructure across northern China. The construction of the Beijing-Zhangjiakou Railway, completed in 1909 as China's first independently engineered rail line, traversed rugged terrain near wall segments, contributing to incidental structural harm through excavation and material extraction in the vicinity. These events compounded centuries of abandonment, with roadways and settlements encroaching on the structure, eroding its integrity.\n\nDuring the Republican era and early years of the People's Republic of China (PRC), initial efforts focused on partial restorations, particularly in the 1950s when the Badaling section near Beijing was rebuilt to serve as an accessible site for visitors and symbolize national resilience. However, the Cultural Revolution (1966–1976) inflicted significant harm, as officials promoted the wall's demolition as a \"feudal relic,\" encouraging locals to extract bricks for homes and dig caves for shelter, particularly in regions like Ningxia. This period saw targeted destruction of cultural sites, including wall portions, amid broader campaigns against historical symbols.\n\nAfter the end of the Cultural Revolution in 1976, the Great Wall gained recognition as a national treasure under Deng Xiaoping's reforms, shifting from ideological target to emblem of cultural heritage. Partial surveys using aerial remote sensing in the 1980s, particularly for Ming sections in areas like Beijing and Ningxia, contributed to early understandings of its extent. A comprehensive national survey conducted from 2006 to 2012 by Chinese institutions, including the State Administration of Cultural Heritage, revealed the wall's full extent—spanning 21,196 kilometers when accounting for all historical segments and branches—prompting renewed preservation initiatives. These efforts, launched with campaigns like Deng's 1984 call to \"Love China, Restore the Great Wall,\" marked a transition toward systematic protection.\n\n### Western Accounts\n\nThe earliest Western references to the Great Wall of China are indirect and ambiguous. Marco Polo's 13th-century travelogue, *The Travels of Marco Polo*, describes various Chinese defensive structures and border fortifications but makes no direct mention of the wall, possibly because the fragmented Yuan dynasty barriers of his era did not resemble the later Ming structure. This omission contributed to early misconceptions, as Polo's account fueled European curiosity about Chinese wonders without clarifying the wall's form or scale. The first clear and detailed European description emerged from Jesuit missionary Matteo Ricci, who in 1605 crossed the wall en route to Beijing and documented it in his journals, later published in 1615 as *De Christiana expeditione apud Sinas*. Ricci portrayed it as a formidable, continuous rampart stretching approximately 1,500 miles to shield against northern nomad incursions, emphasizing its strategic role in imperial defense.\n\nIn the 18th and 19th centuries, European explorers and diplomats offered more firsthand observations, often amplifying the wall's grandeur while introducing exaggerations about its uniformity and height. Accounts from the 1793 Macartney Embassy, Britain's inaugural diplomatic mission to China, depicted the wall as a monumental but weathered barrier symbolizing Qing isolation, with embassy members like George Staunton noting segments up to 25 feet high yet interrupted by natural terrain. Similarly, 19th-century visitors such as William Hutchinson in 1791 described it during overland journeys, highlighting its imposing presence but overstating its seamless continuity across mountains. By the early 20th century, personal narratives like Julia Hartigan's 1909 visit further romanticized the structure, portraying it as an unbroken ancient marvel in travelogues that reached wide audiences. Qing-era policies on foreign access briefly aided these visits, enabling diplomats and traders to traverse northern passes.\n\nThese descriptions profoundly influenced Western perceptions, embedding the wall in the Romantic imagination as an emblem of timeless mystery and human endurance, akin to Roman engineering feats like Hadrian's Wall. European writers and artists drew parallels to evoke exotic antiquity, reinforcing notions of China as a land of inscrutable grandeur and defensive paranoia. However, 20th-century advancements corrected these myths; aerial photography and surveys revealed the wall's discontinuous segments—comprising disparate dynastic remnants rather than a single edifice—with significant gaps; the total length was later precisely measured at 21,196 kilometers in a 2012 national survey. This evidence shifted scholarly views toward recognizing its composite history, diminishing exaggerated tales of invincibility.\n\n## Geography and Course\n\n### Overall Layout and Length\n\nThe Great Wall of China forms an extensive network of fortifications that begins at Shanhaiguan, located on the coast of the Bohai Sea in Hebei Province, and extends westward to Jiayuguan in Gansu Province, near the edge of the Gobi Desert. This primary route meanders across northern China, traversing 15 provincial-level regions including Liaoning, Hebei, Beijing, Tianjin, Shanxi, Inner Mongolia, Shaanxi, Ningxia, and Gansu, among others. Rather than a single linear barrier, the system incorporates branches, parallel walls, spurs, and auxiliary structures designed to adapt to the landscape and enhance defensive coverage.\n\nA comprehensive national survey conducted by the State Administration of Cultural Heritage from 2007 to 2012 measured the total length of the Great Wall at 21,196.18 kilometers, encompassing all historical segments and associated features. This figure includes 8,850 kilometers of Ming Dynasty walls, 6,259 kilometers from pre-Ming eras, and additional elements such as trenches, rivers, and earthen mounds totaling 6,087 kilometers. The survey identified 43,721 heritage sites, highlighting the wall's vast scale and the inclusion of non-wall barriers in its overall defensive layout.\n\nThe wall's path navigates a diverse array of terrains, from coastal plains and fertile river valleys in the east to rugged mountains, high plateaus, and arid deserts in the west. In regions like the Ordos Loop, it integrates with natural obstacles such as the Yellow River, where sections of the river itself serve as a defensive boundary, reducing the need for constructed walls. This strategic alignment with the topography—climbing steep ridges in Shanxi and crossing sandy expanses in Gansu—allowed builders to maximize protection while minimizing material use across varying elevations and soil conditions.\n\nMapping the Great Wall presents significant challenges due to its discontinuous nature, with many segments separated by gaps, destroyed portions, or natural features. Archaeological efforts have revealed buried sections under shifting sands in desert areas and eroded remnants in mountainous zones, complicating accurate delineation and requiring advanced techniques like remote sensing and fieldwork to uncover hidden or fragmented parts. These discontinuities, often resulting from centuries of environmental degradation and human activity, underscore the wall's evolution as a patchwork system rather than a uniform structure.\n\n### Han Dynasty Segments\n\nThe Han Dynasty significantly expanded the Great Wall system, building upon earlier Qin foundations to create an extensive network of fortifications across northern China. These segments, constructed primarily during the Western Han period (206 BCE–9 CE), focused on securing borders against nomadic incursions while facilitating control over trade routes. The eastern portions, located along the regions of Hebei and Liaoning, largely reused and reinforced existing Qin walls, extending from areas near modern-day Lingju eastward toward the Liaodong Peninsula. These reused structures incorporated rammed earth and stone reinforcements to integrate with the rugged terrain of the Yan Mountains and coastal plains, forming a continuous barrier that linked older Warring States defenses.\n\nIn contrast, the western extensions represented a major innovation, stretching over 1,000 kilometers from Dunhuang through the arid Hexi Corridor to Lop Nur in present-day Xinjiang. Initiated under Emperor Wu (r. 141–87 BCE), these segments were built in phases: from Lingju to Jiuquan around 121 BCE, Jiuquan to the Jade Gate Pass between 111 and 110 BCE, and finally from the Jade Gate Pass to Lop Nur between 104 and 100 BCE. Constructed primarily with local materials such as sandy soil, reeds, tamarix branches, and Euphrates poplar for wooden palisades, the walls varied in width from 10 to 12 meters at the base and included associated trenches and beacon towers spaced at intervals for signaling. These features were adapted to the harsh desert environment, with palisades providing lightweight yet effective barriers in sandy areas where stone was scarce.\n\nKey sites along the western route included the Yumenguan Pass (Jade Gate Pass) and Yang Pass, both critical gateways near Dunhuang that controlled access to the Silk Road. Yumenguan, located about 80 kilometers northwest of Dunhuang, served as a fortified checkpoint with surrounding walls and towers, while Yang Pass lay further south, guarding southern approaches. Garrisons were strategically placed at desert oases, such as those sustained by the Shule River in Dunhuang, which supported military towns and agricultural outposts essential for sustaining frontier troops. These oases enabled the establishment of self-sufficient settlements, with walls and towers protecting water sources and supply lines.\n\nOverall, the Han Dynasty segments totaled over 5,000 kilometers in length, making it one of the most expansive iterations of the wall system, though much of it now lies eroded, buried under sand dunes, or weathered by wind and water in remote areas. Archaeological surveys using satellite imagery have identified linear traces of these walls, particularly in the Dunhuang region where about 400 kilometers remain detectable, highlighting their role in pre-Ming defensive networks.\n\n### Ming Dynasty Segments\n\nThe Ming Dynasty segments of the Great Wall represent the most extensive and best-preserved portions of the structure, constructed primarily between 1368 and 1644 to fortify northern borders against Mongol incursions. These segments total approximately 8,851.8 kilometers in overall length, including 6,259.6 kilometers of actual wall, with about 5,500 kilometers consisting of durable stone and brick construction concentrated in the provinces of Hebei and Inner Mongolia. This dense network snakes across rugged terrain, adapting to mountains, plains, and deserts, and forms the iconic image of the Great Wall visited today. In some areas, Ming builders incorporated or reinforced earlier Han Dynasty foundations to expedite construction and leverage existing strategic lines.\n\nThe core Beijing section, extending from Shanhaiguan in the east to Badaling in the west, exemplifies the Ming Wall's engineering prowess and serves as its most prominent and accessible route. This vital corridor, spanning hundreds of kilometers through Hebei Province, includes dramatic steep mountain ascents such as the Jiankou segment, where the wall climbs sharply along precarious ridges at elevations exceeding 1,000 meters, offering natural defensive advantages while demanding sophisticated masonry techniques. Badaling, located at the northern entrance to Juyong Pass, features well-preserved stone battlements that wind over steep hills, making it a focal point for the wall's integration into Beijing's immediate northern defenses.\n\nKey passes along these segments provided critical chokepoints for military control and logistics. Juyongguan, situated 60 kilometers northwest of Beijing in Hebei Province, was extensively renovated during the Jiajing Emperor's reign (1522–1566) and functioned as a grand fortified gateway with towering gates and platforms overlooking mountain passes. Gubeikou, further east near the Miyun Reservoir, includes unique hollow watchtowers built between 1569 and 1571, totaling 1,194 structures, and exemplifies the wall's strategic depth in funneling invaders through narrow corridors. These passes often integrated with natural features, such as rivers like the Haihe and Yellow River for water barriers, and sheer cliffs for impassable flanks, enhancing the overall defensive layout without relying solely on artificial barriers.\n\nIn the northern frontiers, Ming segments adapted to arid environments, particularly in the Gobi Desert regions of Gansu and Ningxia, where rammed earth and mud walls predominated due to scarce stone resources; for instance, the Songshan Great Wall segment, constructed in 1599, measures 151.8 kilometers and utilizes compacted soil layers for resilience against sandstorms. Eastern coastal branches, branching from the main line in Liaodong (modern Liaoning Province), extend defenses toward the Bohai Sea, with over 869 kilometers built between 1437 and 1442 to guard against maritime threats and connect inland fortifications to seaside outposts like Shanhaiguan. These varied adaptations underscore the Ming Wall's role as a comprehensive barrier system tailored to diverse geographies.\n\n## Construction and Characteristics\n\n### Materials and Techniques\n\nThe construction of the Great Wall employed rammed earth, known as hangtu, as the primary technique in early periods, utilizing local soil mixed with gravel, sand, and sometimes organic materials like reeds or twigs, which was compacted in layers typically 7-10 cm thick between wooden or stone formworks to achieve stone-like hardness. This method was prevalent from the Qin Dynasty onward, with workers using wooden tamping rods to pound the mixture firmly, ensuring structural integrity without advanced machinery. In the western sections during the Han Dynasty, particularly in arid desert regions like Dunhuang, wood such as tamarisk branches was incorporated into the rammed earth for reinforcement, or used to form palisades where soil was scarce, adapting to the sparse vegetation and sandy terrain.\n\nDuring the Ming Dynasty, construction advanced to incorporate fired bricks quarried and baked locally, often four times the size of standard bricks for efficiency, alongside quarried stones, which provided greater durability against erosion and sieges compared to earlier earthen methods. These materials were bound using sticky rice mortar, a lime-based mixture incorporating glutinous rice (along with ingredients like blood, egg white, or tung oil in variations) that enhanced tensile strength, waterproofing, and resistance to cracking through bio-mineralization processes forming calcite crystals. This innovation reflected the Ming emphasis on long-term resilience, as evidenced in historical records prioritizing robust fortifications.\n\nLabor was organized through conscription systems across dynasties, drawing from soldiers, peasants, and convicts; for instance, the Qin Dynasty mobilized over 1 million workers, with similar scales of 1-2 million estimated per major building phase in subsequent eras like the Han and Ming. Workers, often serving mandatory corvée labor terms of up to a year, transported materials using basic tools such as levers, windlasses, and handcarts, enduring harsh conditions that highlighted the project's immense human cost.\n\nAdaptations to terrain were essential for stability, with stone and brick favored in mountainous areas for their load-bearing capacity and resistance to landslides, while rammed earth suited the flatter plains where soil was abundant and easier to compact. To mitigate water damage and collapse, builders integrated drainage systems, including barrel-shaped conduits spaced at intervals along the wall to channel rainwater away from the structure.\n\n### Architectural Features\n\nThe Great Wall of China exhibits a standardized profile designed for both defensive stability and operational efficiency, with an average height of 6 to 7 meters and a base width of approximately 6 to 7 meters, narrowing to 4 to 5 meters at the top to support troop movements and artillery. This trapezoidal cross-section, often constructed with brick facing on rammed-earth cores in Ming-era segments, includes a parapet wall about 1 meter high along the inner edge and battlements rising to 2 meters on the outer side, featuring evenly spaced embrasures for archers and sentinels. Platforms integrated into the wall's upper surface provided spaces for soldiers to rest, store supplies, or mount weapons, enhancing the structure's functionality across rugged terrain.\n\nWatchtowers and signal towers form integral components of the Wall's architecture, typically spaced 200 to 500 meters apart in densely fortified sections to ensure overlapping fields of view and rapid communication. In the Ming dynasty, these structures were predominantly built of gray bricks, reaching heights of 10 to 15 meters and often comprising two to three stories, with the uppermost level reserved for observation and signaling. The towers included interior stairs or ladders for access, barracks for garrisons, and machicolations for dropping projectiles on assailants below. Beacon systems within these towers relied on controlled fires at night or smoke signals—produced by burning wolf dung or reeds—during the day to transmit alerts across the network, with the number of fires or smoke columns indicating enemy force size.\n\nPasses and gates represent the most elaborate architectural elements, serving as chokepoints reinforced by multiple layered defenses to control access and repel invasions. These typically comprised a central city gate flanked by gate towers, outer enclosures known as wengcheng for ambush setups, and secondary walls or luocheng for additional surveillance, often surrounded by moats to impede cavalry charges. Juyongguan Pass exemplifies this design with its successive fortifications in a narrow valley, including a triple-gate arrangement where attackers would face barbicans and elevated towers in sequence, the central Cloud Platform rising 9.5 meters as a marble archway with carved Buddhist motifs for both symbolic and tactical purposes.\n\nComplementary features such as horse tracks and barriers augmented the Wall's defensive profile. The upper walkways were paved to accommodate five horses abreast or ten soldiers marching side by side, facilitating quick reinforcements and patrols. In vulnerable lowland areas, dry moats or trenches extended up to 359 kilometers in total length, while natural or planted thorn barriers provided secondary obstacles against mounted incursions. These elements, integrated seamlessly with the landscape, underscored the Wall's role as a multifaceted fortification system.\n\n## Military and Strategic Role\n\n### Defensive Strategies\n\nThe Great Wall of China functioned primarily as a deterrent and early warning mechanism against nomadic incursions from groups such as the Xiongnu in the Han Dynasty and the Mongols in the Ming Dynasty, rather than an absolute barrier, by channeling attackers into predictable paths and buying time for defensive mobilization. This strategic role emphasized psychological intimidation and surveillance over outright invincibility, slowing potential invasions through its sheer scale and visibility across the landscape.\n\nUnder the Ming Dynasty (1368–1644), the wei-suo system formed the backbone of the Wall's garrison network, organizing hereditary soldiers into hierarchical units known as wei (guards, typically 5,600 men each) and suo (battalions, about 1,120 men each), with over 1,100 such garrisons distributed along the frontier to ensure rotational staffing and sustained presence. At its peak, this system supported an estimated force of around 1 million soldiers dedicated to border defense, supplemented by supply chains via postal relay stations that facilitated logistics and reinforcements across vast distances. Watchtowers and beacon networks integrated briefly with these garrisons to enhance vigilance.\n\nThe Wall's design leveraged natural terrain for optimal defense, positioning fortifications at strategic choke points like mountain passes to funnel enemies into kill zones where garrisoned troops could concentrate fire or counterattacks. Beacon towers enabled rapid communication through smoke and fire signals, visible up to 7–10 kilometers in clear conditions, allowing alarms to propagate along the line and coordinate responses within hours. This terrain-integrated approach maximized the Wall's role in broader military doctrines, including border control and resource denial to invaders.\n\nDespite these measures, the Wall's limitations were evident in frequent breaches, often achieved by scaling with ladders, enduring sieges that exhausted supplies, or exploiting internal betrayals among garrisons, underscoring that human factors and adaptability ultimately determined its effectiveness.\n\n### Key Battles and Events\n\nDuring the Qin dynasty, in 215 BCE, General Meng Tian led an offensive campaign with 300,000 troops against the Xiongnu nomads in the Ordos region, pushing them northward and reclaiming territory south of the Yellow River. This victory temporarily repelled Xiongnu raids and prompted the construction and extension of early wall fortifications to secure the northern frontier against further incursions.\n\nIn the Han dynasty, General Wei Qing's campaign in 119 BCE marked a significant defensive success, where Han forces, coordinated through beacon towers along the extended Great Wall segments, decisively defeated the Xiongnu in the northern Gobi Desert and pursued them deep into the steppes, weakening their confederation. Similarly, the Battle of Jushi in 60 BCE saw Han commander Zheng Ji repel Xiongnu forces from the Jushi kingdom in the Turpan region, securing western extensions of the Wall and stabilizing trade routes along the frontier. These engagements demonstrated the Wall's role in enabling rapid signaling and troop mobilization, contributing to Han dominance over nomadic threats.\n\nThe Ming dynasty faced acute tests of the Wall's defenses during the Tumu Crisis of 1449, when Oirat Mongol leader Esen Taishi lured Emperor Yingzong and 500,000 Ming troops beyond Tumu Fortress near the Wall, resulting in the capture of the emperor while the fortifications themselves held against initial assaults. This disaster exposed vulnerabilities in field tactics but underscored the Wall's static defensive value, leading to reforms in garrisoning. Later, Altan Khan's raids in 1550 breached sections of the Wall near Beijing, sacking suburbs and prompting extensive reinforcements and improved beacon systems to counter Mongol cavalry mobility.\n\nThe Wall's ultimate breach occurred in 1644 during the Ming collapse, when rebel leader Li Zicheng's forces advanced from internal unrest to capture Beijing, prompting Ming general Wu Sangui to open Shanhai Pass—a critical eastern Wall gateway—to Qing Manchu allies, allowing their entry and the decisive defeat of Li's army, which sealed the Ming's fall. This event highlighted how internal rebellions could undermine the Wall's northern focus, facilitating dynastic transition.\n\n## Preservation and Condition\n\n### Current State and Threats\n\nThe Great Wall of China remains partially intact, with only about 8.2% in good condition as of 2015 surveys, predominantly from the Ming Dynasty era, while approximately 30% has completely disappeared and the majority of earlier segments have largely eroded or been dismantled. A 2015 survey by Chinese authorities revealed that 22% of the Ming Dynasty sections—totaling about 1,962 kilometers—have been destroyed, leaving only around 8% in good condition due to cumulative degradation over centuries.\n\nNatural threats continue to compromise the Wall's integrity, including erosion from wind, rain, and freeze-thaw cycles, as well as vegetation overgrowth that roots into masonry and accelerates structural weakening. In mountainous and loess regions, unchecked plant growth has led to water retention in walls, promoting further weathering and collapse in vulnerable areas. Human-induced damage exacerbates these issues, with quarrying activities extracting stones and bricks for local construction, particularly in rural northern provinces, and urban expansion encroaching on peripheral sections; for instance, development near Beijing in the late 20th century incorporated Wall materials into modern infrastructure.\n\nClimate change poses escalating risks, with increased rainfall intensity triggering landslides that undermine foundations, as seen in widespread hydrogeological events across northern China in recent years. Rising temperatures, averaging a 1.5°C increase since the 1950s, intensify freeze-thaw damage in colder sections by expanding water in cracks during winter cycles. Additionally, shifting precipitation patterns have heightened erosion in arid zones.\n\nAs of 2025 assessments, sections in the Gobi Desert region, such as those in Gansu Province, exhibit accelerated degradation from desertification, with wind-driven sand abrasion and soil instability eroding rammed-earth structures at rates exceeding 1 meter per decade in exposed areas, based on recent aerial surveys.\n\n### Restoration Efforts\n\nIn the early years of the People's Republic of China, restoration efforts for the Great Wall began with the initiation of systematic protection measures. In 1957, the government launched the first major restoration project at the Badaling section, marking the start of modern conservation initiatives to repair and preserve key segments of the wall as a national symbol. During the 1980s, the Chinese Academy of Sciences conducted pioneering aerial remote sensing surveys of Ming Dynasty sections in Beijing and Ningxia, enabling detailed mapping and identification of buried or eroded portions to inform future preservation strategies.\n\nThe 2000s saw expanded restoration projects emphasizing authenticity and international cooperation. UNESCO supported these efforts through funding and technical assistance, including a US$146,000 donation in the early 1990s extended into ongoing collaborations for sites like Mutianyu, focusing on conservation planning and training for heritage management.\n\nRecent developments under Beijing's 14th Five-Year Plan (2021–2025) have integrated advanced technology into protection strategies. The plan prioritizes real-time monitoring and emergency reinforcements, completing over 60 projects across the wall, with an early warning platform employing drones, quadruped robots, and AI for surveillance and damage assessment. As of May 2025, Beijing has advanced high-standard conservation, including building the Beijing section of the Great Wall national cultural park. In Shanxi Province, post-2023 repairs utilized 3D scanning and InSAR technology to monitor deformations and guide precise reconstructions of Ming-era segments, enhancing long-term stability.\n\nInternational aid has complemented domestic initiatives, particularly through grants from the World Monuments Fund (WMF). The WMF included the Great Wall on its 2002 Watch list of endangered sites, providing funding and expertise for landscape protection to address erosion and urban encroachment. Community involvement has been vital in rural areas, where local residents in villages like those near Beijing participate in ongoing protection, with nearly all permanent populations engaged in heritage maintenance under national campaigns initiated in the 1980s.\n\n## Visibility from Space\n\n### The Myth of Visibility from the Moon\n\nThe popular myth that the Great Wall of China is the only human-made structure visible from the Moon with the naked eye originated in a 1932 *Ripley's Believe It or Not!* cartoon, which described it as \"the mightiest work of man, the only one that would be visible to the human eye from the moon.\" This claim gained traction in the decades leading up to the Space Age, despite lacking scientific basis, and was widely repeated in popular media as a testament to the Wall's immense scale.\n\nThe misconception persisted even after the Apollo missions, with some pre-launch expectations suggesting astronauts might spot it, but none did. Neil Armstrong, in a NASA oral history interview, explicitly refuted the idea, stating that from the Moon or cislunar space, he observed no human-made objects on Earth, including the Great Wall. Similarly, other Apollo astronauts like Alan Bean confirmed the Wall was \"definitely not visible from the Moon.\"\n\nScientifically, the myth is untenable due to the Wall's narrow profile and the vast lunar distance. With an average width of 4 to 5 meters, the structure subtends an angular size of approximately 7 × 10^{-7} degrees from the Moon's average distance of 384,400 kilometers—far below the human eye's resolution limit of about 0.02 degrees—making it indistinguishable from natural linear features like roads or rivers against Earth's curvature. NASA has consistently stated that the Great Wall is not visible from the Moon, as confirmed by Apollo mission observations where the entire Earth appeared as a distant, featureless disk to the unaided eye.\n\nDespite these refutations starting in the late 1960s and formal corrections in the 1970s, the myth endures in popular culture, often invoked in educational materials, films, and tourism promotions as a symbol of engineering prowess, even as fact-checkers like Snopes have repeatedly debunked it. This persistence highlights how entrenched misconceptions can outlive scientific clarification, contrasting sharply with the Wall's actual visibility challenges from closer orbital vantage points.\n\n### Visibility from Low Earth Orbit and Satellites\n\nThe Great Wall of China is visible from the International Space Station (ISS), which orbits at an altitude of approximately 400 km, but only under favorable conditions such as clear weather and low sun angles that cast shadows to enhance contrast. Astronaut photographs from the 2000s, including those taken by Expedition 10 Commander Leroy Chiao in 2005, depict the Wall as a thin, meandering line amid the terrain of Inner Mongolia, requiring high-magnification lenses for clear identification.\n\nHigh-resolution satellite imagery has documented sections of the Great Wall since the Landsat program's inception in 1972, with multispectral data from Landsat satellites enabling the mapping of visible segments over decades. Platforms like Google Earth, incorporating Landsat and other sources, provide accessible views of well-preserved portions, such as those near Beijing. In the 2020s, advanced techniques including interferometric synthetic aperture radar (InSAR) from satellites like TerraSAR-X have revealed deformation patterns, with studies identifying stable areas alongside subsidence rates of up to 7 mm per year near high-traffic sites.\n\nDetecting the Wall from low Earth orbit remains challenging due to its construction materials, which offer low contrast against surrounding landscapes, and its sinuous path that follows natural contours like hills and cliffs for camouflage. Without enhancement techniques such as shadow analysis or spectral processing, only prominent, unrestored sections stand out reliably in imagery.\n\nAs of 2025, China's Gaofen satellite constellation continues to support preservation monitoring, with the October launch of Gaofen-14 enhancing stereo mapping capabilities for topographic analysis of heritage sites. Earlier missions like Gaofen-1 have utilized multispectral imagery, including panchromatic and shortwave infrared bands, to automatically detect linear traces of ancient Wall segments with up to 80% accuracy in uniform terrains, aiding erosion assessment and archaeological surveys.\n\n## Cultural and Modern Significance\n\n### Symbolism and Heritage\n\nThe Great Wall of China embodies profound symbolism in Chinese culture, representing national unity forged through the Qin dynasty's consolidation of warring states and the collective perseverance of laborers who endured immense hardship during its construction. This endurance is vividly captured in the folklore of Meng Jiangnü, a legendary woman whose grief over her conscripted husband's death is said to have caused a section of the wall to collapse through her weeping, symbolizing the human cost of imperial ambition and the resilience of the human spirit against oppression. Mao Zedong further elevated the wall's cultural resonance in his 1936 poem \"Snow,\" where it appears as a majestic yet subdued barrier amid a vast, frozen landscape, evoking the cyclical rise and fall of dynasties while affirming the enduring strength of the Chinese people under communist leadership.\n\nPost-1949, the Great Wall has solidified as an emblem of China's sovereignty and national identity, serving as a powerful propaganda tool to unify the populace around themes of historical resilience and territorial integrity. This symbolism reached a global audience during the 2008 Beijing Olympics, when the torch relay culminated in a historic run along the wall's ancient bricks at Badaling, highlighting China's ancient heritage as a bridge to its modern aspirations and fostering national pride amid international scrutiny. The event underscored the wall's role in projecting a harmonious, unified China on the world stage.\n\nOn a global scale, the Great Wall's heritage value was affirmed in 2007 when it was voted one of the New 7 Wonders of the World through an international poll organized by the New7Wonders Foundation, recognizing its monumental scale and enduring appeal as a testament to human ingenuity. It has influenced art and film, notably in Zhang Yimou's 2002 epic *Hero*, which dramatizes the Qin unification that the wall later fortified, using stylized visuals to explore themes of sacrifice for a greater whole. Intangible aspects of this heritage persist through cultural festivals at wall sites, such as the annual Beijing Great Wall Cultural Festival, featuring traditional performances, temple fairs, and galas that celebrate its literary and historical legacy. The wall's inscription as a UNESCO World Heritage Site in 1987 under criteria (i), (ii), (iii), (iv), and (vi) highlights its status as an exceptional human creative genius, illustrating exchanges of human values, bearing testimony to ancient civilizations, exemplifying military architecture, and holding universal symbolic significance through associated literary works like Tang poet Du Fu's ballads on soldiers' hardships.\n\n### Tourism and Visitor Experience\n\nThe Great Wall of China serves as one of the world's premier tourist attractions, drawing millions annually to its restored sections for hiking, photography, and cultural immersion. Badaling, located about 70 kilometers northwest of Beijing, is the most accessible and popular site, attracting over 10 million visitors per year in the pre-pandemic era due to its well-preserved Ming Dynasty fortifications and proximity to the capital. To mitigate overcrowding, authorities imposed a daily cap of 65,000 visitors at Badaling starting June 1, 2019, requiring advance online bookings via a real-name ticketing system. Mutianyu, situated 65 kilometers northeast of Beijing, offers a more scenic and less congested alternative, featuring cable cars for ascent, a thrilling toboggan descent, and lush forested surroundings that enhance the visitor experience; by July 2025, it had welcomed a record 450,000 foreign tourists since the start of the year.\n\nIn the post-COVID era, tourism to the Great Wall has surged from 2023 through 2025, fueled by eased travel restrictions, visa-free policies for select nationalities, and a national push toward eco-tourism that emphasizes sustainable practices. Domestic trips to heritage sites like the Great Wall contributed to China's overall tourism rebound, with domestic revenue reaching approximately US$318 billion in the first half of 2023 alone and continuing to grow through 2025. This recovery has been marked by innovative green initiatives, aligning with China's broader 2025 sustainability goals in tourism.\n\nDespite these advancements, tourism faces ongoing challenges, including severe overcrowding at peak sites like Badaling, where daily limits are often reached by mid-morning, and incidents of vandalism such as graffiti carving, which prompted arrests and fines for two tourists at Badaling in May 2025. In response, a 2025 ecological resilience framework for Great Wall tourism towns has been developed to balance visitor growth with environmental protection, incorporating measures like capacity assessments, habitat restoration, and community involvement to safeguard the site's integrity amid rising pressures.\n\nEconomically, Great Wall tourism bolsters local communities through revenue from entry fees, guided tours, and ancillary services, with the broader Chinese tourism sector—bolstered by attractions like the Wall—projected to contribute approximately US$2 trillion to the economy in 2025. Popular offerings include guided hikes along trails such as those at Jinshanling, a 10-kilometer unrestored section northeast of Beijing renowned for its watchtowers and wild landscapes, where visitors can trek for 3-4 hours while supporting local vendors and eco-friendly operators. This symbolic icon continues to captivate global travelers, fostering cultural exchange and heritage appreciation.",
  "external_references": [
    {
      "text": "World Asia China 18337039",
      "url": "https://www.bbc.com/news/world-asia-china-18337039",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "438",
      "url": "https://whc.unesco.org/en/list/438/",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "Oldest Section Of Chinas Great Wall Discovered",
      "url": "https://archaeologymag.com/2025/02/oldest-section-of-chinas-great-wall-discovered/",
      "domain": "archaeologymag.com",
      "type": "citation"
    },
    {
      "text": "Great Wall China",
      "url": "https://www.nationalgeographic.com/travel/world-heritage/article/great-wall-china",
      "domain": "nationalgeographic.com",
      "type": "citation"
    },
    {
      "text": "Content 51805883.htm",
      "url": "http://english.scio.gov.cn/chinavoices/2018-06/08/content_51805883.htm",
      "domain": "english.scio.gov.cn",
      "type": "citation"
    },
    {
      "text": "Great Wall China",
      "url": "https://education.nationalgeographic.org/resource/great-wall-china/",
      "domain": "education.nationalgeographic.org",
      "type": "citation"
    },
    {
      "text": "The Great Wall %25e9%2595%25bf%25e5%259f%258e",
      "url": "https://imex.psu.edu/project/the-great-wall-%25E9%2595%25BF%25E5%259F%258E/",
      "domain": "imex.psu.edu",
      "type": "citation"
    },
    {
      "text": "Zhou Event.html",
      "url": "http://www.chinaknowledge.de/History/Zhou/zhou-event.html",
      "domain": "chinaknowledge.de",
      "type": "citation"
    },
    {
      "text": "Changcheng.html",
      "url": "http://www.chinaknowledge.de/History/Terms/changcheng.html",
      "domain": "chinaknowledge.de",
      "type": "citation"
    },
    {
      "text": "2719110",
      "url": "https://www.jstor.org/stable/2719110",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "9c39bcfdf6048f109b31305be52ef1e5",
      "url": "https://www.cambridge.org/core/books/china-and-the-writing-of-english-literary-modernity-16901770/robinson-crusoe-and-the-great-wall-of-china/9C39BCFDF6048F109B31305BE52EF1E5",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "A History Of The Great Wall Of China Ebook By Luo Zhewen.pdf",
      "url": "https://www.wildgreatwall.com/wp-content/uploads/2013/11/A-History-of-the-Great-Wall-of-China-Ebook-by-Luo-Zhewen.pdf",
      "domain": "wildgreatwall.com",
      "type": "citation"
    },
    {
      "text": "The Origins Of The Great Wall.pdf",
      "url": "https://edspace.american.edu/silkroadjournal/wp-content/uploads/sites/984/2017/09/The-Origins-of-the-Great-Wall.pdf",
      "domain": "edspace.american.edu",
      "type": "citation"
    },
    {
      "text": "Building The Great Wall",
      "url": "https://www.asianstudies.org/publications/eaa/archives/building-the-great-wall/",
      "domain": "asianstudies.org",
      "type": "citation"
    },
    {
      "text": "Pmc9800585",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9800585/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "T20240307 5737365.shtml",
      "url": "http://english.cssn.cn/skw_culture/202403/t20240307_5737365.shtml",
      "domain": "english.cssn.cn",
      "type": "citation"
    },
    {
      "text": "Who Built The Great Wall Of China And Why",
      "url": "https://www.magellantv.com/articles/who-built-the-great-wall-of-china-and-why",
      "domain": "magellantv.com",
      "type": "citation"
    },
    {
      "text": "Ming Dynasty China",
      "url": "https://timemaps.com/civilizations/ming-dynasty-china/",
      "domain": "timemaps.com",
      "type": "citation"
    },
    {
      "text": "426736.shtml",
      "url": "https://www.globaltimes.cn/content/426736.shtml",
      "domain": "globaltimes.cn",
      "type": "citation"
    },
    {
      "text": "Labor Force.htm",
      "url": "https://www.travelchinaguide.com/china_great_wall/construction/labor_force.htm",
      "domain": "travelchinaguide.com",
      "type": "citation"
    },
    {
      "text": "Military Defense System Great Wall Ming Dynasty",
      "url": "https://www.mpiwg-berlin.mpg.de/research/projects/military-defense-system-great-wall-ming-dynasty",
      "domain": "mpiwg-berlin.mpg.de",
      "type": "citation"
    },
    {
      "text": "Ming Dynasty Wall.htm",
      "url": "https://www.chinahighlights.com/greatwall/history/ming-dynasty-wall.htm",
      "domain": "chinahighlights.com",
      "type": "citation"
    },
    {
      "text": "Ming Decline And Collapse",
      "url": "https://www.encyclopedia.com/history/news-wires-white-papers-and-books/ming-decline-and-collapse",
      "domain": "encyclopedia.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarworks.utrgv.edu/cgi/viewcontent.cgi?article=1150\\u0026context=hist_fac",
      "domain": "scholarworks.utrgv.edu",
      "type": "citation"
    },
    {
      "text": "Great Wall Of China",
      "url": "https://www.history.com/topics/ancient-china/great-wall-of-china",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "The Great Wall Of China Is Under Siege 825452",
      "url": "https://www.smithsonianmag.com/travel/the-great-wall-of-china-is-under-siege-825452/",
      "domain": "smithsonianmag.com",
      "type": "citation"
    },
    {
      "text": "First Chinese Built Railway Enthusiast Trying",
      "url": "https://www.scmp.com/magazines/post-magazine/long-reads/article/2147567/first-chinese-built-railway-enthusiast-trying",
      "domain": "scmp.com",
      "type": "citation"
    },
    {
      "text": "Chinas Great Wall Is Crumbling In Many Places Can It Be Saved",
      "url": "https://www.whqr.org/2016-01-27/chinas-great-wall-is-crumbling-in-many-places-can-it-be-saved",
      "domain": "whqr.org",
      "type": "citation"
    },
    {
      "text": "Mp Essay.htm",
      "url": "https://afe.easia.columbia.edu/mongols/pop/polo/mp_essay.htm",
      "domain": "afe.easia.columbia.edu",
      "type": "citation"
    },
    {
      "text": "Matteo Ricci China 1583 1610",
      "url": "https://www.historytoday.com/archive/matteo-ricci-china-1583-1610",
      "domain": "historytoday.com",
      "type": "citation"
    },
    {
      "text": "Chapter.pdf",
      "url": "https://ueaeprints.uea.ac.uk/id/eprint/53881/3/Chapter.pdf",
      "domain": "ueaeprints.uea.ac.uk",
      "type": "citation"
    },
    {
      "text": "Huang.pdf",
      "url": "https://historyitm.files.wordpress.com/2013/08/huang.pdf",
      "domain": "historyitm.files.wordpress.com",
      "type": "citation"
    },
    {
      "text": "713139.shtml",
      "url": "https://www.globaltimes.cn/content/713139.shtml",
      "domain": "globaltimes.cn",
      "type": "citation"
    },
    {
      "text": "Content 25574964.htm",
      "url": "http://www.china.org.cn/china/2012-06/06/content_25574964.htm",
      "domain": "china.org.cn",
      "type": "citation"
    },
    {
      "text": "Mapping.pdf",
      "url": "https://thewall.huji.ac.il/sites/default/files/the_wall/files/mapping.pdf",
      "domain": "thewall.huji.ac.il",
      "type": "citation"
    },
    {
      "text": "2711",
      "url": "https://www.mdpi.com/2072-4292/11/22/2711",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "S40494 024 01198 1",
      "url": "https://www.nature.com/articles/s40494-024-01198-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Dunhuang Greatwall.htm",
      "url": "https://www.chinahighlights.com/greatwall/section/dunhuang-greatwall.htm",
      "domain": "chinahighlights.com",
      "type": "citation"
    },
    {
      "text": "986529684 Mit.pdf",
      "url": "https://dspace.mit.edu/bitstream/handle/1721.1/109018/986529684-MIT.pdf?sequence=1\\u0026isAllowed=y",
      "domain": "dspace.mit.edu",
      "type": "citation"
    },
    {
      "text": "S11431 008 0317 0",
      "url": "https://link.springer.com/article/10.1007/s11431-008-0317-0",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Who Built Great Wal.html",
      "url": "https://www.chinadiscovery.com/great-wall/facts/who-built-great-wal.html",
      "domain": "chinadiscovery.com",
      "type": "citation"
    },
    {
      "text": "Ws665d2cdda31082fc043ca8d1.html",
      "url": "https://www.chinadaily.com.cn/a/202406/03/WS665d2cdda31082fc043ca8d1.html",
      "domain": "chinadaily.com.cn",
      "type": "citation"
    },
    {
      "text": "318704953 The Ancient Construction Materials And Methods The Great Wall Of China In Jinshanling As A Case Study",
      "url": "https://www.researchgate.net/publication/318704953_The_Ancient_Construction_Materials_and_Methods_The_Great_Wall_of_China_in_Jinshanling_as_a_Case_Study",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Wall",
      "url": "https://www.travelchinaguide.com/china_great_wall/construction/wall/",
      "domain": "travelchinaguide.com",
      "type": "citation"
    },
    {
      "text": "How Tall.htm",
      "url": "https://www.travelchinaguide.com/china_great_wall/facts/how-tall.htm",
      "domain": "travelchinaguide.com",
      "type": "citation"
    },
    {
      "text": "How Big Is The Great Wall Of China.html",
      "url": "https://www.chinadiscovery.com/great-wall/facts/how-big-is-the-great-wall-of-china.html",
      "domain": "chinadiscovery.com",
      "type": "citation"
    },
    {
      "text": "Great Wall Of China",
      "url": "https://www.mybeijingchina.com/travelguide/great-wall-of-china",
      "domain": "mybeijingchina.com",
      "type": "citation"
    },
    {
      "text": "Pdf",
      "url": "https://www.jstage.jst.go.jp/article/jaabe/16/3/16_503/_pdf",
      "domain": "jstage.jst.go.jp",
      "type": "citation"
    },
    {
      "text": "Tower",
      "url": "https://www.travelchinaguide.com/china_great_wall/construction/tower/",
      "domain": "travelchinaguide.com",
      "type": "citation"
    },
    {
      "text": "Pass",
      "url": "https://www.travelchinaguide.com/china_great_wall/construction/pass/",
      "domain": "travelchinaguide.com",
      "type": "citation"
    },
    {
      "text": "Juyongguan.htm",
      "url": "https://www.chinahighlights.com/greatwall/section/juyongguan.htm",
      "domain": "chinahighlights.com",
      "type": "citation"
    },
    {
      "text": "S40494 024 01209 1",
      "url": "https://www.nature.com/articles/s40494-024-01209-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S2095263520300066",
      "url": "https://www.sciencedirect.com/science/article/pii/S2095263520300066",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "324257324 The Fractal Structure Of The Ming Great Wall Military Defense System A Revised Horizon Over The Relationship Between The Great Wall And The Military Defense Settlements",
      "url": "https://www.researchgate.net/publication/324257324_The_fractal_structure_of_the_Ming_Great_Wall_Military_Defense_System_A_revised_horizon_over_the_relationship_between_the_Great_Wall_and_the_military_defense_settlements",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Xiongnu",
      "url": "https://www.iranicaonline.org/articles/xiongnu/",
      "domain": "iranicaonline.org",
      "type": "citation"
    },
    {
      "text": "380503",
      "url": "https://muse.jhu.edu/article/380503",
      "domain": "muse.jhu.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://ir.library.louisville.edu/cgi/viewcontent.cgi?article=5429\\u0026context=etd",
      "domain": "ir.library.louisville.edu",
      "type": "citation"
    },
    {
      "text": "Notes26.html",
      "url": "https://depts.washington.edu/silkroad/texts/hhshu/notes26.html",
      "domain": "depts.washington.edu",
      "type": "citation"
    },
    {
      "text": "41846503 Tumu Crisis And The Weakness Of The Military System Of Ming Dynasty",
      "url": "https://www.researchgate.net/publication/41846503_Tumu_Crisis_and_the_Weakness_of_the_Military_System_of_Ming_Dynasty",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "02549948.2023.2263277",
      "url": "https://www.tandfonline.com/doi/abs/10.1080/02549948.2023.2263277",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "The Great Wall As Perilous Frontier For The Mongols In 16th Century Reconsidering Nomadic Sedentary Relations In Premodern Inner Asia",
      "url": "https://www.academia.edu/48816424/The_Great_Wall_as_Perilous_Frontier_for_the_Mongols_in_16th_Century_Reconsidering_Nomadic_Sedentary_Relations_in_Premodern_Inner_Asia",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "The Ming Dynasty.htm",
      "url": "https://www.chinahighlights.com/travelguide/china-history/the-ming-dynasty.htm",
      "domain": "chinahighlights.com",
      "type": "citation"
    },
    {
      "text": "J.ctv2hvfj32",
      "url": "https://www.jstor.org/stable/j.ctv2hvfj32",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Loss Of Great Wall Brick By Brick",
      "url": "https://u.osu.edu/mclc/2015/06/30/loss-of-great-wall-brick-by-brick/",
      "domain": "u.osu.edu",
      "type": "citation"
    },
    {
      "text": "Great Wall Of China Check Who Built It Signficance And Key Details 1860000098",
      "url": "https://www.jagranjosh.com/us/explainers/great-wall-of-china-check-who-built-it-signficance-and-key-details-1860000098",
      "domain": "jagranjosh.com",
      "type": "citation"
    },
    {
      "text": "Protection.htm",
      "url": "https://www.chinahighlights.com/greatwall/fact/protection.htm",
      "domain": "chinahighlights.com",
      "type": "citation"
    },
    {
      "text": "7243",
      "url": "https://www.mdpi.com/2071-1050/17/16/7243",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Chinas Great Wall Eaten Away By Mining Idustre79k3ex",
      "url": "https://www.reuters.com/article/lifestyle/chinas-great-wall-eaten-away-by-mining-idUSTRE79K3EX/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/earth-science/articles/10.3389/feart.2023.1146724/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pmc8900695",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8900695/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Climate Change Impact On The Great Wall Of China",
      "url": "https://protectearth.foundation/climate-change-impact-on-the-great-wall-of-china/",
      "domain": "protectearth.foundation",
      "type": "citation"
    },
    {
      "text": "15583058.2025.2487541",
      "url": "https://www.tandfonline.com/doi/full/10.1080/15583058.2025.2487541",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "A8066 Timeline Of Restoration The Great Wall Of China",
      "url": "https://www.re-thinkingthefuture.com/architectural-styles/a8066-timeline-of-restoration-the-great-wall-of-china/",
      "domain": "re-thinkingthefuture.com",
      "type": "citation"
    },
    {
      "text": "162534",
      "url": "https://whc.unesco.org/document/162534",
      "domain": "whc.unesco.org",
      "type": "citation"
    },
    {
      "text": "Ws69033ca8a310f735438b7de1.html",
      "url": "https://global.chinadaily.com.cn/a/202510/30/WS69033ca8a310f735438b7de1.html",
      "domain": "global.chinadaily.com.cn",
      "type": "citation"
    },
    {
      "text": "C90000 20318076.html",
      "url": "https://en.people.cn/n3/2025/0522/c90000-20318076.html",
      "domain": "en.people.cn",
      "type": "citation"
    },
    {
      "text": "375545864 Temporal And Spatial Analysis Of Deformation Monitoring Of The Ming Great Wall In Shanxi Province Through Insar",
      "url": "https://www.researchgate.net/publication/375545864_Temporal_and_Spatial_Analysis_of_Deformation_Monitoring_of_the_Ming_Great_Wall_in_Shanxi_Province_through_InSAR",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Great Wall China Cultural Landscape",
      "url": "https://www.wmf.org/projects/great-wall-china-cultural-landscape",
      "domain": "wmf.org",
      "type": "citation"
    },
    {
      "text": "2b3cba8a9492b737823d5cd4c765b817.pdf",
      "url": "https://www.chinadailyhk.com/upload/main/pdf/2024/10/21/2b3cba8a9492b737823d5cd4c765b817.pdf",
      "domain": "chinadailyhk.com",
      "type": "citation"
    },
    {
      "text": "Is Chinas Great Wall Visible From Space",
      "url": "https://www.scientificamerican.com/article/is-chinas-great-wall-visible-from-space/",
      "domain": "scientificamerican.com",
      "type": "citation"
    },
    {
      "text": "62281main Armstrong Oralhistory.pdf",
      "url": "https://www.nasa.gov/wp-content/uploads/2015/02/62281main_armstrong_oralhistory.pdf",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Great Wall Of China",
      "url": "https://www.thevintagenews.com/2017/12/20/great-wall-of-china/",
      "domain": "thevintagenews.com",
      "type": "citation"
    },
    {
      "text": "No You Cant See The Great Wall Of China From Space",
      "url": "https://www.scientificamerican.com/article/no-you-cant-see-the-great-wall-of-china-from-space/",
      "domain": "scientificamerican.com",
      "type": "citation"
    },
    {
      "text": "Great Wall",
      "url": "https://www.nasa.gov/image-article/great-wall/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Great Wall From Moon",
      "url": "https://www.snopes.com/fact-check/great-wall-from-moon/",
      "domain": "snopes.com",
      "type": "citation"
    },
    {
      "text": "11433",
      "url": "https://svs.gsfc.nasa.gov/11433",
      "domain": "svs.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Great Wall Of China",
      "url": "https://eos.com/landviewer/great-wall-of-china/",
      "domain": "eos.com",
      "type": "citation"
    },
    {
      "text": "S0303243421003378",
      "url": "https://www.sciencedirect.com/science/article/pii/S0303243421003378",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "China Launches New Gaofen 14 Stereo Mapping Satellite",
      "url": "https://spacenews.com/china-launches-new-gaofen-14-stereo-mapping-satellite/",
      "domain": "spacenews.com",
      "type": "citation"
    },
    {
      "text": "Did Great Wall China Work",
      "url": "https://www.livescience.com/did-great-wall-china-work",
      "domain": "livescience.com",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://dash.harvard.edu/bitstreams/7312037d-6a2b-6bd4-e053-0100007fdf3b/download",
      "domain": "dash.harvard.edu",
      "type": "citation"
    },
    {
      "text": "For Truly Great Men Look To This Age Alone",
      "url": "https://chinaheritage.net/journal/for-truly-great-men-look-to-this-age-alone/",
      "domain": "chinaheritage.net",
      "type": "citation"
    },
    {
      "text": "Wbna26063124",
      "url": "https://www.nbcnews.com/id/wbna26063124",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "20080807 Torch Relay Continues Great Wall China Beijing Olympics 2008",
      "url": "https://www.france24.com/en/20080807-torch-relay-continues-great-wall-china-beijing-olympics-2008",
      "domain": "france24.com",
      "type": "citation"
    },
    {
      "text": "New Seven Wonders",
      "url": "https://7wonders.org/new-seven-wonders/",
      "domain": "7wonders.org",
      "type": "citation"
    },
    {
      "text": "Tt0299977",
      "url": "https://www.imdb.com/title/tt0299977/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Ws68e77360a310f735438b409b.html",
      "url": "https://en.chinaculture.org/a/202510/09/WS68e77360a310f735438b409b.html",
      "domain": "en.chinaculture.org",
      "type": "citation"
    },
    {
      "text": "China Surges Ahead Travel Tourism Sector Forecast To Hit A Record 13 7tn This Year",
      "url": "https://wttc.org/news/china-surges-ahead-travel-tourism-sector-forecast-to-hit-a-record-13-7tn-this-year",
      "domain": "wttc.org",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "northern borders",
      "page": "Northern_Borders"
    },
    {
      "text": "Xiongnu",
      "page": "Xiongnu"
    },
    {
      "text": "Mongols",
      "page": "Mongols"
    },
    {
      "text": "3rd century BC",
      "page": "3rd_century_BC"
    },
    {
      "text": "Qin dynasty",
      "page": "Qin_dynasty"
    },
    {
      "text": "Qin Shi Huang",
      "page": "Qin_Shi_Huang"
    },
    {
      "text": "Ming dynasty",
      "page": "Ming_dynasty"
    },
    {
      "text": "Western Zhou",
      "page": "Western_Zhou"
    },
    {
      "text": "Shandong",
      "page": "Shandong"
    },
    {
      "text": "Spring and Autumn period",
      "page": "Spring_and_Autumn_period"
    },
    {
      "text": "Qi",
      "page": "Qi"
    },
    {
      "text": "Yan",
      "page": "Yan"
    },
    {
      "text": "rammed earth",
      "page": "Rammed_earth"
    },
    {
      "text": "Han",
      "page": "Han"
    },
    {
      "text": "Northern Wei",
      "page": "Northern_Wei"
    },
    {
      "text": "Sui",
      "page": "Sui"
    },
    {
      "text": "Jin",
      "page": "Jin"
    },
    {
      "text": "Silk Road",
      "page": "Silk_Road"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "engineering",
      "page": "Engineering"
    },
    {
      "text": "military strategy",
      "page": "Military_strategy"
    },
    {
      "text": "UNESCO",
      "page": "UNESCO"
    },
    {
      "text": "national identity",
      "page": "National_identity"
    },
    {
      "text": "resilience",
      "page": "Resilience"
    },
    {
      "text": "Warring States period",
      "page": "Warring_States_period"
    },
    {
      "text": "long walls",
      "page": "Long_Walls"
    },
    {
      "text": "li",
      "page": "Li"
    },
    {
      "text": "frontier",
      "page": "Frontier"
    },
    {
      "text": "defense",
      "page": "Defense"
    },
    {
      "text": "Sima Qian",
      "page": "Sima_Qian"
    },
    {
      "text": "Records of the Grand Historian",
      "page": "Records_of_the_Grand_Historian"
    },
    {
      "text": "Meng Tian",
      "page": "Meng_Tian"
    },
    {
      "text": "standard Chinese",
      "page": "Standard_Chinese"
    },
    {
      "text": "Han dynasty",
      "page": "Han_dynasty"
    },
    {
      "text": "Chinese wall",
      "page": "Chinese_wall"
    },
    {
      "text": "early modern period",
      "page": "Early_modern_period"
    },
    {
      "text": "19th century",
      "page": "19th_century"
    },
    {
      "text": "tradition",
      "page": "Tradition"
    },
    {
      "text": "Qi",
      "page": "QI"
    },
    {
      "text": "Qin",
      "page": "Qin"
    },
    {
      "text": "Liaodong Peninsula",
      "page": "Liaodong_Peninsula"
    },
    {
      "text": "Gansu",
      "page": "Gansu"
    },
    {
      "text": "Xinjiang",
      "page": "Xinjiang"
    },
    {
      "text": "Wu",
      "page": "Wu"
    },
    {
      "text": "gravel",
      "page": "Gravel"
    },
    {
      "text": "Beacon towers",
      "page": "Beacon_Towers"
    },
    {
      "text": "Tang Dynasty",
      "page": "Tang_dynasty"
    },
    {
      "text": "Song Dynasty",
      "page": "Song_dynasty"
    },
    {
      "text": "Liao Dynasty",
      "page": "Liao_dynasty"
    },
    {
      "text": "Hongwu Emperor",
      "page": "Hongwu_Emperor"
    },
    {
      "text": "Yuan",
      "page": "Yuan"
    },
    {
      "text": "Yongle Emperor",
      "page": "Yongle_Emperor"
    },
    {
      "text": "Beijing",
      "page": "Beijing"
    },
    {
      "text": "Ming Great Wall",
      "page": "Ming_Great_Wall"
    },
    {
      "text": "military",
      "page": "Military"
    },
    {
      "text": "garrison",
      "page": "Garrison"
    },
    {
      "text": "land reclamation",
      "page": "Land_reclamation"
    },
    {
      "text": "Shanhai Pass",
      "page": "Shanhai_Pass"
    },
    {
      "text": "Jiayu Pass",
      "page": "Jiayu_Pass"
    },
    {
      "text": "16th century",
      "page": "16th_century"
    },
    {
      "text": "Qing dynasty",
      "page": "Qing_dynasty"
    },
    {
      "text": "border barrier",
      "page": "Border_barrier"
    },
    {
      "text": "1909",
      "page": "1909"
    },
    {
      "text": "rail",
      "page": "Rail"
    },
    {
      "text": "terrain",
      "page": "Terrain"
    },
    {
      "text": "People's Republic of China",
      "page": "People's_Republic_of_China"
    },
    {
      "text": "Badaling",
      "page": "Badaling"
    },
    {
      "text": "Cultural Revolution",
      "page": "Cultural_Revolution"
    },
    {
      "text": "Ningxia",
      "page": "Ningxia"
    },
    {
      "text": "national treasure",
      "page": "National_treasure"
    },
    {
      "text": "cultural heritage",
      "page": "Cultural_Heritage"
    },
    {
      "text": "remote sensing",
      "page": "Remote_sensing"
    },
    {
      "text": "The Travels of Marco Polo",
      "page": "The_Travels_of_Marco_Polo"
    },
    {
      "text": "Yuan dynasty",
      "page": "Yuan_dynasty"
    },
    {
      "text": "Matteo Ricci",
      "page": "Matteo_Ricci"
    },
    {
      "text": "European",
      "page": "European"
    },
    {
      "text": "Macartney Embassy",
      "page": "Macartney_Embassy"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "Hadrian's Wall",
      "page": "Hadrian's_Wall"
    },
    {
      "text": "paranoia",
      "page": "Paranoia"
    },
    {
      "text": "Bohai Sea",
      "page": "Bohai_Sea"
    },
    {
      "text": "Hebei",
      "page": "Hebei"
    },
    {
      "text": "Gobi Desert",
      "page": "Gobi_Desert"
    },
    {
      "text": "Liaoning",
      "page": "Liaoning"
    },
    {
      "text": "Tianjin",
      "page": "Tianjin"
    },
    {
      "text": "Shanxi",
      "page": "Shanxi"
    },
    {
      "text": "Inner Mongolia",
      "page": "Inner_Mongolia"
    },
    {
      "text": "Shaanxi",
      "page": "Shaanxi"
    },
    {
      "text": "Cultural Heritage",
      "page": "Cultural_heritage"
    },
    {
      "text": "Yellow River",
      "page": "Yellow_River"
    },
    {
      "text": "topography",
      "page": "Topography"
    },
    {
      "text": "environmental degradation",
      "page": "Environmental_degradation"
    },
    {
      "text": "Dunhuang",
      "page": "Dunhuang"
    },
    {
      "text": "Hexi Corridor",
      "page": "Hexi_Corridor"
    },
    {
      "text": "Lop Nur",
      "page": "Lop_Nur"
    },
    {
      "text": "Jiuquan",
      "page": "Jiuquan"
    },
    {
      "text": "satellite imagery",
      "page": "Satellite_imagery"
    },
    {
      "text": "Juyong Pass",
      "page": "Juyong_Pass"
    },
    {
      "text": "logistics",
      "page": "Logistics"
    },
    {
      "text": "durability",
      "page": "Durability"
    },
    {
      "text": "erosion",
      "page": "Erosion"
    },
    {
      "text": "sticky rice mortar",
      "page": "Sticky_rice_mortar"
    },
    {
      "text": "mixture",
      "page": "Mixture"
    },
    {
      "text": "glutinous rice",
      "page": "Glutinous_rice"
    },
    {
      "text": "egg white",
      "page": "Egg_white"
    },
    {
      "text": "tung oil",
      "page": "Tung_oil"
    },
    {
      "text": "calcite",
      "page": "Calcite"
    },
    {
      "text": "corvée",
      "page": "Corvée"
    },
    {
      "text": "operational efficiency",
      "page": "Operational_efficiency"
    },
    {
      "text": "height",
      "page": "Height"
    },
    {
      "text": "artillery",
      "page": "Artillery"
    },
    {
      "text": "brick",
      "page": "Brick"
    },
    {
      "text": "parapet",
      "page": "Parapet"
    },
    {
      "text": "barracks",
      "page": "Barracks"
    },
    {
      "text": "smoke",
      "page": "Smoke"
    },
    {
      "text": "city gate",
      "page": "City_gate"
    },
    {
      "text": "surveillance",
      "page": "Surveillance"
    },
    {
      "text": "cavalry",
      "page": "Cavalry"
    },
    {
      "text": "valley",
      "page": "Valley"
    },
    {
      "text": "marble",
      "page": "Marble"
    },
    {
      "text": "fortification",
      "page": "Fortification"
    },
    {
      "text": "wei",
      "page": "Wei"
    },
    {
      "text": "border control",
      "page": "Border_control"
    },
    {
      "text": "Jushi kingdom",
      "page": "Jushi_Kingdom"
    },
    {
      "text": "Turpan",
      "page": "Turpan"
    },
    {
      "text": "Esen Taishi",
      "page": "Esen_Taishi"
    },
    {
      "text": "Wu Sangui",
      "page": "Wu_Sangui"
    },
    {
      "text": "Shanhai Pass",
      "page": "Shanhai Pass"
    },
    {
      "text": "integrity",
      "page": "Integrity"
    },
    {
      "text": "wind",
      "page": "Wind"
    },
    {
      "text": "rain",
      "page": "Rain"
    },
    {
      "text": "masonry",
      "page": "Masonry"
    },
    {
      "text": "loess",
      "page": "Loess"
    },
    {
      "text": "water",
      "page": "Water"
    },
    {
      "text": "weathering",
      "page": "Weathering"
    },
    {
      "text": "collapse",
      "page": "Collapse"
    },
    {
      "text": "damage",
      "page": "Damage"
    },
    {
      "text": "construction",
      "page": "Construction"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "1950s",
      "page": "1950s"
    },
    {
      "text": "precipitation",
      "page": "Precipitation"
    },
    {
      "text": "desertification",
      "page": "Desertification"
    },
    {
      "text": "conservation",
      "page": "Conservation"
    },
    {
      "text": "Chinese Academy of Sciences",
      "page": "Chinese_Academy_of_Sciences"
    },
    {
      "text": "Mutianyu",
      "page": "Mutianyu"
    },
    {
      "text": "Five-Year Plan",
      "page": "Five-year_plan"
    },
    {
      "text": "AI",
      "page": "Ai"
    },
    {
      "text": "3D scanning",
      "page": "3D_scanning"
    },
    {
      "text": "World Monuments Fund",
      "page": "World_Monuments_Fund"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "Moon",
      "page": "Moon"
    },
    {
      "text": "naked eye",
      "page": "Naked_eye"
    },
    {
      "text": "human eye",
      "page": "Human_eye"
    },
    {
      "text": "Space Age",
      "page": "Space_Age"
    },
    {
      "text": "Neil Armstrong",
      "page": "Neil_Armstrong"
    },
    {
      "text": "NASA",
      "page": "NASA"
    },
    {
      "text": "oral history",
      "page": "Oral_history"
    },
    {
      "text": "cislunar",
      "page": "Cis-Lunar"
    },
    {
      "text": "space",
      "page": "Space"
    },
    {
      "text": "Earth",
      "page": "Earth"
    },
    {
      "text": "Alan Bean",
      "page": "Alan_Bean"
    },
    {
      "text": "myth",
      "page": "Myth"
    },
    {
      "text": "lunar distance",
      "page": "Lunar_distance"
    },
    {
      "text": "1970s",
      "page": "1970s"
    },
    {
      "text": "popular culture",
      "page": "Popular_culture"
    },
    {
      "text": "tourism",
      "page": "Tourism"
    },
    {
      "text": "symbol",
      "page": "Symbol"
    },
    {
      "text": "Snopes",
      "page": "Snopes"
    },
    {
      "text": "visibility",
      "page": "Visibility"
    },
    {
      "text": "International Space Station",
      "page": "International_Space_Station"
    },
    {
      "text": "Leroy Chiao",
      "page": "Leroy_Chiao"
    },
    {
      "text": "inception",
      "page": "Inception"
    },
    {
      "text": "1972",
      "page": "1972"
    },
    {
      "text": "Google Earth",
      "page": "Google_Earth"
    },
    {
      "text": "interferometric synthetic aperture radar",
      "page": "Interferometric_synthetic-aperture_radar"
    },
    {
      "text": "TerraSAR-X",
      "page": "TerraSAR-X"
    },
    {
      "text": "subsidence",
      "page": "Subsidence"
    },
    {
      "text": "analysis",
      "page": "Analysis"
    },
    {
      "text": "imagery",
      "page": "Imagery"
    },
    {
      "text": "Gaofen",
      "page": "Gaofen"
    },
    {
      "text": "satellite constellation",
      "page": "Satellite_constellation"
    },
    {
      "text": "monitoring",
      "page": "Monitoring"
    },
    {
      "text": "mapping",
      "page": "Mapping"
    },
    {
      "text": "heritage",
      "page": "Heritage"
    },
    {
      "text": "infrared",
      "page": "Infrared"
    },
    {
      "text": "Chinese culture",
      "page": "Chinese_culture"
    },
    {
      "text": "unity",
      "page": "unity"
    },
    {
      "text": "Mao Zedong",
      "page": "Mao_Zedong"
    },
    {
      "text": "Snow",
      "page": "Snow"
    },
    {
      "text": "propaganda",
      "page": "Propaganda"
    },
    {
      "text": "territorial integrity",
      "page": "Territorial_integrity"
    },
    {
      "text": "toboggan",
      "page": "Toboggan"
    },
    {
      "text": "US",
      "page": "United_States"
    },
    {
      "text": "graffiti",
      "page": "Graffiti"
    },
    {
      "text": "environmental protection",
      "page": "Environmental_protection"
    },
    {
      "text": "Jinshanling",
      "page": "Jinshanling"
    }
  ],
  "fetched_at": "2025-12-07T07:27:50.613634",
  "elapsed_ms": 823550
}