{
  "topic": "Intelligence",
  "title": "Intelligence",
  "slug": "intelligence",
  "grokipedia_slug": "Intelligence",
  "grokipedia_url": "https://grokipedia.com/page/Intelligence",
  "source": "grokipedia",
  "content": "# Intelligence\n\nIntelligence is the mental capacity to learn from experience, adapt to novel environments, reason abstractly, solve problems, and comprehend complex ideas, enabling effective goal-directed behavior across species. In psychological research, it is often operationalized through the general factor of intelligence (**g**), a statistically derived construct identified by Charles Spearman in 1904 via factor analysis, which explains the positive correlations among diverse cognitive abilities and predicts performance in educational, occupational, and life outcomes. Standardized intelligence quotient (**IQ**) tests, such as the Wechsler Adult Intelligence Scale, reliably measure **g** with high test-retest reliability (typically \\u003e0.9) and predictive validity for real-world achievements, though they do not capture all facets like creativity or social skills.\n\nEmpirical studies, particularly twin and adoption research, demonstrate that individual differences in intelligence are substantially heritable, with estimates rising from about 20-40% in childhood to 50-80% in adulthood, indicating a strong genetic influence modulated by environmental factors.  Neurologically, intelligence correlates with brain volume, neural efficiency, and white matter integrity, supporting a biological basis rooted in evolutionary adaptations for survival and reproduction. Animal intelligence, evident in tool use by primates and corvids or problem-solving in octopuses, shares homologous traits with human cognition but lacks the abstract reasoning depth enabled by human prefrontal cortex development.\n\nKey controversies surround the **g** factor's primacy versus theories positing multiple intelligences (e.g., emotional or practical), though meta-analyses affirm **g**'s superior explanatory power; debates also persist over average group differences in IQ across sexes, socioeconomic classes, and populations, which empirical data show are partly heritable yet influenced by gene-environment interactions, challenging purely environmental explanations.  These findings underscore intelligence's causal role in societal outcomes, from innovation to inequality, while highlighting biases in institutional narratives that often underemphasize genetic components due to ideological pressures.\n\n## Conceptual Foundations\n\n### Etymology and Historical Perspectives\n\nThe term \"intelligence\" derives from the Latin *intelligentia* or *intellegentia*, denoting \"understanding\" or \"comprehension,\" which stems from the verb *intelligere*, a compound of *inter-* (\"between\") and *legere* (\"to choose,\" \"gather,\" or \"read\"), implying the ability to discern or select among options. This etymological root emphasizes selective perception and cognitive discrimination, entering English in the late 14th century via Old French *intelligence*, initially referring to the faculty of grasping general truths or rational insight. By the 15th century, it encompassed both the capacity for knowledge and news-gathering, though the modern sense of mental acuity solidified in the 16th century.\n\nIn ancient Greek philosophy, concepts akin to intelligence centered on rational faculties like *nous* (intellect or mind) and *phronesis* (practical wisdom), predating the Latin term. Plato, in works such as *The Republic* (c. 380 BCE), portrayed intelligence as an innate quality distinguishing philosophical guardians from other classes, tied to the soul's rational part apprehending eternal Forms through dialectic. Aristotle, in *De Anima* (c. 350 BCE), differentiated *nous poietikos* (active intellect) as an immaterial, divine-like capacity for abstract thought and first principles, enabling universal comprehension beyond sensory perception, while linking it empirically to biological functions like perception. These views framed intelligence as hierarchical, with human reason elevating above animal instinct, influencing later essentialist notions of cognition.\n\nMedieval scholasticism integrated Aristotelian intellect with Christian theology, viewing intelligence as the intellectus or *ratio*—a God-given capacity for abstracting universals from particulars, as elaborated by Thomas Aquinas in *Summa Theologica* (1265–1274), where it manifests in *agent intellect* illuminating phantasms for judgment. Debates on mental representation, from Avicenna's influence to 12th-century theories, emphasized species intelligibiles (intelligible forms) as intermediaries for understanding, prioritizing syllogistic logic over empirical induction.\n\nDuring the Enlightenment (17th–18th centuries), intelligence evolved toward empiricism and innate ideas, with Descartes positing it as *cogitatio* (thinking substance) in *Meditations* (1641), distinct from extension, while Locke in *An Essay Concerning Human Understanding* (1689) rejected innate principles, attributing it to sensory experience and reflection. Kant, in *Critique of Pure Reason* (1781), synthesized these by defining intelligence via synthetic a priori judgments, enabling causal inference and moral autonomy, thus framing it as humanity's defining trait amid mechanistic views of nature. This period shifted focus from divine endowment to secular, faculty-based reason, setting groundwork for 19th-century psychometric quantification.\n\n### Psychological Definitions and the g-Factor\n\nIn psychology, intelligence is defined as the ability to derive information, learn from experience, adapt to the environment, understand complex ideas, and correctly utilize thought and reason to solve problems. This conceptualization emphasizes cognitive processes that enable individuals to handle novel situations, abstract reasoning, and goal-directed behavior, distinguishing it from domain-specific skills or mere knowledge accumulation. Empirical assessments, such as standardized tests, operationalize these abilities through performance on tasks involving verbal comprehension, perceptual reasoning, working memory, and processing speed.\n\nA central construct in psychometric theory is the *g*-factor, or general intelligence, first identified by Charles Spearman in 1904 via factor analysis of correlations among diverse cognitive tests. Spearman observed a \"positive manifold\"—consistent positive correlations between tests of seemingly unrelated abilities, such as sensory discrimination, word knowledge, and mathematical reasoning—which could not be explained by task-specific factors alone. He proposed a two-factor theory: a general factor (*g*) common to all intellectual tasks, plus specific factors (*s*) unique to each. The *g*-factor emerges as the highest-loading component in hierarchical factor models, representing shared variance across cognitive domains.\n\nThe *g*-factor typically accounts for 40-50% of the variance in scores on comprehensive IQ batteries, with the remainder attributable to group factors (e.g., verbal or spatial) and error. Its existence is substantiated by the positive manifold persisting across cultures, ages, and test types, as well as its extraction via principal components or maximum likelihood methods in large datasets. Predictive validity further supports *g*: it correlates more strongly with academic achievement (r ≈ 0.5-0.7), job performance (r ≈ 0.5), and socioeconomic outcomes than do narrower abilities, even after controlling for specific factors. For instance, meta-analyses show *g*-loaded tests outperform non-*g* measures in forecasting training success and income, underscoring its causal role in real-world adaptation.\n\nWhile alternative theories, such as multiple intelligences, propose independent modules, empirical factor analyses consistently recover *g* as the dominant higher-order factor, explaining why *g*-saturated tests (e.g., Raven's Progressive Matrices) generalize across domains better than specialized assessments. This robustness holds despite measurement challenges, as *g* loadings correlate with neural efficiency and reaction times, linking psychometric *g* to biological processes.\n\n### Operationalization and Core Components\n\nIntelligence is operationalized in psychological research primarily through standardized psychometric tests designed to quantify cognitive abilities, with performance expressed as deviation scores relative to age-matched norms, such as the intelligence quotient (IQ) derived from batteries like the Wechsler Adult Intelligence Scale (WAIS). This approach translates the abstract construct of intelligence into observable behaviors, including response accuracy and speed on tasks involving reasoning, memory, and problem-solving, enabling empirical prediction of real-world outcomes like academic and occupational success. Operationalization emphasizes reliability across diverse populations and contexts, though debates persist on whether test scores fully capture underlying causal mechanisms or merely proxy them.\n\nAt its core, human intelligence is hierarchically structured, with the general factor (g) representing the dominant shared variance across cognitive tasks, accounting for approximately 40-50% of individual differences in test performance and outperforming specific abilities in predictive validity for complex criteria. Empirical factor analyses of large datasets consistently reveal g as a second-order factor emerging from positive manifold correlations among diverse mental tests, reflecting efficient neural processing and biological constraints rather than mere statistical artifact. Subordinate to g are broad abilities delineated in the Cattell-Horn-Carroll (CHC) theory, an empirically derived taxonomy integrating fluid-crystallized distinctions with psychometric evidence from over a century of test data.\n\nKey broad components in CHC include:\n\n- **Fluid reasoning (Gf)**: Capacity for novel problem-solving, pattern recognition, and inductive/deductive inference without reliance on prior knowledge, peaking in early adulthood and declining with age.\n- **Crystallized knowledge (Gc)**: Accumulated verbal and cultural information, vocabulary, and comprehension, which increases with education and experience.\n- **Short-term memory (Gsm)**: Ability to hold and manipulate information in working memory over brief periods, foundational for learning and executive function.\n- **Visual-spatial processing (Gv)**: Skills in perceiving, manipulating, and reasoning with visual patterns and spatial relations.\n- **Processing speed (Gs)**: Efficiency in executing simple cognitive operations under time constraints, correlating with neural conduction velocity.\n\nNarrower abilities, such as auditory processing (Ga) and long-term retrieval (Glr), further differentiate performance but load substantially on g, underscoring its primacy; CHC's structure has been validated through cross-battery assessments and structural equation modeling, unifying prior models while prioritizing data over theoretical fiat. This operational framework facilitates causal inference by linking components to neurobiological substrates, though environmental confounds must be controlled to isolate innate variance.\n\n## Measurement of Intelligence\n\n### Intelligence Quotient (IQ) and Psychometrics\n\nThe intelligence quotient (IQ) is a score derived from standardized tests designed to assess cognitive abilities, particularly those reflecting general intelligence, or *g*. These tests evaluate performance across domains such as verbal comprehension, perceptual reasoning, working memory, and processing speed, yielding a composite score that correlates strongly with *g*, the common factor underlying diverse mental tasks identified through factor analysis. Psychometrics, the scientific discipline of psychological measurement, underpins IQ testing by ensuring instruments are reliable, valid, and normed against representative populations.\n\nThe origins of IQ trace to 1905, when French psychologists Alfred Binet and Théodore Simon created the Binet-Simon scale to identify schoolchildren requiring remedial education, focusing on tasks approximating age-typical mental development. In 1912, German psychologist William Stern formalized the IQ concept as a ratio: (mental age / chronological age) × 100, enabling age-independent comparisons. American psychologist Lewis Terman adapted and standardized the Binet-Simon test as the Stanford-Binet Intelligence Scale in 1916, introducing widespread use in the United States and establishing IQ as a metric for intellectual classification. David Wechsler advanced the field in 1939 with the Wechsler-Bellevue Intelligence Scale for adults, emphasizing deviation scoring over ratio IQ to address limitations in older methods, such as ceiling effects in high-ability individuals.\n\nContemporary IQ tests, including the Wechsler Adult Intelligence Scale (WAIS-IV, revised 2008) and Stanford-Binet 5 (2003), employ deviation scoring: raw scores are converted to a normal distribution with a population mean of 100 and standard deviation of 15, based on stratified normative samples stratified by age, sex, race, and geography. This yields scores where approximately 68% of the population falls between 85 and 115, and 95% between 70 and 130. Psychometric rigor is evident in high internal consistency (Cronbach's α \\u003e 0.90) and test-retest reliability (r \\u003e 0.90 over 1-2 years), minimizing measurement error. Validity is substantiated by strong correlations with *g* (loadings 0.60-0.80), as well as predictive power for academic achievement (r ≈ 0.50-0.70), job performance (r ≈ 0.50-0.60), and socioeconomic outcomes, outperforming non-cognitive measures.\n\nFactor analysis reveals the positive manifold—correlations among diverse cognitive tasks—driving *g*'s centrality in psychometrics, with IQ tests serving as proxies due to their saturation with this factor. Standardization processes, updated periodically (e.g., every 10-15 years), account for cohort effects like the Flynn effect, though *g*-loaded subtests show greater stability across re-normings. Despite critiques of cultural bias, meta-analyses confirm differential validity holds across groups when *g* is controlled, underscoring the tests' robustness for individual assessment.\n\n### Validity, Reliability, and Predictive Power\n\nIntelligence tests demonstrate high reliability, with test-retest correlations often exceeding 0.90 for short-term retesting and remaining substantial (around 0.70-0.80) over intervals of several years to decades, as evidenced by meta-analyses aggregating thousands of participants across longitudinal studies. Internal consistency reliabilities for major IQ batteries, such as the Wechsler Adult Intelligence Scale, typically range from 0.90 to 0.98 across subtests and composites. These metrics indicate consistent measurement of stable traits, though minor fluctuations can occur due to factors like motivation or health, underscoring the need for standardized administration to minimize error variance.\n\nThe validity of intelligence tests is supported by their alignment with the general intelligence factor (*g*), which emerges robustly from factor analyses of diverse cognitive tasks, accounting for 40-50% of variance in individual differences across test batteries. This *g* factor exhibits convergent validity with real-world cognitive demands, outperforming narrower abilities in explaining performance on novel tasks, and shows predictive superiority over alternative constructs like multiple intelligences in empirical tests. Criterion-related validity is affirmed by correlations with educational achievement (r ≈ 0.50-0.60) and occupational attainment, where *g*-loaded scores consistently forecast outcomes better than socioeconomic status alone, though critics note potential cultural loading in test items that may attenuate validity in diverse populations without undermining the core *g* structure.\n\nPredictive power of IQ scores extends to multiple life domains, with meta-analyses confirming moderate to strong associations: job performance correlations average 0.51 (uncorrected for range restriction and measurement error), rising to 0.65 when adjusted, establishing cognitive ability as the strongest single predictor in personnel selection. For socioeconomic outcomes, childhood IQ predicts adult income (r ≈ 0.27-0.40) and educational attainment more effectively than parental SES in many cohorts, with effects persisting after controlling for family background. Health and longevity correlations are also notable, as lower IQ in early life elevates risks for physical and mental illnesses (odds ratios up to 2-3 for severe outcomes), contributing to reduced lifespan expectancy independent of behavioral confounders. These relations hold across large-scale, longitudinal datasets, though incremental validity alongside non-cognitive factors like conscientiousness can enhance predictions by 10-20%.\n\n### Critiques of Alternative Measures\n\nHoward Gardner's theory of multiple intelligences proposes eight or more relatively autonomous cognitive abilities, including linguistic, logical-mathematical, spatial, musical, bodily-kinesthetic, interpersonal, intrapersonal, and naturalistic intelligences, as alternatives to a unitary general intelligence. Empirical critiques highlight that factor-analytic studies of cognitive abilities consistently identify a dominant general factor (g) explaining 40-50% of variance in performance across diverse tasks, rather than independent modules as Gardner claims. No robust evidence from psychometric or neuroimaging data supports distinct neural substrates for these intelligences; instead, they often overlap with g-loaded skills or personality traits, rendering the theory more descriptive of talents than explanatory of intelligence structure. Gardner's framework has been characterized as a neuromyth due to its persistence in education despite lacking falsifiable predictions or superior explanatory power over g-based models.\n\nEmotional intelligence (EI), as defined in ability models by Mayer and Salovey and popularized in mixed models by Daniel Goleman, seeks to assess skills in perceiving, facilitating, understanding, and regulating emotions to enhance cognitive processes. Critiques of EI measures, including the Mayer-Salovey-Caruso Emotional Intelligence Test (MSCEIT), emphasize their suboptimal psychometric properties, such as low internal consistency (Cronbach's alpha often below 0.70 for subscales) and limited test-retest reliability. Ability-based EI shows weak incremental validity in predicting outcomes like job performance or academic success after controlling for g and the Big Five personality traits, with meta-analyses reporting correlations of 0.10-0.20 that diminish under rigorous controls. Self-report EI variants fare worse, exhibiting susceptibility to social desirability bias and substantial overlap (r \\u003e 0.50) with traits like agreeableness and conscientiousness, failing to capture a unique emotional processing construct independent of general cognitive ability.\n\nRobert Sternberg's triarchic theory posits analytical, creative, and practical intelligences as subcomponents shaping adaptation to environments, with practical intelligence emphasizing tacit knowledge for real-world success. Empirical evaluations reveal that practical intelligence tasks, such as those in the Sternberg Triarchic Abilities Test, correlate highly (r = 0.60-0.80) with g-loaded measures, suggesting they reflect crystallized intelligence rather than a distinct adaptive faculty. Longitudinal studies find no evidence that triarchic components outperform g in forecasting criteria like income or leadership efficacy, and the theory's broader claims lack cross-cultural replicability, with practical skills varying more by opportunity than innate modularity. Gottfredson's analysis dissects practical intelligence as repackaged g plus domain-specific experience, unsupported by differential subgroup predictions absent in g research.\n\nCollectively, these alternatives underperform g in predictive validity for consequential outcomes, including educational attainment (g accounts for ~25% variance), occupational attainment (~20%), and even health metrics, per meta-analyses spanning decades. Mathematical constraints on test design preclude alternatives from yielding higher validity without introducing adverse impact disparities mirroring those in g, as subgroup differences in cognitive demands persist across domains. While proponents argue for contextual breadth, the absence of convergent validity—correlations among alternative measures rarely exceed 0.30—undermines their coherence as viable substitutes, reinforcing g's centrality derived from first-order factor analysis of over 100 years of data.\n\n## Biological Underpinnings\n\n### Genetic Heritability and Polygenic Influences\n\nBehavioral genetic studies, including twin and adoption research, indicate that genetic factors account for approximately 50% of the variance in intelligence among adults, with estimates rising to 60-80% in later adulthood. These figures derive from comparisons of monozygotic twins reared apart or together, which show intraclass correlations of 0.70-0.80 for IQ, substantially exceeding those for dizygotic twins (0.40-0.50) or adoptive siblings (near 0.00 in adulthood). Adoption studies further support this by demonstrating that IQ similarity between biological relatives persists despite separate environments, while shared adoptive environments contribute minimally to adult outcomes (less than 10% variance).\n\nHeritability of intelligence increases linearly across the lifespan, a pattern termed the Wilson effect. In infancy, estimates hover around 20%, climbing to 40-50% in childhood and adolescence, and stabilizing at about 80% by ages 18-20, where it remains into mid-adulthood before a modest decline after age 80. This trend reflects diminishing shared environmental influences (from ~30% in childhood to near 0% in adults) and amplifying genetic effects as individuals select environments correlated with their genotypes. Such patterns hold across Western populations but may vary in non-industrialized settings with greater environmental adversity.\n\nAt the molecular level, intelligence exhibits a polygenic architecture, influenced by thousands of genetic variants each contributing minuscule effects (typically \\u003c0.02% variance per locus). Genome-wide association studies (GWAS), such as the 2018 analysis by Savage et al. involving over 280,000 participants, have identified hundreds of single-nucleotide polymorphisms (SNPs) associated with cognitive performance. Polygenic scores aggregating these SNPs predict 6% of IQ variance in independent samples, per a 2024 meta-analysis of 452,864 individuals, with correlations between scores and phenotypic IQ averaging 0.245. These predictions, while lower than twin-based heritability due to incomplete variant capture in current GWAS, confirm the additive polygenic basis and forecast improvements with larger genomic datasets exceeding 1 million samples.\n\n### Neuroanatomy and Brain Size Correlates\n\nStudies utilizing magnetic resonance imaging (MRI) have identified consistent positive associations between overall brain volume and measures of general intelligence (g), with meta-analyses reporting correlations typically ranging from r = 0.24 to r = 0.33 across diverse samples of healthy individuals. These estimates derive from aggregating data from over 100 studies involving thousands of participants, controlling for factors such as age and sex, and indicate that larger brain volume accounts for approximately 6-10% of variance in IQ scores. The correlation appears robust across developmental stages, though it may be moderated by measurement quality of intelligence tests and sample characteristics, with stronger effects observed in adults compared to children.\n\nRegionally, greater gray matter volume in the prefrontal cortex correlates positively with higher intelligence, particularly in domains involving executive function and working memory, as evidenced by voxel-based morphometry analyses in healthy adults. Parietal lobe volumes, especially in the superior parietal regions, also show significant positive associations with g, supporting the parieto-frontal integration theory of intelligence, which posits that efficient information processing relies on interconnected frontal and parietal networks. Temporal lobe structures, including the hippocampus, exhibit weaker but positive correlations with verbal and memory-related cognitive abilities. Subcortical regions such as the basal ganglia demonstrate links to cognitive performance, with larger volumes predicting better executive control in young adults.\n\nWhite matter microstructure, assessed via diffusion tensor imaging (DTI), further correlates with intelligence through metrics like fractional anisotropy (FA), which reflect axonal integrity and myelination efficiency. Higher FA in major tracts, including the corpus callosum and superior longitudinal fasciculus, predicts faster information processing speed and higher g-factor scores, explaining up to 20-30% of variance in cognitive tasks among older adults. A general factor of white matter integrity across multiple tracts has been identified as a predictor of processing speed, underscoring the role of neural connectivity in supporting intelligent behavior beyond mere volumetric measures. These associations hold after adjusting for total brain volume, suggesting that organizational efficiency contributes independently to cognitive variance.\n\n### Evolutionary Origins\n\nThe evolutionary origins of intelligence trace to adaptations enhancing survival in variable environments, with precursors evident in non-human primates through behaviors such as tool use and social maneuvering. Primates exhibit elevated encephalization quotients (EQ), a measure of brain size relative to body mass, with humans achieving the highest at 7.4–7.8, indicating brains seven to eight times larger than expected for mammals of equivalent size. This relative enlargement correlates with cognitive capacities for problem-solving and planning, as seen in corvids and cephalopods, but intensified in primates via natural selection for extracting resources from complex ecologies.\n\nIn the human lineage, brain volume expanded markedly over approximately six million years, from around 350–400 cm³ in early hominins sharing ancestry with chimpanzees to over 1,300 cm³ in Homo sapiens by 200,000 years ago. This tripling or quadrupling in size coincided with innovations like bipedalism, which freed hands for manipulation, and controlled fire use around 1 million years ago, enabling cooked food that supported higher metabolic demands of larger brains consuming up to 20% of basal energy. Selective pressures likely included climatic instability during the Pleistocene, favoring foresight and adaptability, alongside demands for hunting high-value prey requiring coordinated group strategies.\n\nProminent explanations emphasize social and ecological drivers. The social brain hypothesis posits that primate intelligence evolved primarily to navigate intricate group dynamics, with neocortex size predicting maximum group sizes—around 150 for humans—via correlations observed across 38 primate genera. Dunbar's 1998 framework argues this computational load for tracking alliances, deception, and reciprocity outweighed ecological factors alone, though critics note ecological challenges like extractive foraging in patchy habitats also imposed cognitive demands. The ecological intelligence hypothesis revives foraging cognition as central, evidenced by primate specializations in spatial memory and tool innovation for accessing embedded foods, paralleling human reliance on nutrient-dense diets.\n\nThe cognitive niche theory integrates these, proposing intelligence coevolved with sociality and language, enabling cumulative culture that amplified fitness beyond innate traits. This runaway process, where smarter individuals outcompeted via teaching and imitation, explains rapid encephalization despite costs like prolonged immaturity and vulnerability. Genetic analyses of modern variants linked to cognition reveal trade-offs, such as heightened disease susceptibility, underscoring that intelligence's benefits—enhanced prediction and cooperation—prevailed under ancestral pressures but may incur metabolic and immunological burdens. Empirical support derives from fossil endocasts and comparative primatology, though debates persist on precise triggers, with no single factor fully accounting for the leap in Homo.\n\n## Environmental and Developmental Factors\n\n### Prenatal and Early Life Influences\n\nPrenatal nutritional deficiencies exert significant effects on offspring intelligence. Severe maternal iodine deficiency during pregnancy impairs fetal brain development, leading to IQ reductions of approximately 8 to 13 points in affected children, as evidenced by cross-sectional and intervention studies in deficient regions. Even mild to moderate iodine deficiency has been linked to lower verbal IQ and cognitive scores, with a meta-analysis of cohort studies showing deficits persisting into childhood. Broader maternal diet quality also matters; higher-quality diets during pregnancy correlate with improved offspring visual-spatial skills and full-scale IQ in adolescence, potentially through influences on brain morphology. Conversely, pro-inflammatory or Western dietary patterns are associated with reduced verbal IQ and smaller head circumference at birth.\n\nExposure to teratogens prenatally disrupts neurodevelopment. Heavy prenatal alcohol consumption causes fetal alcohol spectrum disorders (FASD), with average IQ scores around 70 for those with fetal alcohol syndrome (FAS) and 80 for non-dysmorphic heavy-exposure cases, alongside deficits in executive function and memory. Maternal smoking during pregnancy is linked to offspring IQ deficits of 2 to 6 points, even after adjusting for socioeconomic status, maternal IQ, and education, based on meta-analyses of cohort studies. These effects likely stem from nicotine's impact on fetal brain oxygenation and neurotransmitter systems, though residual confounding by genetic factors cannot be fully ruled out.\n\nPerinatal factors like low birth weight and preterm birth predict lower intelligence. Very preterm or very low birth weight (\\u003c1500g) infants score 11 to 13 IQ points below term-born peers on average, per meta-analyses of longitudinal data, with associations persisting into adulthood and mediated partly by atypical brain structure. A dose-response gradient exists, where each kilogram increase in birth weight within the normal range correlates with higher IQ, independent of gestational age. Birth complications, including hypoxia, contribute via disrupted neuronal migration and myelination, though much variance is shared with genetic and postnatal confounders.\n\nIn early life, postnatal malnutrition hinders cognitive trajectories. Severe undernutrition in infancy leads to persistent IQ reductions and behavioral issues, with neurodevelopmental deficits traceable to impaired myelination and synaptic pruning, as shown in long-term follow-ups of malnourished cohorts. Interventions improving nutrition in the first two years mitigate some losses, underscoring a critical window for brain growth. Environmental toxins like lead amplify risks; early childhood blood lead levels above 5 μg/dL associate with 2 to 3 IQ point losses per 10 μg/dL increment, per meta-analyses, with population-level exposure from mid-20th-century sources estimated to have reduced U.S. collective IQ by hundreds of millions of points. These effects are causal, supported by dose-response patterns and convergence of animal models with human epidemiology, though low-level exposures show diminishing returns after lead abatement.\n\n### The Flynn Effect and Generational Changes\n\nThe Flynn Effect refers to the substantial rise in average IQ test scores observed across generations in many countries throughout the 20th century, with gains averaging approximately 3 IQ points per decade on standardized tests. This phenomenon was systematically documented by political scientist James Flynn, who in the 1980s reanalyzed historical IQ data from nations including the United States, Britain, and the Netherlands, revealing consistent upward trends that necessitated periodic renorming of tests to maintain a mean score of 100. For instance, U.S. data from the 1930s to the 1970s showed total gains of 15-18 points on Wechsler scales, equivalent to shifting population norms by over one standard deviation.\n\nThese generational increases have been uneven across cognitive domains, with larger gains on measures of fluid intelligence—such as Raven's Progressive Matrices, which assess novel problem-solving—compared to crystallized intelligence involving accumulated knowledge. A meta-analysis of over 200 studies confirmed average annual gains of 0.31 IQ points globally from 1909 to 2013, though rates varied by region and test type, with developing nations showing continued rises into the 21st century while some advanced economies exhibited slowdowns. Evidence from military conscript data in Scandinavia and achievement tests in the U.S. corroborated these patterns, indicating real performance improvements rather than mere test familiarity.\n\nExplanations for the Effect emphasize environmental factors over genetic changes, as twin and adoption studies show smaller within-family IQ gains across cohorts compared to between-family shifts. Proposed causes include improvements in nutrition (e.g., reduced iodine deficiency and better caloric intake), diminished exposure to infectious diseases, extended education emphasizing abstract thinking, and broader cultural shifts toward complexity in media and work environments. Flynn himself argued that gains reflect enhanced habits of scientific reasoning rather than core general intelligence (*g*), as *g*-loadings on tests have not uniformly increased and spatial abilities sometimes declined amid verbal gains. However, critics contend that unaccounted confounders like selective migration or test construction artifacts may inflate apparent rises, and the Effect's multiplier dynamics—where initial gains amplify through social feedback—remain empirically contested.\n\nIn recent decades, evidence of a reversal or \"negative Flynn Effect\" has emerged in several developed nations, with IQ scores stagnating or declining since the 1990s. Norwegian conscript data from 1962-1991 to 1993-2009 revealed a drop of 0.38 points per decade on general ability measures, while similar trends appeared in Denmark, Britain, Finland, and France, affecting multiple cognitive domains including spatial perception.  A systematic review identified declines in nine studies across seven countries, potentially linked to dysgenic fertility (lower-IQ individuals having more children), immigration from lower-scoring regions, or saturation of environmental benefits like nutrition. These reversals challenge assumptions of indefinite progress, suggesting that once basic health and education thresholds are met, countervailing pressures may dominate generational IQ trajectories, though data from less-developed regions continue to show positive gains.\n\n### Socioeconomic and Nutritional Impacts\n\nChildren from higher socioeconomic status (SES) families tend to exhibit IQ scores approximately 10-15 points above those from lower SES families, based on large-scale surveys in the United States and Europe.   However, this correlation is substantially attenuated when controlling for parental IQ, which shares a genetic basis with offspring intelligence and often aligns with SES due to assortative mating and meritocratic selection.  Twin and adoption studies indicate that heritability of IQ rises with SES, from around 0.2-0.4 in low-SES environments to 0.7-0.8 in high-SES ones, suggesting that deprivation in low-SES settings amplifies non-shared environmental variance while high-SES conditions allow genetic factors to predominate.   \n\nAdoption studies further underscore limited causal impact of elevated SES on IQ. In a French sample of children adopted after age 4 into high-SES homes, mean IQ gains were modest (around 12 points relative to pre-adoption estimates) and did not fully close gaps with non-adopted peers, with outcomes more predictive of biological origins than adoptive environment.   Similarly, analyses of international adoptees raised in affluent U.S. families show adult IQs correlating near-zero with adoptive parents' SES but strongly with biological factors, including polygenic scores.   Interventions like Head Start programs yield temporary IQ boosts of 5-10 points that fade by adolescence, implying that SES-related enrichments (e.g., education quality, stimulation) exert small, non-permanent effects overshadowed by genetic endowments. \n\nNutritional factors, particularly early-life deficiencies, exert measurable but domain-specific influences on cognitive development. Severe iodine deficiency during pregnancy and infancy can reduce offspring IQ by 10-15 points, as evidenced by randomized trials in deficient regions where supplementation averted such losses; resurgence in U.S. iodine shortfall since 2010 correlates with subtle cognitive risks.   Iron deficiency anemia in early childhood impairs executive function and overall IQ by 5-10 points, with effects persisting if uncorrected before age 2, per meta-analyses of supplementation trials.  Omega-3 fatty acid deficits, common in low-SES diets, link to reduced neurodevelopmental outcomes, though prenatal supplementation yields inconsistent gains (2-5 points) in randomized studies, primarily benefiting deficient subgroups.   \n\nBroad undernutrition stunts brain growth and myelination, correlating with 8-12 point IQ decrements in cohort studies from famine-affected or impoverished areas, yet catch-up nutrition post-infancy recovers only partial function, highlighting sensitive periods.  Unlike SES proxies, targeted micronutrient interventions demonstrate causal efficacy in averting deficits, but population-level Flynn effect gains (3 points per decade) occur across SES strata, attributing more to aggregate improvements in health and testing familiarity than isolated socioeconomic lifts.  Overall, while low SES often coincides with nutritional shortfalls amplifying mild IQ suppression, genetic confounders and heritability gradients indicate that socioeconomic mobility alone yields negligible long-term cognitive uplift. \n\n## Human Variations and Differences\n\n### Sex Differences in Cognitive Abilities\n\nMales and females exhibit similar average levels of general intelligence, as measured by the g-factor, with meta-analyses consistently finding negligible or no significant mean differences across large samples and diverse cognitive batteries. However, some studies report a small male advantage in g, equivalent to 2-4 IQ points, particularly when using comprehensive test batteries or longitudinal data tracking development from childhood.  These discrepancies may arise from variations in test composition, sample demographics, or measurement of g, but the overall evidence does not support substantial sex-based disparities in mean general cognitive capacity.\n\nA robust finding is greater variability in male cognitive performance, with males showing higher standard deviations in IQ scores across multiple datasets, leading to disproportionate male representation at both the upper and lower tails of the distribution.  For instance, analyses of standardized IQ tests reveal male variance ratios exceeding 1.0 (indicating greater male spread) in general intelligence measures, a pattern observed from childhood through adulthood and consistent with the greater male variability hypothesis. This increased male dispersion explains phenomena such as higher male prevalence among Nobel laureates and individuals with intellectual disabilities, without implying differences in central tendency.\n\nSex differences are more pronounced in specific cognitive domains. Males typically outperform females in visuospatial abilities, such as mental rotation and spatial navigation, with meta-analytic effect sizes ranging from moderate to large (d ≈ 0.5-1.0), persisting across age groups including into the 80s.  Females, conversely, show advantages in verbal fluency, episodic memory, and verbal reasoning, with effect sizes around d = 0.2-0.4, advantages that hold in crystallized intelligence components like vocabulary.  Mathematical reasoning displays a slight male edge in some analyses, particularly in abstract problem-solving, though overlaps are substantial and environmental factors may modulate these patterns.\n\nThese domain-specific differences contribute to the hierarchical structure of intelligence, where g loads similarly across sexes but subfactors diverge, reflecting evolutionary pressures like sexual selection for spatial skills in males and social-verbal competencies in females. Despite academic and media tendencies to minimize such findings—potentially influenced by ideological biases favoring environmental explanations—replication in peer-reviewed meta-analyses underscores their empirical validity, with effect sizes stable over decades. \n\n### Racial and Ethnic Group Differences\n\nAverage IQ scores, as measured by standardized tests, exhibit consistent differences across racial and ethnic groups. East Asians and their descendants score approximately 106, Europeans and their descendants around 100, African Americans about 85, and sub-Saharan Africans around 70. Hispanics in the United States average around 89-93, while Ashkenazi Jews score notably higher at 110-115. These patterns hold in both national and international samples, with differences most pronounced on highly *g*-loaded (general intelligence factor) subtests.\n\nSuch gaps persist after controlling for socioeconomic status (SES), education, and other environmental proxies. For instance, meta-analyses of cognitive ability tests show Black-White differences of about 1 standard deviation (15 points) even among high-SES groups, and adoption studies like the Minnesota Transracial Adoption Study reveal that Black children raised in White middle-class homes still average IQs 10-15 points below White adoptees by adolescence. Within-group heritability of intelligence is moderate to high (0.5-0.8) and does not differ significantly across White, Black, and Hispanic groups, per systematic reviews, undermining claims that lower averages in minority groups stem primarily from restricted environmental variance.\n\nEvidence for a partial genetic basis includes correlations with brain size (East Asians \\u003e Whites \\u003e Blacks) and evolutionary selection pressures differing by ancestral environments, such as colder climates favoring planning and impulse control. Transracial adoption and regression-to-the-mean studies further suggest that about 50-80% of the Black-White gap may be heritable, though exact partitioning remains debated due to unmeasured gene-environment interactions. Critics emphasize environmental factors like prenatal nutrition, lead exposure, and cultural test bias, yet these explain only a fraction of the variance, as gaps have narrowed modestly (e.g., Black-White gap from 1.1 to ~0.9 SD since 1970) despite major SES improvements, without closing.\n\nMainstream academic consensus, influenced by institutional pressures, often attributes differences wholly to environment and rejects genetic inferences, deeming racial categories socially constructed without biological validity for complex traits like IQ. However, genomic data confirm population-level genetic clustering aligns with self-identified races, and polygenic scores for educational attainment (a proxy for IQ) show small but replicable group differences consistent with observed IQ patterns. Polygenic studies remain preliminary, as IQ GWAS explain only ~10-20% of variance, but they do not support zero genetic contribution to group means.\n\n| Group | Average IQ Estimate | Key Sources |\n|-------|---------------------|-------------|\n| East Asians | 106 | Rushton-Jensen (2005); Lynn (various national IQ compilations) |\n| Europeans/Whites | 100 | Standardized norms (e.g., WAIS, WISC) |\n| Hispanics (U.S.) | 89-93 | Roth et al. meta-analysis (2001) |\n| African Americans | 85 | Dickens-Flynn (2006); NAEP trends |\n| Sub-Saharan Africans | 70 | Lynn-Vanhanen global data |\n| Ashkenazi Jews | 110-115 | Cochran et al. (2006) evolutionary hypothesis |\n\n### Within-Population Trends and Dysgenics\n\nA negative correlation between intelligence and fertility has been documented in numerous developed populations, with higher-IQ individuals producing fewer offspring on average, exerting dysgenic pressure on the genotypic basis of cognitive ability. Meta-analyses of studies from the United States, Europe, and other industrialized nations report correlations typically ranging from -0.1 to -0.3, indicating that each standard deviation increase in IQ is associated with approximately 0.1 to 0.2 fewer children per woman. This pattern persists after controlling for socioeconomic status and education, suggesting a direct link between cognitive traits and reproductive output driven by delayed childbearing, career prioritization, and lower desired family size among the more intelligent.\n\nIn the United States, longitudinal data from cohorts born between 1900 and 1950, such as those analyzed in the National Longitudinal Survey of Youth, reveal a genotypic IQ loss of about 0.9 points per generation attributable to this fertility differential, assuming heritability of intelligence around 0.8. European evidence mirrors this, with Scandinavian registries showing completed fertility declining linearly with IQ scores into the 1970s and 1980s, projecting a 0.5 to 1 point IQ drop per generation if unchecked. Globally, cross-national aggregates confirm the trend, with a -0.73 correlation between national IQ means and fertility rates contributing to an estimated worldwide genotypic decline of 0.86 IQ points from 1950 to 2000.\n\nThese dysgenic trends may underlie the reverse Flynn effect observed in several within-population studies since the 1990s, where IQ scores have stagnated or declined by 0.2 to 0.3 points per decade in countries including Norway, Denmark, the United Kingdom, and Finland. A systematic review of 29 datasets from seven nations identified negative Flynn effects in nine studies, with dysgenic fertility posited as a key causal factor alongside potential environmental contributors like immigration or educational dilution. While some analyses attribute reversals primarily to within-family environmental variance rather than selection, the persistent negative IQ-fertility link provides empirical support for genetic deterioration outpacing prior environmental gains in intelligence.\n\nAssortative mating for intelligence, which has strengthened in recent decades, partially offsets dysgenic losses by concentrating high-IQ genes in fewer lineages, but overall reproductive differentials dominate, with low-IQ subgroups (below 85 IQ points) contributing disproportionately to population replacement. Estimates suggest cumulative effects could reduce average genotypic IQ by 5 to 10 points over a century in the absence of policy interventions, though direct genomic selection studies remain limited. Critics of dysgenic interpretations, often from academic institutions, emphasize measurement artifacts or environmental confounders, yet fertility data from unselected population samples consistently affirm the directional pressure against heritable intelligence.\n\n## Intelligence in Non-Human Animals\n\n### General Factor (g) in Animals\n\nPsychometric investigations into the general factor of intelligence (g) in non-human animals apply factor analysis to batteries of cognitive tasks, seeking a common underlying dimension akin to human g that accounts for positive correlations across diverse abilities. Early studies in rodents, such as rats and mice, demonstrated consistent individual differences in learning and reasoning tasks, with principal component analysis revealing a general learning factor explaining approximately 38% of variance in genetically diverse mouse populations across tasks like fear conditioning and spatial navigation. In rats, reasoning ability correlated with performance on multiple cognitive measures and brain size, supported by neuroanatomical and genetic evidence from inbred strains and lesion models.  \n\nEvidence for g extends to primates, where meta-analytic data across 69 species confirmed a general factor derived from ethological observations of cognitive abilities, explaining 61.7% of variance via principal axis factoring. In chimpanzees, factor analysis of 15 tasks yielded a common factor with loadings from 0.24 to 0.54, indicating heritable general intelligence up to 0.74. Dogs also exhibit a hierarchical g, as shown in a 2016 study of 68 border collies performing detour, pointing, and quantity tasks, where g alone accounted for 17% of variance, with the full model explaining 68%. Comparable patterns appear in birds and other mammals, suggesting phylogenetic continuity of domain-general cognitive processes.  \n\nHowever, a 2020 meta-analysis of 555 correlations from 33 studies across 11 species found average inter-task correlations of 0.185, with g explaining a mean of 32% of variance (range 17–65%), but multi-level models indicated weak or negative trait associations after accounting for methodological artifacts. This suggests that while positive manifolds exist, the robustness of g in animals is limited compared to humans, potentially due to challenges in constructing ecologically valid, non-domain-specific test batteries and controlling for non-cognitive confounds like motivation. Such findings underscore ongoing debates about interpreting animal g as equivalent to human general intelligence, emphasizing the need for refined comparative methods.\n\n### Comparative Cognitive Testing\n\nComparative cognitive testing employs behavioral paradigms to evaluate cognitive capacities such as perception, memory, reasoning, and problem-solving in non-human animals, facilitating cross-species comparisons while addressing sensory and motivational differences. These tests often adapt human-inspired tasks to animal contexts, using operant conditioning, touchscreen interfaces, or naturalistic setups to minimize anthropocentric biases. Pioneered in early experiments like Thorndike's puzzle boxes in 1898, modern approaches include standardized batteries such as the Primate Cognitive Test Battery (PCTB), which assesses domains like inhibitory control and spatial memory across primates.\n\nA core paradigm is the mirror self-recognition (MSR) test, where animals receive a mark on a body part visible only via mirror and are scored for self-directed responses indicating self-awareness. Chimpanzees (*Pan troglodytes*), orangutans (*Pongo spp.*), and gorillas (*Gorilla gorilla*) reliably pass, with success rates improving under enriched rearing; bottlenose dolphins (*Tursiops truncatus*) and Asian elephants (*Elephas maximus*) have also shown mark-touching behaviors. The Eurasian magpie (*Pica pica*) passed via beak manipulation of marks, suggesting convergent evolution of self-recognition in corvids. However, passerines like cleaner wrasse (*Labroides dimidiatus*) exhibit contingent behaviors, though replication failures and olfactory modality differences raise validity concerns for non-mammalian species.\n\nTool-use tasks probe causal reasoning and planning, exemplified by the trap-tube paradigm, where subjects insert tools to retrieve food while avoiding traps. Great apes and capuchin monkeys (*Cebus spp.*) succeed in modified versions requiring metatool selection, demonstrating foresight; New Caledonian crows (*Corvus moneduloides*) manufacture hooked tools from novel materials, rivaling ape flexibility in serial problem-solving. Orangutans in honey-box tasks combine multiple tools, with performance correlating to wild tool-use experience. These tests reveal domain-general mechanisms but are confounded by motor constraints, as species without dexterous appendages like birds compensate via beak or foot use.\n\nMemory and learning assessments include delayed matching-to-sample tasks on touchscreens, where rhesus macaques (*Macaca mulatta*) and pigeons (*Columba livia*) perform above chance, indicating working memory capacity scaling with brain size. Spatial cognition tests, such as radial arm mazes, show rats (*Rattus norvegicus*) encoding multiple paths via hippocampal mechanisms analogous to human navigation. Social cognition paradigms, like deception games in ravens (*Corvus corax*), test theory of mind proxies, with success implying mental state attribution.\n\nDespite advances, pitfalls persist: neophobia reduces participation in primates, while ceiling effects in simple tasks obscure hierarchies; non-cognitive factors like attention and inhibitory control must be controlled via batteries. Interpretations risk over-anthropomorphizing, as behaviors may stem from associative learning rather than representational thought, necessitating convergent evidence from multiple paradigms. Cross-species g-factor extraction remains elusive due to task specificity, though principal components analysis in primate batteries hints at underlying general variance.\n\n### Implications for Evolutionary Continuity\n\nThe identification of correlated cognitive performance across diverse tasks in non-human animals supports the hypothesis of evolutionary continuity in intelligence, suggesting that human cognitive abilities represent an extension of ancestral mechanisms rather than a complete rupture. Studies have demonstrated a general factor (g) or analogous structures in species such as rats, where performance on learning and problem-solving tasks loads onto a single dimension accounting for up to 44% of variance. Similar patterns emerge in primates and birds, with factor analyses revealing positive manifolds indicative of domain-general processing capacities shared across vertebrates. These findings imply that the psychometric g observed in humans likely evolved from conserved neural architectures honed by natural selection for adaptive problem-solving in varying ecological niches.\n\nComparative cognition research further underscores this continuity through homologous behaviors, such as tool use in macaques and corvids, which parallel rudimentary forms of human instrumental reasoning. For instance, long-tailed macaques exhibit stone-tool proficiency for processing food, a skill transmitted culturally and reliant on inhibitory control and causal understanding akin to early human precursors. In canines, a recent study identified a g-factor correlating with traits like curiosity and adaptability, mirroring human intelligence correlates and suggesting phylogenetic inheritance of flexible cognition. However, meta-analytic evidence tempers enthusiasm for a universal g in animals, finding weak to moderate positive correlations across tasks but insufficient strength for a robust general factor in most datasets, highlighting potential discontinuities in scalability.\n\nThese implications favor gradualist evolutionary models over saltationist views, positing that incremental enhancements in brain size, encephalization, and neural efficiency—evident from fossil records showing quadrupled hominid brain volume over 2 million years—drove cognitive escalation without invoking non-Darwinian leaps. Shared genetic underpinnings, such as conserved roles of genes like FOXP2 in vocal learning across species, reinforce causal realism in continuity, where selection on pleiotropic traits yielded multifaceted intelligence. Nonetheless, human-unique emergents like recursive syntax and cumulative culture arise from quantitative thresholds, implying continuity in foundations but qualitative divergence in outcomes, as debated in frameworks balancing anthropocentric biases with biocentric evidence. This perspective informs reconstructions of hominid evolution, linking animal analogs to the emergence of Homo sapiens' abstract reasoning around 300,000 years ago.\n\n## Extended Claims of Intelligence\n\n### Plant \"Intelligence\": Behaviors vs. Cognition\n\nPlants exhibit a range of adaptive responses to environmental cues, such as phototropism, where shoots grow toward light sources via auxin-mediated cell elongation, and gravitropism, involving statolith sedimentation in root tips to direct growth against gravity. These behaviors enable survival without mobility or predation, relying on decentralized biochemical signaling rather than centralized neural processing. Electrical signals, including action potentials, propagate in some species at speeds of 0.04–0.6 m/s, far slower than animal neural impulses (0.5–100 m/s), and primarily facilitate physiological adjustments like osmotic regulation rather than information integration.\n\nA notable example is the Venus flytrap (*Dionaea muscipula*), which closes its trap upon two consecutive touches of mechanosensitive hairs, generating propagating action potentials that activate motor cells via calcium influx and turgor pressure changes. Similarly, *Mimosa pudica* leaflets fold in response to touch or vibration, with repeated non-harmful stimuli sometimes leading to diminished reactions, termed habituation by some researchers. However, such responses are typically explained as sensory adaptation or resource depletion, lacking spontaneous recovery or stimulus generalization characteristic of animal non-associative learning; critiques argue these do not constitute true learning but mechanical fatigue.\n\nIn contrast to these observable behaviors, cognition implies flexible, goal-directed information processing, internal representation, and potentially subjective experience, prerequisites unmet in plants due to the absence of neurons, brains, or reciprocal signaling networks for holistic integration. Plant hormone signaling, such as auxin or jasmonic acid cascades, modulates growth and defense but operates via diffusion and local gradients, not synaptic transmission or neurotransmitter analogs functional in neural contexts. Proponents of \"plant neurobiology\" or minimal cognition cite plasticity and anticipation in root foraging or volatile emissions for \"communication,\" yet these remain reactive and pre-programmed, without evidence of operant conditioning, mapped sensory hierarchies, or proactive planning independent of stimulus trails.\n\nThe field faces significant skepticism, with a 2007 statement by 36 plant scientists rejecting \"neurobiology\" terminology as misleading, given plants' lack of neural structures, and recent reviews deeming consciousness claims speculative and empirically unsupported, often failing replication in associative paradigms.  While adaptive behaviors underscore plants' evolutionary sophistication, attributing cognition risks anthropomorphism, conflating physiological efficiency with mental states; mainstream botany views these as evolved, deterministic mechanisms optimizing fitness without necessitating intelligence.\n\n### Emotional, Social, and Moral Intelligence Critiques\n\nEmotional intelligence, popularized by Daniel Goleman's 1995 book, refers to the ability to recognize, understand, and manage one's own emotions and those of others, purportedly predicting life success beyond traditional IQ. However, psychometric critiques highlight that ability-based EI measures, such as the Mayer-Salovey-Caruso Emotional Intelligence Test, exhibit low reliability (often below 0.80) and questionable validity, with performance frequently attributable to verbal IQ rather than distinct emotional processing. Mixed-model EI assessments, which blend traits like optimism and empathy, correlate strongly (r \\u003e 0.70) with personality factors from the Big Five model—particularly low neuroticism, high extraversion, and high agreeableness—rendering EI redundant as a predictor of outcomes like job performance, where general intelligence (g) and conscientiousness account for more variance (up to 25% combined). \n\nSocial intelligence, first proposed by Edward Thorndike in 1920 as the capacity to understand and manage interpersonal relations, has faced longstanding theoretical and empirical challenges. Attempts to measure it independently, such as through situational judgment tests, yield constructs that load heavily on the general factor of intelligence (g), with correlations to IQ often exceeding 0.50, suggesting social skills reflect crystallized knowledge and reasoning rather than a separable \"intelligence.\" Self-reported social intelligence inversely predicts objective performance on social cognition tasks (r = -0.30 to -0.40), indicating overconfidence bias and poor discriminant validity from traits like extraversion. Critics argue that SI's elusiveness stems from its overlap with executive functions and theory of mind, which are g-saturated, undermining claims of it as an orthogonal domain explaining leadership or adaptability beyond cognitive ability.\n\nMoral intelligence, conceptualized in works like Doug Lennick and Fred Kiel's 2005 framework as the mental capacity to discern right from wrong and act ethically, lacks robust scientific grounding as a distinct cognitive module. Empirical studies on moral reasoning, drawing from Kohlberg's stages, show strong ties to IQ (r ≈ 0.40-0.60), where higher cognitive ability facilitates abstract ethical deliberation but does not guarantee moral action, which is more influenced by temperament and socialization. Critiques note that MI scales suffer from definitional vagueness and cultural bias, with predictive power for ethical behavior minimal after controlling for general intelligence and personality; for instance, higher IQ correlates with utilitarian moral judgments but weaker adherence to deontological foundations like loyalty or sanctity. Unlike g, which demonstrates high heritability (h² ≈ 0.80) and predictive stability, MI constructs show low test-retest reliability and fail to explain variance in real-world moral outcomes, such as reduced delinquency, independently of socioeconomic factors and self-control. Proponents' emphasis on MI as a counter to cognitive elitism overlooks causal evidence that moral development emerges from domain-general reasoning rather than specialized circuitry.\n\n## Artificial Intelligence\n\n### Distinctions from Biological Intelligence\n\nArtificial intelligence systems are implemented on silicon-based digital hardware utilizing transistors and electronic circuits, in stark contrast to biological intelligence, which arises from carbon-based organic neural wetware comprising neurons, synapses, and biochemical signaling. This foundational substrate difference enables AI to achieve high parallelism through distributed computing clusters but introduces vulnerabilities such as sensitivity to hardware failures and the need for constant power supply, unlike the self-repairing and metabolically adaptive qualities of biological neural tissues. Biological brains, exemplified by the human cortex with approximately 86 billion neurons and 100 trillion synapses, process information through analog electrochemical gradients and sparse spiking activity, fostering robustness to noise and efficient local computations absent in rigid digital architectures.\n\nLearning mechanisms further diverge: AI predominantly relies on supervised or reinforcement learning via backpropagation and gradient descent, necessitating massive labeled datasets—often billions of examples—and iterative optimization over thousands of epochs to approximate tasks, whereas biological intelligence employs Hebbian plasticity, neuromodulation, and evolutionary priors for few-shot or one-shot adaptation from minimal exposures. For instance, deep neural networks exhibit high variance in learning trajectories and susceptibility to adversarial perturbations or distributional shifts, contrasting with the steady, contextually grounded acquisition in biological systems that integrates sensory feedback loops and intrinsic motivations like curiosity or homeostasis. This disparity underscores AI's data-hungry scalability versus biology's sample-efficient, lifelong learning calibrated by embodied survival pressures.\n\nCognitively, AI prioritizes correlational pattern matching over causal reasoning; large language models predict tokens based on statistical associations in training corpora, often failing to discern true causation without auxiliary interventions like causal graphs, while biological cognition embeds causal models derived from physical interactions and counterfactual simulation. Biological intelligence benefits from evolutionary inductive biases—such as object permanence or intuitive physics—hardwired through natural selection, enabling robust generalization beyond training distributions, a capability current AI approximates only through architectural hacks like transformers rather than innate mechanisms. Energy efficiency amplifies these gaps: the human brain sustains complex cognition on roughly 20 watts via sparse, event-driven processing, whereas training a single large model like GPT-3 consumes energy equivalent to hundreds of households annually, and inference scales poorly without specialized hardware.\n\nEmbodiment represents another core distinction; biological intelligence is inextricably linked to sensorimotor loops in physical environments, grounding abstractions in real-world dynamics and enabling adaptive behaviors like tool use or navigation, whereas disembodied AI lacks this causal tether, leading to \"hallucinations\" or brittle performance in novel scenarios unless paired with robotics, which still falls short of biological integration. Finally, biological systems exhibit qualia, subjective experience, and potential consciousness tied to integrated information processing, qualities empirically absent in AI, which simulates intelligence through algorithmic computation devoid of phenomenal awareness or intrinsic goals beyond programmed objectives. These differences imply that while AI surpasses biological limits in narrow, scalable domains like calculation speed, it does not replicate the holistic, causally grounded adaptability of evolved intelligence.\n\n### Current Capabilities and Narrow AI\n\nNarrow artificial intelligence (AI) systems, also termed weak AI, are engineered to perform discrete, task-specific functions with high proficiency but without the capacity for broad generalization or autonomous reasoning across domains. These systems dominate contemporary AI applications, leveraging techniques such as deep learning, reinforcement learning, and supervised models to achieve superhuman performance in constrained environments. As of 2025, narrow AI has driven productivity gains in sectors like manufacturing and healthcare, with empirical studies indicating it narrows skill disparities by automating routine cognitive tasks, though benefits vary by implementation.\n\nIn computer vision, narrow AI exemplifies domain-specific excellence; convolutional neural networks, refined through architectures like ResNet and Vision Transformers, routinely surpass 99% accuracy on benchmarks such as ImageNet for image classification, enabling applications from autonomous vehicle object detection to medical diagnostics. Similarly, in natural language processing, large language models (LLMs) like those powering chat interfaces excel at tasks including translation and summarization, with 2025 benchmarks showing performance gaps between top models and human baselines shrinking to under 2% on datasets like GLUE and SuperGLUE. Reinforcement learning agents, such as AlphaGo's successors, have mastered combinatorial games like Go and chess, achieving win rates exceeding 90% against grandmasters by 2017 and extending to real-time strategy simulations by 2025. In scientific domains, tools like AlphaFold3 predict protein structures with atomic-level precision, accelerating drug discovery by resolving structures for over 200 million proteins as of 2024 updates.\n\nDespite these advances, narrow AI exhibits inherent limitations rooted in its training paradigms. Systems falter on out-of-distribution data, displaying brittleness to adversarial perturbations that humans easily dismiss, as demonstrated in vision tasks where minor pixel alterations reduce accuracy by over 90%. They lack causal understanding, relying on correlational patterns rather than mechanistic reasoning, which confines transfer learning to superficial similarities and precludes novel problem-solving without retraining. Interpretability remains a challenge, with \"black-box\" dynamics obscuring decision processes, though narrow scope facilitates targeted auditing compared to broader systems. Compute demands have plummeted—training costs for state-of-the-art models dropped by orders of magnitude since 2020—yet scaling yields diminishing returns beyond task-specific optima, underscoring the absence of emergent general intelligence.\n\n### Pathways to General Intelligence and Limitations\n\nArtificial general intelligence (AGI) refers to AI systems capable of performing any intellectual task that a human can, across diverse domains with adaptability and generalization akin to human cognition. Current research pathways emphasize scaling deep neural networks, particularly transformer-based large language models (LLMs), through increased compute, data volume, and model parameters, as evidenced by predictable performance improvements following power-law scaling relationships. However, empirical data from 2025 benchmarks indicate that such scaling has plateaued in yielding emergent general reasoning, with models like those from OpenAI's o1 series excelling in narrow tasks but failing on out-of-distribution generalization and causal inference.\n\nAlternative pathways include neuro-symbolic AI, which integrates neural learning for pattern recognition with symbolic reasoning for logical deduction and rule-based inference, aiming to address LLMs' brittleness in abstract planning and counterfactuals. Proponents argue this hybrid approach mimics human dual-process cognition—fast intuitive pattern matching (System 1) and slow deliberate reasoning (System 2)—potentially enabling verifiable explanations and reduced hallucinations, as demonstrated in small-scale integrations for tasks like theorem proving. Other proposed routes involve reinforcement learning enhancements for agentic behavior, multimodal fusion of vision-language-action data, and algorithmic innovations like test-time compute for chain-of-thought prompting, though these remain incremental atop connectionist foundations without resolving core architectural deficits.\n\nSignificant limitations persist, rooted in the statistical nature of deep learning, which excels at interpolation but struggles with extrapolation, lacking innate mechanisms for building causal world models or composing novel solutions from primitives. LLMs, trained on vast internet corpora, exhibit superficial fluency without comprehension, as shown by persistent failures on benchmarks like ARC requiring core knowledge priors (e.g., object permanence, intuitive physics) that humans acquire efficiently from minimal data. Data and energy demands escalate exponentially—training frontier models now requires terawatt-hours—yet yield diminishing marginal gains, with surveys of AI researchers estimating low probability (\\u003c25%) that pure scaling suffices for AGI. Critics highlight systemic issues like vulnerability to adversarial inputs and absence of self-improvement loops independent of human-curated feedback, underscoring that connectionism alone cannot replicate the causal realism and efficiency of biological intelligence. Achieving AGI may necessitate paradigm shifts, such as incorporating evolutionary search or brain-inspired architectures, but as of October 2025, no pathway has demonstrated scalable generality beyond narrow domains.\n\n## Controversies and Implications\n\n### Nature vs. Nurture Resolution\n\nThe nature versus nurture debate in intelligence centers on the extent to which genetic factors and environmental influences determine individual differences in cognitive abilities, as measured by IQ tests. Empirical evidence from behavioral genetics has increasingly resolved this in favor of a predominant genetic contribution, with heritability estimates— the proportion of variance in intelligence attributable to genetic differences within a population—ranging from approximately 40% in early childhood to 70-80% in adulthood. This age-related increase reflects a diminishing role for shared environmental factors, such as family socioeconomic status or parenting practices, which account for about 20-30% of variance in childhood but near zero in adulthood.\n\nTwin and adoption studies provide the foundational data, demonstrating that monozygotic (identical) twins reared apart exhibit IQ correlations of 0.70-0.75, closely matching those reared together, while dizygotic (fraternal) twins show correlations around 0.50, consistent with half-shared genetics. A meta-analysis of over 11,000 twin pairs confirmed heritability rising from 41% at age 9 to 66% by age 12 and stabilizing higher in later life, underscoring that non-shared environmental experiences (e.g., unique peer interactions or illnesses) explain the remaining variance rather than systematic nurture effects. Adoption studies further support this, as adopted children's IQs correlate more strongly with biological parents (r ≈ 0.40) than adoptive ones (r ≈ 0.15) by adolescence.\n\nGenome-wide association studies (GWAS) corroborate these findings at the molecular level, identifying thousands of genetic variants associated with intelligence, with SNP-based heritability capturing 20-30% of variance in large samples. Although GWAS currently explain less than twin estimates—due to factors like rare variants, gene-environment interactions, and non-additive genetic effects—the polygenic architecture aligns with high overall heritability, rejecting purely environmental explanations. Environmental interventions, such as early education programs, yield modest IQ gains (3-5 points) that often fade by adulthood, indicating limited capacity to alter genetic trajectories.\n\nThis resolution highlights intelligence as highly heritable within populations, with nurture playing a facilitative but secondary role in realizing genetic potential; for instance, extreme deprivation can suppress IQ by 10-15 points, but optimal environments do not elevate beyond genetic limits. Claims minimizing genetics, often rooted in ideological preferences in social sciences, contradict this converging evidence from diverse methodologies, emphasizing causal realism in prioritizing polygenic inheritance over malleable nurture for explaining variance.\n\n### Societal Outcomes and Policy Debates\n\nHigher intelligence, as measured by IQ tests, predicts a range of positive socioeconomic outcomes, including educational attainment, occupational status, and income. Longitudinal meta-analyses indicate that IQ is a substantial predictor of adult socioeconomic success, with correlations typically ranging from 0.3 to 0.5 for income and job prestige, outperforming parental socioeconomic status in many models after controlling for early advantages. Individuals with IQs above 115 are overrepresented in high-skill professions, while those below 85 face elevated risks of unemployment and reliance on social welfare.\n\nConversely, lower IQ is associated with higher rates of criminal involvement. Empirical studies show a negative correlation between state-level IQ estimates and FBI-reported violent and property crime rates, with coefficients around -0.6 to -0.8; criminal offenders average IQs of 85-92, roughly one standard deviation below the population mean. This link persists after adjusting for socioeconomic factors, suggesting cognitive deficits impair impulse control and foresight in decision-making. Health outcomes also favor higher IQ: childhood IQ scores predict reduced mortality from causes like coronary disease and accidents, with each standard deviation increase linked to 20-25% lower all-cause mortality risk up to age 79. Genetic mediation underlies much of this association, as twin studies confirm heritability drives both intelligence and longevity.\n\nGroup differences in average IQ—such as the 15-point gap between Ashkenazi Jews and Europeans, or 10-15 points between Europeans and sub-Saharan Africans—have societal ramifications, including disparities in innovation rates and incarceration. Peer-reviewed analyses attribute these partly to genetic factors, with heritability estimates of 50-80% in adulthood implying limited environmental closure of gaps; however, mainstream academic discourse often minimizes genetic contributions due to ideological pressures, prioritizing nurture explanations despite contradictory adoption and twin data. Such differences challenge policies assuming equal cognitive potential across groups, as evidenced by persistent underperformance in selective institutions post-affirmative action.\n\nPolicy debates center on integrating intelligence research into education, employment, and equity initiatives. In education, IQ testing informs ability grouping and resource allocation, with evidence showing cognitive ability predicts academic achievement better than socioeconomic status alone; critics argue for de-emphasis due to disparate outcomes, but randomized trials affirm tracking's benefits for high-ability students without harming others. Employment screening via cognitive tests enhances productivity, correlating 0.5-0.6 with job performance, yet U.S. Supreme Court rulings like *Griggs v. Duke Power* (1971) restrict their use if yielding racial disparities, prioritizing outcome equality over merit despite validation data.\n\nHeritability's policy implications—estimated at 60-80% for adult IQ—undermine egalitarian interventions like universal preschool, which yield modest, fading gains (3-5 points), while favoring selective approaches such as merit-based admissions or high-skill immigration. Economists debate whether high heritability justifies reduced redistribution, as genetic endowments explain much variance in outcomes, but opponents invoke malleability from Flynn effect gains (3 points per decade), though these reflect test norming and environmental shifts rather than individual uplift. Broader debates question suppressing research on group differences, as self-censorship in academia—evident in retracted papers and funding biases—hinders evidence-based policy, potentially perpetuating ineffective programs. Truth-seeking policies prioritize cognitive selection for roles demanding complexity, as mismatches elevate failure rates and societal costs.\n\n### Ethical and Ideological Challenges\n\nThe study of human intelligence has faced ethical scrutiny due to historical misapplications, particularly in the early 20th century eugenics movement, where IQ tests were used to justify coercive policies such as forced sterilizations. In the United States, the 1927 Supreme Court case *Buck v. Bell* upheld the sterilization of Carrie Buck, deemed \"feeble-minded\" based partly on IQ assessments, with Justice Oliver Wendell Holmes famously stating, \"Three generations of imbeciles are enough,\" affecting an estimated 60,000-70,000 individuals across states by the mid-20th century. Similar practices in Europe culminated in Nazi Germany's Aktion T4 program, which euthanized over 200,000 disabled individuals, including those identified via intelligence metrics, framing low IQ as a societal burden warranting elimination. These abuses stemmed from overinterpreting early IQ data as fixed and racially hierarchical, without accounting for environmental confounders, leading to policies that prioritized population \"quality\" over individual rights.\n\nIn contemporary contexts, ideological pressures pose challenges by discouraging research into genetic influences on intelligence, despite twin and adoption studies estimating heritability at 50-80% in adulthood. This suppression often arises from egalitarian assumptions that variance in outcomes must be environmental, fearing that acknowledging partial genetic causation could revive eugenic justifications or undermine affirmative action. For instance, in 2007, Nobel laureate James Watson faced professional ostracism, including revocation of honors by Cold Spring Harbor Laboratory, for hypothesizing that lower average IQ scores in sub-Saharan Africa (around 70, per Lynn's meta-analyses) might reflect genetic factors alongside environmental ones. Critics, including mainstream media outlets, labeled such views inherently racist without engaging the data, illustrating how institutional biases—prevalent in left-leaning academia where conservatives are underrepresented—stifle debate.\n\nProponents of unrestricted inquiry argue that ethical integrity demands pursuing causal realities, as denying heritability hampers targeted interventions for low-intelligence populations, who face higher rates of poverty, crime, and unemployment. Linda Gottfredson has contended that politicized reticence about IQ's predictive power (correlating 0.5-0.7 with socioeconomic success) disadvantages the very groups it aims to protect, by promoting unattainable \"nurture-only\" policies like Head Start, which show negligible long-term IQ gains. Conversely, ethical advocates warn of slippery slopes toward embryo selection or genetic editing for higher intelligence via CRISPR, raising consent issues for future generations and exacerbating inequality if accessible only to elites. Balancing these, the genetics community emphasizes rigorous, transparent research to avoid past misuses while rejecting ideologically driven censorship. Recent surveys of intelligence experts affirm that differences between groups are substantially heritable yet politically charged, underscoring the need for viewpoint diversity to mitigate bias.",
  "external_references": [
    {
      "text": "Pmc3341646",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3341646/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S1041608002000742",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S1041608002000742",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc6927908",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6927908/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4270739",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4270739/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5985927",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5985927/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7433699",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7433699/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2e5cac865e67e6bc04d73735f1a6ff01",
      "url": "https://www.cambridge.org/core/books/human-intelligence/group-differences-in-intelligence/2E5CAC865E67E6BC04D73735F1A6FF01",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "09515089.2019.1697803",
      "url": "https://www.tandfonline.com/doi/full/10.1080/09515089.2019.1697803",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Intelligence",
      "url": "https://www.etymonline.com/word/intelligence",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Intelligence N",
      "url": "https://www.oed.com/dictionary/intelligence_n",
      "domain": "oed.com",
      "type": "citation"
    },
    {
      "text": "The Concept Of Intelligence From Ancient Greek Philosophy To The Theory Of Multiple Intelligences",
      "url": "https://www.academia.edu/36815479/The_Concept_of_Intelligence_from_Ancient_Greek_Philosophy_to_the_Theory_of_Multiple_Intelligences",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "660",
      "url": "https://journals.publishing.umich.edu/phimp/article/id/660/",
      "domain": "journals.publishing.umich.edu",
      "type": "citation"
    },
    {
      "text": "Ai Thinking Greek Philosophers Plato Aristotle",
      "url": "https://www.fastcompany.com/91370960/ai-thinking-greek-philosophers-plato-aristotle",
      "domain": "fastcompany.com",
      "type": "citation"
    },
    {
      "text": "Representation Medieval",
      "url": "https://plato.stanford.edu/entries/representation-medieval/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Enlightenment",
      "url": "https://plato.stanford.edu/entries/enlightenment/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "On The Dark History Of Intelligence As Domination",
      "url": "https://aeon.co/essays/on-the-dark-history-of-intelligence-as-domination",
      "domain": "aeon.co",
      "type": "citation"
    },
    {
      "text": "Insertion A Brief History Of The Concept Of Intelligence And Its Future",
      "url": "https://www.uffmm.org/2025/02/15/insertion-a-brief-history-of-the-concept-of-intelligence-and-its-future/",
      "domain": "uffmm.org",
      "type": "citation"
    },
    {
      "text": "Intelligence",
      "url": "https://dictionary.apa.org/intelligence",
      "domain": "dictionary.apa.org",
      "type": "citation"
    },
    {
      "text": "Intelligence.html",
      "url": "https://www.simplypsychology.org/intelligence.html",
      "domain": "simplypsychology.org",
      "type": "citation"
    },
    {
      "text": "230224420 Spearman And The Origin And Development Of Factor Models",
      "url": "https://www.researchgate.net/publication/230224420_Spearman_and_the_origin_and_development_of_factor_models",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Psychometric G Definition And Substantiation 2002 By Arthur Robert Jensen.pdf",
      "url": "https://arthurjensen.net/wp-content/uploads/2014/06/Psychometric-g-Definition-and-Substantiation-2002-by-Arthur-Robert-Jensen.pdf",
      "domain": "arthurjensen.net",
      "type": "citation"
    },
    {
      "text": "G Factor",
      "url": "https://www.cogn-iq.org/learn/theory/g-factor/",
      "domain": "cogn-iq.org",
      "type": "citation"
    },
    {
      "text": "S016028962100101x",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S016028962100101X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "The Predictive Validity Of Cognitive Ability",
      "url": "https://reasonwithoutrestraint.com/the-predictive-validity-of-cognitive-ability/",
      "domain": "reasonwithoutrestraint.com",
      "type": "citation"
    },
    {
      "text": "Pmc10219189",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10219189/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Newpsy",
      "url": "https://www.cogsci.ecs.soton.ac.uk/cgi/psyc/newpsy?intelligence-g-factor.1",
      "domain": "cogsci.ecs.soton.ac.uk",
      "type": "citation"
    },
    {
      "text": "11276908",
      "url": "https://pubmed.ncbi.nlm.nih.gov/11276908/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Schneider2012.pdf",
      "url": "http://www.iapsych.com/articles/schneider2012.pdf",
      "domain": "iapsych.com",
      "type": "citation"
    },
    {
      "text": "9781118660584.ese0431",
      "url": "https://onlinelibrary.wiley.com/doi/full/10.1002/9781118660584.ese0431",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Chc Theory",
      "url": "https://www.cogn-iq.org/learn/theory/chc-theory/",
      "domain": "cogn-iq.org",
      "type": "citation"
    },
    {
      "text": "Pmc9865475",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9865475/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41809 022 00113 Z",
      "url": "https://link.springer.com/article/10.1007/s41809-022-00113-z",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Intelligence Quotient",
      "url": "https://www.sciencedirect.com/topics/mathematics/intelligence-quotient",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "History Of Intelligence Testing 2795581",
      "url": "https://www.verywellmind.com/history-of-intelligence-testing-2795581",
      "domain": "verywellmind.com",
      "type": "citation"
    },
    {
      "text": "The Origins And History Of Iq Tests",
      "url": "https://interestingengineering.com/science/the-origins-and-history-of-iq-tests",
      "domain": "interestingengineering.com",
      "type": "citation"
    },
    {
      "text": "275354727 A Brief History Of Iq Tests",
      "url": "https://www.researchgate.net/publication/275354727_A_Brief_History_of_IQ_Tests",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Intelligence Quotient Iq And Measuring Intelligence",
      "url": "https://www.ebsco.com/research-starters/health-and-medicine/intelligence-quotient-iq-and-measuring-intelligence",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "38330347",
      "url": "https://pubmed.ncbi.nlm.nih.gov/38330347/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0022440521000571",
      "url": "https://www.sciencedirect.com/science/article/pii/S0022440521000571",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "1998generalintelligencefactor.pdf",
      "url": "https://www1.udel.edu/educ/gottfredson/reprints/1998generalintelligencefactor.pdf",
      "domain": "www1.udel.edu",
      "type": "citation"
    },
    {
      "text": "S0160289606001127",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289606001127",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc4557354",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4557354/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S44271 025 00245 2",
      "url": "https://www.nature.com/articles/s44271-025-00245-2",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc10493274",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10493274/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0160289621000507",
      "url": "https://www.sciencedirect.com/science/article/pii/S0160289621000507",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc6546921",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6546921/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2019.01116/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "2003dissecting.pdf",
      "url": "https://www1.udel.edu/educ/gottfredson/reprints/2003dissecting.pdf",
      "domain": "www1.udel.edu",
      "type": "citation"
    },
    {
      "text": "S0160289603000242",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289603000242",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0160289624000862",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289624000862",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Mp2014105",
      "url": "https://www.nature.com/articles/mp2014105",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Ff406cc4cf286d78af72c9e7ef9b5e3f",
      "url": "https://www.cambridge.org/core/journals/twin-research-and-human-genetics/article/wilson-effect-the-increase-in-heritability-of-iq-with-age/FF406CC4CF286D78AF72C9E7EF9B5E3F",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "S0160289624000655",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289624000655",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S014976341500250x",
      "url": "https://www.sciencedirect.com/science/article/pii/S014976341500250X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2005 07858 002",
      "url": "https://psycnet.apa.org/record/2005-07858-002",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Pmc9096623",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9096623/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0160289616303385",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289616303385",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc2770698",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2770698/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2291291",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2291291/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0093623",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Pmc6632368",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6632368/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3780714",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3780714/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2022.05.02.490274v1.full Text",
      "url": "https://www.biorxiv.org/content/10.1101/2022.05.02.490274v1.full-text",
      "domain": "biorxiv.org",
      "type": "citation"
    },
    {
      "text": "86b09d85ecf9bfae468fb1d540f2dd54",
      "url": "https://www.cambridge.org/core/books/cambridge-handbook-of-intelligence/evolution-of-intelligence/86B09D85ECF9BFAE468FB1D540F2DD54",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Encephalization Quotient",
      "url": "https://www.sciencedirect.com/topics/neuroscience/encephalization-quotient",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "28625354",
      "url": "https://pubmed.ncbi.nlm.nih.gov/28625354/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "How Humans Evolved Supersize Brains 20151110",
      "url": "https://www.quantamagazine.org/how-humans-evolved-supersize-brains-20151110/",
      "domain": "quantamagazine.org",
      "type": "citation"
    },
    {
      "text": "Brains",
      "url": "https://humanorigins.si.edu/human-characteristics/brains",
      "domain": "humanorigins.si.edu",
      "type": "citation"
    },
    {
      "text": "The Evolution Of Human Intelligence 32131",
      "url": "https://www.discovermagazine.com/the-evolution-of-human-intelligence-32131",
      "domain": "discovermagazine.com",
      "type": "citation"
    },
    {
      "text": "%28sici%291520 6505%281998%296:5%253c178::aid Evan5%253e3.0.co%3b2 8",
      "url": "https://onlinelibrary.wiley.com/doi/10.1002/%28SICI%291520-6505%281998%296:5%253C178::AID-EVAN5%253E3.0.CO%3B2-8",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "19575315",
      "url": "https://pubmed.ncbi.nlm.nih.gov/19575315/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2017 Rosati Foraging.pdf",
      "url": "https://sites.lsa.umich.edu/cognitive-evolution/wp-content/uploads/sites/501/2017/07/2017-rosati-foraging.pdf",
      "domain": "sites.lsa.umich.edu",
      "type": "citation"
    },
    {
      "text": "Nbk210002",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK210002/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1308.5034",
      "url": "https://arxiv.org/pdf/1308.5034",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2499487 Evolution Of Intelligence In Our Ancestors May Have Come At A Cost",
      "url": "https://www.newscientist.com/article/2499487-evolution-of-intelligence-in-our-ancestors-may-have-come-at-a-cost/",
      "domain": "newscientist.com",
      "type": "citation"
    },
    {
      "text": "S0079612322002059",
      "url": "https://www.sciencedirect.com/science/article/pii/S0079612322002059",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc6804415",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6804415/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "22254096",
      "url": "https://pubmed.ncbi.nlm.nih.gov/22254096/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8755080",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8755080/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004454",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Pmc3410672",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3410672/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0161813x21000528",
      "url": "https://www.sciencedirect.com/science/article/pii/S0161813X21000528",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "16085682",
      "url": "https://pubmed.ncbi.nlm.nih.gov/16085682/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8329745",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8329745/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2808936",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2808936",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "S1053811921001051",
      "url": "https://www.sciencedirect.com/science/article/pii/S1053811921001051",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S41598 023 36841 7",
      "url": "https://www.nature.com/articles/s41598-023-36841-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "8162884",
      "url": "https://pubmed.ncbi.nlm.nih.gov/8162884/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.2118631119",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2118631119",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S13643 022 01963 Y",
      "url": "https://systematicreviewsjournal.biomedcentral.com/articles/10.1186/s13643-022-01963-y",
      "domain": "systematicreviewsjournal.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Flynn Effect",
      "url": "https://www.sciencedirect.com/topics/psychology/flynn-effect",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Flynn 1999 The Discovery Of Iq Gains Over Time.pdf",
      "url": "https://james-flynn.net/wp-content/uploads/2020/12/Flynn-1999-The-Discovery-of-IQ-Gains-Over-Time.pdf",
      "domain": "james-flynn.net",
      "type": "citation"
    },
    {
      "text": "The Rising Curve Long Term Gains In Iq And Related Measures Apa Science Volumes By Ulric Neisser American Psychological Association Z Lib.org.pdf",
      "url": "https://james-flynn.net/wp-content/uploads/2020/12/The-Rising-Curve-Long-Term-Gains-in-IQ-and-Related-Measures-Apa-Science-Volumes-by-Ulric-Neisser-American-Psychological-Association-z-lib.org.pdf",
      "domain": "james-flynn.net",
      "type": "citation"
    },
    {
      "text": "2014 26576 001",
      "url": "https://psycnet.apa.org/record/2014-26576-001",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Pmc9812031",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9812031/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.claremont.edu/cgi/viewcontent.cgi?article=1262\\u0026context=cmc_theses",
      "domain": "scholarship.claremont.edu",
      "type": "citation"
    },
    {
      "text": "S0160289608000998",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289608000998",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0160289625000121",
      "url": "https://www.sciencedirect.com/science/article/pii/S0160289625000121",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0160289616300198",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289616300198",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc11676032",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11676032/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "714992",
      "url": "https://www.journals.uchicago.edu/doi/10.1086/714992",
      "domain": "journals.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Pmc9255665",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9255665/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0276562423000069",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0276562423000069",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0160289616300629",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289616300629",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "8997472 Socioeconomic Status Modifies Heritability Of Iq In Young Children",
      "url": "https://www.researchgate.net/publication/8997472_Socioeconomic_Status_Modifies_Heritability_of_IQ_in_Young_Children",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Pnas.96.15.8790",
      "url": "https://www.pnas.org/doi/10.1073/pnas.96.15.8790",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "1990 Locurto.pdf",
      "url": "https://gwern.net/doc/iq/1990-locurto.pdf",
      "domain": "gwern.net",
      "type": "citation"
    },
    {
      "text": "Pmc8513766",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8513766/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Is There A Difference In Iq Between Adopted Children And Their Biological Parents",
      "url": "https://www.quora.com/Is-there-a-difference-in-IQ-between-adopted-children-and-their-biological-parents",
      "domain": "quora.com",
      "type": "citation"
    },
    {
      "text": "S0160289696900227",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289696900227",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/human-neuroscience/articles/10.3389/fnhum.2013.00097/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "8082091",
      "url": "https://academic.oup.com/nutritionreviews/article-abstract/83/10/1944/8082091",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Pmc8839299",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8839299/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4175558",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4175558/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0022316622004114",
      "url": "https://www.sciencedirect.com/science/article/pii/S0022316622004114",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "1093",
      "url": "https://www.mdpi.com/2072-6643/16/7/1093",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "S1071909125000336",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S1071909125000336",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc2907168",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2907168/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11541283",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11541283/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S10648 022 09705 1",
      "url": "https://link.springer.com/article/10.1007/s10648-022-09705-1",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "S019188690400385x",
      "url": "https://www.sciencedirect.com/science/article/pii/S019188690400385X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "222534750 Negligible Sex Differences In General Intelligence",
      "url": "https://www.researchgate.net/publication/222534750_Negligible_Sex_Differences_in_General_Intelligence",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "26158978",
      "url": "https://pubmed.ncbi.nlm.nih.gov/26158978/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0191886924002368",
      "url": "https://www.sciencedirect.com/science/article/pii/S0191886924002368",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "1995 20087 001",
      "url": "https://psycnet.apa.org/record/1995-20087-001",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "S11357 025 01585 X",
      "url": "https://link.springer.com/article/10.1007/s11357-025-01585-x",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "S0149763423003020",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0149763423003020",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "18",
      "url": "https://www.mdpi.com/2079-3200/13/2/18",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2024.1402645/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "S0191886999001427",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0191886999001427",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2000 13747 015",
      "url": "https://psycnet.apa.org/record/2000-13747-015",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Rushton Jensen30years.pdf",
      "url": "https://www1.udel.edu/educ/gottfredson/30years/Rushton-Jensen30years.pdf",
      "domain": "www1.udel.edu",
      "type": "citation"
    },
    {
      "text": "S016028960200137x",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S016028960200137X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Roth%2520et%2520al%2520ethnic%2520grp%2520diff%2520in%2520cog%2520abil%2520ppsych%25202001.pdf",
      "url": "https://home.ubalt.edu/tmitch/645/articles/roth%2520et%2520al%2520ethnic%2520grp%2520diff%2520in%2520cog%2520abil%2520ppsych%25202001.pdf?ref=quillette.com",
      "domain": "home.ubalt.edu",
      "type": "citation"
    },
    {
      "text": "Report 43536",
      "url": "https://www.innovations-report.com/education/studies-and-analyses/report-43536/",
      "domain": "innovations-report.com",
      "type": "citation"
    },
    {
      "text": "S0160289619301904",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289619301904",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0306987708002454",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0306987708002454",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "The Black White Test Score Gap Why It Persists And What Can Be Done",
      "url": "https://www.brookings.edu/articles/the-black-white-test-score-gap-why-it-persists-and-what-can-be-done/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Pmc8872358",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8872358/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8604262",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8604262/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "229224456 Iq And Fertility A Cross National Study",
      "url": "https://www.researchgate.net/publication/229224456_IQ_and_fertility_A_cross-national_study",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Jensen 2025a.pdf",
      "url": "https://openpsych.net/files/papers/Jensen_2025a.pdf",
      "domain": "openpsych.net",
      "type": "citation"
    },
    {
      "text": "S0160289607000463",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289607000463",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "29891660",
      "url": "https://pubmed.ncbi.nlm.nih.gov/29891660/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5646700",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5646700/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "11276911",
      "url": "https://pubmed.ncbi.nlm.nih.gov/11276911/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0160289614000993",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289614000993",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2016 Arden.pdf",
      "url": "https://gwern.net/doc/iq/animal/2016-arden.pdf",
      "domain": "gwern.net",
      "type": "citation"
    },
    {
      "text": "Amici Coexistance Behbrainsci 2017 2476762.pdf",
      "url": "https://www.eva.mpg.de/documents/Cambridge/Amici_Coexistance_BehBrainSci_2017_2476762.pdf",
      "domain": "eva.mpg.de",
      "type": "citation"
    },
    {
      "text": "Rspb.2020.1853",
      "url": "https://royalsocietypublishing.org/doi/10.1098/rspb.2020.1853",
      "domain": "royalsocietypublishing.org",
      "type": "citation"
    },
    {
      "text": "Pmc4239033",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4239033/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2020.01835/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3000021",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "12056368 The G Factor In Non Human Animals",
      "url": "https://www.researchgate.net/publication/12056368_The_g_Factor_in_Non-Human_Animals",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "56da6270178791722ce907f4478aade8",
      "url": "https://www.cambridge.org/core/journals/behavioral-and-brain-sciences/article/g-but-not-g-in-search-of-the-evolutionary-continuity-of-intelligence/56DA6270178791722CE907F4478AADE8",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0072872",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Intelligence Evolved",
      "url": "https://www.scientificamerican.com/article/intelligence-evolved/",
      "domain": "scientificamerican.com",
      "type": "citation"
    },
    {
      "text": "Pmc3385676",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3385676/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.0706147104",
      "url": "https://www.pnas.org/doi/10.1073/pnas.0706147104",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "5ab1923f6d39aeed6afb91e5aaccee8e",
      "url": "https://www.cambridge.org/core/journals/behavioral-and-brain-sciences/article/evolution-of-general-intelligence/5AB1923F6D39AEED6AFB91E5AACCEE8E",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Annurev Arplant 070722 015329",
      "url": "https://www.annualreviews.org/content/journals/10.1146/annurev-arplant-070722-015329",
      "domain": "annualreviews.org",
      "type": "citation"
    },
    {
      "text": "Pmc8052213",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8052213/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2634039",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2634039/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4814444",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4814444/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Challenging Plant Intelligence Reevaluating Habituation In Mimosa Pudica",
      "url": "https://nutrisoil.com.au/challenging-plant-intelligence-reevaluating-habituation-in-mimosa-pudica/",
      "domain": "nutrisoil.com.au",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://www.wellbeingintlstudiesrepository.org/cgi/viewcontent.cgi?article=1782\\u0026context=animsent",
      "domain": "wellbeingintlstudiesrepository.org",
      "type": "citation"
    },
    {
      "text": "Pmc11839687",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11839687/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "J.tplants.2019.05.008",
      "url": "https://doi.org/10.1016/j.tplants.2019.05.008",
      "domain": "doi.org",
      "type": "citation"
    },
    {
      "text": "Feeling Smart The Science Of Emotional Intelligence",
      "url": "https://www.americanscientist.org/article/feeling-smart-the-science-of-emotional-intelligence",
      "domain": "americanscientist.org",
      "type": "citation"
    },
    {
      "text": "S0191886905001534",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0191886905001534",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Emotional Intelligence Is Connected With These Work Outcomes",
      "url": "https://oxford-review.com/emotional-intelligence-is-connected-with-these-work-outcomes/",
      "domain": "oxford-review.com",
      "type": "citation"
    },
    {
      "text": "1930 01843 001",
      "url": "https://psycnet.apa.org/record/1930-01843-001",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.openpsychologyjournal.com/VOLUME/16/ELOCATOR/e187435012301180/FULLTEXT/",
      "domain": "openpsychologyjournal.com",
      "type": "citation"
    },
    {
      "text": "Spo.78",
      "url": "https://swisspsychologyopen.com/articles/10.5334/spo.78",
      "domain": "swisspsychologyopen.com",
      "type": "citation"
    },
    {
      "text": "2005 06828 010",
      "url": "https://psycnet.apa.org/record/2005-06828-010",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "Pmc7602045",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7602045/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12294983",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12294983/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0160289625000339",
      "url": "https://www.sciencedirect.com/science/article/pii/S0160289625000339",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2024.1425341/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pmc8108480",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8108480/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2024 01 03 Study Shows Way Brain Learns Different Way Artificial Intelligence Systems Learn",
      "url": "https://www.ox.ac.uk/news/2024-01-03-study-shows-way-brain-learns-different-way-artificial-intelligence-systems-learn",
      "domain": "ox.ac.uk",
      "type": "citation"
    },
    {
      "text": "126011310.pdf",
      "url": "https://www.atlantis-press.com/article/126011310.pdf",
      "domain": "atlantis-press.com",
      "type": "citation"
    },
    {
      "text": "2408.14811v1",
      "url": "https://arxiv.org/html/2408.14811v1",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Stsc.2024.0189",
      "url": "https://pubsonline.informs.org/doi/10.1287/stsc.2024.0189",
      "domain": "pubsonline.informs.org",
      "type": "citation"
    },
    {
      "text": "2405.02325v4",
      "url": "https://arxiv.org/html/2405.02325v4",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Pmc10629395",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10629395/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Energy Efficiency In Artificial And Biological Intelligence",
      "url": "https://blog.neurozone.com/energy-efficiency-in-artificial-and-biological-intelligence",
      "domain": "blog.neurozone.com",
      "type": "citation"
    },
    {
      "text": "2405.02325v3",
      "url": "https://arxiv.org/html/2405.02325v3",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "S41598 025 92190 7",
      "url": "https://www.nature.com/articles/s41598-025-92190-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "2505.15811v1",
      "url": "https://arxiv.org/html/2505.15811v1",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "2025 Ai Index Report",
      "url": "https://hai.stanford.edu/ai-index/2025-ai-index-report",
      "domain": "hai.stanford.edu",
      "type": "citation"
    },
    {
      "text": "The State Of Artificial Intelligence In 2025",
      "url": "https://www.baytechconsulting.com/blog/the-state-of-artificial-intelligence-in-2025",
      "domain": "baytechconsulting.com",
      "type": "citation"
    },
    {
      "text": "2025 Report Launch",
      "url": "https://www.stateof.ai/2025-report-launch",
      "domain": "stateof.ai",
      "type": "citation"
    },
    {
      "text": "Latest Ai News And Updates",
      "url": "https://www.crescendo.ai/news/latest-ai-news-and-updates",
      "domain": "crescendo.ai",
      "type": "citation"
    },
    {
      "text": "The Benefits Of Narrow Ai And The Challenges In Its Creation",
      "url": "https://realkm.com/2025/07/31/the-benefits-of-narrow-ai-and-the-challenges-in-its-creation/",
      "domain": "realkm.com",
      "type": "citation"
    },
    {
      "text": "S41562 023 01734 2.pdf",
      "url": "https://www.nature.com/articles/s41562-023-01734-2.pdf",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Is Deep Learning Actually Hitting A Wall Evaluating Ilya",
      "url": "https://www.lesswrong.com/posts/2MvgBnWDWYdL2XixA/is-deep-learning-actually-hitting-a-wall-evaluating-ilya",
      "domain": "lesswrong.com",
      "type": "citation"
    },
    {
      "text": "S2667305325000675",
      "url": "https://www.sciencedirect.com/science/article/pii/S2667305325000675",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "The Six Ai Pathways That Will Overcome Todays Dead End Llms And Finally Get Us To Agi",
      "url": "https://www.forbes.com/sites/lanceeliot/2025/10/20/the-six-ai-pathways-that-will-overcome-todays-dead-end-llms-and-finally-get-us-to-agi/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Francois Chollet On Why Llms Won T Scale To Agi",
      "url": "https://forum.effectivealtruism.org/posts/MGpJpN3mELxwyfv8t/francois-chollet-on-why-llms-won-t-scale-to-agi",
      "domain": "forum.effectivealtruism.org",
      "type": "citation"
    },
    {
      "text": "Artificial General Intelligence Singularity Timing",
      "url": "https://research.aimultiple.com/artificial-general-intelligence-singularity-timing/",
      "domain": "research.aimultiple.com",
      "type": "citation"
    },
    {
      "text": "The Last Few Months Have Been Devastating",
      "url": "https://garymarcus.substack.com/p/the-last-few-months-have-been-devastating",
      "domain": "garymarcus.substack.com",
      "type": "citation"
    },
    {
      "text": "Agi Right Goal",
      "url": "https://www.ibm.com/think/news/agi-right-goal",
      "domain": "ibm.com",
      "type": "citation"
    },
    {
      "text": "25985137",
      "url": "https://pubmed.ncbi.nlm.nih.gov/25985137/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0160289625000340",
      "url": "https://www.sciencedirect.com/science/article/pii/S0160289625000340",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0001691825003853",
      "url": "https://www.sciencedirect.com/science/article/pii/S0001691825003853",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "A Meta Analysis Of 11000 Pairs Of Twins Shows That The Heritability Of Intelligence Fig1 265690996",
      "url": "https://www.researchgate.net/figure/A-meta-analysis-of-11000-pairs-of-twins-shows-that-the-heritability-of-intelligence_fig1_265690996",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Pmc12416016",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12416016/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41380 021 01027 Y",
      "url": "https://www.nature.com/articles/s41380-021-01027-y",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc3182557",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3182557/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2795492",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2795492",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Pmc4511162",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4511162/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "242633",
      "url": "https://di.aerzteblatt.de/int/archive/article/242633",
      "domain": "di.aerzteblatt.de",
      "type": "citation"
    },
    {
      "text": "222868304 Intelligence And Socioeconomic Success A Meta Analytic Review Of Longitudinal Research",
      "url": "https://www.researchgate.net/publication/222868304_Intelligence_and_Socioeconomic_Success_A_Meta-Analytic_Review_of_Longitudinal_Research",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "2004socialconsequences.pdf",
      "url": "https://www1.udel.edu/educ/gottfredson/reprints/2004socialconsequences.pdf",
      "domain": "www1.udel.edu",
      "type": "citation"
    },
    {
      "text": "S0191886909005169",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0191886909005169",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Does Iq Significantly Contribute Crime Taking Sides Clashing Views",
      "url": "https://www.ojp.gov/ncjrs/virtual-library/abstracts/does-iq-significantly-contribute-crime-taking-sides-clashing-views",
      "domain": "ojp.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5485431",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5485431/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4795559",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4795559/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Testing",
      "url": "https://www.apa.org/topics/intelligence/testing",
      "domain": "apa.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.kentlaw.iit.edu/cgi/viewcontent.cgi?article=2145\\u0026context=cklawreview",
      "domain": "scholarship.kentlaw.iit.edu",
      "type": "citation"
    },
    {
      "text": "Iq And Hiring D.html",
      "url": "https://www.econlib.org/archives/2013/04/iq_and_hiring_d.html",
      "domain": "econlib.org",
      "type": "citation"
    },
    {
      "text": "1076 8971.2.3 4.473",
      "url": "https://awspntest.apa.org/doi/10.1037/1076-8971.2.3-4.473",
      "domain": "awspntest.apa.org",
      "type": "citation"
    },
    {
      "text": "S10888 025 09690 9",
      "url": "https://link.springer.com/article/10.1007/s10888-025-09690-9",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Heritability Estimates Versus Large Environmental Effects The Iq Paradox Resolved",
      "url": "https://www.brookings.edu/articles/heritability-estimates-versus-large-environmental-effects-the-iq-paradox-resolved/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://via.library.depaul.edu/cgi/viewcontent.cgi?article=1270\\u0026context=law-review",
      "domain": "via.library.depaul.edu",
      "type": "citation"
    },
    {
      "text": "Pmc5866457",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5866457/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "135445624",
      "url": "https://academic.oup.com/book/825/chapter/135445624",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "18440722",
      "url": "https://pubmed.ncbi.nlm.nih.gov/18440722/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0160289619301886",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0160289619301886",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2005suppressingintelligence.pdf",
      "url": "https://www1.udel.edu/educ/gottfredson/reprints/2005suppressingintelligence.pdf",
      "domain": "www1.udel.edu",
      "type": "citation"
    },
    {
      "text": "26413953",
      "url": "https://pubmed.ncbi.nlm.nih.gov/26413953/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8376687",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8376687/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "capacity",
      "page": "Capacity"
    },
    {
      "text": "experience",
      "page": "Experience"
    },
    {
      "text": "complex",
      "page": "Complex"
    },
    {
      "text": "behavior",
      "page": "Behavior"
    },
    {
      "text": "species",
      "page": "Species"
    },
    {
      "text": "psychological research",
      "page": "Psychological_research"
    },
    {
      "text": "factor",
      "page": "Factor"
    },
    {
      "text": "Charles Spearman",
      "page": "Charles_Spearman"
    },
    {
      "text": "strong",
      "page": "The_Strong"
    },
    {
      "text": "brain",
      "page": "Brain"
    },
    {
      "text": "volume",
      "page": "The_Volume"
    },
    {
      "text": "efficiency",
      "page": "Efficiency"
    },
    {
      "text": "white matter",
      "page": "White_matter"
    },
    {
      "text": "survival",
      "page": "Survival"
    },
    {
      "text": "reproduction",
      "page": "Reproduction"
    },
    {
      "text": "Animal",
      "page": "A.N.I.M.A.L."
    },
    {
      "text": "Wechsler Adult Intelligence Scale",
      "page": "Wechsler_Adult_Intelligence_Scale"
    },
    {
      "text": "processing",
      "page": "Processing"
    },
    {
      "text": "structure",
      "page": "Structure"
    },
    {
      "text": "has been",
      "page": "Has_Been"
    },
    {
      "text": "structural equation modeling",
      "page": "Structural_equation_modeling"
    },
    {
      "text": "prior",
      "page": "Prior"
    },
    {
      "text": "data",
      "page": "Data"
    },
    {
      "text": "fiat",
      "page": "Fiat"
    },
    {
      "text": "framework",
      "page": "Framework"
    },
    {
      "text": "causal inference",
      "page": "Causal_inference"
    },
    {
      "text": "must be",
      "page": "Must_be"
    },
    {
      "text": "intelligence quotient",
      "page": "Intelligence_quotient"
    },
    {
      "text": "general",
      "page": "General"
    },
    {
      "text": "comprehension",
      "page": "Comprehension"
    },
    {
      "text": "working memory",
      "page": "Working_memory"
    },
    {
      "text": "common",
      "page": "Common"
    },
    {
      "text": "factor analysis",
      "page": "Factor_analysis"
    },
    {
      "text": "Psychometrics",
      "page": "Psychometrics"
    },
    {
      "text": "measurement",
      "page": "Measurement"
    },
    {
      "text": "2008",
      "page": "2008"
    },
    {
      "text": "2003",
      "page": "2003"
    },
    {
      "text": "mean",
      "page": "mean"
    },
    {
      "text": "standard",
      "page": "standard"
    },
    {
      "text": "15",
      "page": "15"
    },
    {
      "text": "age",
      "page": "age"
    },
    {
      "text": "sex",
      "page": "sex"
    },
    {
      "text": "race",
      "page": "race"
    },
    {
      "text": "geography",
      "page": "geography"
    },
    {
      "text": "range",
      "page": "Range"
    },
    {
      "text": "architecture",
      "page": "Architecture"
    },
    {
      "text": "g",
      "page": "G"
    },
    {
      "text": "non-human",
      "page": "Non-human"
    },
    {
      "text": "animals",
      "page": "Mole"
    },
    {
      "text": "Venus flytrap",
      "page": "Venus_flytrap"
    },
    {
      "text": "action",
      "page": "Action"
    },
    {
      "text": "turgor pressure",
      "page": "Turgor_pressure"
    },
    {
      "text": "vibration",
      "page": "Vibration"
    },
    {
      "text": "adaptation",
      "page": "Adaptation"
    },
    {
      "text": "fatigue",
      "page": "Fatigue"
    },
    {
      "text": "role",
      "page": "Role"
    },
    {
      "text": "extreme",
      "page": "Extreme"
    },
    {
      "text": "genetics",
      "page": "Genetics"
    },
    {
      "text": "social",
      "page": "Social"
    },
    {
      "text": "evidence",
      "page": "Evidence"
    },
    {
      "text": "realism",
      "page": "Realism"
    },
    {
      "text": "inheritance",
      "page": "Inheritance"
    },
    {
      "text": "Flynn effect",
      "page": "Flynn_effect"
    },
    {
      "text": "evidence-based policy",
      "page": "Evidence-based_policy"
    },
    {
      "text": "study",
      "page": "Study"
    },
    {
      "text": "human intelligence",
      "page": "Human_intelligence"
    },
    {
      "text": "scrutiny",
      "page": "Scrutiny"
    },
    {
      "text": "due",
      "page": "A_due"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "eugenics",
      "page": "Eugenics"
    },
    {
      "text": "movement",
      "page": "Movement"
    },
    {
      "text": "In the United States",
      "page": "Baptist_Health"
    },
    {
      "text": "Supreme Court",
      "page": "Supreme_court"
    },
    {
      "text": "Buck v. Bell",
      "page": "Buck_v._Bell"
    },
    {
      "text": "Carrie Buck",
      "page": "Carrie_Buck"
    },
    {
      "text": "Justice",
      "page": "Justice"
    },
    {
      "text": "Oliver",
      "page": "Oliver"
    },
    {
      "text": "60",
      "page": "60"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "Aktion T4",
      "page": "Aktion_T4"
    },
    {
      "text": "program",
      "page": "Program"
    },
    {
      "text": "identified",
      "page": "Identified"
    },
    {
      "text": "inquiry",
      "page": "Inquiry"
    },
    {
      "text": "integrity",
      "page": "Integrity"
    },
    {
      "text": "heritability",
      "page": "Heritability"
    },
    {
      "text": "poverty",
      "page": "Poverty"
    },
    {
      "text": "crime",
      "page": "Crime"
    },
    {
      "text": "unemployment",
      "page": "Unemployment"
    },
    {
      "text": "Gottfredson",
      "page": "Linda_Gottfredson"
    },
    {
      "text": "predictive power",
      "page": "Predictive_power"
    },
    {
      "text": "success",
      "page": "Success"
    },
    {
      "text": "editing",
      "page": "Editing"
    },
    {
      "text": "CRISPR",
      "page": "CRISPR"
    },
    {
      "text": "raising",
      "page": "Raising"
    },
    {
      "text": "consent",
      "page": "Consent"
    },
    {
      "text": "future generations",
      "page": "Future_generations"
    },
    {
      "text": "inequality",
      "page": "Inequality"
    },
    {
      "text": "community",
      "page": "Community"
    },
    {
      "text": "research",
      "page": "Research"
    },
    {
      "text": "censorship",
      "page": "Censorship"
    },
    {
      "text": "diversity",
      "page": "Diversity"
    },
    {
      "text": "bias",
      "page": "Bias"
    }
  ],
  "fetched_at": "2025-12-07T07:28:38.318260",
  "elapsed_ms": 871255
}