{
  "topic": "Islam",
  "title": "Islam",
  "slug": "islam",
  "grokipedia_slug": "Islam",
  "grokipedia_url": "https://grokipedia.com/page/Islam",
  "source": "grokipedia",
  "content": "# Islam\n\nIslam is a monotheistic Abrahamic religion founded in the 7th century CE in the Arabian Peninsula by Prophet Muhammad, whom Muslims regard as the final prophet and messenger of Allah, to whom He revealed His will in the Quran. The faith emphasizes submission to Allah's oneness (**tawhid**) and follows the Quran as the literal word of Allah alongside the Hadith, collections of Muhammad's sayings and actions serving as interpretive guidance. As of 2020, Islam has approximately 2.0 billion followers worldwide, representing the second-largest religion and the fastest-growing major religion, with its population increasing by 347 million from 2010 to 2020—more than all other religious groups combined—and projected to grow faster than Christianity due to higher fertility rates and younger demographics.\n\nCentral doctrines include belief in Allah as the singular, omnipotent creator without partners or equals; the existence of angels as intermediaries; divine scriptures including the Quran as the final uncorrupted revelation superseding prior texts like the Torah and Gospel; a chain of prophets from Adam to Prophet Muhammad; the Day of Judgment with accountability for deeds; and divine predestination (**qadar**) balancing human free will. These tenets underpin a worldview where salvation requires faith, righteous action, and adherence to Sharia, the legal and ethical framework derived from Quranic injunctions and Hadith.\n\nThe core practices, known as the Five Pillars, structure Muslim life: the **shahada** (declaration of faith: \"There is no god but Allah, and Muhammad is His messenger\"); **salat** (ritual prayer five times daily facing Mecca); **zakat** (obligatory almsgiving, typically 2.5% of savings); **sawm** (fasting during Ramadan from dawn to sunset); and **hajj** (pilgrimage to Mecca at least once if able). These rituals foster communal solidarity and personal discipline, though interpretations vary across Sunni (majority) and Shia sects, the latter emphasizing Ali's succession and Imams' authority.\n\nHistorically, Islam expanded rapidly after Muhammad's death in 632 CE through military conquests by the Rashidun Caliphs, who subdued the Byzantine and Sassanid empires, establishing vast territories from Spain to India by the 8th century via campaigns that combined jihad doctrine with pragmatic governance, including jizya tax on non-Muslims. This era saw intellectual flourishing in fields like mathematics and medicine under Abbasid patronage, alongside enduring tensions from doctrinal rigidity, such as prescriptions for apostasy punishment and gender segregation rooted in foundational texts. Modern Islam grapples with reform debates amid globalization, where empirical data highlight correlations between strict adherence and socioeconomic challenges in some adherent-majority states, challenging narratives of inherent compatibility with liberal democracy.\n## Definition and Etymology\n\n### Origins and Meaning of \"Islam\"\n\nThe word \"Islam\" derives from the Arabic triliteral root *s-l-m* (س-ل-م), which encompasses concepts of peace (*salām*), safety, wholesomeness, and submission. This root appears over 140 times in the Quran in various forms, reflecting its semantic range related to security from harm and surrender to a higher authority. In Semitic linguistics, the root predates Islam, appearing in related languages like Hebrew (*shalom*) for peace, but the specific nominal form * Islām* as a religious designation emerged in 7th-century Arabia.\n\nWithin Islamic theology, \"Islam\" primarily signifies voluntary submission (*istislām*) to the will of God (*Allāh*), implying total obedience and peace attained through such surrender rather than mere pacifism. The Quran explicitly defines it as such in verses like 3:19 (\"Indeed, the religion in the sight of Allah is Islam\") and 3:85 (\"And whoever desires other than Islam as religion—never will it be accepted from him\"), where it denotes the primordial monotheistic path of prophets preceding the Prophet Muhammad. This interpretation aligns with the verbal form *aslama*, meaning \"he submitted,\" used in the Quran to describe acts of yielding to divine command, as in Abraham's submission (2:131).\n\nHistorically, the term \"Islam\" as the name for the religion originated with the Quranic revelations to the Prophet Muhammad beginning in 610 CE in Mecca, marking its first attestation in that context; pre-Islamic Arabic sources show the root *s-l-m* in pagan treaties for truce or protection (*sulh*), but not *Islām* as a faith label. Early non-Muslim references, such as 7th-century Syriac texts, rendered it variably but recognized it as denoting the Prophet Muhammad's followers' submission practices by around 634 CE. Scholarly analyses note that while the root's peaceful connotation is emphasized in modern apologetics, classical Arabic lexicons prioritize submission as the core verbal action underlying *Islām*.\n### Relation to Submission and Historical Usage\n\nThe Arabic term *islām* derives from the root *s-l-m*, which encompasses meanings of peace (*salām*), safety, and submission or surrender (*aslama*, \"he submitted\"). In the context of the religion, it specifically denotes voluntary submission to the will of God (Allah), emphasizing total obedience and peace attained through such surrender. This etymological link underscores Islam's core theological posture: a monotheistic framework where adherents align their lives with divine commandments, contrasting with pre-Islamic polytheistic practices in Arabia.\n\nThe Quran explicitly ties *islām* to submission, as in Surah Al Imran 3:19: \"Indeed, the religion in the sight of Allah is Islam,\" rendered as submission to His will, with prior Abrahamic traditions framed as earlier instances of such submission rather than distinct religions. This usage portrays *islām* not as a novel invention but as the primordial, universal mode of devotion to the one God, retroactively applied to prophets like Abraham, who is described as a *muslim* (one who submits) in Quran 3:67. The term thus serves to unify prophetic history under a single paradigm of surrender, rejecting polytheism or alteration of divine law.\n\nHistorically, the noun *islām* as a designation for the religious system emerged with Prophet Muhammad's revelations beginning in 610 CE, distinguishing his message from the dominant Arab polytheism (*jahiliyyah*, or age of ignorance) prevalent in pre-Islamic Arabia, where tribal rituals centered on idols at the Kaaba in Mecca. While the verbal form *aslama* may have appeared sporadically in pre-Islamic contexts to denote general surrender or treaty-making, no evidence indicates *islām* functioned as a proper name for a monotheistic faith before Prophet Muhammad; instead, it gained prominence through Quranic deployment to describe both individual conversion and the collective path. The earliest epigraphic use by Muslims appears in the 691 CE inscriptions on the Dome of the Rock in Jerusalem, affirming *islām* as submission to Allah alone. Over subsequent centuries, the term solidified in Islamic jurisprudence and historiography, as seen in works like Ibn Ishaq's biography of Muhammad (compiled circa 767 CE), where conversion narratives invoke *aslama* to signify allegiance to the new order.\n## Theological Foundations\n\n### Concept of God (Tawhid)\n\nTawhid, derived from the Arabic root *wahhada* meaning \"to make one,\" denotes the indivisible oneness of Allah as the sole deity worthy of worship, creator, sustainer, and sovereign over the universe. In Islamic theology, it rejects any form of association (shirk) with Allah, including polytheism, trinitarianism, or attributing divine qualities to prophets, saints, or created beings. This doctrine underpins all Islamic beliefs and practices, with the Quran repeatedly emphasizing Allah's uniqueness, as in Surah Al-Ikhlas (112:1-4): \"Say, 'He is Allah, [who is] One, Allah, the Eternal Refuge. He neither begets nor is born, Nor is there to Him any equivalent.'\" The principle is affirmed even by pre-Islamic Arabs in acknowledging Allah's lordship, though they deviated by worshiping intermediaries.\n\nScholars categorize Tawhid into three interconnected aspects to delineate its full scope. Tawhid al-Rububiyyah affirms Allah's exclusive lordship as the sole Creator, Provider, and Controller of all affairs, without partners in sustaining existence. Tawhid al-Uluhiyyah demands directing all acts of worship—prayer, sacrifice, vows—solely to Allah, prohibiting invocation of any other entity, which distinguishes true monotheism from nominal theism observed in some polytheistic societies. Tawhid al-Asma wa al-Sifat requires affirming Allah's names and attributes exactly as described in the Quran and authentic Sunnah, neither negating them nor likening them to human qualities, thus preserving divine transcendence. These divisions, articulated by medieval theologians, underscore that incomplete adherence in any aspect constitutes deficient faith.\n\nThe Quran reinforces Tawhid through direct commands and refutations of opposing views prevalent in 7th-century Arabia and beyond, such as attributing daughters to Allah or divine sonship to figures like Jesus. For instance, Quran 112:3 explicitly denies begetting or being begotten, countering Christian Trinitarian claims of God's triune nature as incompatible with oneness. Shirk, the antithesis of Tawhid, is deemed the gravest sin, unforgivable if unrepented, as stated in Quran 4:48: \"Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills.\" This uncompromising stance stems from causal reasoning that divided divinity implies fragmented sovereignty and power, undermining unified creation and moral order observable in natural laws.\n\n### Prophets, Including Muhammad's Role\n\nIn Islamic doctrine, prophets are human beings chosen by God to receive divine revelation and convey messages of monotheism, moral guidance, and warnings against disbelief to their communities. Belief in all prophets is the fourth of the six articles of faith (iman), requiring Muslims to affirm that God sent messengers to every nation throughout history. Islamic tradition holds that there were approximately 124,000 prophets, though the Quran explicitly names 25, including figures recognized in Abrahamic traditions such as Abraham, Moses, and Jesus.\n\nThe prophets form an unbroken chain of divine guidance beginning with Adam, regarded as the first human and prophet, and continuing through figures like Noah, Abraham, Moses, and Jesus, each tasked with upholding tawhid (the oneness of God) amid prevailing idolatry or deviation. These messengers, distinguished from ordinary prophets by receiving new scriptures or laws (e.g., Torah to Moses, Gospel to Jesus), progressively clarified God's will, with each affirming prior revelations while correcting distortions.\n\nMuhammad ibn Abdullah, born around 570 CE in Mecca, occupies the culminating position as the final prophet and messenger, designated the \"Seal of the Prophets\" in Quran 33:40, signifying the completion and perfection of divine revelation with no subsequent prophets. He received the Quran via the angel Gabriel starting in 610 CE during a retreat in the Cave of Hira near Mecca, with revelations continuing over 23 years until his death in 632 CE in Medina. Unlike previous prophets sent to specific peoples, Muhammad's prophethood is universal, addressing all humanity and jinn, and his message abrogates inconsistent elements of earlier scriptures while confirming their core monotheistic essence.\n\nThe named prophets in the Quran are: Adam, Idris (Enoch), Nuh (Noah), Hud, Saleh, Ibrahim (Abraham), Lut (Lot), Ismail (Ishmael), Ishaq (Isaac), Yaqub (Jacob), Yusuf (Joseph), Ayyub (Job), Shuayb (Jethro), Musa (Moses), Harun (Aaron), Dhul-Kifl (Ezekiel), Dawud (David), Sulayman (Solomon), Ilyas (Elijah), Al-Yasa (Elisha), Yunus (Jonah), Zakariya (Zechariah), Yahya (John the Baptist), Isa (Jesus), and Muhammad. This lineage underscores Islam's view of prophetic continuity, with Muhammad restoring the pure faith of Abraham (millah Ibrahim) as the final link.\n\n### Scriptures: Quran and Hadith\n\nThe Quran is regarded in Islamic tradition as the verbatim word of God revealed to Prophet Muhammad beginning in 610 CE during the month of Ramadan in the Cave of Hira near Mecca, through the angel Gabriel. Revelations continued intermittently over the next 23 years until Muhammad's death in 632 CE, addressing theological, legal, moral, and eschatological matters in response to specific events or inquiries. During Muhammad's lifetime, the text was primarily transmitted orally by memorizers known as huffaz, with portions recorded on materials such as palm leaves, bones, and parchment by scribes.\n\nFollowing Muhammad's death, the Battle of Yamama in 632 CE resulted in the loss of many huffaz, prompting Caliph Abu Bakr (r. 632–634 CE) to commission Zaid ibn Thabit to compile the revelations into a single codex, drawing from written fragments and memorizers' recitations to preserve the text. This codex passed to Caliph Umar and then his daughter Hafsa. Under Caliph Uthman (r. 644–656 CE), around 650 CE, a standardized version was produced to resolve dialectal variations in recitation, with copies distributed to major cities and non-standard variants ordered destroyed. Islamic tradition holds this Uthmanic codex as the definitive text, unchanged since, though some Western scholars question the completeness of early standardization due to reliance on oral transmission and limited contemporary manuscripts.\n\nThe Quran consists of 114 surahs (chapters) divided into approximately 6,236 ayahs (verses), arranged roughly in descending order of length rather than chronological revelation, with Meccan surahs generally preceding Medinan ones. Composed in classical Arabic, it is considered by Muslims to exhibit linguistic inimitability (i'jaz), serving as a literary miracle, and encompasses themes from monotheism and prophecy to social laws and afterlife judgment. Later verses can abrogate (naskh) earlier ones on the same topic, a principle derived from Quranic statements such as in Surah 2:106.\n\nThe Hadith comprise reports of Muhammad's sayings (qawl), actions (fi'l), tacit approvals (taqrir), and physical attributes, collectively forming the Sunnah, which elucidates and supplements the Quran. Unlike the Quran, viewed as direct divine speech and infallible, Hadith are human narrations requiring authentication, with the Quran taking precedence in any apparent conflict. In Sunni Islam, the six canonical collections (Kutub al-Sittah)—Sahih al-Bukhari (compiled by al-Bukhari, d. 870 CE), Sahih Muslim (d. 875 CE), Sunan Abi Dawud (d. 889 CE), Jami' al-Tirmidhi (d. 892 CE), Sunan al-Nasa'i (d. 915 CE), and Sunan Ibn Majah (d. 887 CE)—were assembled in the 9th century after evaluating over 600,000 narrations.\n\nHadith authenticity is assessed via the isnad (chain of transmitters) and matn (content), grading them as sahih (authentic), hasan (good), da'if (weak), or mawdu' (fabricated) based on narrators' reliability, memory, and continuity back to Muhammad. Traditional hadith scholars developed this science over two centuries to filter forgeries, rejecting thousands, yet critics, including some modern Muslim reformers and Western academics, argue that the 200-year gap between Muhammad and major collections, combined with oral transmission's vulnerabilities to error or invention for sectarian or political motives, undermines full reliability despite isnad rigor. Shia Islam relies on different collections, such as al-Kafi, emphasizing narrations from Ali and the Imams.\n\nTogether, the Quran and Hadith form the basis of Islamic theology and law (Sharia), with the former providing core principles and the latter practical exemplars; jurists derive rulings primarily from their conjunction, as the Quran often states commands like prayer without detailing modalities supplied by Hadith. This dual reliance underscores Islam's emphasis on emulating Muhammad as the ideal human, per Quran 33:21.\n### Angels, Predestination, and Eschatology\n\nIn Islamic theology, angels (mala'ika) are incorporeal beings created by God from light, possessing no free will and existing solely to execute divine commands without disobedience. They are invisible to humans under normal circumstances and lack physical needs such as food, drink, or reproduction, emphasizing their role as pure agents of God's will. The Quran describes them as having wings, with variations in number—some bearing two, others three or four, or even more—symbolizing their swift obedience and multifaceted capabilities (Quran 35:1).\n\nKey angels fulfill specialized functions: Jibril (Gabriel) serves as the primary messenger, delivering revelations including the Quran to Prophet Muhammad over 23 years; Mikail (Michael) oversees the provision of sustenance, rain, and natural welfare; Israfil holds the trumpet for the eschatological blast initiating resurrection; and the angel of death (Malak al-Mawt), often identified as Azrael, extracts souls at appointed times.  Pairs of angels known as Kiraman Katibin record every human deed, positive and negative, for accountability on Judgment Day, while others guard individuals by divine order (Quran 13:11). Angels also participate in cosmic events, such as bearing God's throne and intervening in battles like Badr to aid believers.\n\nBelief in predestination (qadar) constitutes one of the six articles of faith (iman), asserting God's comprehensive foreknowledge, decree, and creation of all events, including human actions, while maintaining human accountability through moral choice. The Quran affirms this dual reality: God guides whom He wills and leaves astray whom He wills (Quran 14:4), yet humans are not compelled, as evidenced by commands to strive and warnings of consequences. Theological debates arose early; the Mu'tazila school, influential in the 8th-10th centuries, prioritized rational human free will to preserve divine justice, rejecting strict predestination as implying God authors evil. In contrast, the dominant Ash'ari school, formalized by Abu al-Hasan al-Ash'ari (d. 936 CE), reconciled qadar with responsibility via \"acquisition\" (kasb): God creates all acts, but humans acquire them through intention, avoiding both fatalism and absolute autonomy. This framework counters deterministic interpretations that could undermine incentives for ethical conduct, as critiqued in orthodox hadith compilations.\n\nEschatology in Islam focuses on the inevitable Day of Judgment (Yawm al-Qiyamah), a cataclysmic event heralded by Israfil's trumpet blast, collapsing the universe and resurrecting all souls for divine reckoning based on faith, deeds, and God's mercy (Quran 39:68). Preceding signs divide into minor (e.g., widespread immorality, false prophets, and the sun rising from the west) and major (e.g., the Mahdi's emergence, Dajjal's deception, Jesus's return to slay him, and release of Gog and Magog), drawn from prophetic hadith in collections like Sahih Bukhari and Muslim. Post-death, souls enter barzakh—an intermediate realm of questioning by angels Munkar and Nakir and provisional punishment or comfort—until the final gathering on a barren plain, where records are weighed on scales, prophets intercede, and individuals cross the Sirat bridge over hellfire, succeeding based on righteous works. Outcomes bifurcate into eternal paradise (Jannah), with tiers of gardens, rivers, and companions for the faithful, or hell (Jahannam), featuring layers of fire and torment for disbelievers and grave sinners, though some hadith suggest temporary purification for Muslims. The Quran stresses personal responsibility, with no intercession saving polytheists, underscoring eschatology's role in motivating adherence to monotheism and law.\n## Core Practices\n\n### The Five Pillars\n\nThe Five Pillars of Islam represent the foundational obligations for Sunni Muslims, encapsulating core acts of worship derived primarily from prophetic tradition as recorded in hadith collections. A key hadith narrated by Ibn Umar from the Prophet Muhammad states: \"Islam has been built on five [pillars]: testifying that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing the salah (prayer), paying the zakat (obligatory alms), making the hajj (pilgrimage) to the House, and fasting in Ramadhan.\" This framework, while not enumerated as a single list in the Quran, draws support from scattered Quranic injunctions on each pillar, with details elaborated in authentic hadith. Observance of these pillars is deemed essential for fulfilling religious duties, though exemptions apply for the ill, elderly, or financially unable in cases like hajj and zakat.\n\n**Shahada (Testimony of Faith)**  \nThe shahada is the declaration: \"There is no god but Allah, and Muhammad is the Messenger of Allah\" (La ilaha illallah, Muhammadur rasulullah). It affirms tawhid (the oneness of God) and the prophethood of Muhammad, serving as the entry point to Islam; recitation with sincere belief converts an individual. The Quran emphasizes bearing witness to Allah's oneness, as in Surah Al-Imran 3:18: \"Allah witnesses that there is no deity except Him, and [so do] the angels and those of knowledge.\" Hadith collections reinforce its centrality, with the Prophet linking it directly to the pillars' foundation. Public recitation occurs during conversion, adhan (call to prayer), and funerals, underscoring its role in communal identity.\n\n**Salat (Ritual Prayer)**  \nSalat requires Muslims to perform five daily prayers at prescribed times: fajr (dawn), zuhr (noon), asr (afternoon), maghrib (sunset), and isha (night). Each involves ritual purification (wudu), facing the Kaaba in Mecca (qibla), and recitation of Quranic verses in Arabic, totaling 17 rak'ahs (units) daily for able adults. The Quran mandates prayer repeatedly, such as in Surah An-Nisa 4:103: \"Indeed, prayer has been decreed upon the believers a decree of specified times,\" with verses alluding to timings like dawn (17:78), noon (20:130), and night (24:58). Details on the fivefold structure and method stem from hadith, including the Prophet's ascension (Isra and Mi'raj) where the number was reduced from fifty to five. Congregational prayer, especially Friday's jumu'ah, fosters discipline and community, with non-performance considered a major sin absent valid excuse.\n\n**Zakat (Obligatory Almsgiving)**  \nZakat is an annual wealth tax of 2.5% on savings exceeding the nisab threshold (approximately 85 grams of gold or equivalent), distributed to specified recipients like the poor, debtors, and wayfarers as outlined in Quran 9:60. It purifies wealth and soul, combating hoarding; the Prophet stated in hadith: \"Islam has been built on five [pillars]... paying the zakat.\" Calculation applies to cash, livestock, crops, and gold/silver above nisab held for a lunar year (hawl), with exemptions for primary residences and tools of trade. Sahih al-Bukhari records exemptions for small holdings: \"No zakat is due on property mounting to less than five awsuq (of dates or grain).\" Historically, caliphs like Abu Bakr enforced collection, fighting apostates who withheld it, viewing it inseparable from faith.\n\n**Sawm (Fasting in Ramadan)**  \nSawm entails abstaining from food, drink, sexual relations, and sinful speech from dawn to sunset during Ramadan, the month the Quran was revealed, as per Surah Al-Baqarah 2:183: \"O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous.\" Exemptions include the ill, travelers, pregnant, or menstruating, who make up missed days later or offer fidya (compensation) if unable. The fast ends daily with iftar and culminates in Eid al-Fitr. Hadith ties it to the pillars: \"Islam has been built on five [pillars]... fasting in Ramadhan.\" Quran 2:185 specifies Ramadan's timing by the sighted moon, promoting self-restraint and empathy for the needy.\n\n**Hajj (Pilgrimage to Mecca)**  \nHajj is the once-in-a-lifetime pilgrimage to Mecca during Dhul-Hijjah, involving rituals like tawaf (circumambulation of the Kaaba), standing at Arafat, and stoning pillars symbolizing rejection of evil. Quran 3:97 mandates: \"And [due] to Allah from the people is a pilgrimage to the House—for whoever is able to find thereto a way.\" Ability requires physical health, financial means for travel without debt, and safe passage; women typically require a mahram escort. Over 2 million perform it annually under Saudi oversight since 1925. The Prophet included it in the pillars via hadith, linking it to Abrahamic origins. Umrah, a non-obligatory pilgrimage, shares rites but occurs anytime. Completion earns forgiveness, per hadith: \"Whoever performs hajj for Allah's sake only and does not have sexual relations with his wife, and does not do evil or sins, then he will return as the day his mother bore him.\"\n\n### Additional Rituals and Observances\n\nMuslims perform various recommended rituals and observances beyond the obligatory Five Pillars, known as sunnah or mustahabb acts, which draw from the Quran, authenticated hadiths, and the example of Muhammad to foster greater piety and proximity to God. These practices emphasize voluntary devotion, communal gathering, and personal spiritual discipline, with rewards promised in prophetic traditions for their observance. \n\nSalat al-Jumu'ah, the Friday congregational prayer, replaces the noon Zuhr prayer and requires attendance at a mosque for adult males, featuring two rak'ahs of prayer preceded by a sermon (khutbah) delivered by an imam on religious and moral topics. Performed weekly after sunrise on Fridays, it underscores community unity, with hadiths stating that Allah disperses angels to record attendance and that missing it without excuse equates to abandoning prayer altogether. Women may attend but are not obligated, and the prayer must occur in congregation of at least three to forty people depending on scholarly interpretations. \n\nEid prayers mark the two major festivals: Salat al-Eid for Eid al-Fitr on the first day of Shawwal following Ramadan's fast, and for Eid al-Adha on the tenth of Dhul-Hijjah coinciding with Hajj's culmination. Each consists of two rak'ahs with additional takbirs (declarations of \"Allahu Akbar\"), performed in open spaces or mosques post-sunrise, emphasizing gratitude and sacrifice; for Eid al-Adha, it follows ritual animal slaughter commemorating Abraham's obedience. These prayers are sunnah mu'akkadah (emphasized recommended), attended communally without a preceding call to prayer (adhan) or iqamah in some traditions. \n\nVoluntary fasting (sawm tatawwu') supplements Ramadan's obligation, including six days in Shawwal for rewards equivalent to a year's worship per hadith, Mondays and Thursdays for deeds presented to God, the Day of Arafah (ninth Dhul-Hijjah) expiating prior and subsequent year sins for non-pilgrims, and Ashura (tenth Muharram) with its preceding day. These fasts from dawn to sunset abstain from food, drink, and marital relations, promoting self-control; perpetual fasting like David’s alternating days is praised but not required. Prohibited days include Eid festivals to distinguish obligatory from voluntary acts. \n\nSadaqah entails voluntary charity exceeding Zakat's fixed alms, encompassing monetary gifts, kind acts, or aid to the needy, animals, or environment, rooted in the term's meaning of \"truthfulness\" as sincere devotion. Hadiths equate it to shielding from calamity, multiplying wealth, and interceding on Judgment Day, with forms like providing water or knowledge yielding ongoing rewards (sadaqah jariyah). Unlike Zakat's 2.5% on savings, sadaqah has no minimum, encouraging habitual generosity. \n\nDhikr, the verbal remembrance of Allah through repetitive phrases like \"Subhanallah\" (33 times), \"Alhamdulillah\" (33 times), and \"Allahu Akbar\" (34 times) post-prayer, or invoking His 99 names, cleanses the heart, repels Satan, and brings tranquility as per Quranic injunctions to remember God standing, sitting, or lying down. Prophetic traditions promise it as the best deed after obligations, filling any void left by other worship with divine light and protection. Often using prayer beads (tasbih), it forms a core of daily devotion, especially in solitude or gatherings. \n\nAdditional voluntary prayers (nawafil), such as Tahajjud at night or Duha before noon, extend the five daily salats, with hadiths indicating they compensate for shortcomings in fard prayers and elevate status in paradise. Quran recitation beyond ritual, seeking knowledge, and ethical conduct like enjoining good further embody these observances, though orthodox Sunni scholarship cautions against innovations like widespread birthday celebrations of Muhammad, viewing them as unsubstantiated by early sources. \n\n## Historical Development\n\n### Pre-Islamic Arabia and Muhammad's Era (570–632 CE)\n\nPre-Islamic Arabia consisted primarily of nomadic Bedouin tribes inhabiting the Arabian Peninsula's vast deserts, supplemented by settled communities in oases and trade centers like Mecca and Yathrib (later Medina). Society was organized around kinship ties within tribes, such as the Quraysh in Mecca, with survival dependent on camel herding, raiding (ghazw), and caravan trade routes linking Byzantium, Persia, and Yemen.   Economic activities included incense and spice trade, fostering polycentric pilgrimage to sites like the Kaaba in Mecca, which housed idols representing tribal deities. \n\nReligion in pre-Islamic Arabia was predominantly polytheistic, centered on animistic spirits (jinn), astral deities, and tribal gods, with Allah acknowledged as a supreme creator but subordinated to intercessors like his purported daughters al-Lat, al-Uzza, and Manat. The Kaaba served as a shared sanctuary, drawing annual fairs for trade and poetry recitation, though intertribal feuds persisted due to honor codes (asabiyyah). Monotheistic pockets existed, including Jewish tribes in Yathrib, Christian communities in Najran and along trade routes, and Yemen's Himyarite Jewish rulers, alongside Hanifs—Arab seekers of pure monotheism rejecting idols.   These influences stemmed from contacts with Sassanid Persia, Byzantine Syria, and Abyssinian Ethiopia, but polytheism dominated nomadic life. \n\nMuhammad ibn Abdullah was born circa 570 CE in Mecca to the Banu Hashim clan of the Quraysh tribe, orphaned early—his father Abdullah died before birth, mother Amina at age six—and raised by grandfather Abdul Muttalib then uncle Abu Talib.  As a merchant, he gained reputation for trustworthiness (al-Amin), marrying wealthy widow Khadija bint Khuwaylid around age 25; they had several children, including daughter Fatima.  At age 40, during Ramadan 610 CE, Muhammad experienced the first Quranic revelation in the Cave of Hira near Mecca, commanded by the angel Gabriel to \"Recite\" (Iqra), marking the inception of his prophethood and emphasis on tawhid (monotheism).  \n\nInitial preaching in Mecca from 610–622 CE attracted converts among the marginalized but provoked Quraysh elite opposition, who viewed monotheism and social leveling as threats to polytheistic commerce and tribal hierarchy. Persecution intensified, prompting small migrations to Abyssinia (615 CE) under Christian Negus; Muhammad's followers numbered around 150 by 622 CE.  Economic boycotts and assassinations attempts ensued, culminating in the Hijra (migration) to Yathrib in 622 CE, where Aws and Khazraj tribes sought Muhammad as arbiter. \n\nIn Medina, Muhammad established the Constitution of Medina (622 CE), a pact forming an ummah (community) uniting Muslim emigrants (Muhajirun), Medinan helpers (Ansar), and Jewish tribes under mutual defense, prohibiting internal feuds, and designating Muhammad as leader for disputes.  This document outlined rights, blood money (diya) equivalences, and collective retaliation against external aggression, fostering a proto-state amid raids on Meccan caravans to sustain the community. \n\nKey conflicts defined the Medinan period: the Battle of Badr (March 624 CE), where 313 Muslims defeated 1,000 Quraysh, killing leaders like Abu Jahl and capturing spoils, interpreted as divine aid.  The Battle of Uhud (March 625 CE) saw initial Muslim gains reversed when archers abandoned positions for loot, allowing Quraysh counterattack that killed 70 Muslims, including Hamza ibn Abdul Muttalib, though Mecca suffered heavier losses overall.  The Battle of the Trench (April 627 CE) involved a 10,000-strong confederacy besieging Medina; a defensive ditch and storms led to coalition dispersal with minimal Muslim casualties. Following the battle, Muslim forces besieged the fortress of the Jewish tribe Banu Qurayza for 25 days amid allegations of treasonous collaboration with the confederacy; the tribe surrendered and submitted to arbitration by Sa'd ibn Mu'adh, who decreed the execution of 600-900 adult males, enslavement of women and children, and division of property as spoils, a verdict Muhammad approved as divine judgment.  \n\nBy 630 CE, weakened Quraysh submitted; Prophet Muhammad conquered Mecca bloodlessly, destroying idols in the Kaaba while granting amnesty, consolidating control over Arabia through alliances and delegations.  He died on June 8, 632 CE in Medina at age 62 or 63, from illness following a farewell pilgrimage, leaving no designated successor and a unified peninsula under Islamic auspices. \n### Early Conquests and Rashidun Caliphate (632–661 CE)\n\nFollowing Muhammad's death on June 8, 632 CE, the Muslim community in Medina selected Abu Bakr as the first caliph, initiating the Rashidun Caliphate, a period marked by rapid military expansion driven by religious zeal, tribal unification, and the exhaustion of the Byzantine and Sassanid empires from prolonged warfare. Abu Bakr, facing internal apostasy (Ridda wars) from 632 to 633 CE, suppressed rebellions by tribes withholding zakat or claiming prophethood, such as Musaylima in Yamama, where forces under Khalid ibn al-Walid killed an estimated 7,000 to 13,000 apostates in the Battle of Yamama. These campaigns, involving 11,000 to 40,000 troops across Arabia, reasserted central authority and mobilized Arab warriors for external conquests.\n\nUnder Abu Bakr's successor Umar ibn al-Khattab, who assumed the caliphate in 634 CE after Abu Bakr's death on August 23, 634 CE, the conquests accelerated, capturing key territories from the weakened Sassanid Empire and Byzantine Empire, whose resources were depleted by the Byzantine-Sassanid War of 602–628 CE that left both empires with devastated economies and depleted armies. In 636 CE, Muslim forces under Khalid ibn al-Walid defeated a Byzantine army of 40,000–100,000 at the Battle of Yarmouk near the Yarmuk River, resulting in Byzantine losses estimated at 40,000 and securing Syria, with Damascus surrendering in 635 CE and Jerusalem in 638 CE. Concurrently, in Mesopotamia, the Battle of al-Qadisiyyah in late 636 CE saw 30,000 Muslim troops under Sa'd ibn Abi Waqqas rout a Sassanid force of 30,000–100,000 led by Rustam Farrukh Hormizd, killing Rustam and opening Iraq to conquest, with Ctesiphon falling by March 637 CE. These victories, attributed to superior mobility, morale, and tactical flexibility of lightly armored Arab cavalry against heavier infantry, expanded the caliphate to include Persia by 651 CE after the Battle of Nahavand in 642 CE.\n\nUmar's administration further consolidated gains through the conquest of Egypt in 639–642 CE, where Amr ibn al-As's 4,000-man army defeated Byzantine forces at Heliopolis and besieged Alexandria, leading to a treaty granting Muslims control and imposing jizya on non-Muslims; Egypt's granaries then supplied the caliphal armies. Umar established a diwan system for military stipends based on service and tribal status, fostering loyalty among warriors, and appointed governors like Muawiya in Syria, while prohibiting land grants to prevent feudalism. His assassination by a Persian slave on November 3, 644 CE ended a caliphate that had grown from Arabian peninsula control to an empire spanning 2.2 million square miles with 29 million subjects.\n\nUthman ibn Affan, caliph from 644 to 656 CE, continued expansions into Armenia, Cyprus (raided 649 CE), and North Africa, reaching Tripoli by 647 CE, but internal discontent arose from nepotism in appointments and perceived favoritism toward his Umayyad clan, culminating in his siege and murder in Medina on June 17, 656 CE by rebels from Egypt, Kufa, and Basra. Ali ibn Abi Talib's caliphate (656–661 CE) faced civil strife, including the Battle of the Camel in December 656 CE near Basra, where Ali's forces defeated Aisha's coalition, killing 5,000–10,000, and the Battle of Siffin in 657 CE against Muawiya, which ended inconclusively via arbitration, eroding Ali's authority. Ali's assassination on January 28, 661 CE by a Kharijite in Kufa led to Muawiya's ascension, transitioning to the Umayyad Caliphate, though the Rashidun era's conquests laid the foundation for Islam's spread across three continents through military prowess and administrative innovations amid tribal and doctrinal tensions.\n\n### Umayyad and Abbasid Expansion (661–1258 CE)\n\nThe Umayyad Caliphate, established in 661 CE by Muawiya I following the First Fitna, marked a shift from elective to hereditary rule with Damascus as its capital. Under Umayyad governance, military campaigns extended Islamic territories significantly, incorporating regions such as Ifriqiya, Transoxiana, Sindh, the Maghreb, and Hispania (al-Andalus) by 750 CE. The conquest of Hispania began in 711 CE under Tariq ibn Ziyad, reaching completion by 718 CE, while eastern expansions reached Bukhara, Samarkand, and Khwarezm in Central Asia. These advances relied on Arab tribal armies, bolstered by incentives like land grants and lower taxes for converts, though non-Muslims paid jizya tribute, facilitating gradual Islamization amid ongoing Zoroastrian, Christian, and Hindu majorities in conquered areas.\n\nThe Abbasid Revolution in 750 CE overthrew the Umayyads, with Abbasid forces under Abu al-Abbas al-Saffah massacring most Umayyad princes except Abd al-Rahman I, who fled to establish the Emirate of Córdoba. The Abbasids, claiming descent from Muhammad's uncle Abbas, relocated the capital to Baghdad in 762 CE, fostering a more inclusive administration that integrated Persian bureaucrats and mawali (non-Arab converts). While territorial expansion slowed compared to the Umayyads, Abbasid forces consolidated holdings and briefly pushed into Anatolia and India, emphasizing internal stability over new conquests.\n\nThe Abbasid era, particularly from 750 to 833 CE under caliphs like Harun al-Rashid and al-Ma'mun, ushered in a period of intellectual flourishing known as the Islamic Golden Age, centered in Baghdad's House of Wisdom. Scholars translated Greek, Persian, and Indian texts, advancing fields such as mathematics (e.g., al-Khwarizmi's algebra), medicine (e.g., al-Razi's clinical observations), and optics (e.g., Ibn al-Haytham's experiments). This synthesis, supported by state patronage and trade routes linking China to the Mediterranean, elevated Abbasid prestige, though underlying ethnic tensions and reliance on Turkish slave soldiers foreshadowed decline.\n\nBy the 13th century, Abbasid authority fragmented amid regional dynasties like the Seljuks and Buyids, reducing the caliph to a symbolic figure. The caliphate ended with the Mongol siege of Baghdad in January 1258 CE, led by Hulagu Khan; after defenses crumbled by February 5, the city was sacked for a week, resulting in over 200,000 to 1 million deaths, the destruction of libraries, and the execution of Caliph al-Musta'sim. This cataclysm terminated centralized Abbasid rule, scattering scholars and halting the Golden Age's momentum.\n\n### Post-Mongol Fragmentation and Regional Empires (1258–1800 CE)\n\nThe Mongol invasion culminated in the sack of Baghdad on February 3, 1258, by Hulagu Khan's forces, resulting in the death of the last Abbasid caliph, al-Musta'sim, and the effective end of the centralized Abbasid Caliphate, which had symbolized Islamic unity since 750 CE. This event fragmented the Islamic world politically, as Mongol hordes devastated Persia, Iraq, and parts of Syria, killing an estimated hundreds of thousands and destroying key centers of learning like the House of Wisdom, though some libraries survived in part. The power vacuum led to the rise of regional military elites and successor states, with no single authority reclaiming the caliphal mantle until later symbolic revivals.\n\nIn Egypt and Syria, the Mamluk Sultanate, established by former slave soldiers who overthrew the Ayyubids in 1250, halted the Mongol advance decisively at the Battle of Ain Jalut on September 3, 1260, under Sultan Qutuz and Baybars, marking the first major defeat of the Mongols and preserving Islamic rule in the Levant. The Mamluks, primarily Turkic in origin, reestablished a puppet Abbasid caliphate in Cairo in 1261, providing nominal religious legitimacy while wielding real power as Sunni sultans until their conquest by the Ottomans in 1517; they controlled trade routes, patronized architecture like the madrasas of Cairo, and defended against Crusader remnants and Timurid threats.\n\nTo the east, the Ilkhanate, a Mongol khanate ruling Persia and adjacent regions from 1256, gradually Islamized; Ghazan Khan's formal conversion to Sunni Islam in 1295, influenced by advisors like the vizier Rashid al-Din, integrated Islamic administration, taxation, and law, fostering a cultural renaissance in historiography and art despite ongoing internal strife. The Ilkhanate fragmented after 1335 amid plagues and succession wars, paving the way for local dynasties. Timur (Tamerlane), a Turco-Mongol warlord claiming descent from Genghis Khan, established the Timurid Empire from 1370 to 1405, conquering Persia, Central Asia, and sacking Delhi in 1398 with massacres exceeding 100,000; a devout Sunni who invoked Islamic jihad rhetoric, Timur patronized Persianate culture in Samarkand but his empire dissolved into successor states by the mid-15th century.\n\nBy the 16th century, three \"gunpowder empires\" dominated: the Ottoman Empire in Anatolia and the Balkans, originating under Osman I around 1299, expanded under Mehmed II's conquest of Constantinople on May 29, 1453, renaming it Istanbul and positioning the Ottomans as Sunni caliphs after absorbing the Mamluks in 1517, ruling over 20-30 million subjects by 1600 with a millet system for non-Muslims. In Persia, the Safavid dynasty under Shah Ismail I from 1501 enforced Twelver Shia Islam as the state religion, converting a predominantly Sunni population through ulama importation from Lebanon and forced measures, solidifying Shia identity against Sunni Ottoman rivals until the dynasty's fall in 1736. In India, Babur founded the Mughal Empire in 1526 after defeating the Delhi Sultanate at Panipat, reaching its zenith under Akbar (r. 1556–1605), who pursued tolerant policies like abolishing jizya tax on non-Muslims and interfaith dialogues, contrasting with Aurangzeb's (r. 1658–1707) orthodox enforcement of sharia, temple destructions, and reimposition of jizya, amid territorial peaks covering 4 million square kilometers but sowing seeds of Hindu rebellion.\n\nElsewhere, regional powers proliferated: the Delhi Sultanate persisted until 1526 with Turkic and Afghan dynasties promoting Sufi orders for conversion; West African Songhai Empire under Askia Muhammad (r. 1493–1528) expanded Islamic scholarship in Timbuktu; and Moroccan Saadians defeated Portuguese incursions while claiming sharifian descent. This era saw Islam's spread via trade and conquest to Southeast Asia and Sub-Saharan Africa, but political disunity hampered unified responses to emerging European naval powers by 1800.\n\n### Colonial Encounters and Reform Movements (1800–1945 CE)\n\nDuring the 19th century, European powers expanded into Muslim-majority territories across North Africa, the Middle East, South Asia, and Southeast Asia, marking a period of military defeats, territorial losses, and economic dependency for Islamic polities. France invaded Algeria in 1830, establishing colonial rule that displaced Ottoman suzerainty and led to prolonged resistance, including Abd al-Qadir's campaigns from 1832 to 1847. Britain consolidated control over India by 1818 following victories over the Marathas and Mysore, incorporating princely states and Mughal remnants, while occupying Egypt in 1882 after the Urabi revolt against Khedive Tawfiq's pro-European policies. The Netherlands deepened its hold on Indonesia through the 1820s Java War against Diponegoro's Islamic insurgency, and Russia annexed Central Asian khanates like Bukhara and Khiva by the 1870s. These incursions exposed military and technological disparities, prompting varied Muslim responses from armed jihad to administrative adaptation.\n\nThe Ottoman Empire, as the preeminent Islamic power, faced existential threats from European encroachment, losing Greece in 1829 and Tunisia to France in 1881, which spurred internal reforms known as the Tanzimat from 1839 to 1876. Initiated by the Gülhane Edict of 1839 under Sultan Abdülmecid I, these measures centralized taxation, reorganized the military along European lines with conscription introduced in 1843, and extended legal equality to non-Muslims via the 1856 Reform Edict, aiming to bolster loyalty amid ethnic unrest. Educational reforms included secular schools like the Imperial Ottoman Medical School in 1827 and the Military Academy's modernization, while the 1858 land code facilitated state revenue but often benefited elites. Despite intentions to preserve sovereignty through selective Westernization, the Tanzimat exacerbated fiscal strains, leading to the Ottoman Public Debt Administration in 1881 under European oversight, and failed to prevent further Balkan losses or the 1877-1878 Russo-Turkish War defeat.\n\nIn Egypt, Muhammad Ali Pasha (r. 1805-1848), an Albanian Ottoman officer, pursued aggressive modernization post-Napoleon's 1798-1801 invasion, building factories, a modern army of 130,000 by 1831, and irrigation projects that doubled cultivable land. His conquests threatened Ottoman control, culminating in the 1840 Convention of London limiting his autonomy, yet his successors like Ismail Pasha (r. 1863-1879) incurred debts funding the Suez Canal (opened 1869), inviting British-French intervention. Resistance manifested in the 1881-1882 Urabi movement, invoking Islamic solidarity against foreign influence, but was crushed, solidifying occupation. Similar patterns emerged in India, where the 1857 revolt blended Mughal restorationism with sepoy grievances against British cultural impositions like greased cartridges, resulting in direct Crown rule over 300 million subjects by 1858.\n\nReform movements emphasized revivalism and purification to counter decline. The Wahhabi doctrine, founded by Muhammad ibn Abd al-Wahhab (1703-1792), allied with the Saud family in 1744, fueled the first Saudi state's expansion to include Mecca by 1806 but was dismantled by Ottoman-Egyptian forces in 1818 after raids on holy cities. Revived as the third Saudi state under Abdulaziz ibn Saud from 1902, it captured Riyadh in 1902 and the Hejaz in 1925, leveraging tribal warfare and British support during World War I against the Ottomans, establishing a puritanical polity rejecting Ottoman \"innovations.\" Concurrently, modernist reformers like Jamal al-Din al-Afghani (1838-1897) advocated pan-Islamism to unite Muslims against imperialism, traveling across Iran, India, and Europe to promote ijtihad (independent reasoning) and scientific engagement as inherent to original Islam. His disciple Muhammad Abduh (1849-1905), Grand Mufti of Egypt from 1899, reformed Al-Azhar University by incorporating rationalism, criticizing taqlid (imitation of medieval jurists), and arguing Islam's compatibility with modernity, influencing lay intellectuals despite conservative backlash.\n\nIn India, responses diverged: the Deoband seminary (founded 1866) stressed scriptural fidelity and anti-colonial fatwas, training ulama who later influenced the 1940s Pakistan demand, while Sir Syed Ahmad Khan's Aligarh movement (1875) promoted English education and loyalty to Britain for Muslim advancement, establishing Muhammadan Anglo-Oriental College in 1875 as a precursor to Aligarh Muslim University. Sudanese Mahdism under Muhammad Ahmad (declared 1881) overthrew Turco-Egyptian rule in 1885, establishing a theocratic state until British reconquest in 1898 at Omdurman, killing 11,000 Mahdists. These efforts, blending revivalism with adaptation, often yielded short-term resistance but long-term fragmentation, as World War I alliances fractured Ottoman caliphal unity—proclaimed jihad against Allies in 1914 but undermined by Arab Revolt (1916)—leading to 1922 abolition and League of Nations mandates over Syria, Iraq, and Palestine.\n\n### Post-Colonial Era and Contemporary Dynamics (1945–Present)\n\nFollowing World War II, numerous Muslim-majority territories achieved independence from European colonial powers, reshaping the political landscape of the Islamic world. Pakistan emerged as the first modern Islamic republic in 1947 through the partition of British India, amid communal violence that displaced millions and established a state explicitly for Muslims. Indonesia gained sovereignty from the Netherlands in 1949, becoming the world's largest Muslim-majority nation, while North African states like Libya (1951), Sudan (1956), and the Maghreb countries (Morocco and Tunisia in 1956, Algeria after a protracted war ending in 1962) transitioned to self-rule. These new nation-states often adopted secular-nationalist frameworks influenced by leaders like Egypt's Gamal Abdel Nasser, prioritizing pan-Arabism over pan-Islamism, though Islamic identity persisted in constitutions and public life.\n\nThe formation of the Organization of the Petroleum Exporting Countries (OPEC) in 1960 by Iran, Iraq, Kuwait, Saudi Arabia, and Venezuela marked a pivotal economic shift, enabling Muslim-majority oil producers to assert control over pricing and production. The 1973 Arab oil embargo, imposed by OPEC's Arab members in response to Western support for Israel during the Yom Kippur War, quadrupled global oil prices, generating unprecedented revenues for Gulf states—Saudi Arabia's income surged from $4.3 billion in 1972 to $22.5 billion in 1974. This windfall funded infrastructure, welfare states, and the global export of Salafi-Wahhabi interpretations of Islam through mosques, schools, and aid, amplifying conservative religious influences across the Muslim world.\n\nParallel to economic transformations, Islamist movements gained traction as alternatives to secular nationalism, particularly after the 1967 Six-Day War exposed the failures of Arab socialist regimes. Groups like Egypt's Muslim Brotherhood, active since the 1920s but repressed under Nasser, expanded influence by critiquing Westernization and advocating sharia-based governance. The 1979 Iranian Revolution, led by Ayatollah Ruhollah Khomeini, overthrew the Pahlavi monarchy and established a Shia theocracy, inspiring both Sunni and Shia activists by demonstrating the feasibility of Islamist revolution against autocratic rule. It spurred transnational networks, including the export of revolutionary ideology, though Sunni states like Saudi Arabia countered with anti-Shia propaganda and funding for Sunni orthodoxy.\n\nThe Soviet invasion of Afghanistan in 1979 catalyzed a jihadist mobilization, with U.S., Saudi, and Pakistani support arming mujahideen fighters, fostering a generation of battle-hardened Islamists. This conflict birthed networks like Al-Qaeda, founded by Osama bin Laden in 1988, which evolved into a global terrorist franchise. The September 11, 2001, attacks by Al-Qaeda affiliates killed nearly 3,000 in the U.S., prompting the U.S.-led invasions of Afghanistan (2001) and Iraq (2003), which destabilized the region, empowered Shia militias in Iraq, and facilitated the rise of ISIS in 2014, responsible for over 20,000 deaths in peak years of attacks per the Global Terrorism Database. Islamist terrorism has accounted for the majority of global terrorism fatalities since 2000, concentrated in Muslim-majority countries like Iraq, Afghanistan, and Nigeria.\n\nThe Arab Spring uprisings beginning in Tunisia in December 2010 challenged authoritarian regimes across the Middle East and North Africa, initially driven by economic grievances and demands for dignity rather than explicit Islamism. However, Islamist parties capitalized on power vacuums: Egypt's Muslim Brotherhood won elections in 2012, implementing sharia elements before military ouster in 2013; Tunisia's Ennahda moderated to sustain democratic gains. Outcomes varied, with civil wars in Libya, Syria, and Yemen exacerbating sectarian divides and enabling jihadist groups like ISIS to seize territory until defeated by 2019 coalitions.\n\nDemographically, the global Muslim population expanded from approximately 300 million in 1950 (about 12-17% of world total) to over 1.9 billion by 2020 (24%), driven primarily by higher fertility rates averaging 2.9 children per woman versus the global 2.3, alongside youthful demographics and limited apostasy due to social and legal penalties. Migration post-1960s formed significant diaspora communities in Europe (e.g., 25 million Muslims by 2020, up from negligible numbers in 1950) and North America, influencing cultural debates on integration, halal practices, and parallel societies. Organizations like the Organisation of Islamic Cooperation, founded in 1969 with 57 members, coordinate on issues from Palestine to economic development, reflecting Islam's institutional adaptation to modern statehood.\n\n## Denominations and Sects\n\n### Sunni Islam\n\nSunni Islam represents the predominant branch of the faith, comprising 85 to 90 percent of the global Muslim population, which totals approximately 2 billion adherents as of 2025, thereby accounting for roughly 1.7 to 1.8 billion Sunnis.57963) Adherents, known as Sunnis or Ahl al-Sunnah wa al-Jama'ah (\"people of the tradition and the community\"), emphasize adherence to the Quran, the exemplary conduct (Sunnah) of Muhammad as recorded in hadith, and the consensus (ijma) of the early Muslim community. This orientation prioritizes the collective practices of Muhammad's companions over claims of exclusive interpretive authority vested in specific lineages.  \n\nThe divergence between Sunni and Shia Islam originated following Muhammad's death on June 8, 632 CE, when the Medinan community elected Abu Bakr as caliph through consultative assembly (shura), bypassing Ali ibn Abi Talib, Muhammad's cousin and son-in-law, whom Shias regard as the divinely designated successor. Sunnis validate the leadership of the first four caliphs—Abu Bakr (r. 632–634 CE), Umar ibn al-Khattab (r. 634–644 CE), Uthman ibn Affan (r. 644–656 CE), and Ali (r. 656–661 CE)—as the Rashidun (\"rightly guided\") caliphs, selected for their proximity to Muhammad and personal righteousness rather than hereditary entitlement. This consensus-based approach, rooted in the practices of the salaf (pious predecessors), distinguishes Sunni legitimacy from Shia emphasis on Ali's familial Imamate.  \n\nSunni jurisprudence (fiqh) derives from the Quran and Sunnah, authenticated via six canonical hadith collections compiled between the 9th and 10th centuries CE: Sahih al-Bukhari (d. 870 CE), Sahih Muslim (d. 875 CE), Sunan Abi Dawood (d. 889 CE), Jami' al-Tirmidhi (d. 892 CE), Sunan al-Nasa'i (d. 915 CE), and Sunan Ibn Majah (d. 887 CE). Interpretive methodologies crystallized into four orthodox schools (madhahib) by the 9th century: Hanafi, founded by Abu Hanifa (d. 767 CE) and favoring analogical reasoning (qiyas), prevalent in Turkey, Central Asia, and the Indian subcontinent; Maliki, established by Malik ibn Anas (d. 795 CE) with emphasis on Medinan practice, dominant in North and sub-Saharan Africa; Shafi'i, developed by al-Shafi'i (d. 820 CE) integrating hadith and consensus, influential in Southeast Asia, East Africa, and Yemen; and Hanbali, initiated by Ahmad ibn Hanbal (d. 855 CE) prioritizing textual literalism, the basis for Wahhabism and official in Saudi Arabia. These schools coexist without mutual exclusivity, allowing juristic flexibility (ikhtilaf) within unified doctrinal bounds.  \n\nTheologically, Sunnis affirm tawhid (God's oneness), prophethood culminating in Muhammad, and eschatological accountability, while Ash'ari and Maturidi creeds—formalized in the 9th–10th centuries—counter rationalist excesses by subordinating reason to revelation, rejecting anthropomorphism and unqualified free will in favor of divine omnipotence tempered by human accountability. Unlike Shia Islam's ongoing Imams or esoteric interpretations, Sunni authority resides in scholarly ijma and the closing of major prophetic revelation, fostering institutional stability across diverse empires from the Umayyads to the Ottomans.\n\n### Shia Islam\n\nShia Islam, comprising approximately 10-15% of the global Muslim population or 180-200 million adherents as of 2025, emerged from a dispute over leadership succession following the death of the Prophet Muhammad in 632 CE. Adherents, known as Shi'at Ali or \"partisans of Ali,\" maintain that Ali ibn Abi Talib, Muhammad's cousin and son-in-law, was divinely designated as the rightful successor through events such as the declaration at Ghadir Khumm, rather than through communal election as favored by the emerging Sunni majority who selected Abu Bakr. This schism solidified after Ali's caliphate (656-661 CE) and the martyrdom of his son Husayn at the Battle of Karbala in 680 CE, which Shias commemorate annually during Ashura as a symbol of resistance against perceived tyranny.\n\nCentral to Shia doctrine is the Imamate, a lineage of infallible (ma'sum) leaders descended from Ali and Fatima, Muhammad's daughter, who possess divinely granted knowledge and authority to interpret Islamic law and guide the community, distinct from prophethood's role in revelation. Unlike Sunnis, who emphasize consensus (ijma) and the traditions (sunna) of the Prophet's companions, Shias prioritize the Imams' guidance, viewing them as protected from error or sin to ensure unerring religious direction. This belief underpins practices such as seeking intercession from Imams and a structured clerical hierarchy, particularly among Twelvers, where senior scholars (mujtahids) derive rulings during the occultation of the twelfth Imam.\n\nThe largest Shia branch, Twelver (Ithna Ashariyyah) Shiism, predominates in Iran (state religion since 1501 CE under the Safavids), Iraq, Azerbaijan, and Bahrain, recognizing twelve Imams with the final one, Muhammad al-Mahdi, in occultation since 874 CE and expected to return as the Mahdi. Ismailis, diverging after the sixth Imam around 765 CE, follow a living Imam (e.g., the Aga Khan for Nizaris) and emphasize esoteric (batini) interpretations, with subgroups like the Musta'lis; they number in the millions across South Asia, East Africa, and the diaspora. Zaydis, the closest to Sunnis in jurisprudence and rejecting infallibility beyond basic piety, activate in Yemen where they led the Houthi movement, tracing to the fifth Imam Zayd ibn Ali (d. 740 CE) and advocating armed uprising against unjust rule.\n\nShia practices diverge from Sunni norms in ritual details, such as combining daily prayers (e.g., noon and afternoon), incorporating phrases praising Ali in the call to prayer (adhan), permitting temporary marriage (mut'ah) under specific conditions, and using a clay tablet (turbah) from Karbala for prostration in prayer to symbolize humility. Mourning rituals for the Imams, including self-flagellation in some Ashura processions, underscore themes of sacrifice, though these vary by region and have faced internal critique for excess. Historically, Shias endured systemic persecution under Umayyad (661-750 CE) and Abbasid rule, including mass killings and forced conversions, fostering a narrative of marginalization that persists in Sunni-majority contexts like Pakistan and Saudi Arabia, where sectarian violence has claimed thousands of lives since the 1980s. Despite shared pillars like the Quran, five daily prayers, fasting, almsgiving, and pilgrimage, these doctrinal and historical divergences have fueled geopolitical tensions, as seen in Iran-Saudi proxy conflicts.\n### Other Sects and Movements\n\nIbadi Islam, the dominant form of Islam in Oman and a minority elsewhere, traces its origins to the moderate faction of the early Kharijite movement that emerged during the First Fitna in the 7th century CE, rejecting both Umayyad rule and certain Shia claims while emphasizing community election of leaders over hereditary descent. Unlike the extremist Kharijites who deemed sinners as apostates deserving death, Ibadis classify grave sinners as *kufr kufr* (unbelief without full apostasy), allowing for repentance and maintaining a doctrine of *walaya* (association with true believers) and *baraa* (dissociation from unjust rulers). Ibadi theology aligns closely with Sunni schools in jurisprudence but differs in views on the imamate, predestination, and the Quran's createdness, with adherents numbering fewer than 1% of global Muslims, concentrated in Oman (where they form about 75% of the population) and pockets in North Africa such as Algeria's M'zab Valley and Libya's Nafusa Mountains.\n\nAhmadiyya, founded in 1889 by Mirza Ghulam Ahmad in Qadian, India, claims Ahmad as the promised Messiah and Mahdi, a non-law-bearing prophet subordinate to Muhammad, reviving Islam's essence amid British colonial rule without abrogating the finality of Muhammad's prophethood. Adherents uphold core Islamic tenets including the Quran's supremacy, five pillars, and rejection of idolatry, but their belief in continued subordinate prophethood has led mainstream Sunni and Shia scholars to declare them heretical or non-Muslim, citing Quranic verses like 33:40 affirming Muhammad as the Seal of Prophets. The community, estimated at 10-20 million worldwide with headquarters now in London after partition-era migration, faces severe persecution, including Pakistan's 1974 constitutional amendment declaring Ahmadis non-Muslim, mosque burnings, and extrajudicial killings, as documented by human rights reports.\n\nQuranism, a modern movement gaining traction in the 19th-20th centuries particularly among reformist thinkers in India, Egypt, and the West, rejects the binding authority of hadith collections, insisting on the Quran alone as sufficient for faith and practice, interpreting verses like 6:114 and 45:6 as prohibiting reliance on other \"hadith.\" Proponents argue many hadith contradict the Quran or stem from unreliable chains of transmission, advocating direct Quranic guidance for rituals such as prayer timings and inheritance laws, though this leads to varied practices like rejecting stoning for adultery based solely on Quranic text. Mainstream Muslims criticize Quranism as incomplete, arguing it severs the Sunnah essential for understanding Quranic implementation, as evidenced by prophetic practices during Muhammad's lifetime; adherents remain a small, decentralized group without institutional unity.\n\nGroups like the Druze, Alawites, and Alevis exhibit syncretic elements diverging from orthodox Islam, often incorporating esoteric interpretations, veneration of figures beyond prophetic bounds, or non-Islamic doctrines such as reincarnation (Druze) or deification of Ali (Alawites), leading most Sunni and Shia authorities to view them as outside the fold of Islam despite self-identifications by some members. The Druze faith, emerging in 11th-century Egypt under Fatimid influence, closed to converts after 1043 and emphasizes a tawhid with seven cosmic principles, rejecting core Islamic rituals like the five prayers. Alawites, rooted in 9th-century Twelver ghulat traditions, incorporate Christian and Gnostic influences with a trinitarian view of Muhammad-Ali-Allah, while Alevis in Turkey blend Shia reverence for Ali with shamanistic and folk elements, practicing communal meals over formal mosques. These movements, numbering in the millions regionally, persist amid debates over their Muslim status, with orthodox critiques highlighting deviations from tawhid and sharia.\n\n### Non-Denominational and Cultural Muslims\n\nNon-denominational Muslims are those who reject affiliation with established sects such as Sunni or Shia, instead identifying solely as \"just Muslim\" and prioritizing a unified, Quran-focused interpretation of Islam over jurisprudential schools or historical divisions. This approach often emphasizes the tawhid (oneness of God) and core prophetic traditions while critiquing sectarianism as a post-Quranic innovation that fragments the ummah. Surveys indicate significant prevalence in regions with histories of state-imposed secularism or syncretic practices, where at least one-in-five Muslims in 22 of 38 countries surveyed identify without sectarian labels.\n\nPrevalence is highest in Central Asia and Southern and Eastern Europe, with medians exceeding 50% non-sectarian identification; for instance, 74% of Muslims in Kazakhstan, 65% in Albania, and 64% in Kyrgyzstan self-identify as simply Muslim. In Southeast Asia, 56% in Indonesia report this view, while sub-Saharan Africa shows medians around 23%, and the Middle East-North Africa region around 12%. These patterns correlate with Soviet-era suppression of religious institutions in Central Asia, fostering a folk Islam detached from orthodox sects, as well as Ottoman legacies of administrative secularism in the Balkans.\n\nCultural Muslims, also termed nominal or non-observing Muslims, are individuals of Muslim ancestry who retain ethnic, familial, or societal ties to Islamic heritage—such as observing holidays like Eid for social reasons or valuing traditions like hospitality norms—but do not adhere to ritual obligations like daily salat (prayer) or strict halal dietary rules, often holding secular or agnostic worldviews. This phenomenon arises from modernization, urbanization, and state policies promoting laïcité or socialism, leading to low religiosity metrics; for example, in Albania, scholars describe the majority of the 50.67% Muslim-identified population as cultural or nominal, with minimal mosque attendance.\n\nIn Turkey, where 97% of the population is nominally Muslim, estimates place strict practitioners at 15-20%, with the remainder engaging Islam primarily through cultural lenses like iftar gatherings rather than theological commitment, influenced by Kemalist secular reforms since 1923. Central Asian republics maintain official secularism, resulting in widespread non-observance despite nominal adherence, as Soviet policies privatized faith into family customs without institutional revival post-1991. Globally, non-practicing identification has risen, with 13% of Arab world respondents in 2019 declaring themselves \"not religious\" compared to 8% in 2013, particularly among youth under 30. In Europe, second- and third-generation Muslim immigrants often exhibit cultural retention amid declining observance, comprising part of the 6% Muslim population where integration pressures dilute doctrinal fidelity.\n\nDistinctions between non-denominational and cultural Muslims blur in practice, as both prioritize personal or communal identity over orthodoxy, yet non-denominational adherents may still affirm metaphysical beliefs like prophethood while rejecting clergy, whereas cultural ones frequently question core tenets. This segment challenges assumptions of monolithic religiosity in Muslim-majority contexts, with empirical data revealing variance driven by governance and economics rather than inherent doctrinal appeal.\n\n## Islamic Law and Jurisprudence (Sharia)\n\n### Sources and Schools of Thought\n\nThe primary sources of *Sharia* (Islamic law) are the Quran and the *Sunnah*. The Quran, comprising 114 chapters revealed to Muhammad between 610 and 632 CE, constitutes the foundational text containing explicit legal injunctions on matters such as inheritance, contracts, and criminal penalties, with approximately 500 verses addressing juridical issues. The *Sunnah* encompasses Muhammad's sayings, actions, and tacit approvals, preserved in Hadith compilations like those of al-Bukhari (d. 870 CE) and Muslim (d. 875 CE), which provide detailed explanations and extensions of Quranic principles.\n\nSecondary sources, derived through *usul al-fiqh* (principles of jurisprudence), include *ijma* (scholarly consensus) and *qiyas* (analogical reasoning). *Ijma* refers to the agreement of qualified jurists (*mujtahids*) on a ruling after the Prophet's era, serving to resolve ambiguities in primary texts, as seen in collective endorsements of practices like the compilation of the Quran under Caliph Uthman (r. 644–656 CE). *Qiyas* extends established rulings to new cases by identifying an effective cause (*illah*), such as applying the prohibition of wine to other intoxicants based on shared harm. Additional subsidiary sources, varying by school, include *istihsan* (juristic preference for equity over strict analogy) and *maslaha* (public interest), though their application remains contested.\n\nSchools of thought (*madhahib*) systematize the application of these sources, emerging from the 8th–9th centuries CE amid interpretive disputes. In Sunni Islam, four major *madhahib* predominate: the Hanafi school, founded by Abu Hanifa (699–767 CE) in Kufa, Iraq, which favors reasoned opinion (*ra'y*) and consensus for flexibility in diverse regions; the Maliki school, established by Malik ibn Anas (711–795 CE) in Medina, emphasizing the practice of Medina's people (*amal ahl al-Madina*) alongside Hadith; the Shafi'i school, developed by Muhammad ibn Idris al-Shafi'i (767–820 CE), which prioritizes a structured hierarchy of sources and formalized *qiyas*; and the Hanbali school, initiated by Ahmad ibn Hanbal (780–855 CE) in Baghdad, adhering strictly to literal texts while minimizing analogy. These schools, while differing on specifics—such as Hanafi permissiveness in contract law versus Hanbali textualism—view each other as valid within Sunni orthodoxy, with adherents comprising roughly 45% Hanafi, 35% Shafi'i/Maliki, and 13% Hanbali globally as of recent surveys.\n\nIn Shia Islam, the Ja'fari school, named after Ja'far al-Sadiq (702–765 CE), the sixth Imam, integrates the infallible guidance of the Imams (descendants of Ali ibn Abi Talib) as a primary interpretive authority, alongside Quran, *Sunnah* (including narrations from the Imams), *ijma* of Imami scholars, and *aql* (intellect) for rational deduction. This approach diverges from Sunni methodology by elevating Imamic traditions, influencing rulings on temporary marriage (*mut'a*) and emulation (*taqlid*) of living jurists during the occultation of the twelfth Imam (since 874 CE). Other minor schools, such as the Zahiri (literalist, extinct by the 14th century), persist regionally but lack widespread adherence.\n\n### Personal and Family Law Applications\n\nIn Islamic jurisprudence, personal and family law, often termed *ahwal shakhsiyya*, encompasses marriage, divorce, child custody, guardianship, and inheritance, derived primarily from the Quran, Sunnah, and interpretations by juridical schools. These rules apply in numerous Muslim-majority countries, including Saudi Arabia, Iran, Pakistan, Egypt, and Indonesia, where Sharia courts handle such matters exclusively or in parallel with civil systems, prioritizing religious texts over secular equality principles. For instance, in Saudi Arabia and Iran, full Sharia implementation mandates adherence to these norms without optional civil alternatives for Muslims.\n\nMarriage under Sharia requires mutual consent, typically formalized through a contract (*nikah*) specifying a bridewealth (*mahr*) paid by the groom to the bride, along with witnesses and public announcement to avoid clandestine unions. Polygyny is permitted for men up to four wives, conditional on equitable treatment in financial support and time allocation, as stipulated in Quran 4:3, though empirical data indicate prevalence below 1% in most Muslim societies due to socioeconomic barriers. Women lack reciprocal polyandry rights, reflecting patrilineal inheritance and maintenance obligations placed on husbands. Variations exist across Sunni schools (e.g., Hanafi permits delegation of divorce rights to wives via *talaq tafwid*), while Shia jurisprudence emphasizes the bride's guardian (*wali*) role more stringently in some cases.\n\nDivorce procedures exhibit asymmetry favoring men: husbands may initiate *talaq* unilaterally by pronouncement, revocable during the waiting period (*iddah*) of three menstrual cycles to confirm non-pregnancy and allow reconciliation, after which it becomes irrevocable after three utterances unless mediated. Women seek *khula*, requiring judicial approval and often forfeiture of *mahr*, or *faskh* for fault-based dissolution like abuse, but face evidentiary hurdles. Divorce rates in Sharia-applied contexts vary; for example, Pakistan reports around 20-30% of marriages ending in divorce, often linked to polygyny disputes or unmet maintenance, though data collection biases in conservative regimes underreport female-initiated cases. Shia law introduces *mut'a* (temporary marriage) as a distinct option, absent in Sunni fiqh, potentially affecting divorce dynamics.\n\nInheritance follows fixed Quranic shares (*fara'id*), allocating portions to designated heirs: sons receive twice daughters' shares to account for male financial duties toward family, with daughters guaranteed at least half if no sons exist, and spouses receiving fixed fractions (e.g., 1/8 for wives with children). This agnatic system prioritizes male-line relatives, excluding non-Muslims in strict applications and distant kindred in Shia law, which divides heirs into two classes without Sunni-style \"residuary\" agnates. Empirical application in countries like Egypt and Malaysia shows rigid adherence, leading to fragmentation of estates and occasional intestacy disputes, though some reforms (e.g., Tunisia's equal shares) deviate from classical Sharia, drawing criticism for contradicting primary sources.\n\nChild custody (*hadana*) prioritizes maternal care for infants (up to weaning age, around 2 years for boys and 7 for girls in some Sunni views), shifting to paternal guardianship (*wilaya*) thereafter for financial and educational decisions, rooted in presumed maternal nurturing aptitude and paternal provider role. Post-divorce, mothers retain custody only if compliant with Sharia morals, with fathers liable for maintenance (*nafaqa*). In practice, this favors paternal lineage continuity, as seen in Iranian and Saudi courts where maternal custody lapses upon remarriage. These applications underscore Sharia's emphasis on familial interdependence over individual autonomy, with juridical discretion (*ijtihad*) allowing contextual adaptations but rarely overriding core textual mandates.\n\n### Criminal and Political Dimensions\n\nSharia's criminal framework encompasses hudud (fixed punishments prescribed in Quran and Sunnah for offenses against God), qisas (retaliatory justice for personal crimes like murder), and ta'zir (discretionary penalties for other offenses). Hudud apply to crimes including theft (sariqa), where amputation of the right hand is mandated if the stolen value exceeds the nisab threshold and conditions like lack of necessity are met; adultery or fornication (zina), punishable by 100 lashes for unmarried offenders and stoning for married ones, requiring four eyewitnesses to the act; false accusation of adultery (qadhf), carrying 80 lashes; consumption of intoxicants (shurb al-khamr), with 40-80 lashes; and highway robbery or rebellion (hiraba), which may involve amputation of opposite limbs, crucifixion, or exile depending on severity. Apostasy (riddah) is treated as a hudud offense in classical jurisprudence, warranting death for public renunciation of Islam, though evidentiary hurdles like confession or clear proof are stringent. Qisas permits equivalent retaliation for intentional homicide or bodily injury, such as \"a life for a life,\" with options for diyah (blood money) as compensation if pardoned by the victim's kin. Ta'zir allows judges flexibility, often involving imprisonment, fines, or flogging for crimes like fraud or minor theft not meeting hudud criteria.\n\nImplementation of hudud remains limited globally due to rigorous proof requirements, which classical scholars designed to prioritize doubt over punishment—\"avert hudud by means of doubts.\" In Saudi Arabia, hudud for theft and adultery have been applied sporadically, with 88 executions for various crimes including sorcery and adultery between 1981 and 1992, though recent reforms under Vision 2030 reduced floggings. Iran enforces stoning for adultery, with at least 102 documented cases from 1979 to 1997, and death for apostasy, as in the 2022 execution of four individuals for propagating anti-regime views deemed apostasy. Afghanistan under Taliban rule since August 2021 has reinstated hudud, including hand amputations for theft and public executions for murder via qisas, as ordered in decrees emphasizing Sharia supremacy. Brunei introduced hudud in 2019, authorizing stoning for adultery and amputation for theft, though no executions have occurred by 2023 due to suspended phases. At least 13 countries, including Mauritania, Sudan, and Yemen, prescribe death for apostasy in penal codes, often blending Sharia with civil law. Pew Research surveys indicate majorities in regions like South Asia (84% in Pakistan) and the Middle East-North Africa (74% in Egypt) favor Sharia as official law, but support for hudud application varies, with only minorities in some nations endorsing corporal punishments for theft or apostasy.\n\nPolitically, Sharia posits divine sovereignty (hakimiyyah), where legislation derives from revelation rather than human will, historically embodied in the caliphate as the Prophet Muhammad's successor enforcing Sharia across unified territories from 632 CE onward. The caliphate integrated religious and temporal authority, with rulers like the Rashidun caliphs (632-661 CE) applying Sharia in governance, taxation (zakat), and jihad declarations. Modern political Islam revives this through movements advocating Sharia-based states; Iran's 1979 constitution establishes wilayat al-faqih (guardianship of the jurist), vesting supreme authority in a cleric overseeing elected bodies. Saudi Arabia's Basic Law declares the Quran and Sunnah as the constitution, with the king as custodian of holy sites exercising absolute rule under Sharia. In Pakistan, the 1979 Hudood Ordinances incorporated partial Sharia criminal elements, though amended amid criticism. Pew data shows 99% of Afghan Muslims and 75% in Iraq supported Sharia as law in pre-2021 surveys, reflecting widespread preference for Islamic governance over secular models. Critics from human rights perspectives argue such systems conflict with international norms, yet proponents cite Sharia's emphasis on justice and deterrence, with empirical rarity of hudud executions underscoring conditional mercy over severity.\n\n## Sufism and Esoteric Traditions\n\n### Origins and Key Figures\n\nSufism emerged in the early 8th century CE amid the Umayyad Caliphate (661–750 CE), as an ascetic reaction among certain Muslims to the era's political expansion and material excesses, with initial centers in Basra, Iraq. Early practitioners, termed *zuhhād* (ascetics), focused on *zuhd* (renunciation of worldly attachments), rigorous self-discipline, and inner purification to achieve proximity to God, drawing from Quranic injunctions against ostentation and prophetic traditions of simplicity. The designation \"Sufi\" likely stems from *ṣūf* (wool), alluding to the rough woolen garments worn by these renunciants to signify detachment, though some accounts trace terminological use to the late 8th century in Baghdad. By the 9th century, Sufism coalesced into structured teachings emphasizing *maʿrifa* (gnosis) and *fanāʾ* (annihilation of the self in God), distinguishing it from orthodox legalism while remaining rooted in Sunni theology.\n\nHasan al-Basri (642–728 CE), a Medinan-born scholar and preacher who settled in Basra, stands as a foundational precursor to Sufism, exemplifying early asceticism through his eloquent admonitions against corruption, emphasis on God-fearing piety (*taqwā*), and withdrawal from political intrigue during Umayyad rule. As a tabiʿī (successor to the Prophet's companions), he influenced later mystics by prioritizing inner spiritual struggle (*jihād al-nafs*) over external conquests, reportedly teaching that true devotion involved constant remorse for shortcomings and reliance on divine mercy rather than ritual formalism. His circles in Basra attracted seekers, laying groundwork for Sufi *tariqas* (paths), though he avoided explicit mysticism, focusing instead on ethical reform.\n\nRabia al-Adawiyya (c. 717–801 CE), a Basran freed slave and orphan, advanced Sufi thought by shifting emphasis from fear-based asceticism to disinterested love (*maḥabba*) for God, famously praying: \"O God, if I worship Thee for fear of Hell, burn me in Hell; if for hope of Paradise, deny me Paradise.\" Her life of voluntary poverty, nocturnal worship, and rejection of worldly rewards or punishments marked a pivotal evolution, influencing doctrines of divine unity (*tawḥīd*) beyond legal observance. As one of the earliest documented female mystics, Rabia challenged gender norms in spiritual authority, with traditions attributing to her miracles like levitation during prayer, though her legacy rests more on poetic expressions of ecstatic union with the divine.\n\nOther early figures include Ibrahim ibn Adham (c. 718–777 CE), a Balkh prince who renounced royalty for mendicancy and wandering asceticism, embodying radical *zuhd* by abandoning wealth after a divine admonition in a dream. Bayazid Bastami (d. 874 CE) introduced ecstatic mysticism (*ittihād*) through bold declarations of self-annihilation, such as \"Glory be to Me,\" risking accusations of heresy but inspiring later *ʿurafāʾ* (gnostics). Al-Junayd of Baghdad (d. 910 CE) synthesized these strands into \"sober\" Sufism, advocating sobriety (*ṣaḥw*) in divine intoxication to align with Sharia, thus legitimizing mysticism within orthodox Islam. These pioneers, operating pre-900 CE, established Sufism's core as experiential knowledge of God, often amid tensions with literalist scholars wary of innovation (*bidʿa*).\n\n### Practices and Influence\n\nSufi practices emphasize spiritual purification and direct experiential knowledge of the divine, primarily through *dhikr*, the ritual remembrance of God involving repetitive invocation of divine names or phrases drawn from the Quran, often performed collectively in sessions led by a spiritual guide (*shaykh*). These sessions aim to induce states of ecstasy and focus the heart on God, with variations including vocal or silent recitation depending on the order. Complementary practices include *sama*, auditory spiritual sessions incorporating poetry recitation, music, and sometimes dance to evoke divine love, as seen in the whirling rituals of the Mevlevi order inspired by the 13th-century poet Jalaluddin Rumi (1207–1273). Meditation (*muraqaba*) and ascetic disciplines further structure daily routines, fostering ethical conduct and detachment from worldly attachments within structured spiritual lineages (*tariqas*).\n\nSufism organizes adherents into *tariqas*, hierarchical orders tracing spiritual authority through chains of masters (*silsila*) back to the Prophet Muhammad or early companions, with major branches including the Chishti order, founded in the 12th century by Mu'inuddin Chishti and emphasizing devotional music (*qawwali*), tolerance, and service to the poor, which spread prominently in South Asia. The Naqshbandi order, originating in 14th-century Central Asia, prioritizes silent *dhikr* and sobriety to maintain inner vigilance, influencing regions from Turkestan to the Ottoman Empire. The Qadiri order, established by Abdul Qadir Gilani (1077–1166), incorporates vocal *dhikr* and has adapted across Africa and Asia, while the Mevlevi, formalized after Rumi's death in 1273, ritualizes whirling (*sema*) as symbolic annihilation of the ego in divine unity, performed in white robes signifying purity. These orders transmit initiations (*bay'ah*) and graded spiritual stations (*maqamat*), blending Quranic injunctions with introspective methods to cultivate *ihsan*, or worship as if beholding God.\n\nSufi practices exerted significant influence on Islam's expansion by facilitating conversions through adaptable, non-coercive approaches that integrated local customs, particularly in South Asia, Southeast Asia, and sub-Saharan Africa, where *tariqas* established shrines (*dargahs*) as centers of communal devotion and intercession. Figures like Rumi contributed enduring literary legacies, with his *Mathnawi*—a six-volume poetic corpus completed around 1270—articulating mystical themes of love and unity that permeated Persian, Turkish, and Urdu traditions, inspiring both devotional music and philosophical discourse. Culturally, Sufism enriched Islamic arts via symbolic poetry and music, as in Chishti *qawwali* gatherings that drew diverse audiences, while politically, orders like the Naqshbandi advised rulers in Central Asia and the Balkans, promoting ethical governance amid dynastic shifts, though often as a counterbalance to perceived excesses of political authority. This influence persisted into modern contexts, with Sufi networks shaping social cohesion in postcolonial societies, albeit amid tensions with reformist movements rejecting perceived innovations.\n\n### Criticisms Within Islam\n\nThe Mu'tazila school, prominent in the 8th and 9th centuries CE, critiqued literalist interpretations of divine attributes in the Quran and hadith, rejecting anthropomorphism that implied God possessed physical form or human-like limitations, such as literal hands or eyes, in favor of rational interpretations emphasizing God's transcendence and unity.  They argued that such attributes must be understood metaphorically to align with reason and avoid resembling created beings, influencing debates during the Abbasid era under caliphs like al-Ma'mun, who enforced Mu'tazili views through the mihna inquisition from 833 to 848 CE.\n\nQuranists, a modern movement emerging in the 19th and 20th centuries, reject the authority of hadith collections as secondary sources, deeming them unreliable due to chains of transmission prone to fabrication and contradiction, and advocate adherence solely to the Quran as the unaltered word of God. Figures like Rashid Rida initially engaged with hadith criticism before mainstream rejection, while 20th-century proponents such as Ghulam Ahmed Pervez argued that hadith-based practices like stoning for adultery lack Quranic basis and distort original Islam. This stance challenges core Sunni and Shia jurisprudence reliant on hadith for rituals, prayer details, and legal rulings, positioning Quranists as innovators or heretics in orthodox eyes.\n\nReformist scholars have contested apostasy penalties, with Muhammad Abduh (d. 1905) arguing that classical rulings prescribing death for ridda stem from political sedition rather than mere doctrinal change, lacking direct Quranic mandate and conflicting with verses on no compulsion in religion (Quran 2:256). Later thinkers like Mahmoud Muhammad Taha (executed 1985 in Sudan) and Sudanese scholar Abdullahi Ahmed An-Na'im advocated abolishing hudud punishments for apostasy, viewing them as context-bound to early Medina's tribal conflicts rather than eternal norms, urging ijtihad to prioritize individual conscience over state enforcement. These views persist among some contemporary jurists who limit penalties to public acts threatening social order, not private belief shifts.\n\nInternal critiques of Sharia's application to women highlight disparities in inheritance (Quran 4:11 granting males double shares), testimony (Quran 2:282 equating two women to one man in financial matters), and polygamy, with reformers like Egyptian scholar Nasr Hamid Abu Zayd (d. 2010) arguing these reflect 7th-century Arabian norms requiring reinterpretation via historical context and maqasid (objectives) like equity, rather than rigid literalism. Sudanese reformer Fatima Ahmed Ibrahim and others contend that patriarchal hadith amplifications exacerbate inequalities, proposing egalitarian rereadings to align with Quranic emphases on mutual rights in marriage (Quran 2:228).\n\nDebates on jihad distinguish \"greater\" internal struggle against sin from \"lesser\" armed defense, with scholars like al-Ghazali (d. 1111) and modern figures such as Yusuf al-Qaradawi limiting offensive jihad to prophetic eras or defensive necessity, criticizing expansive interpretations justifying conquest or terrorism as deviations from Quranic restraints against aggression (Quran 2:190). Reformers post-20th century, amid colonial and nationalist contexts, further argue that jihad's martial aspects were abrogated by peaceful Meccan surahs, prioritizing da'wah (invitation) over violence, though orthodox responses often reaffirm classical fiqh allowing expansion under caliphal authority.\n\n## Society and Daily Life in Muslim Contexts\n\n### Family Structures and Gender Dynamics\n\nIslamic family structures are predominantly patriarchal, with the husband positioned as the head of the household and primary provider, as stipulated in Quran 4:34, which designates men as *qawwamun* (maintainers) over women due to their financial obligations. This framework emphasizes complementary roles, where men bear the duty of maintenance (*nafaqa*), including housing, food, and clothing for wives and children, while women manage domestic affairs and child-rearing, though they retain rights to personal property and earnings. Extended families remain common in many Muslim-majority societies, fostering intergenerational support, but nuclear families are increasing due to urbanization, as observed in demographic shifts across the Middle East and South Asia.\n\nMarriage in Islam requires mutual consent, a dowry (*mahr*) from the groom to the bride, and often involvement of a male guardian (*wali*) for women, reflecting protective norms derived from prophetic traditions. Polygyny is permitted under Quran 4:3, allowing a man up to four wives provided he treats them equitably, a practice intended to address widows and orphans in early Islamic society but restricted in modern contexts by many states, such as Tunisia's 1956 ban. Empirical data indicate low prevalence: polygyny rates hover below 5% in countries like Indonesia and Pakistan, though higher in parts of sub-Saharan Africa among Muslims, correlating with economic instability rather than religious fervor alone. Divorce is asymmetrical; men may initiate *talaq* unilaterally after a waiting period (*iddah*), while women pursue *khula* through judicial dissolution, often forfeiting mahr, leading to male-initiated divorces comprising 70-90% in surveyed Muslim populations.\n\nInheritance laws allocate shares based on Quranic fixed portions (*fara'id*), with sons typically receiving twice the share of daughters (Quran 4:11), rationalized by men's exclusive maintenance responsibilities, though women inherit outright without such duties. Daughters may receive more than brothers in scenarios with multiple female heirs (up to two-thirds collectively), and widows retain spousal shares alongside natal inheritance. In practice, cultural deviations occur, such as disinheritance of women in rural Pakistan, contravening Sharia but persisting due to patriarchal customs.\n\nGender dynamics emphasize wifely obedience in matters of lawful conduct (Quran 4:34), endorsed by majorities in Pew surveys across 39 Muslim-majority countries, where 85-95% agree a wife must obey her husband. Men hold authority in family decisions, including child custody post-divorce (favoring mothers for young children per Hanafi jurisprudence), but women possess rights to education, work, and separation from abuse, as affirmed in hadith prohibiting harm. These roles yield mixed outcomes: Muslim women report high marital satisfaction in U.S. surveys but lower quality than men, with divorce rates comparable to or below national averages (around 30% lifetime risk), though rising in urban settings like the Maldives (highest globally at 10.97 per 1,000). Variations by sect and region persist, with Shia law permitting temporary marriage (*mut'a*) and reformist interpretations challenging rigid hierarchies, yet core scriptural asymmetries endure.\n\n### Education, Science, and Intellectual History\n\nIn the early centuries of Islam, education primarily occurred in mosques and private homes, focusing on memorization of the Quran, hadith, and basic Arabic literacy. This system emphasized religious knowledge, with itinerant scholars teaching orally and students traveling for learning, known as *rihla*. By the 11th century, formalized institutions called madrasas emerged, such as the Nizamiyya in Baghdad founded around 1067 by vizier Nizam al-Mulk, which provided structured curricula in Islamic jurisprudence (*fiqh*), theology, and some ancillary subjects like logic and mathematics. Madrasas offered boarding for students and were funded by endowments (*waqf*), but their primary orientation remained religious, with secular disciplines secondary and often instrumental to theological ends.\n\nThe intellectual history of Islam saw a period of advancement from the 8th to the 13th century, often termed the Islamic Golden Age, during which scholars in centers like Baghdad's House of Wisdom translated and expanded upon Greek, Indian, and Persian works. Key contributions included Muhammad ibn Musa al-Khwarizmi's development of algebra and algorithms in his 9th-century treatise *Al-Kitab al-Mukhtasar fi Hisab al-Jabr wal-Muqabala*, building on prior Hindu numerals and Diophantine equations. In medicine, Ibn Sina's *Canon of Medicine* (completed 1025) synthesized Galen and empirical observations, serving as a standard text in Europe until the 17th century, while Al-Razi distinguished measles from smallpox through clinical methods. Optics advanced with Ibn al-Haytham's *Book of Optics* (1011–1021), introducing experimental verification and the intromission theory of vision, influencing later European science. These achievements relied on patronage from Abbasid caliphs and a synthesis of imported knowledge rather than isolated innovation, with empirical progress often checked by religious orthodoxy requiring alignment with Quranic revelation.\n\nScientific and intellectual decline set in after the 13th century, coinciding with Mongol invasions that sacked Baghdad in 1258, destroying libraries and disrupting patronage networks. More fundamentally, theological shifts, such as Al-Ghazali's *The Incoherence of the Philosophers* (1095), critiqued Aristotelian causality as undermining divine omnipotence, promoting Ash'arite occasionalism where natural laws were seen as direct divine interventions rather than reliable mechanisms. This worldview, gaining dominance in Sunni orthodoxy, discouraged sustained empirical inquiry by prioritizing faith over reason, as evidenced by reduced output in mathematics and astronomy post-1200 compared to earlier centuries. Political fragmentation and the empowerment of ulema (religious scholars) over rationalist philosophers further entrenched anti-speculative stances, leading to stagnation where innovation required theological sanction.\n\nIn contemporary Muslim-majority countries, scientific output remains disproportionately low despite comprising about 20% of global population; 46 such nations contribute roughly 5–8% of world scientific literature, far below India's 1.66%. Forty-one predominantly Muslim countries generate under 5% of global science publications, with exceptions like Turkey and Iran showing modest growth but still trailing non-Muslim peers in per capita metrics. Education systems often prioritize religious instruction in madrasas, where curricula emphasize Quranic exegesis over STEM, fostering tensions with modern science—such as rejection of evolutionary theory in countries like Saudi Arabia and Pakistan due to literalist interpretations. While some reforms integrate secular education, pervasive religious influence and authoritarian governance limit critical inquiry, perpetuating gaps in Nobel Prizes (five in sciences for Muslim winners since 1901: Abdus Salam in physics in 1979, Ahmed Zewail in chemistry in 1999, Aziz Sancar in chemistry in 2015, Moungi Bawendi in chemistry in 2023, and Omar Yaghi in chemistry in 2025) and patents relative to population.\n### Arts, Culture, and Economic Patterns\n\nIslamic art is characterized by aniconism, which prohibits the depiction of living beings in religious contexts to avoid idolatry, as derived from interpretations of prophetic traditions. This restriction fostered the development of non-figural decorative elements, including intricate geometric patterns, arabesques, and vegetal motifs, which symbolize infinite divine order and repetition.\n\nCalligraphy holds a central place in Islamic arts, elevating the written word—particularly Quranic verses—into a revered aesthetic form, often integrated with geometric designs in manuscripts, tiles, and architecture. Architectural achievements exemplify these principles, with structures like the Dome of the Rock (completed 691 CE) and the Alhambra (14th century) featuring domes, minarets, and muqarnas vaulting adorned in such motifs. Literature flourished under Islamic patronage, producing works like the Quran's rhythmic prose, epic poetry by figures such as Al-Mutanabbi (d. 965 CE), and narrative collections like the One Thousand and One Nights, compiled between the 8th and 13th centuries, reflecting oral storytelling traditions across Muslim societies.\n\nMusic in Islamic cultures emphasizes vocal recitation over instruments, with genres like nasheeds and qawwali serving devotional purposes, though some jurists deem instrumental music impermissible based on hadith interpretations prohibiting excess. Cultural expressions maintain unity through shared practices, such as the adhan (call to prayer) broadcast five times daily and communal iftars during Ramadan, fostering social cohesion in diverse regions from Morocco to Indonesia. Hospitality norms, rooted in prophetic example, mandate generosity toward guests, influencing social interactions in Muslim-majority areas.\n\nIslamic economic principles prohibit riba (usury or interest), viewing it as exploitative, and mandate zakat—a 2.5% annual levy on wealth above a threshold—to redistribute resources and support the needy. Waqf endowments, inalienable trusts established since the 8th century, historically funded mosques, schools, and infrastructure, enhancing public goods but also locking assets and impeding market flexibility, as analyzed in institutional economics.\n\nIn practice, Muslim-majority countries exhibit patterns of resource-dependent economies, with oil exports driving GDP in nations like Saudi Arabia (nominal GDP $1.07 trillion in 2023) and the UAE, while others lag in diversification. Empirical data reveal lower innovation outputs, with Organisation of Islamic Cooperation (OIC) members averaging fewer patents per capita and ranking low on the Global Innovation Index—e.g., Pakistan at 99th and Indonesia at 61st in 2024—attributable in part to rigid inheritance laws fragmenting capital and waqf-induced path dependence hindering enterprise evolution. Islamic finance assets reached $3.25 trillion by 2023, emphasizing profit-sharing over debt, yet overall economic performance trails global averages, with OIC GDP per capita at about 25% of the world mean in recent decades.\n\n### Governance and Political Islam\n\nIslamic governance historically centered on the caliphate, a system where a caliph served as both political leader and religious successor to Muhammad, unifying the Muslim ummah under Sharia-derived rule following his death in 632 CE. The Rashidun Caliphs (632–661 CE) expanded the polity through conquests, establishing administrative structures that integrated fiscal policies like the jizya tax on non-Muslims and zakat on Muslims, while applying Quranic principles to adjudication. Subsequent dynasties, including the Umayyads (661–750 CE) and Abbasids (750–1258 CE), formalized this into imperial bureaucracies, though power often shifted toward hereditary rule and secular influences, diverging from the consultative ideal of bay'ah (pledge of allegiance).\n\nIn classical theory, sovereignty resided with God, obligating rulers to enforce Sharia in public and private spheres, including hudud punishments for offenses like theft (amputation) and adultery (stoning), as derived from Quran 5:38 and 24:2. This theocratic model emphasized justice (adl) and consultation (shura), yet empirical implementation frequently involved autocratic consolidation, as caliphs amassed military and fiscal control, leading to internal revolts and sectarian splits like the Sunni-Shia divide over succession.\n\nModern political Islam, or Islamism, revived these ideals amid 19th-20th century colonial decline and secular reforms, positing Islam as a total system for state and society. Pioneered by thinkers like Jamal al-Din al-Afghani (d. 1897), it sought pan-Islamic unity against Western dominance, influencing movements that reject secular nationalism. The Muslim Brotherhood, founded in 1928 by Hassan al-Banna in Egypt, exemplifies this, advocating gradual Islamization through education, social services, and politics to establish Sharia-based governance, viewing Western models as incompatible with divine law.\n\nThe 1979 Iranian Revolution marked a pivotal Islamist takeover, ousting Shah Mohammad Reza Pahlavi via mass protests and establishing a velayat-e faqih (guardianship of the jurist) under Ayatollah Ruhollah Khomeini, blending Shia theology with republican elements but prioritizing clerical oversight. Iran's constitution mandates Sharia as the basis for laws, resulting in institutions like the Guardian Council vetting legislation for Islamic compliance. This model inspired Sunni counterparts, though tensions arose over Shia leadership claims.\n\nContemporary applications vary: Saudi Arabia applies strict Wahhabi-influenced Sharia, enforcing hudud like flogging (100 lashes for adultery per Quran 24:2) and limiting women's public roles until partial reforms post-2018. Pakistan's 1979 Hudood Ordinances introduced Islamic penalties, leading to thousands of blasphemy convictions by 2023, often criticized for miscarriages of justice. Afghanistan under Taliban rule since August 2021 reinstates amputations and bans female secondary education, correlating with humanitarian crises including famine affecting 24 million by 2022.\n\nEmpirical outcomes of Islamist governance often include curtailed human rights, with Freedom House scoring Iran 12/100 and Saudi Arabia 8/100 in 2023 for political rights and civil liberties, reflecting suppression of dissent via bodies like Iran's morality police. Economically, states like Iran face stagnation, with GDP per capita dropping from $7,500 in 2010 to $4,100 by 2022 amid sanctions and mismanagement, while institutional rigidities—such as waqf endowments hindering property markets—persist from classical Sharia, contributing to long-term underperformance relative to non-Islamic peers. Proponents argue such systems foster moral order, yet data show correlations with higher corruption perceptions (Iran ranks 149/180 on Transparency International's 2023 index) and gender disparities, as Sharia interpretations subordinate women in testimony and inheritance (Quran 2:282, 4:11).\n\nDebates persist on compatibility with democracy; while groups like the Brotherhood participated in elections (e.g., Egypt 2012), outcomes frequently devolve into authoritarianism, as seen in Hamas's Gaza rule since 2007, marked by rocket attacks and internal purges. Non-state actors like ISIS declared a caliphate in 2014, enforcing brutal Sharia interpretations, including beheadings for apostasy, before territorial defeat in 2019, highlighting extremism's appeal amid governance failures in Iraq and Syria. Overall, political Islam's pursuit of divine sovereignty challenges secular pluralism, yielding mixed results where empirical evidence underscores tensions between ideological purity and modern state demands.\n\n## Global Demographics and Expansion\n\n### Current Population and Growth Rates\n\nAs of 2020, the global Muslim population stood at 2.0 billion, representing 25.6% of the world's total population of approximately 7.8 billion.  Independent estimates for mid-2025 project a figure exceeding 2.05 billion, reflecting continued demographic momentum amid a global population of about 8.1 billion. This places Islam as the second-largest religion worldwide, after Christianity.\n\nBetween 2010 and 2020, the Muslim population increased by 347 million—a 21% rise—outpacing the global population growth of 12% over the same period and marking Islam as the fastest-growing major religion.  This equates to an average annual growth rate of roughly 1.9% for Muslims, compared to the worldwide average of about 1.1%, driven primarily by higher fertility rates (averaging 2.9 children per Muslim woman versus 2.2 globally) and a younger median age (24 years for Muslims versus 30 worldwide). Religious switching contributes negligibly to net growth, with gains from conversions offset by apostasy, resulting in minimal overall impact.\n\nProjections indicate sustained expansion, with the Muslim population expected to reach 2.2 billion by 2030 and potentially 2.8 billion by 2050, approaching parity with Christianity due to persistent demographic advantages in birth rates and age structure, though growth rates may moderate as fertility declines in some Muslim-majority regions. These trends are substantiated by census data and demographic modeling, underscoring natural increase over migration or proselytization as the dominant factor.\n\n### Regional Distributions and Migration Trends\n\nAs of 2020, approximately 62% of the world's Muslims resided in the Asia-Pacific region, encompassing South and Southeast Asia, where countries like Indonesia (hosting over 240 million Muslims), Pakistan (around 220 million), and India (over 200 million) account for the largest national populations. Sub-Saharan Africa held about 16% of global Muslims, with rapid numerical growth driven by high fertility rates, while North Africa and the Middle East comprised roughly 20%, where Muslims form 94% of the population in majority-Muslim states. Europe and the Americas together represented under 5%, with Europe's Muslim share estimated at 5-6% (around 25-30 million) concentrated in urban areas of France, Germany, and the United Kingdom.\n\n| Region | Approximate Share of Global Muslims (2020) | Key Characteristics |\n|--------|-------------------------------------------|---------------------|\n| Asia-Pacific | 62% | Largest absolute numbers; Indonesia leads with 13% of world total. |\n| Middle East-North Africa | 20% | Highest regional concentration (94% Muslim). |\n| Sub-Saharan Africa | 16% | Fastest growth rates due to demographics. |\n| Europe | ~3% | Growth primarily migration-driven. |\n| North America | ~0.5% (5.9 million) | Small but rapidly expanding via immigration. |\n\nMigration trends have significantly shaped non-majority-Muslim regions, with Europe receiving about 20% of global Muslim migrants as of 2024, often from conflict-affected areas like Syria, Afghanistan, and Iraq following the 2011 Arab Spring uprisings and subsequent civil wars that displaced millions. Between 2010 and 2020, North America's Muslim population surged 52% to 5.9 million, largely attributable to family reunification, refugee admissions, and labor migration from South Asia and the Middle East. In Europe, irregular sea and land arrivals peaked in 2015-2016 with over 1 million asylum seekers annually, predominantly Muslim, leading to policy shifts toward stricter border controls by 2024 amid sustained high application volumes exceeding 1 million yearly. Intra-Muslim migration remains prominent, such as labor flows from South Asia to Gulf states, but Western destinations continue to see net increases, contributing to localized demographic shifts in urban centers. These patterns reflect push factors including political instability, economic disparity, and persecution in origin countries, alongside pull factors like welfare systems and relative stability in host nations.\n\n### Factors Driving Demographic Shifts\n\nThe primary driver of demographic shifts favoring Islam's global expansion is elevated fertility rates among Muslim populations, which have historically exceeded the replacement level of 2.1 children per woman. Globally, Muslims maintain the highest total fertility rate (TFR) at an average of 3.1 children per woman, compared to 2.5 for the world overall, contributing to a 21% increase in the Muslim population from 1.7 billion in 2010 to 2.0 billion in 2020—more than double the global population growth rate.  This disparity stems from a combination of socioeconomic factors, including higher rates of poverty and limited access to education and healthcare in many Muslim-majority countries, alongside cultural and religious emphases on procreation, such as interpretations of Quranic injunctions encouraging marriage and family.  Although TFR in Muslim-majority nations has declined from 4.3 in 1990-1995 to approximately 2.9 today, it remains above global averages, sustaining population momentum due to the relatively young median age of Muslims (24 years versus 30 globally). \n\nMigration patterns significantly amplify Muslim demographic shares in non-Muslim-majority regions, particularly Europe and North America, where inflows from Muslim-majority countries outpace outflows. In Europe, migration scenarios project the Muslim population rising from 4.9% in 2016 to between 7.4% (zero migration) and 14% (high migration) by 2050, driven by refugees and economic migrants from conflict zones like Syria and Afghanistan, as well as family reunification. In the United States, Muslim immigration constitutes a growing fraction of total inflows, with Muslims comprising about 4-8% of recent immigrants, contributing to a population increase alongside higher fertility. These shifts are causally linked to push factors such as instability, war, and economic disparity in origin countries (e.g., sub-Saharan Africa and the Middle East), and pull factors like welfare systems and labor demands in host nations; however, integration challenges, including lower labor market participation among Muslim migrants, can perpetuate concentrated communities with sustained high birth rates. \n\nReligious switching contributes minimally to net growth, with conversions to Islam roughly offsetting apostasy in most regions, resulting in negligible overall impact compared to natural increase. Pew estimates indicate that globally, no more than 3% of adults switch into or out of Islam, yielding a small net gain of approximately 420,000 converts every five years—far overshadowed by the 347 million added via births from 2010-2020.  In the U.S., about 23% of Muslim adults are converts, balancing losses, while countries like Kenya and the U.S. show higher inflows, often tied to personal or communal influences rather than organized proselytism. High retention rates, evidenced by low reported switching (e.g., 76-77% of U.S.-raised Muslims remain affiliated), are reinforced in many Muslim-majority societies by legal penalties for apostasy—prescribed as death in 13 countries per traditional Sharia interpretations—and social ostracism, which suppress visible exits and may understate true disaffiliation in surveys.  This dynamic, while empirically limiting net losses, reflects causal pressures rather than voluntary adherence alone.\n\nOverall, these factors—dominated by differential fertility and augmented by migration—project Muslims comprising 30% of the world population by 2050, up from 24% today, though accelerating declines in Muslim TFR could moderate future trajectories if socioeconomic modernization continues. \n\n## Interfaith Influences and Interactions\n\n### Impacts on Judaism, Christianity, and Other Faiths\n\nIslam's doctrine designates Jews and Christians as *Ahl al-Kitab* (People of the Book), granting them protected status under Muslim rule while asserting Islam's supersession over their revelations. This framework imposed the *dhimmi* system, requiring non-Muslims to pay the *jizya* poll tax in exchange for protection, but also enforcing restrictions such as prohibitions on bearing arms, building new places of worship, proselytizing, and residing in structures taller than those of Muslims.  Under this status, dhimmis faced institutionalized inferiority, with periodic humiliations like distinctive clothing and vulnerability to mob violence or arbitrary enforcement by rulers. \n\nThe rapid Islamic conquests from the 7th century onward drastically reduced Christian majorities in regions like the Levant, North Africa, and Persia through a combination of warfare, economic pressures from *jizya*, and incentives for conversion, leading to Christianity's near-extinction in many ancestral heartlands by the medieval period. For instance, in 1009, Fatimid Caliph al-Hakim bi-Amr Allah ordered the destruction of the Church of the Holy Sepulchre in Jerusalem and numerous other churches and synagogues across his domain, symbolizing doctrinal intolerance toward perceived idolatrous practices. Abbasid-era uprisings, such as the 936 Jerusalem revolt, resulted in the burning of churches, while ongoing restrictions prevented reconstruction or expansion, contributing to the demographic decline of Christian communities.\n\nJewish communities under Islamic rule experienced similar subjugation, with *dhimmi* obligations fostering cycles of tolerance interspersed with pogroms and forced conversions; for example, 11th-century Almohad persecutions in North Africa and Spain compelled many Jews to convert or flee, eroding longstanding settlements. Synagogues were frequently confiscated and repurposed as mosques, and Jews were barred from public office or testimony against Muslims, perpetuating social marginalization. Despite occasional scholarly exchanges, such as during the Abbasid era's translations, the overall impact was one of constrained autonomy and cultural pressure toward assimilation or exodus.\n\nBeyond Abrahamic faiths, Islam's expansion devastated polytheistic and other monotheistic traditions. Zoroastrianism in Persia, once dominant, saw its adherents plummet from a majority to under 10% within centuries of the 7th-century conquests due to heavy *jizya*, temple destructions, and coerced conversions, with surviving communities retreating to remote areas or migrating to India as Parsis. In India, Muslim rulers demolished Hindu temples like Somnath in 1025 by Mahmud of Ghazni, repurposing materials for mosques and imposing *jizya* on non-Muslims, which eroded Hindu institutional power and prompted resistance movements. Buddhist centers in Afghanistan and Central Asia, such as Bamiyan, faced iconoclastic destruction under early caliphates, accelerating Buddhism's retreat eastward and contributing to its marginalization in former strongholds. These patterns reflect Islam's imperative for monotheistic supremacy, often manifesting in the erosion of rival faiths' demographics and sacred infrastructure.\n\n### Borrowings and Parallels from Pre-Islamic Sources\n\nThe Quran recounts numerous prophetic narratives that exhibit close parallels to accounts in the Hebrew Bible and New Testament, including the creation of Adam, the flood of Noah, the trials of Abraham, the exodus led by Moses, and the virgin birth of Jesus. These stories, while affirming a shared monotheistic lineage, frequently incorporate variant details not found in canonical Jewish or Christian texts but attested in apocryphal works and rabbinic traditions circulating in late antique Arabia. For instance, the Quranic depiction of Jesus speaking from the cradle to defend Mary's honor (Quran 19:29-33) mirrors motifs in the second-century *Infancy Gospel of Thomas* and Syriac Christian infancies, which were known in the region through oral transmission among Nestorian and Monophysite communities. Similarly, the tale of Abraham surviving immolation in a fire (Quran 21:68-70) echoes Jewish midrashim, such as those in *Genesis Rabbah*, where Nimrod casts Abraham into flames, a narrative absent from the Masoretic text but prevalent in oral lore encountered by Muhammad in Medina's Jewish tribes.\n\nRitual practices in Islam also retain elements traceable to pre-Islamic Arabian polytheism, particularly in the Hajj pilgrimage centered on the Kaaba in Mecca. Prior to Muhammad's revelations around 610 CE, the Kaaba functioned as a cubic sanctuary housing idols of various tribal deities, serving as a focal point for annual pilgrimages by Bedouin groups across the Hijaz who performed circumambulation (*tawaf*) around it seven times in a counterclockwise direction, a practice retained in Islamic Hajj. The ritual of *sa'i*, involving seven runs between the hills of Safa and Marwah, originated as a pre-Islamic commemoration of Hagar's search for water, linked to pagan fertility cults and integrated into the Islamic narrative as Abrahamic in origin (Quran 2:158). Additionally, the stoning of pillars at Mina, symbolizing the rejection of Satan, parallels pre-Islamic expiation rites against evil spirits, as evidenced in Hijazi poetry predating Islam that describes similar processions and sacrifices during the sacred months.\n\nTheological concepts in Islam show continuities with pre-Islamic Arabian henotheism, where Allah—derived from *al-ilah* (\"the god\")—was acknowledged as the supreme creator deity above a pantheon of lesser gods and goddesses like al-Lat, al-Uzza, and Manat, whom the Quran later condemns as mere intercessors (Quran 53:19-23). Inscriptions from the sixth century CE, such as those at Umm al-Jimal, invoke Allah alongside polytheistic oaths, indicating his pre-Islamic status as a high god associated with oaths and rain, not a novel invention by Muhammad. Elements of spirit beings, termed *jinn* in the Quran, derive from pre-Islamic Arabian folklore of invisible nomads inhabiting deserts and ruins, capable of possession or alliance, a belief system Muhammad reformed but did not originate.\n\nParallels extend to influences from Zoroastrianism via Sasanian Persia, which bordered Arabia and interacted through trade. The Quranic eschatology of a narrow bridge (*sirāt*) over hell, traversable only by the righteous (Quran 19:71-72), resembles the *Chinvat Bridge* in Avestan texts, where souls are judged post-mortem; this motif, absent in canonical Abrahamic scriptures, likely entered via Zoroastrian communities in eastern Arabia or Bahran. Likewise, the promise of houris—pure companions in paradise (Quran 44:54)—echoes Zoroastrian descriptions of celestial maidens rewarding the faithful, as in the *Arda Viraf Namag*, reflecting cultural diffusion in a region where Persian garrisons influenced local cosmology before Islam's rise circa 622 CE. These borrowings, while adapted to affirm tawhid (strict monotheism), underscore Islam's emergence in a syncretic milieu where Muhammad, a merchant exposed to diverse traditions, synthesized elements into a new framework claiming primordial authenticity.\n\n### Conflicts and Coexistence in History\n\nThe early Islamic conquests from 632 to 750 CE involved rapid military campaigns that overthrew the Sasanian Empire in Persia by 651 CE and seized Byzantine territories including Syria after the Battle of Yarmouk in 636 CE, Egypt by 641 CE, and much of North Africa. These expansions displaced Zoroastrian, Christian, and Jewish populations, who were offered dhimmi status—protection in exchange for jizya tax, loyalty, and submission to Islamic rule, with restrictions on building new places of worship, public religious displays, and proselytizing. While this framework allowed continuity of non-Muslim communities under caliphal oversight, it institutionalized subordination, with periodic enforcement of distinctive clothing and vulnerability to rulers' whims, contrasting with full equality under Muslim law.\n\nIn medieval al-Andalus, following the 711 CE Umayyad conquest of Visigothic Spain, Muslims, Christians, and Jews coexisted under varying degrees of tolerance, particularly during the 10th-century Caliphate of Cordoba, where intellectual exchanges flourished amid dhimmi protections. However, this convivencia was uneven; the 11th-12th century Almoravid and Almohad dynasties imposed forced conversions and persecutions on Jews and Christians, prompting migrations and contributing to internal fragmentation exploited by Christian kingdoms in the Reconquista, culminating in Granada's fall in 1492 CE. The Crusades (1095-1291 CE), initiated by European Christians to reclaim Jerusalem after Seljuk Turk expansions, were viewed in Islamic chronicles as Frankish invasions rather than unified holy wars, with Muslim unification under leaders like Saladin enabling recapture of Jerusalem in 1187 CE after initial losses.\n\nUnder the Ottoman Empire from the 14th to early 20th centuries, the millet system organized non-Muslim communities—such as Orthodox Christians, Armenian Christians, and Jews—into semi-autonomous units with their own leaders, courts for personal law, and tax collection, fostering administrative stability across diverse Anatolia, Balkans, and Levant. This structure, rooted in sharia's dhimmi provisions, permitted religious practice and communal governance but upheld Muslim supremacy, with jizya payments and bans on Muslim conversion to other faiths; while enabling relative peace compared to Europe's religious wars, it included discriminatory taxes and occasional pogroms, as during the 1821 Greek revolt suppressions. Historical coexistence thus balanced pragmatic governance with doctrinal hierarchy, varying by era and ruler, often prioritizing Islamic dominance over egalitarian pluralism.\n\n## Doctrinal Controversies\n\n### Interpretations of Jihad and Warfare\n\nThe term *jihad* derives from the Arabic root *j-h-d*, connoting striving or exertion in a cause. In the Quran, it encompasses personal and communal efforts toward faith, but frequently mandates combative action against non-believers, as in Surah 9:29, which instructs fighting \"those who do not believe in Allah\" until they pay *jizya* (poll tax) in submission, and Surah 2:216, prescribing fighting as obligatory despite aversion.   These verses, revealed during conflicts in Medina, frame jihad as integral to establishing Islamic dominance over opposing polities. Early Islamic expeditions under Muhammad involved at least 27 military engagements, including offensive raids like the Battle of Badr in 624 CE and conquests of Mecca in 630 CE, setting precedents for expansionary warfare. \n\nClassical Islamic jurisprudence, as articulated by major schools (Hanafi, Maliki, Shafi'i, Hanbali), categorizes jihad into defensive (fard ayn, obligatory on all able-bodied Muslims when under attack) and offensive (fard kifaya, communal duty to expand Islamic territory and subdue non-Muslims).  Offensive jihad aimed to remove barriers to *da'wah* (invitation to Islam) and establish *dar al-Islam* (abode of Islam) through conquest, permitting warfare against peaceful non-Muslim states unless they accepted dhimmi status or conversion.  Jurists like al-Shafi'i (d. 820 CE) justified perpetual offensive campaigns until global submission to Islamic rule, drawing on hadiths such as Sahih Muslim 19:4294, where Muhammad declares fighting disbelievers until they testify to Allah's oneness.  This doctrine underpinned the rapid conquests post-632 CE, expanding from Arabia to Persia and Byzantium by 661 CE, amassing territories exceeding 2.2 million square miles under the Rashidun Caliphs through systematic military jihad. \n\nThe popularized distinction between \"greater jihad\" (internal spiritual struggle) and \"lesser jihad\" (armed combat) stems from a hadith reported after a battle, claiming return from the lesser to the greater jihad against the self; however, this narration lacks a verifiable chain of transmission and is classified as weak (*da'if*) by hadith scholars, absent from authentic collections like Sahih al-Bukhari or Sahih Muslim.  Primary sources prioritize martial jihad, with Muhammad equating the highest martyrdom to death in battle for Allah's cause, as in Sahih al-Bukhari 4:52:53.  Shia interpretations similarly emphasize offensive eschatological jihad under the Imam, though defensive jihad predominates in Twelver doctrine pending the Mahdi's return. \n\nIn modern contexts, interpretations diverge: reformist scholars, often in Western-influenced academia, restrict jihad to defensive warfare, aligning with international norms and citing verses like 2:190 (\"fight in the way of Allah those who fight you but do not transgress\"), downplaying offensive mandates amid post-colonial sensitivities.  Conversely, Salafi-jihadist groups like al-Qaeda invoke classical rulings for global offensive jihad against perceived apostate regimes and infidels, referencing Surah 9:5's \"sword verse\" abrogating peace treaties with polytheists.   Empirical outcomes include over 80% of post-1945 Islamist conflicts involving offensive insurgencies justified as jihad, per analyses of groups from the Afghan mujahideen to ISIS, contrasting with state doctrines in countries like Saudi Arabia that nominally limit to defense but fund transnational militant networks.  This tension reflects unresolved doctrinal pluralism, where source credibility varies—mainstream media often amplifies defensive narratives from institutional apologists, while primary texts and historical practice substantiate expansionary imperatives. \n\n### Apostasy, Blasphemy, and Freedom of Belief\n\nIn traditional Islamic jurisprudence, apostasy (riddah), defined as a Muslim's renunciation of Islam through explicit declaration, action, or belief, is punishable by death for adult males who refuse to repent after a period of three days, according to the consensus of major Sunni and Shia schools of thought.  This ruling derives primarily from hadiths attributed to Muhammad, such as the narration in Sahih al-Bukhari where Ibn Abbas reports: \"The Prophet said, 'Whoever changes his religion, kill him.'\"  The Quran itself contains no explicit worldly penalty for apostasy alone, with verses like 2:256 stating \"there is no compulsion in religion\" often interpreted by traditional scholars as applying only to initial conversion or non-Muslims, not prohibiting punishment for those born or raised Muslim who later apostatize, which is viewed as a betrayal akin to treason in the early Islamic context of tribal warfare. \n\nBlasphemy, encompassing insults to Allah, the Quran, or Muhammad, similarly lacks a direct Quranic mandate for capital punishment but is treated severely under hadith and fiqh traditions, often equating it to apostasy or warranting death to preserve communal faith. In practice, blasphemy accusations have led to executions or mob violence in several Muslim-majority countries; for instance, in Pakistan under Section 295-C of the penal code, which mandates death for insulting Muhammad, Christian woman Asia Bibi was convicted and sentenced to hang in November 2010 following an accusation during a workplace dispute, though she was acquitted by the Supreme Court in October 2018 after years of appeals amid international pressure and domestic unrest that included the 2011 assassination of Punjab Governor Salman Taseer for defending her.  Such laws, present in about 32 Muslim-majority countries as of 2019, frequently result in extrajudicial killings, with over 60 deaths linked to blasphemy claims in Pakistan alone since the 1980s amendments under General Zia-ul-Haq.\n\nAs of 2021, at least 10 Muslim-majority countries— including Afghanistan, Iran, Malaysia, Maldives, Mauritania, Qatar, Saudi Arabia, Somalia, United Arab Emirates, and Yemen—impose the death penalty for apostasy, while others like Pakistan and Sudan allow it under certain interpretations, though executions are rare and often extrajudicial. Pew Research data indicate that 13 percent of countries worldwide penalize apostasy, concentrated in the Middle East-North Africa region where 90 percent of nations have such restrictions, reflecting the enduring influence of classical Sharia over universal human rights norms like UN Article 18 on freedom of thought and belief. Historically, executions for apostasy occurred sporadically, such as Iran's state-sanctioned hanging of Hossein Soodmand in 1990 for converting to Christianity, but enforcement has varied; Ottoman reforms in the 19th century suspended such penalties under Tanzimat edicts, though they were reinstated in some post-colonial states.\n\nThese doctrines contrast with claims of inherent religious freedom in Islam, as the hadith-based penalties prioritize communal order and doctrinal purity over individual exit rights, leading critics to argue a causal link between scriptural traditions and empirical restrictions in Muslim societies, where surveys show majority support for apostasy punishment in countries like Afghanistan (79 percent) and Pakistan (62 percent) as of 2013. Some 20th-century reformers, like Muhammad Abduh (d. 1905), questioned the death penalty's applicability absent sedition, but mainstream institutions, including Al-Azhar, uphold it, underscoring tensions between historical jurisprudence and modern pluralism.\n\n### Slavery, Polygamy, and Historical Justifications\n\nIn Islamic scripture, slavery is permitted and regulated rather than prohibited. The Quran refers to slaves as \"what your right hands possess\" (ma malakat aymanukum), allowing believers to own captives from war (Quran 47:4) and engage in sexual relations with female slaves without marriage, as in Surah An-Nisa 4:24, which permits relations with \"those whom your right hands possess\" after paying their bride-price equivalent. Surah Al-Mu'minun 23:5-6 further specifies that the righteous guard their chastity except with wives or \"those whom their right hands possess.\" Hadith collections record Muhammad owning slaves, including Mariyah al-Qibtiyyah, a Coptic concubine gifted by the Byzantine emperor, with whom he had a son, Ibrahim; he freed some slaves as acts of piety, such as Zayd ibn Harithah, but retained others.\n\nHistorically, the Arab-Muslim slave trade, spanning from the 7th to 20th centuries, enslaved an estimated 10 to 18 million Africans via trans-Saharan and Indian Ocean routes, far outlasting the transatlantic trade in duration though with smaller peak volume, involving castration of many male slaves for harem service and high mortality rates exceeding 80% for some castrations. Up to 50% died en route from castration, marches, or shipwrecks, totaling an estimated 5-9 million deaths. This trade, justified under Islamic law as deriving from prisoners of war or purchase from non-Muslim lands, persisted in Ottoman, Persian, and Arab societies until the 19th and early 20th centuries, when bans were enacted—often under European pressure—such as Saudi Arabia's in 1962 and Mauritania's in 1981, though enforcement lagged. Islamic jurisprudence viewed slavery as a merciful alternative to executing war captives, with manumission encouraged for expiation of sins (Quran 58:3) and as an act of piety (Quran 90:13), but no doctrinal imperative existed for total abolition, leading to its endurance as a socioeconomic institution.\n\nPolygamy, specifically polygyny, is explicitly authorized in Quran 4:3, permitting men to marry up to four women provided they can treat them justly, framed in the context of caring for orphans but not limited to it. Muhammad practiced polygyny extensively, marrying at least 11 women after Khadijah's death, maintaining up to nine wives simultaneously by his death in 632 CE, exceeding the Quranic limit for ordinary men via a special dispensation in Surah Al-Ahzab 33:50. Traditional justifications portray this as a means to support widows, forge alliances, or provide for the vulnerable in a tribal society scarred by warfare, with equity in treatment mandated to prevent favoritism (Quran 4:129 admits full justice is unattainable). In practice, polygyny served reproductive, economic, and status purposes, as evidenced by its prevalence among elites in caliphates, though Hadith emphasize financial responsibility to avoid overburdening men.\n\nThese practices were historically defended in Islamic thought as pragmatic regulations of pre-Islamic Arabian norms, introducing protections like prohibiting forced prostitution of female slaves (Quran 24:33) and urging kind treatment, rather than outright bans that might destabilize societies reliant on captive labor and concubinage. Reformist interpretations later argued for gradual obsolescence, akin to alcohol's phased prohibition, but primary sources show no explicit Quranic or Prophetic command for eradication, allowing persistence until modern secular influences compelled legal abolition. Empirical outcomes reveal higher slave mortality and exploitation in Islamic systems compared to contemporaneous European indenture, underscoring causal continuities from scriptural permissions to institutionalized practices.\n## Societal and Ethical Criticisms\n\n### Treatment of Women and Minorities\n\nIn Islamic doctrine, women are granted specific rights and obligations under Sharia, derived from the Quran and Hadith, but these often establish legal inequalities relative to men. For inheritance, Quran 4:11 stipulates that a daughter's share is half that of a son's in the absence of male offspring, reflecting a rationale of male financial responsibility for family maintenance. Similarly, in financial transactions, Quran 2:282 requires the testimony of two women to equal that of one man, predicated on assumptions of women's lesser aptitude in such matters. Polygamy is permitted for men up to four wives, conditional on equitable treatment, as per Quran 4:3, while polyandry is prohibited. Modesty requirements include veiling, with Quran 24:31 directing women to cover their bosoms and draw veils over themselves, and 33:59 advising outer garments for protection.\n\nEmpirical outcomes in Muslim-majority countries frequently reveal disparities in women's status. Female labor force participation averages below 20% in many Middle Eastern and North African (MENA) nations, compared to global rates exceeding 50%, constrained by guardianship laws and cultural norms enforcing domestic roles. Honor killings, often justified through interpretations of family honor tied to female chastity, claim thousands of victims annually; in Pakistan alone, over 1,000 cases were reported in 2022, with perpetrators rarely facing severe penalties under weak legal deterrents. Female genital mutilation (FGM), called khitan al-inath or khifad, lacks explicit Quranic command but is endorsed in classical Islam as part of fitrah (Quran 30:30) and sunnah through prophetic obedience (Quran 33:21, 33:36); key hadiths include Sahih al-Bukhari 5889 listing khitan among five fitrah practices for both sexes, Sahih Muslim 785 and Tirmidhi referencing \"when the two circumcised parts meet\" assuming female khitan, and Sunan Abi Dawud 5271 advising a circumciser not to cut severely as it is better for the woman and preferred by the husband. In fiqh, it is obligatory in Shafi’i (e.g., Reliance e4.3) and Hanbali schools (at puberty), recommended in Maliki, and not prohibited in Hanafi, with no madhhab forbidding it; the CSPII FGM Index 2025 estimates 291–304 million living victims, 77–86% in Muslim contexts (21.7–25.3% of Muslim females vs. 1.4–2.4% non-Muslim), with top rates in Somalia (99%) and Indonesia (87%, 121 million cases), and diaspora cases exceeding 500,000 in the USA and 137,000 in the UK. Traditional doctrine views mild forms as sunnah or wajib despite universal medical and legal condemnation; the World Health Organization classifies all forms of FGM as mutilation and human rights violations. Adultery under Sharia carries hudud punishments like stoning to death, disproportionately applied to women due to evidentiary burdens and societal scrutiny of female behavior.\n\nNon-Muslim minorities under Islamic governance historically held dhimmi status, affording protection in exchange for jizya tax and submission to Islamic authority, but entailing restrictions such as prohibitions on proselytizing, bearing arms, or building new places of worship without permission. Quran 9:29 mandates fighting those who do not believe until they pay jizya \"while they are humbled,\" establishing a subordinate position for People of the Book (Jews and Christians). In practice, this led to periodic humiliations, like distinctive clothing mandates or exclusion from public office, though enforcement varied; Ottoman dhimmis enjoyed communal autonomy but faced sporadic pogroms, such as the 1894-1896 Hamidian massacres killing up to 300,000 Armenian Christians.\n\nContemporary Muslim-majority countries exhibit high levels of religious persecution against minorities, with Pew Research documenting harassment of Christians in 145 countries in 2022, predominantly Islamic ones imposing blasphemy laws or forced conversions. Apostasy from Islam warrants death penalties in 13 nations, including Saudi Arabia and Iran, rooted in hadiths declaring \"whoever changes his religion, kill him,\" suppressing minority sects like Ahmadis in Pakistan, where over 1,000 faced violence or discrimination in 2023. Groups like Yazidis endured genocide under ISIS in 2014-2017, with 5,000 killed and 7,000 women enslaved, justified via revivalist interpretations of slavery and jihad. Such patterns underscore causal links between strict Sharia adherence and minority vulnerability, contrasting with protections in secular frameworks.\n### Compatibility with Modernity and Human Rights\n\nThe Cairo Declaration on Human Rights in Islam, adopted by the Organisation of Islamic Cooperation on August 5, 1990, presents an Islamic framework for rights and freedoms, stipulating in its preamble that such rights are derived from divine revelation and subject to Sharia as the sole source of reference. Article 24 explicitly states that all stipulated rights and freedoms are \"subject to the Islamic Sharia,\" subordinating individual entitlements to religious jurisprudence rather than universal secular standards. This contrasts with the Universal Declaration of Human Rights (1948), which posits rights as inherent and inalienable irrespective of religious doctrine, highlighting a fundamental tension where Sharia's supremacy limits equality, freedom of expression, and non-discrimination on grounds independent of faith.\n\nClassical Islamic jurisprudence, drawing from Quran, Hadith, and scholarly consensus, prescribes corporal and capital punishments under Sharia—such as amputation for theft (Quran 5:38) and death for adultery (based on Hadith)—deemed incompatible with international prohibitions on cruel, inhuman, or degrading treatment under treaties like the International Covenant on Civil and Political Rights. A 2013 Pew Research Center survey across 39 countries found majorities in regions like South Asia (84% in Pakistan, 99% in Afghanistan) and the Middle East-North Africa (e.g., 74% in Egypt) favoring Sharia as official law, with substantial support for these hudud penalties, including stoning for adultery (e.g., 86% in Pakistan, 57% in Egypt). Such endorsements reflect doctrinal adherence to seventh-century revelatory texts over modern egalitarian norms, where punishments are viewed as divinely ordained deterrents rather than violations of human dignity.\n\nOn religious freedom, apostasy (riddah) is treated as a capital offense in four major Sunni schools of jurisprudence and Twelver Shia fiqh, justified by Hadith narrations like Sahih Bukhari 9.84.57 attributing to Muhammad the statement that \"whoever changes his religion, kill him,\" despite the Quran's lack of explicit worldly penalty (e.g., 2:256: \"no compulsion in religion\"). As of 2021, ten Muslim-majority countries codify death for apostasy, including Saudi Arabia, Iran, and Afghanistan, though executions are infrequent; this stance prioritizes communal order and doctrinal purity over individual autonomy, conflicting with Article 18 of the UDHR on freedom to change religion.\n\nGender equality under Sharia derives from verses like Quran 4:34, permitting male guardianship (qiwama) and disciplinary measures against wives, alongside unequal inheritance (Quran 4:11, males receiving double shares) and testimony valuation (Quran 2:282, two female witnesses equaling one male in financial matters). Polygyny is endorsed (Quran 4:3, up to four wives), while female autonomy in marriage and divorce remains restricted in orthodox interpretations, diverging from CEDAW standards on substantive equality. Non-Muslims (dhimmis) face jizya tax and subordinate status (Quran 9:29), incompatible with non-discrimination principles.\n\nModerns like secular governance and scientific inquiry face doctrinal hurdles, as sovereignty belongs to Allah alone (Quran 33:36), rendering popular democracy potentially illicit if it contravenes Sharia; historical caliphates integrated religion into statecraft without separation of mosque and state. Freedom House's 2024 assessments rate most Muslim-majority countries as \"Not Free,\" with scores below 20/100 in political rights for nations like Saudi Arabia (8/100) and Iran (12/100), attributing deficits to Sharia-enforced theocracy over pluralistic institutions.  While modernist reformers advocate ijtihad (independent reasoning) to align with contemporary ethics, orthodox majorities and institutions like Al-Azhar uphold traditional fiqh, sustaining incompatibilities absent wholesale reinterpretation of immutable sources.\n\n### Empirical Outcomes in Muslim-Majority Societies\n\nMuslim-majority countries, numbering approximately 50 and comprising over 1.8 billion people, generally underperform global averages across key development metrics, with notable exceptions in resource-dependent economies such as those in the Gulf states. According to World Bank data for 2023, the average GDP per capita in the Middle East and North Africa region—predominantly Muslim-majority—was around $4,000 to $5,000 in non-oil exporters, compared to the global average exceeding $12,000, reflecting structural challenges including reliance on commodities, institutional weaknesses, and limited diversification.  Oil-rich nations like Qatar and the UAE achieve per capita figures above $60,000, but even these mask vulnerabilities tied to volatile energy markets rather than broad-based productivity gains.\n\nHuman Development Index (HDI) scores from the United Nations Development Programme's 2023 report place most Muslim-majority countries in the medium or low categories, with an Arab states regional average of 0.719—below the global 0.739—driven by deficits in education, health, and income equality.  Countries like Afghanistan (HDI 0.478), Yemen (0.424), and Pakistan (0.544) rank among the lowest globally, correlating with prolonged conflict and governance failures, while Malaysia (0.810) and Indonesia (0.709) perform better but still trail advanced economies. Gender Inequality Index (GII) values further highlight disparities, with the Arab states averaging 0.523 in 2022—the second-highest regionally—indicating elevated maternal mortality, low parliamentary representation for women (around 18% average), and labor force participation gaps exceeding 30 percentage points between genders. \n\nGovernance indicators reveal systemic issues: the 2023 Corruption Perceptions Index by Transparency International assigns Muslim-majority countries an average score of approximately 35 out of 100 (where 0 is highly corrupt), lower than the global 43, with nations like Somalia (11), Yemen (16), and Syria (13) at the bottom, linked to weak rule of law and patronage networks.  Freedom House's 2023 assessments classify over 80% of Muslim-majority states as \"Not Free,\" with aggregate scores below 30/100 for political rights and civil liberties in places like Saudi Arabia (8/100), Iran (12/100), and Egypt (18/100), reflecting authoritarian consolidation, electoral manipulation, and suppression of dissent.  \n\nSecurity outcomes are markedly poor, as evidenced by the 2023 Global Peace Index, where five of the ten least peaceful countries—Yemen (162nd), Afghanistan (163rd), Syria (159th), Iraq (151st), and Pakistan (140th)—are Muslim-majority, scoring high on indicators of internal conflict, societal violence, and militarization.  Terrorism remains concentrated in these societies; the Global Terrorism Index 2023 attributes 95% of terrorism deaths to conflicts involving Islamist groups, with epicenters in Afghanistan (over 1,000 deaths), Somalia, Nigeria, Syria, and Iraq, perpetuating cycles of instability that hinder investment and human capital development.  These patterns persist despite resource endowments and population sizes, suggesting causal factors beyond colonialism or geography, including doctrinal rigidities and institutional incentives misaligned with innovation and pluralism.\n\n| Indicator | Regional Average (Muslim-Majority/Arab States) | Global Average | Key Low Performers (2023) |\n|-----------|------------------------------------------------|----------------|---------------------------|\n| GDP per Capita (USD) | ~$4,000–$5,000 (non-oil) | \\u003e$12,000 | Yemen ($677), Somalia ($462) |\n| HDI Score | 0.719 | 0.739 | Yemen (0.424), Afghanistan (0.478) |\n| CPI Score (/100) | ~35 | 43 | Somalia (11), Syria (13) |\n| Freedom House Score (/100) | \\u003c30 (majority \"Not Free\") | N/A | Saudi Arabia (8), Iran (12) |\n| GPI Rank (out of 163) | Bottom quartile dominant | N/A | Yemen (162), Afghanistan (163) |\n| GII Value | 0.523 | ~0.45 | Yemen, Pakistan high inequality\n\n### Reform Efforts and Internal Debates\n\nIn the late 19th and early 20th centuries, Islamic modernist reformers such as Jamal al-Din al-Afghani (1838–1897), Muhammad Abduh (1849–1905), and Rashid Rida (1865–1935) sought to reconcile Islamic doctrine with modern science, rationalism, and governance by advocating the reopening of ijtihad, the independent interpretation of religious texts, which they argued had been stifled by centuries of taqlid, or unquestioning adherence to medieval jurists.  Abduh, as Grand Mufti of Egypt from 1899, emphasized rational inquiry into the Quran to address colonial-era challenges, critiquing blind imitation as a cause of Muslim decline while preserving core sharia principles. Rida, through his journal Al-Manar founded in 1898, extended this by promoting a return to salaf (early Muslim ancestors) but diverged toward proto-Salafism, influencing groups like the Muslim Brotherhood established in 1928, which prioritized political revival over liberal adaptation. These efforts yielded mixed results, with modernist ideas inspiring educational reforms in places like Al-Azhar University but often co-opted by revivalist movements that reinforced orthodoxy rather than secular pluralism.\n\nCentral to these reform initiatives were debates over ijtihad versus taqlid, with modernists arguing that the \"closing of the gates of ijtihad\" around the 10th century had ossified Islamic law, preventing adaptation to contemporary realities like constitutionalism and technology. Proponents claimed qualified scholars could derive new rulings from primary sources (Quran and Sunnah) to endorse democracy or banking interest, viewing taqlid as a post-classical innovation that prioritized madhhab (legal school) loyalty over textual fidelity. Opponents, including traditional ulema, countered that widespread ijtihad risked heresy and fragmentation, insisting only mujtahids (elite interpreters) could engage in it, a view reinforced by historical fatwas limiting non-specialists to emulation. These tensions persist, as seen in Saudi Arabia's 20th-century Hanbali establishment upholding taqlid while selectively allowing state ijtihad for oil-era policies, highlighting how political authority often overrides doctrinal purity.\n\nContemporary reform advocates, such as Maajid Nawaz and Irshad Manji, echo modernist calls for ijtihad to prioritize human rights and contextual reinterpretation over literalist applications of hudud punishments or gender roles, with Nawaz's Quilliam Foundation (founded 2008) promoting \"reformist Islam\" against extremism.  Manji, in works like *Allah, Liberty and Love* (2011), urges Muslims to challenge taboos on questioning prophetic traditions for ethical renewal. However, such voices face internal backlash, labeled as Western puppets or apostates by orthodox groups, with empirical data showing marginal impact: surveys indicate over 80% of Muslims in countries like Pakistan and Egypt favor sharia as official law, per Pew Research 2013 findings on unyielding scriptural primacy. \n\nEmpirical outcomes underscore reform's challenges, including the absence of a centralized authority akin to the Catholic Church's papacy, which fragments efforts across Sunni-Shia divides and 1,300 madhabs. Historical resistance, such as the Ottoman ulema's 18th-century opposition to printing presses until 1727, delayed literacy and discourse, contributing to persistent doctrinal rigidity. In practice, attempted reforms like Egypt's 1920s secular experiments under modernist influence reverted amid Brotherhood-led pushback, while state-imposed \"reforms\" in places like Iran's post-1979 theocracy or Saudi's 2017 female driving allowance remain top-down and selective, not grassroots doctrinal shifts. Critics attribute limited success to causal factors like oil-funded Wahhabism exporting conservatism since the 1970s, outpacing modernist education, with data from the World Bank's 2020 governance indicators showing Muslim-majority states averaging lower rule-of-law scores than global norms, correlating with unreformed legal systems. Despite this, pockets of debate continue in diaspora communities and online forums, where younger Muslims grapple with reconciling faith and secularity, though without institutional backing, these yield more individual dissent than systemic change.",
  "external_references": [
    {
      "text": "Whp 3 5 7d Read Islam 1030l.pdf",
      "url": "https://www.oerproject.com/-/media/WHP/PDF/Era3/WHP-3-5-7d-Read---Islam---1030L.pdf",
      "domain": "oerproject.com",
      "type": "citation"
    },
    {
      "text": "Intro To Islam",
      "url": "https://www.mei.edu/bassiouni/intro-to-islam",
      "domain": "mei.edu",
      "type": "citation"
    },
    {
      "text": "Muslim Population Change",
      "url": "https://www.pewresearch.org/religion/2025/06/09/muslim-population-change/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Six Major Beliefs In Islam",
      "url": "https://sites.udel.edu/msadelaware/six-major-beliefs-in-islam/",
      "domain": "sites.udel.edu",
      "type": "citation"
    },
    {
      "text": "The Teachings Of Islam According To The Quran",
      "url": "https://prophetsofgod.net/the-teachings-of-islam-according-to-the-quran/",
      "domain": "prophetsofgod.net",
      "type": "citation"
    },
    {
      "text": "The Five Pillars Of Islam",
      "url": "https://www.metmuseum.org/learn/educators/curriculum-resources/art-of-the-islamic-world/unit-one/the-five-pillars-of-islam",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Kennedy.pdf",
      "url": "https://rps.macmillan.yale.edu/sites/default/files/files/kennedy.pdf",
      "domain": "rps.macmillan.yale.edu",
      "type": "citation"
    },
    {
      "text": "The Rise Of Islamic Empires And States",
      "url": "https://www.khanacademy.org/humanities/world-history/medieval-times/spread-of-islam/a/the-rise-of-islamic-empires-and-states",
      "domain": "khanacademy.org",
      "type": "citation"
    },
    {
      "text": "S0014498321000188",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0014498321000188",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Origin Of Name Islam",
      "url": "https://islamichistory.com/advent-of-islam/origin-of-name-islam/",
      "domain": "islamichistory.com",
      "type": "citation"
    },
    {
      "text": "Understanding The Term Islam",
      "url": "https://quranicteachings.org/understanding-the-term-islam/",
      "domain": "quranicteachings.org",
      "type": "citation"
    },
    {
      "text": "Islam Means Peace A Brief Etymological Reflection",
      "url": "https://abtslebanon.org/2016/02/04/islam-means-peace-a-brief-etymological-reflection/",
      "domain": "abtslebanon.org",
      "type": "citation"
    },
    {
      "text": "Islam Means Submission Submission In The Quran And The Bible",
      "url": "https://www.patheos.com/blogs/askamuslim/2021/07/islam-means-submission-submission-in-the-quran-and-the-bible/",
      "domain": "patheos.com",
      "type": "citation"
    },
    {
      "text": "Translation.jsp",
      "url": "https://corpus.quran.com/translation.jsp?chapter=3\\u0026verse=19",
      "domain": "corpus.quran.com",
      "type": "citation"
    },
    {
      "text": "Translation.jsp",
      "url": "https://corpus.quran.com/translation.jsp?chapter=3\\u0026verse=85",
      "domain": "corpus.quran.com",
      "type": "citation"
    },
    {
      "text": "Translation.jsp",
      "url": "https://corpus.quran.com/translation.jsp?chapter=2\\u0026verse=131",
      "domain": "corpus.quran.com",
      "type": "citation"
    },
    {
      "text": "When Did The Name Islam Become Attributed As",
      "url": "https://www.reddit.com/r/AcademicQuran/comments/1h0pk93/when_did_the_name_islam_become_attributed_as/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Islams Origins",
      "url": "https://mag.uchicago.edu/arts-humanities/islams-origins",
      "domain": "mag.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "The Meaning Of Islam",
      "url": "https://wikiislam.net/wiki/The_Meaning_of_Islam",
      "domain": "wikiislam.net",
      "type": "citation"
    },
    {
      "text": "Islam",
      "url": "https://www.etymonline.com/word/Islam",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "What Is Submission",
      "url": "https://www.whyislam.org/what-is-submission/",
      "domain": "whyislam.org",
      "type": "citation"
    },
    {
      "text": "Where Did The Word Islam Come From And Was It The",
      "url": "https://www.reddit.com/r/islam/comments/5mot3n/where_did_the_word_islam_come_from_and_was_it_the/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "49030",
      "url": "https://islamqa.info/en/answers/49030",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "Al Ikhlas",
      "url": "https://quran.com/en/al-ikhlas",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "Types Of Tawheed",
      "url": "https://zinaidabunaser.com/2009/06/18/types-of-tawheed/",
      "domain": "zinaidabunaser.com",
      "type": "citation"
    },
    {
      "text": "A Clash Of Monotheisms Tawhid Vs Trinity Pt 1",
      "url": "https://glanier.wordpress.com/2014/05/06/a-clash-of-monotheisms-tawhid-vs-trinity-pt-1/",
      "domain": "glanier.wordpress.com",
      "type": "citation"
    },
    {
      "text": "Chapter 4 Tawhid Or Monotheism",
      "url": "https://al-islam.org/god-quran-metaphysical-study-sayyid-muhammad-husayni-beheshti/chapter-4-tawhid-or-monotheism",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "Belief In Prophets",
      "url": "https://www.islamreligion.com/en/articles/37/belief-in-prophets",
      "domain": "islamreligion.com",
      "type": "citation"
    },
    {
      "text": "138141",
      "url": "https://islamqa.info/en/answers/138141",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "Prophets Mentioned In The Quran",
      "url": "https://onepathnetwork.com/prophets-mentioned-in-the-quran/",
      "domain": "onepathnetwork.com",
      "type": "citation"
    },
    {
      "text": "A Timeline Of All The Prophets In Islam",
      "url": "https://charitymeals.org/news/a-timeline-of-all-the-prophets-in-islam/",
      "domain": "charitymeals.org",
      "type": "citation"
    },
    {
      "text": "Number Prophets",
      "url": "https://al-islam.org/prophethood-and-prophet-islam-ibrahim-amini/number-prophets",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "40",
      "url": "https://quran.com/en/al-ahzab/40",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "Ayat 40",
      "url": "https://myislam.org/surah-ahzab/ayat-40/",
      "domain": "myislam.org",
      "type": "citation"
    },
    {
      "text": "Belief In Prophets",
      "url": "https://www.whyislam.org/belief-in-prophets/",
      "domain": "whyislam.org",
      "type": "citation"
    },
    {
      "text": "The History And Compilation Of The Holy Quran.html",
      "url": "https://www.minhaj.org/english//tid/2929/The-History-And-Compilation-Of-The-Holy-Quran.html",
      "domain": "minhaj.org",
      "type": "citation"
    },
    {
      "text": "The History Of The Quranic Text From Revelation To Compilation.pdf",
      "url": "https://individual.utoronto.ca/fantastic/The_History_of_the_Quranic_Text_from_Revelation_to_Compilation.pdf",
      "domain": "individual.utoronto.ca",
      "type": "citation"
    },
    {
      "text": "The First Codex Abu Bakrs Compilation Of The Quran",
      "url": "https://yaqeeninstitute.org/read/paper/the-first-codex-abu-bakrs-compilation-of-the-quran",
      "domain": "yaqeeninstitute.org",
      "type": "citation"
    },
    {
      "text": "739794",
      "url": "https://academic.oup.com/jis/article-abstract/18/1/95/739794",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "corpus.quran.com",
      "url": "https://corpus.quran.com/",
      "domain": "corpus.quran.com",
      "type": "citation"
    },
    {
      "text": "The Difference Between The Quran Hadith And Hadith Qudsi",
      "url": "https://www.newmuslim.net/the-difference-between-the-quran-hadith-and-hadith-qudsi/",
      "domain": "newmuslim.net",
      "type": "citation"
    },
    {
      "text": "What Is The Difference Between Hadith And Quran",
      "url": "https://islam.stackexchange.com/questions/4254/what-is-the-difference-between-hadith-and-quran",
      "domain": "islam.stackexchange.com",
      "type": "citation"
    },
    {
      "text": "The Compilers Of Al Sihah Al Sitta",
      "url": "https://ghayb.com/the-compilers-of-al-sihah-al-sitta/",
      "domain": "ghayb.com",
      "type": "citation"
    },
    {
      "text": "Authenticating Hadith And The History Of Hadith Criticism",
      "url": "https://yaqeeninstitute.org/read/paper/authenticating-hadith-and-the-history-of-hadith-criticism",
      "domain": "yaqeeninstitute.org",
      "type": "citation"
    },
    {
      "text": "843",
      "url": "https://islamqa.info/en/answers/843",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "14 Characteristics Of Angels",
      "url": "https://www.alislam.org/articles/14-characteristics-of-angels/",
      "domain": "alislam.org",
      "type": "citation"
    },
    {
      "text": "Physical Characteristics Of Angels Ii",
      "url": "https://www.islamweb.net/en/article/135686/physical-characteristics-of-angels-ii",
      "domain": "islamweb.net",
      "type": "citation"
    },
    {
      "text": "Duties Of Angels",
      "url": "https://www.islam.org.uk/beliefs-overview/angels/duties-of-angels/",
      "domain": "islam.org.uk",
      "type": "citation"
    },
    {
      "text": "Names Of Angels In Islam",
      "url": "https://studioarabiya.com/names-of-angels-in-islam/",
      "domain": "studioarabiya.com",
      "type": "citation"
    },
    {
      "text": "Divine Will And Predestination.pdf",
      "url": "https://adviceforparadise.com/media/books/Divine_Will_and_Predestination.pdf",
      "domain": "adviceforparadise.com",
      "type": "citation"
    },
    {
      "text": "Angels",
      "url": "https://myislam.org/quran-verses/angels/",
      "domain": "myislam.org",
      "type": "citation"
    },
    {
      "text": "Early Islamic Debate Faith Reason Worth Examining",
      "url": "https://www.cato.org/commentary/early-islamic-debate-faith-reason-worth-examining",
      "domain": "cato.org",
      "type": "citation"
    },
    {
      "text": "78329",
      "url": "https://islamqa.info/en/answers/78329",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "Islamic Day Of Judgement",
      "url": "https://www.zwemercenter.com/islamic-day-of-judgement/",
      "domain": "zwemercenter.com",
      "type": "citation"
    },
    {
      "text": "183",
      "url": "https://quran.com/en/al-baqarah/183",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "Five Pillars Islam",
      "url": "https://www.saudiembassy.net/five-pillars-islam",
      "domain": "saudiembassy.net",
      "type": "citation"
    },
    {
      "text": "Are The Five Daily Prayers Mentioned In The Quran",
      "url": "https://islamqa.info/en/answers/1092/are-the-five-daily-prayers-mentioned-in-the-quran",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "Islam Beyond The Five Pillars",
      "url": "https://islamicity.org/3542/islam-beyond-the-five-pillars/",
      "domain": "islamicity.org",
      "type": "citation"
    },
    {
      "text": "Islam Rituals And Practices",
      "url": "https://culturalatlas.sbs.com.au/religions/islam/resources/islam-rituals-and-practices",
      "domain": "culturalatlas.sbs.com.au",
      "type": "citation"
    },
    {
      "text": "Rakats In Jummah Prayer",
      "url": "https://myislam.org/rakats-in-jummah-prayer/",
      "domain": "myislam.org",
      "type": "citation"
    },
    {
      "text": "Friday Prayer",
      "url": "https://www.alislam.org/book/salat/friday-prayer/",
      "domain": "alislam.org",
      "type": "citation"
    },
    {
      "text": "How To Pray Eid Salah 1",
      "url": "https://muslimhands.org.uk/latest/2016/07/how-to-pray-eid-salah-1",
      "domain": "muslimhands.org.uk",
      "type": "citation"
    },
    {
      "text": "Eid Ul Fitr And Eid Ul Adha What Is The Difference",
      "url": "https://muslimaid.org/media-centre/blog/eid-ul-fitr-and-eid-ul-adha-what-is-the-difference/",
      "domain": "muslimaid.org",
      "type": "citation"
    },
    {
      "text": "21979",
      "url": "https://islamqa.info/en/answers/21979",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "Voluntary Fasting Days",
      "url": "https://kalimah-center.com/voluntary-fasting-days/",
      "domain": "kalimah-center.com",
      "type": "citation"
    },
    {
      "text": "Sadaqah",
      "url": "https://islamic-relief.org/sadaqah/",
      "domain": "islamic-relief.org",
      "type": "citation"
    },
    {
      "text": "5 Acts Of Sadaqah Jaariyah In Islam",
      "url": "https://muslimaid.org/media-centre/blog/5-acts-of-sadaqah-jaariyah-in-islam/",
      "domain": "muslimaid.org",
      "type": "citation"
    },
    {
      "text": "253005",
      "url": "https://islamqa.info/en/answers/253005",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "The Virtues Of Dhikr",
      "url": "https://lifewithallah.com/articles/dhikr/the-virtues-of-dhikr/",
      "domain": "lifewithallah.com",
      "type": "citation"
    },
    {
      "text": "Islamic Practices",
      "url": "https://pluralism.org/islamic-practices",
      "domain": "pluralism.org",
      "type": "citation"
    },
    {
      "text": "Sunni Islam Exploring Beliefs Practices",
      "url": "https://ximulate.org/blog/sunni-islam-exploring-beliefs-practices",
      "domain": "ximulate.org",
      "type": "citation"
    },
    {
      "text": "Pre Islamic Arabia",
      "url": "https://courses.lumenlearning.com/suny-fmcc-boundless-worldhistory/chapter/pre-islamic-arabia/",
      "domain": "courses.lumenlearning.com",
      "type": "citation"
    },
    {
      "text": "Pre Islamic Arab Religious Beliefs",
      "url": "https://historyofislam.org/pre-islamic-arab-religious-beliefs/",
      "domain": "historyofislam.org",
      "type": "citation"
    },
    {
      "text": "7.07%253a Culture And Religion In Pre Islamic Arabia",
      "url": "https://human.libretexts.org/Bookshelves/History/World_History/Early_World_Civilizations_%28Lumen%29/07%253A_The_Rise_and_Spread_of_Islam/7.07%253A_Culture_and_Religion_in_Pre-Islamic_Arabia",
      "domain": "human.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Muhammad And The Rise Of Islam",
      "url": "https://historyguild.org/muhammad-and-the-rise-of-islam/",
      "domain": "historyguild.org",
      "type": "citation"
    },
    {
      "text": "The Life Of Muhammad Pbuh A Timeline",
      "url": "https://www.alsirah.com/the-life-of-muhammad-pbuh-a-timeline/",
      "domain": "alsirah.com",
      "type": "citation"
    },
    {
      "text": "Cave Of Hira",
      "url": "https://hajjcouncil.org/cave-of-hira/",
      "domain": "hajjcouncil.org",
      "type": "citation"
    },
    {
      "text": "What Is The First Revelation At Cave Hira",
      "url": "https://thesubmitters.org/what-is-the-first-revelation-at-cave-hira/",
      "domain": "thesubmitters.org",
      "type": "citation"
    },
    {
      "text": "Constitution Of Medina",
      "url": "https://oceanlibrary.com/constitution-of-medina/",
      "domain": "oceanlibrary.com",
      "type": "citation"
    },
    {
      "text": "The Medina Charter Dustar Al Madinah.html",
      "url": "http://notesinhistory.blogspot.com/2013/08/the-medina-charter-dustar-al-madinah.html",
      "domain": "notesinhistory.blogspot.com",
      "type": "citation"
    },
    {
      "text": "Badr Was A Miraculous Gift Uhud A Reality Check",
      "url": "https://www.islamicity.org/82486/badr-was-a-miraculous-gift-uhud-a-reality-check/",
      "domain": "islamicity.org",
      "type": "citation"
    },
    {
      "text": "Battle Uhud Summary",
      "url": "https://rahiqacademy.com/battle-uhud-summary/",
      "domain": "rahiqacademy.com",
      "type": "citation"
    },
    {
      "text": "Ma Jews.shtml",
      "url": "https://www.pbs.org/muhammad/ma_jews.shtml",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Battle Of Trench",
      "url": "https://zamzam.com/blog/battle-of-trench/",
      "domain": "zamzam.com",
      "type": "citation"
    },
    {
      "text": "Expansion Under The Umayyad Caliphates",
      "url": "https://courses.lumenlearning.com/suny-hccc-worldcivilization/chapter/expansion-under-the-umayyad-caliphates/",
      "domain": "courses.lumenlearning.com",
      "type": "citation"
    },
    {
      "text": "The Umayyad Caliphate Invasion Of Spain",
      "url": "https://historymedieval.com/the-umayyad-caliphate-invasion-of-spain/",
      "domain": "historymedieval.com",
      "type": "citation"
    },
    {
      "text": "Spread Of Islam Map",
      "url": "https://brilliantmaps.com/spread-of-islam-map/",
      "domain": "brilliantmaps.com",
      "type": "citation"
    },
    {
      "text": "Map Of The Islamic Conquests In The 7th 9th Centur",
      "url": "https://www.worldhistory.org/image/14212/map-of-the-islamic-conquests-in-the-7th-9th-centur/",
      "domain": "worldhistory.org",
      "type": "citation"
    },
    {
      "text": "Ueiver267ma26ecb",
      "url": "https://fiveable.me/religions-of-the-west/unit-8/umayyad-abbasid-caliphates/study-guide/UeIvEr267Ma26eCB",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "The Golden Age Of Islam",
      "url": "https://www.khanacademy.org/humanities/world-history/medieval-times/cross-cultural-diffusion-of-knowledge/a/the-golden-age-of-islam",
      "domain": "khanacademy.org",
      "type": "citation"
    },
    {
      "text": "The Art Of The Abbasid Period 750 1258",
      "url": "https://www.metmuseum.org/essays/the-art-of-the-abbasid-period-750-1258",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Achievements Of The Islamic Golden Age",
      "url": "https://www.studentsofhistory.com/achievements-of-the-islamic-golden-age",
      "domain": "studentsofhistory.com",
      "type": "citation"
    },
    {
      "text": "Abbasid Caliphate",
      "url": "https://www.geeksforgeeks.org/social-science/abbasid-caliphate/",
      "domain": "geeksforgeeks.org",
      "type": "citation"
    },
    {
      "text": "The Fall Of Baghdad",
      "url": "https://historyofislam.com/contents/the-post-mongol-period/the-fall-of-baghdad/",
      "domain": "historyofislam.com",
      "type": "citation"
    },
    {
      "text": "Baghdad Sacked Mongols",
      "url": "https://www.historytoday.com/archive/months-past/baghdad-sacked-mongols",
      "domain": "historytoday.com",
      "type": "citation"
    },
    {
      "text": "The Siege Of Baghdad",
      "url": "https://www.historythroughfiction.com/blog/the-siege-of-baghdad",
      "domain": "historythroughfiction.com",
      "type": "citation"
    },
    {
      "text": "Papers.cfm",
      "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3899594",
      "domain": "papers.ssrn.com",
      "type": "citation"
    },
    {
      "text": "Why The Arabic World Turned Away From Science",
      "url": "https://www.thenewatlantis.com/publications/why-the-arabic-world-turned-away-from-science",
      "domain": "thenewatlantis.com",
      "type": "citation"
    },
    {
      "text": "Mamluk Sultanate Slaves Rule Empire",
      "url": "https://www.thecollector.com/mamluk-sultanate-slaves-rule-empire/",
      "domain": "thecollector.com",
      "type": "citation"
    },
    {
      "text": "Who Were Mamluks",
      "url": "https://www.historytoday.com/miscellanies/who-were-mamluks",
      "domain": "historytoday.com",
      "type": "citation"
    },
    {
      "text": "Ghazan The Great",
      "url": "https://historyofislam.com/ghazan-the-great/",
      "domain": "historyofislam.com",
      "type": "citation"
    },
    {
      "text": "Timur Of Samarqand",
      "url": "https://historyofislam.com/contents/the-post-mongol-period/timur-of-samarqand/",
      "domain": "historyofislam.com",
      "type": "citation"
    },
    {
      "text": "Amp",
      "url": "https://www.dailysabah.com/feature/2017/03/03/the-rise-and-fall-of-the-islamic-caliphate-in-history/amp",
      "domain": "dailysabah.com",
      "type": "citation"
    },
    {
      "text": "How Sunni Iran Became A Shii Country",
      "url": "https://islamichistory.info/2024/06/22/how-sunni-iran-became-a-shii-country/",
      "domain": "islamichistory.info",
      "type": "citation"
    },
    {
      "text": "Islam And The Mughal Empire In South Asia 1526 1857",
      "url": "https://www.asianstudies.org/publications/eaa/archives/islam-and-the-mughal-empire-in-south-asia-1526-1857/",
      "domain": "asianstudies.org",
      "type": "citation"
    },
    {
      "text": "Obo 9780195390155 0023.xml",
      "url": "https://www.oxfordbibliographies.com/display/document/obo-9780195390155/obo-9780195390155-0023.xml",
      "domain": "oxfordbibliographies.com",
      "type": "citation"
    },
    {
      "text": "161304803",
      "url": "https://academic.oup.com/book/12020/chapter/161304803",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "The Ottoman Tanzimats And The Constitution.aspx",
      "url": "https://www.dohainstitute.org/en/ResearchAndStudies/Pages/The_Ottoman_Tanzimats_and_the_Constitution.aspx",
      "domain": "dohainstitute.org",
      "type": "citation"
    },
    {
      "text": "1981430",
      "url": "https://journals.indexcopernicus.com/api/file/viewByFileId/1981430",
      "domain": "journals.indexcopernicus.com",
      "type": "citation"
    },
    {
      "text": "381571450 How Do Islamic Movements In The 19th And 20th Centuries In Egypt Help Define Islamic Modernity",
      "url": "https://www.researchgate.net/publication/381571450_How_do_Islamic_movements_in_the_19th_and_20th_centuries_in_Egypt_help_define_Islamic_modernity",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "The Emancipation Of Egypt A Quest For Modernity Under Islamic And Egyptian Values",
      "url": "https://www.metacriticjournal.com/article/265/the-emancipation-of-egypt-a-quest-for-modernity-under-islamic-and-egyptian-values",
      "domain": "metacriticjournal.com",
      "type": "citation"
    },
    {
      "text": "Islamic Civilization In The Face Of Modernity The Case Of Jamal Al Din Al Afghani And Muhammad Abduh",
      "url": "https://www.academia.edu/98647660/Islamic_Civilization_in_the_Face_of_Modernity_The_Case_of_Jamal_Al_Din_Al_Afghani_and_Muhammad_Abduh",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "212130594",
      "url": "https://academic.oup.com/edited-volume/28076/chapter/212130594",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Abduh.htm",
      "url": "https://jisarchive.cis-ca.org/voices/a/abduh.htm",
      "domain": "jisarchive.cis-ca.org",
      "type": "citation"
    },
    {
      "text": "Asia And Africa",
      "url": "https://history.state.gov/milestones/1945-1952/asia-and-africa",
      "domain": "history.state.gov",
      "type": "citation"
    },
    {
      "text": "Brief History.html",
      "url": "https://www.opec.org/brief-history.html",
      "domain": "opec.org",
      "type": "citation"
    },
    {
      "text": "Oil Embargo",
      "url": "https://history.state.gov/milestones/1969-1976/oil-embargo",
      "domain": "history.state.gov",
      "type": "citation"
    },
    {
      "text": "What Irans 1979 Revolution Meant For The Muslim Brotherhood",
      "url": "https://www.brookings.edu/articles/what-irans-1979-revolution-meant-for-the-muslim-brotherhood/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Islamism 50",
      "url": "https://www.wilsoncenter.org/article/islamism-50",
      "domain": "wilsoncenter.org",
      "type": "citation"
    },
    {
      "text": "Terrorism",
      "url": "https://ourworldindata.org/terrorism",
      "domain": "ourworldindata.org",
      "type": "citation"
    },
    {
      "text": "Modern.html",
      "url": "https://www.pbs.org/wgbh/pages/frontline/shows/target/etc/modern.html",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Islamism After The Arab Spring Between The Islamic State And The Nation State",
      "url": "https://www.brookings.edu/articles/islamism-after-the-arab-spring-between-the-islamic-state-and-the-nation-state/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Muslimpopulationeurope1950 2020.pdf",
      "url": "http://soerenkern.com/pdfs/islam/MuslimPopulationEurope1950-2020.pdf",
      "domain": "soerenkern.com",
      "type": "citation"
    },
    {
      "text": "Muslim Population By Country 2025",
      "url": "https://www.islamicity.org/104639/muslim-population-by-country-2025/",
      "domain": "islamicity.org",
      "type": "citation"
    },
    {
      "text": "Future Of The Global Muslim Population Sunni And Shia",
      "url": "https://www.pewresearch.org/religion/2011/01/27/future-of-the-global-muslim-population-sunni-and-shia/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Sunni Islam",
      "url": "https://www.jewishvirtuallibrary.org/sunni-islam",
      "domain": "jewishvirtuallibrary.org",
      "type": "citation"
    },
    {
      "text": "Sunni Shia Divide Islam Muslim",
      "url": "https://www.history.com/articles/sunni-shia-divide-islam-muslim",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "Sunnishia 1.shtml",
      "url": "https://www.bbc.co.uk/religion/religions/islam/subdivisions/sunnishia_1.shtml",
      "domain": "bbc.co.uk",
      "type": "citation"
    },
    {
      "text": "Obo 9780195390155 0084.xml",
      "url": "https://www.oxfordbibliographies.com/abstract/document/obo-9780195390155/obo-9780195390155-0084.xml",
      "domain": "oxfordbibliographies.com",
      "type": "citation"
    },
    {
      "text": "Shia Population By Country",
      "url": "https://rankerover.com/shia-population-by-country/",
      "domain": "rankerover.com",
      "type": "citation"
    },
    {
      "text": "Four Charts That Explain Shia Islam",
      "url": "https://www.americansecurityproject.org/four-charts-that-explain-shia-islam/",
      "domain": "americansecurityproject.org",
      "type": "citation"
    },
    {
      "text": "The Origins Of The Shiite Sunni Split",
      "url": "https://www.npr.org/sections/parallels/2007/02/12/7332087/the-origins-of-the-shiite-sunni-split",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Infallibility Of Imams",
      "url": "https://en.wikishia.net/view/Infallibility_of_Imams",
      "domain": "en.wikishia.net",
      "type": "citation"
    },
    {
      "text": "Chapter 1 Characteristics Imam",
      "url": "https://al-islam.org/imamate-and-imams-ibrahim-amini/chapter-1-characteristics-imam",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "Difference Between Shia And Sunni Muslims 2003755",
      "url": "https://www.learnreligions.com/difference-between-shia-and-sunni-muslims-2003755",
      "domain": "learnreligions.com",
      "type": "citation"
    },
    {
      "text": "Three Branches Of Shia Islam",
      "url": "https://fanack.com/religions-in-the-middle-east-and-north-africa/islam/shia-islam/three-branches-of-shia-islam/",
      "domain": "fanack.com",
      "type": "citation"
    },
    {
      "text": "Branches Of Shia Islam Ismailis Twelvers And Bohras",
      "url": "https://ismailimail.blog/2017/08/23/branches-of-shia-islam-ismailis-twelvers-and-bohras/",
      "domain": "ismailimail.blog",
      "type": "citation"
    },
    {
      "text": "Sunni Shia Divide",
      "url": "https://www.cfr.org/article/sunni-shia-divide",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Part B Persecution Shia Umayyads",
      "url": "https://al-islam.org/hidden-truth-about-karbala-ak-ahmed-bsc-bl/part-b-persecution-shia-umayyads",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "A Short History Of Shia Persecution In Pakistan",
      "url": "https://swarajyamag.com/news-brief/a-short-history-of-shia-persecution-in-pakistan",
      "domain": "swarajyamag.com",
      "type": "citation"
    },
    {
      "text": "Rec3.12164",
      "url": "https://compass.onlinelibrary.wiley.com/doi/10.1111/rec3.12164",
      "domain": "compass.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "C.php",
      "url": "https://guides.library.illinois.edu/c.php?g=348315\\u0026p=2347041",
      "domain": "guides.library.illinois.edu",
      "type": "citation"
    },
    {
      "text": "The Ahmadiyya",
      "url": "https://fanack.com/religions-in-the-middle-east-and-north-africa/islam/the-ahmadiyya/",
      "domain": "fanack.com",
      "type": "citation"
    },
    {
      "text": "Ahmadiyya Muslims Face Persecution Discrimination And Hostility",
      "url": "https://www.uscirf.gov/news-room/uscirf-spotlight/ahmadiyya-muslims-face-persecution-discrimination-and-hostility",
      "domain": "uscirf.gov",
      "type": "citation"
    },
    {
      "text": "The Ahmadiyya In Pakistan Religious Persecution Human Rights And Islam",
      "url": "https://ohrh.law.ox.ac.uk/the-ahmadiyya-in-pakistan-religious-persecution-human-rights-and-islam/",
      "domain": "ohrh.law.ox.ac.uk",
      "type": "citation"
    },
    {
      "text": "Rejecting Hadiths",
      "url": "https://thethinkingmuslim.com/2013/08/28/rejecting-hadiths/",
      "domain": "thethinkingmuslim.com",
      "type": "citation"
    },
    {
      "text": "256435",
      "url": "https://islamqa.info/en/answers/256435",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "The Worlds Muslims Unity And Diversity 5 Religious Identity",
      "url": "https://www.pewresearch.org/religion/2012/08/09/the-worlds-muslims-unity-and-diversity-5-religious-identity/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Understanding Muslim Diversity.pdf",
      "url": "https://amwchr.org.au/wp-content/uploads/2020/10/Understanding-Muslim-diversity.pdf",
      "domain": "amwchr.org.au",
      "type": "citation"
    },
    {
      "text": "The Worlds Muslims Unity And Diversity 1 Religious Affiliation",
      "url": "https://www.pewresearch.org/religion/2012/08/09/the-worlds-muslims-unity-and-diversity-1-religious-affiliation/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Who Are Non Denominational Muslims",
      "url": "https://www.islamicity.org/14168/who-are-non-denominational-muslims/",
      "domain": "islamicity.org",
      "type": "citation"
    },
    {
      "text": "World Middle East 48703377",
      "url": "https://www.bbc.com/news/world-middle-east-48703377",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Mapping The Global Muslim Population14",
      "url": "https://www.pewresearch.org/religion/2009/10/07/mapping-the-global-muslim-population14/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "According To Google 99 Of The Population Is",
      "url": "https://www.reddit.com/r/Turkey/comments/1hs26b2/according_to_google_99_of_the_population_is/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Religion In Europe",
      "url": "https://www.pewresearch.org/religion/2025/06/09/religion-in-europe/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Mena Youth Lead Return To Religion",
      "url": "https://www.arabbarometer.org/2023/03/mena-youth-lead-return-to-religion/",
      "domain": "arabbarometer.org",
      "type": "citation"
    },
    {
      "text": "C.php",
      "url": "https://lawresearchguides.cwru.edu/c.php?g=819978\\u0026p=5851791",
      "domain": "lawresearchguides.cwru.edu",
      "type": "citation"
    },
    {
      "text": "Sharia Law And Sources Of Sharia",
      "url": "https://aims.education/study-online/sharia-law-and-sources-of-sharia/",
      "domain": "aims.education",
      "type": "citation"
    },
    {
      "text": "Islamic Law And Legal Systems",
      "url": "https://judiciariesworldwide.fjc.gov/islamic-law-and-legal-systems",
      "domain": "judiciariesworldwide.fjc.gov",
      "type": "citation"
    },
    {
      "text": "Dtpl45vfndoee7so",
      "url": "https://fiveable.me/the-islamic-world/unit-4/sources-islamic-law/study-guide/DtpL45vfndoEE7SO",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "1",
      "url": "https://peh-med.biomedcentral.com/articles/10.1186/1747-5341-9-11/tables/1",
      "domain": "peh-med.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Different Sources Of Shariah",
      "url": "https://cssprepforum.com/different-sources-of-shariah/",
      "domain": "cssprepforum.com",
      "type": "citation"
    },
    {
      "text": "What Is Usul Al Fiqh",
      "url": "https://jibreel.app/islamqa/what-is-usul-al-fiqh",
      "domain": "jibreel.app",
      "type": "citation"
    },
    {
      "text": "What Is Islamic Jurisprudence",
      "url": "https://halalfoundation.org/what-is-islamic-jurisprudence/",
      "domain": "halalfoundation.org",
      "type": "citation"
    },
    {
      "text": "Who Are The Four Imams Of Sunni Islam A Guide To Their Lives And Legacy",
      "url": "https://iqranetwork.com/blog/who-are-the-four-imams-of-sunni-islam-a-guide-to-their-lives-and-legacy/",
      "domain": "iqranetwork.com",
      "type": "citation"
    },
    {
      "text": "Five Schools Islamic Thought",
      "url": "https://al-islam.org/inquiries-about-shia-islam-sayyid-moustafa-al-qazwini/five-schools-islamic-thought",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "More.php",
      "url": "https://almerja.com/en/more.php?pid=958",
      "domain": "almerja.com",
      "type": "citation"
    },
    {
      "text": "An Intellectual History Of The Jafari School",
      "url": "https://lawandreligionforum.org/2022/08/25/an-intellectual-history-of-the-jafari-school/",
      "domain": "lawandreligionforum.org",
      "type": "citation"
    },
    {
      "text": "Understanding Sharia Intersection Islam And Law",
      "url": "https://www.cfr.org/backgrounder/understanding-sharia-intersection-islam-and-law",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Islamic Law And Legal Systems",
      "url": "http://judiciariesworldwide.fjc.gov/islamic-law-and-legal-systems",
      "domain": "judiciariesworldwide.fjc.gov",
      "type": "citation"
    },
    {
      "text": "Sharia Law Countries",
      "url": "https://meccainstitute.org/sharia-law-countries/",
      "domain": "meccainstitute.org",
      "type": "citation"
    },
    {
      "text": "Understanding Sharia Family Law",
      "url": "https://www.americanbar.org/groups/family_law/resources/committee-articles/understanding-sharia-family-law/",
      "domain": "americanbar.org",
      "type": "citation"
    },
    {
      "text": "28375300.2025.2511505",
      "url": "https://www.tandfonline.com/doi/full/10.1080/28375300.2025.2511505",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Shariah Law Marriage Divorce And Financial Aspects",
      "url": "https://financialremediesjournal.com/shariah-law-marriage-divorce-and-financial-aspects/",
      "domain": "financialremediesjournal.com",
      "type": "citation"
    },
    {
      "text": "373345261 The Dynamics Of Polygamy And Divorce In Muslim Countries",
      "url": "https://www.researchgate.net/publication/373345261_The_Dynamics_of_Polygamy_and_Divorce_in_Muslim_Countries",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Inheritance Under Muslim Law Framework Of Sharia Law",
      "url": "https://chambers.com/articles/inheritance-under-muslim-law-framework-of-sharia-law",
      "domain": "chambers.com",
      "type": "citation"
    },
    {
      "text": "766778 1636952456.pdf",
      "url": "https://www.iilsindia.com/study-material/766778_1636952456.pdf",
      "domain": "iilsindia.com",
      "type": "citation"
    },
    {
      "text": "The Assemblys Family Code For Muslim Communities In North America",
      "url": "https://www.amjaonline.org/declaration-articles/the-assemblys-family-code-for-muslim-communities-in-north-america",
      "domain": "amjaonline.org",
      "type": "citation"
    },
    {
      "text": "The Ambitions Of Muslim Family Law Reform",
      "url": "https://hrp.law.harvard.edu/publications/the-ambitions-of-muslim-family-law-reform/",
      "domain": "hrp.law.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Pr2ekcfkgpl35dot",
      "url": "https://fiveable.me/the-islamic-world/unit-4/islamic-family-law/study-guide/pR2eKCFKgpl35dot",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Sufism",
      "url": "https://islamichistory.info/2021/11/03/sufism/",
      "domain": "islamichistory.info",
      "type": "citation"
    },
    {
      "text": "Origins Of Sufism",
      "url": "https://www.sufiway.org/origins-of-sufism",
      "domain": "sufiway.org",
      "type": "citation"
    },
    {
      "text": "Sufism History 1.html",
      "url": "https://aos.mto.org/Main/All/en/Sufism_History_1.html",
      "domain": "aos.mto.org",
      "type": "citation"
    },
    {
      "text": "Historical Development.html",
      "url": "https://sufischool.org/sufism/historical-development.html",
      "domain": "sufischool.org",
      "type": "citation"
    },
    {
      "text": "Hasan Al Basri Father Of Sufism With Ascetism Mysticism Traditions",
      "url": "https://www.dailysabah.com/arts/portrait/hasan-al-basri-father-of-sufism-with-ascetism-mysticism-traditions",
      "domain": "dailysabah.com",
      "type": "citation"
    },
    {
      "text": "A History Of Sufism For Western Readers September Octomber 2015",
      "url": "https://fountainmagazine.com/all-issues/2015/issue-107-september-october-2015/a-history-of-sufism-for-western-readers-september-octomber-2015",
      "domain": "fountainmagazine.com",
      "type": "citation"
    },
    {
      "text": "Founders",
      "url": "https://www.patheos.com/library/sufism/origins/founders",
      "domain": "patheos.com",
      "type": "citation"
    },
    {
      "text": "Rabia Al Adawiyya",
      "url": "https://sufimaster.org/teachings/rabia-al-adawiyya/",
      "domain": "sufimaster.org",
      "type": "citation"
    },
    {
      "text": "Rabia Al Adawiyya.asp",
      "url": "https://www.onelittleangel.com/wisdom/quotes/rabia-al-adawiyya.asp",
      "domain": "onelittleangel.com",
      "type": "citation"
    },
    {
      "text": "Rabia Al Basri",
      "url": "https://scienceandnonduality.com/article/rabia-al-basri/",
      "domain": "scienceandnonduality.com",
      "type": "citation"
    },
    {
      "text": "The Evolution Of Sufism",
      "url": "https://ghayb.com/the-evolution-of-sufism/",
      "domain": "ghayb.com",
      "type": "citation"
    },
    {
      "text": "The Pioneers Of Sufi Philosophy",
      "url": "https://ishqybusiness.com/blogs/news/the-pioneers-of-sufi-philosophy",
      "domain": "ishqybusiness.com",
      "type": "citation"
    },
    {
      "text": "J.1478 0542.2010.00718.x",
      "url": "https://compass.onlinelibrary.wiley.com/doi/10.1111/j.1478-0542.2010.00718.x",
      "domain": "compass.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Chapter 17 Early Sufis Continued",
      "url": "https://al-islam.org/history-muslim-philosophy-volume-1-book-3/chapter-17-early-sufis-continued",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "Sufism",
      "url": "https://www.scribd.com/document/805572517/SUFISM",
      "domain": "scribd.com",
      "type": "citation"
    },
    {
      "text": "950",
      "url": "https://jalt.com.pk/index.php/jalt/article/download/532/418/950",
      "domain": "jalt.com.pk",
      "type": "citation"
    },
    {
      "text": "Whirling Dervishes",
      "url": "https://www.historytoday.com/archive/whirling-dervishes",
      "domain": "historytoday.com",
      "type": "citation"
    },
    {
      "text": "The Philosophy Of Sufism E2bdbe54fc2f",
      "url": "https://cbarkinozer.medium.com/the-philosophy-of-sufism-e2bdbe54fc2f",
      "domain": "cbarkinozer.medium.com",
      "type": "citation"
    },
    {
      "text": "The Chishti Order",
      "url": "https://ghayb.com/the-chishti-order/",
      "domain": "ghayb.com",
      "type": "citation"
    },
    {
      "text": "The Orders",
      "url": "https://www.naqshbandi.info/the-orders/",
      "domain": "naqshbandi.info",
      "type": "citation"
    },
    {
      "text": "What Is The Tariqa En",
      "url": "https://qadiri-kasnazani.com/en/what-is-the-tariqa-en/",
      "domain": "qadiri-kasnazani.com",
      "type": "citation"
    },
    {
      "text": "Wcgqymgjt4vs0rje",
      "url": "https://fiveable.me/religions-of-the-west/unit-10/sufi-practices-rituals/study-guide/wcgqymgJt4vs0rjE",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Unit 10",
      "url": "https://fiveable.me/religions-of-the-west/unit-10",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Item1436.html",
      "url": "https://factsanddetails.com/world/cat55/sub394/item1436.html",
      "domain": "factsanddetails.com",
      "type": "citation"
    },
    {
      "text": "Comprehensive Exploration Of Sufi Orders A Historical And Biographical Catalog",
      "url": "https://ghayb.com/comprehensive-exploration-of-sufi-orders-a-historical-and-biographical-catalog/",
      "domain": "ghayb.com",
      "type": "citation"
    },
    {
      "text": "P2.1.2.pdf",
      "url": "https://postcolonial.net/wp-content/uploads/2024/09/P2.1.2.pdf",
      "domain": "postcolonial.net",
      "type": "citation"
    },
    {
      "text": "133741",
      "url": "https://www.newageislam.com/debating-islam/va-mohamad-ashrof-new-age-islam/faith-reason-early-islam-lessons-mutazila-debate/d/133741",
      "domain": "newageislam.com",
      "type": "citation"
    },
    {
      "text": "Article P38 2.xml",
      "url": "https://brill.com/view/journals/si/107/1/article-p38_2.xml?language=en",
      "domain": "brill.com",
      "type": "citation"
    },
    {
      "text": "Quran Alone Vs God Alone",
      "url": "https://qurantalkblog.com/2023/09/13/quran-alone-vs-god-alone/",
      "domain": "qurantalkblog.com",
      "type": "citation"
    },
    {
      "text": "Death Penalty For Apostasy Selected Sunni And Shia Scholars Views In Favour Of Abolition",
      "url": "https://www.melbourneasiareview.edu.au/death-penalty-for-apostasy-selected-sunni-and-shia-scholars-views-in-favour-of-abolition/",
      "domain": "melbourneasiareview.edu.au",
      "type": "citation"
    },
    {
      "text": "Sharia And Womens Rights A Hunger For Justice",
      "url": "https://just-international.org/articles/sharia-and-womens-rights-a-hunger-for-justice/",
      "domain": "just-international.org",
      "type": "citation"
    },
    {
      "text": "Esposito Jihad Holy Unholy.pdf",
      "url": "https://www.unaoc.org/repository/Esposito_Jihad_Holy_Unholy.pdf",
      "domain": "unaoc.org",
      "type": "citation"
    },
    {
      "text": "Bassiouni.evolving Approaches To Jihad.pdf",
      "url": "https://securitypolicylaw.syr.edu/wp-content/uploads/2013/03/Bassiouni.Evolving-Approaches-to-Jihad.pdf",
      "domain": "securitypolicylaw.syr.edu",
      "type": "citation"
    },
    {
      "text": "Woman Quran.html",
      "url": "https://www.iium.edu.my/deed/articles/woman_quran.html",
      "domain": "iium.edu.my",
      "type": "citation"
    },
    {
      "text": "Whoprovideswhocares En.pdf",
      "url": "https://www.musawah.org/wp-content/uploads/2018/11/WhoProvidesWhoCares_En.pdf",
      "domain": "musawah.org",
      "type": "citation"
    },
    {
      "text": "Islamic Marriage System",
      "url": "https://www.alislam.org/book/pathway-to-paradise/islamic-marriage-system/",
      "domain": "alislam.org",
      "type": "citation"
    },
    {
      "text": "The Law Of Inheritance Regarding Women And Principles Concerning The Genders In Islam",
      "url": "https://www.pennstatelawreview.org/the-forum/the-law-of-inheritance-regarding-women-and-principles-concerning-the-genders-in-islam/",
      "domain": "pennstatelawreview.org",
      "type": "citation"
    },
    {
      "text": "Scielo.php",
      "url": "http://www.scielo.org.za/scielo.php?script=sci_arttext\\u0026pid=S2077-49072023000100017",
      "domain": "scielo.org.za",
      "type": "citation"
    },
    {
      "text": "The Worlds Muslims Religion Politics Society Women In Society",
      "url": "https://www.pewresearch.org/religion/2013/04/30/the-worlds-muslims-religion-politics-society-women-in-society/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Womens Rights In Islam Protecting From Domestic Abuse",
      "url": "https://www.amaliah.com/post/66973/womens-rights-in-islam-protecting-from-domestic-abuse",
      "domain": "amaliah.com",
      "type": "citation"
    },
    {
      "text": "American Muslim Marital Quality A Preliminary Investigation",
      "url": "https://quod.lib.umich.edu/j/jmmh/10381607.0007.201/--american-muslim-marital-quality-a-preliminary-investigation?rgn=main%3Bview=fulltext",
      "domain": "quod.lib.umich.edu",
      "type": "citation"
    },
    {
      "text": "Five Facts About Divorce",
      "url": "https://ispu.org/five-facts-about-divorce/",
      "domain": "ispu.org",
      "type": "citation"
    },
    {
      "text": "Roles",
      "url": "https://www.whyislam.org/roles/",
      "domain": "whyislam.org",
      "type": "citation"
    },
    {
      "text": "Education Iv The Medieval Madrasa",
      "url": "https://www.iranicaonline.org/articles/education-iv-the-medieval-madrasa/",
      "domain": "iranicaonline.org",
      "type": "citation"
    },
    {
      "text": "The Madrasa And Its Economic Worlds Towards A Broader History Of Education",
      "url": "http://www.oeaw.ac.at/sice/sice-blog/the-madrasa-and-its-economic-worlds-towards-a-broader-history-of-education",
      "domain": "oeaw.ac.at",
      "type": "citation"
    },
    {
      "text": "300077166 The Islamic Golden Age A Story Of The Triumph Of The Islamic Civilization",
      "url": "https://www.researchgate.net/publication/300077166_The_Islamic_Golden_Age_A_Story_of_the_Triumph_of_the_Islamic_Civilization",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "How Big Was The Islamic Golden Ages Contributions",
      "url": "https://www.reddit.com/r/AskHistory/comments/lexqi8/how_big_was_the_islamic_golden_ages_contributions/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Pmc3621228",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3621228/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Details.aspx",
      "url": "https://www.bibalex.org/SCIplanet/en/article/Details.aspx?id=15801",
      "domain": "bibalex.org",
      "type": "citation"
    },
    {
      "text": "Paper.pdf",
      "url": "https://scholar.harvard.edu/files/chaney/files/paper.pdf",
      "domain": "scholar.harvard.edu",
      "type": "citation"
    },
    {
      "text": "What Led To The Stagnation Of Muslim Innovation",
      "url": "https://www.reddit.com/r/AskHistorians/comments/ms3trq/what_led_to_the_stagnation_of_muslim_innovation/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "S11192 022 04517 0",
      "url": "https://link.springer.com/article/10.1007/s11192-022-04517-0",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Why Does The Muslim World Lag In Science",
      "url": "https://www.meforum.org/middle-east-quarterly/why-does-the-muslim-world-lag-in-science",
      "domain": "meforum.org",
      "type": "citation"
    },
    {
      "text": "Nobel Prizes Science And Islam",
      "url": "https://www.forbes.com/sites/saleemali/2023/10/01/nobel-prizes-science-and-islam/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "363924482 Global Science And The Muslim World Overview Of Muslim Majority Country Contributions To Global Science",
      "url": "https://www.researchgate.net/publication/363924482_Global_science_and_the_Muslim_world_Overview_of_Muslim-majority_country_contributions_to_global_science",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "134318",
      "url": "https://www.newageislam.com/islam-science/sahil-razvi-new-age-islam/the-rise-decline-future-muslim-scientific-innovation/d/134318",
      "domain": "newageislam.com",
      "type": "citation"
    },
    {
      "text": "Press Release",
      "url": "https://www.nobelprize.org/prizes/chemistry/2025/press-release/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Geometric Patterns In Islamic Art",
      "url": "https://www.metmuseum.org/essays/geometric-patterns-in-islamic-art",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Islamic Art Patterns",
      "url": "https://www.invaluable.com/blog/islamic-art-patterns/",
      "domain": "invaluable.com",
      "type": "citation"
    },
    {
      "text": "The Nature Of Islamic Art",
      "url": "https://www.metmuseum.org/essays/the-nature-of-islamic-art",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Arts Of The Islamic World",
      "url": "https://smarthistory.org/arts-of-the-islamic-world/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "Music",
      "url": "https://www.britannica.com/topic/Islamic-arts/Music",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Music And Islam Deeper Look",
      "url": "https://asiasociety.org/arts/music-and-islam-deeper-look",
      "domain": "asiasociety.org",
      "type": "citation"
    },
    {
      "text": "Acrefore 9780199340378 E 687",
      "url": "https://oxfordre.com/religion/display/10.1093/acrefore/9780199340378.001.0001/acrefore-9780199340378-e-687",
      "domain": "oxfordre.com",
      "type": "citation"
    },
    {
      "text": "Ithlybcb7ugc2bq1",
      "url": "https://fiveable.me/the-islamic-world/unit-9/principles-islamic-economics/study-guide/iTHLybCB7ugc2bQ1",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Islam Economic Performance Kuran Jel In Press.pdf",
      "url": "https://sites.duke.edu/timurkuran/files/2017/09/Islam-Economic-Performance-Kuran-JEL-in-press.pdf",
      "domain": "sites.duke.edu",
      "type": "citation"
    },
    {
      "text": "Gii 2025 Results.html",
      "url": "https://www.wipo.int/web-publications/global-innovation-index-2025/en/gii-2025-results.html",
      "domain": "wipo.int",
      "type": "citation"
    },
    {
      "text": "Atlas Final Report.pdf",
      "url": "https://royalsociety.org/~/media/policy/projects/atlas-islamic-world/atlas-final-report.PDF",
      "domain": "royalsociety.org",
      "type": "citation"
    },
    {
      "text": "Papers.cfm",
      "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2918685",
      "domain": "papers.ssrn.com",
      "type": "citation"
    },
    {
      "text": "160942610",
      "url": "https://academic.oup.com/book/11842/chapter/160942610",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Penal Law",
      "url": "https://www.britannica.com/topic/sharia/Penal-law",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "The Dangerous Fantasy Of The Caliphate",
      "url": "https://newlinesinstitute.org/nonstate-actors/the-dangerous-fantasy-of-the-caliphate/",
      "domain": "newlinesinstitute.org",
      "type": "citation"
    },
    {
      "text": "E3rbmp7ydkoqbigx",
      "url": "https://fiveable.me/politics-in-contemporary-middle-east/unit-4/origins-evolution-political-islam/study-guide/e3RBmp7YdKOQBigX",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "The Secret History Of Political Islam",
      "url": "https://andrewhammond.substack.com/p/the-secret-history-of-political-islam",
      "domain": "andrewhammond.substack.com",
      "type": "citation"
    },
    {
      "text": "Egypts Muslim Brotherhood",
      "url": "https://www.cfr.org/backgrounder/egypts-muslim-brotherhood",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Mb.htm",
      "url": "https://irp.fas.org/world/para/mb.htm",
      "domain": "irp.fas.org",
      "type": "citation"
    },
    {
      "text": "The Iranian Revolution A Timeline Of Events",
      "url": "https://www.brookings.edu/articles/the-iranian-revolution-a-timeline-of-events/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Ideology And Irans Revolution How 1979 Changed World",
      "url": "https://institute.global/insights/geopolitics-and-security/ideology-and-irans-revolution-how-1979-changed-world",
      "domain": "institute.global",
      "type": "citation"
    },
    {
      "text": "The Iranian Revolution And Sunni Political Islam",
      "url": "https://pomeps.org/the-iranian-revolution-and-sunni-political-islam",
      "domain": "pomeps.org",
      "type": "citation"
    },
    {
      "text": "Sharia Law Countries",
      "url": "https://worldpopulationreview.com/country-rankings/sharia-law-countries",
      "domain": "worldpopulationreview.com",
      "type": "citation"
    },
    {
      "text": "2023",
      "url": "https://www.transparency.org/en/cpi/2023",
      "domain": "transparency.org",
      "type": "citation"
    },
    {
      "text": "303",
      "url": "https://www.mdpi.com/2227-7099/11/12/303",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Islam Was The Worlds Fastest Growing Religion From 2010 To 2020",
      "url": "https://www.pewresearch.org/short-reads/2025/06/10/islam-was-the-worlds-fastest-growing-religion-from-2010-to-2020/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Muslim Population",
      "url": "https://timesprayer.com/en/muslim-population/",
      "domain": "timesprayer.com",
      "type": "citation"
    },
    {
      "text": "Muslim Population By Country",
      "url": "https://worldpopulationreview.com/country-rankings/muslim-population-by-country",
      "domain": "worldpopulationreview.com",
      "type": "citation"
    },
    {
      "text": "The Future Of The Global Muslim Population",
      "url": "https://www.pewresearch.org/religion/2011/01/27/the-future-of-the-global-muslim-population/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Muslim Migrants Around The World",
      "url": "https://www.pewresearch.org/religion/2024/08/19/muslim-migrants-around-the-world/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Arrivals",
      "url": "https://dtm.iom.int/europe/arrivals",
      "domain": "dtm.iom.int",
      "type": "citation"
    },
    {
      "text": "Understanding Europes Turn On Migration",
      "url": "https://www.brookings.edu/articles/understanding-europes-turn-on-migration/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Muslim Immigrants United States",
      "url": "https://cis.org/Report/Muslim-Immigrants-United-States",
      "domain": "cis.org",
      "type": "citation"
    },
    {
      "text": "Religious Projections 2010 2050",
      "url": "https://www.pewresearch.org/religion/2015/04/02/religious-projections-2010-2050/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Future Of The Global Muslim Population Main Factors",
      "url": "https://www.pewresearch.org/religion/2011/01/27/future-of-the-global-muslim-population-main-factors/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Muslims Lead Global Fertility Rates Fuelling Population Growth",
      "url": "https://www.newarab.com/news/muslims-lead-global-fertility-rates-fuelling-population-growth",
      "domain": "newarab.com",
      "type": "citation"
    },
    {
      "text": "Fertility Decline Muslim World",
      "url": "https://www.hoover.org/research/fertility-decline-muslim-world",
      "domain": "hoover.org",
      "type": "citation"
    },
    {
      "text": "Europes Growing Muslim Population",
      "url": "https://www.pewresearch.org/religion/2017/11/29/europes-growing-muslim-population/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Nancy Foner 2016 Symposium.pdf",
      "url": "https://cmsny.org/wp-content/uploads/2016/04/Nancy-Foner-2016-Symposium.pdf",
      "domain": "cmsny.org",
      "type": "citation"
    },
    {
      "text": "Muslim Immigration Integration United States Western Europe",
      "url": "https://www.cato.org/blog/muslim-immigration-integration-united-states-western-europe",
      "domain": "cato.org",
      "type": "citation"
    },
    {
      "text": "The Struggle To Integrate Muslims In Europe",
      "url": "https://immigrationlab.org/project/the-struggle-to-integrate-muslims-in-europe/",
      "domain": "immigrationlab.org",
      "type": "citation"
    },
    {
      "text": "Religious Switching Into And Out Of Islam",
      "url": "https://www.pewresearch.org/religion/2025/03/26/religious-switching-into-and-out-of-islam/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "The Share Of Americans Who Leave Islam Is Offset By Those Who Become Muslim",
      "url": "https://www.pewresearch.org/short-reads/2018/01/26/the-share-of-americans-who-leave-islam-is-offset-by-those-who-become-muslim/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Us Kenya Have Highest Levels Of Conversion To Islam",
      "url": "https://www.moroccoworldnews.com/2025/03/188353/us-kenya-have-highest-levels-of-conversion-to-islam/",
      "domain": "moroccoworldnews.com",
      "type": "citation"
    },
    {
      "text": "Is Islam Really The Fastest Growing Religion In The World",
      "url": "https://www.crossway.org/articles/is-islam-really-the-fastest-growing-religion-in-the-world/",
      "domain": "crossway.org",
      "type": "citation"
    },
    {
      "text": "Conversions.html",
      "url": "https://islam365.io/topics/conversions.html",
      "domain": "islam365.io",
      "type": "citation"
    },
    {
      "text": "The Treatment Of Jews In Arab Islamic Countries",
      "url": "https://www.jewishvirtuallibrary.org/the-treatment-of-jews-in-arab-islamic-countries",
      "domain": "jewishvirtuallibrary.org",
      "type": "citation"
    },
    {
      "text": "What Do You Know Dhimmi Jewish Legal Status Under Muslim Rule",
      "url": "https://katz.sas.upenn.edu/resources/blog/what-do-you-know-dhimmi-jewish-legal-status-under-muslim-rule",
      "domain": "katz.sas.upenn.edu",
      "type": "citation"
    },
    {
      "text": "Jews Muslims Triumph Dhimmi Eli Kavon",
      "url": "https://www.linkedin.com/pulse/jews-muslims-triumph-dhimmi-eli-kavon",
      "domain": "linkedin.com",
      "type": "citation"
    },
    {
      "text": "Dhimmis Damascus.html",
      "url": "https://www.answering-islam.org/authors/thomas/dhimmis_damascus.html",
      "domain": "answering-islam.org",
      "type": "citation"
    },
    {
      "text": "Uncle Tom And The Happy Dhimmi",
      "url": "https://www.meforum.org/middle-east-quarterly/uncle-tom-and-the-happy-dhimmi",
      "domain": "meforum.org",
      "type": "citation"
    },
    {
      "text": "1400 Years Christianislamic Struggle Analysis",
      "url": "https://cbn.com/article/religion/1400-years-christianislamic-struggle-analysis",
      "domain": "cbn.com",
      "type": "citation"
    },
    {
      "text": "Christs Tomb Took A Beating Over The Centuries",
      "url": "https://christianhistoryinstitute.org/dailystory/permalink/christs-tomb-took-a-beating-over-the-centuries",
      "domain": "christianhistoryinstitute.org",
      "type": "citation"
    },
    {
      "text": "Churches Under Islam",
      "url": "https://www.meforum.org/churches-under-islam",
      "domain": "meforum.org",
      "type": "citation"
    },
    {
      "text": "History Of Muslim Jewish Conflicts",
      "url": "https://sephardicu.com/sephardic-history/history-of-muslim-jewish-conflicts/",
      "domain": "sephardicu.com",
      "type": "citation"
    },
    {
      "text": "A Brief History Of The Persecution Of Jews In The",
      "url": "https://www.reddit.com/r/history/comments/1kzvfzs/a_brief_history_of_the_persecution_of_jews_in_the/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "P10098.pdf",
      "url": "https://assets.press.princeton.edu/chapters/p10098.pdf",
      "domain": "assets.press.princeton.edu",
      "type": "citation"
    },
    {
      "text": "Why Was Zoroastrianism Almost Wiped Out By Islam",
      "url": "https://www.reddit.com/r/AskHistorians/comments/1hkdgru/why_was_zoroastrianism_almost_wiped_out_by_islam/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "In Islamic State War Like Others Heritage Always A Target",
      "url": "https://www.timesofisrael.com/in-islamic-state-war-like-others-heritage-always-a-target/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "List Of Genocides%2c Cultural Genocides And Ethnic Cleansings Under Islam",
      "url": "https://wikiislam.net/wiki/List_of_Genocides%2C_Cultural_Genocides_and_Ethnic_Cleansings_under_Islam",
      "domain": "wikiislam.net",
      "type": "citation"
    },
    {
      "text": "Arabian Fights",
      "url": "https://www.desiringgod.org/articles/arabian-fights",
      "domain": "desiringgod.org",
      "type": "citation"
    },
    {
      "text": "Infancy Gospels.html",
      "url": "https://www.answering-islam.org/authors/masihiyyen/rebuttals/zawadi/infancy_gospels.html",
      "domain": "answering-islam.org",
      "type": "citation"
    },
    {
      "text": "A Note On Christian Sources For The Muslim Christmas Story",
      "url": "https://philiptite.wordpress.com/2016/12/30/a-note-on-christian-sources-for-the-muslim-christmas-story/",
      "domain": "philiptite.wordpress.com",
      "type": "citation"
    },
    {
      "text": "The Kaaba",
      "url": "https://smarthistory.org/the-kaaba/",
      "domain": "smarthistory.org",
      "type": "citation"
    },
    {
      "text": "On Pre Islamic Hajj",
      "url": "https://www.criticalmuslim.io/on-pre-islamic-hajj/",
      "domain": "criticalmuslim.io",
      "type": "citation"
    },
    {
      "text": "Html",
      "url": "https://www.degruyterbrill.com/document/doi/10.1515/mill-2023-0004/html",
      "domain": "degruyterbrill.com",
      "type": "citation"
    },
    {
      "text": "Preislamic Allah2.html",
      "url": "https://www.answering-islam.org/authors/shamoun/preislamic_allah2.html",
      "domain": "answering-islam.org",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=NmVM3izB5lk",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Pagansources.htm",
      "url": "https://answering-islam.org/Silas/pagansources.htm",
      "domain": "answering-islam.org",
      "type": "citation"
    },
    {
      "text": "Did Islam Borrow From Zoroastrianism",
      "url": "https://www.reddit.com/r/exmuslim/comments/acw2bc/did_islam_borrow_from_zoroastrianism/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Did Zoroastrianism Really Influence Christianity Judaism And Islam Or Was It The Other Way Around",
      "url": "https://www.quora.com/Did-Zoroastrianism-really-influence-Christianity-Judaism-and-Islam-or-was-it-the-other-way-around",
      "domain": "quora.com",
      "type": "citation"
    },
    {
      "text": "Earlyrise 1.shtml",
      "url": "https://www.bbc.co.uk/religion/religions/islam/history/earlyrise_1.shtml",
      "domain": "bbc.co.uk",
      "type": "citation"
    },
    {
      "text": "11 2 The Arab Islamic Conquests And The First Islamic States",
      "url": "https://openstax.org/books/world-history-volume-1/pages/11-2-the-arab-islamic-conquests-and-the-first-islamic-states",
      "domain": "openstax.org",
      "type": "citation"
    },
    {
      "text": "dhimmitude.org",
      "url": "https://www.dhimmitude.org/",
      "domain": "dhimmitude.org",
      "type": "citation"
    },
    {
      "text": "Spain 1.shtml",
      "url": "https://www.bbc.co.uk/religion/religions/islam/history/spain_1.shtml",
      "domain": "bbc.co.uk",
      "type": "citation"
    },
    {
      "text": "The Reconquista And The Expulsion Of Muslims",
      "url": "https://unravelingislam.com/the-reconquista-and-the-expulsion-of-muslims/",
      "domain": "unravelingislam.com",
      "type": "citation"
    },
    {
      "text": "Why Muslims See The Crusades So Differently From Christians",
      "url": "https://www.history.com/articles/why-muslims-see-the-crusades-so-differently-from-christians",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "What Was The Ottoman Millet System",
      "url": "https://www.islamiqate.com/889/what-was-the-ottoman-millet-system",
      "domain": "islamiqate.com",
      "type": "citation"
    },
    {
      "text": "Islamic Governance Ensuring The Rights Of Minorities",
      "url": "https://en.islamonweb.net/islamic-governance-ensuring-the-rights-of-minorities",
      "domain": "en.islamonweb.net",
      "type": "citation"
    },
    {
      "text": "Myersjoseph.quranic Concept Of War.pdf",
      "url": "https://securitypolicylaw.syr.edu/wp-content/uploads/2013/03/MyersJoseph.Quranic-Concept-of-War.pdf",
      "domain": "securitypolicylaw.syr.edu",
      "type": "citation"
    },
    {
      "text": "966",
      "url": "https://www.mdpi.com/2077-1444/12/11/966",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://press.armywarcollege.edu/cgi/viewcontent.cgi?article=2132\\u0026context=parameters",
      "domain": "press.armywarcollege.edu",
      "type": "citation"
    },
    {
      "text": "10484",
      "url": "https://eujournal.org/index.php/esj/article/view/10484",
      "domain": "eujournal.org",
      "type": "citation"
    },
    {
      "text": "33092.html",
      "url": "https://iifa-aifi.org/en/33092.html",
      "domain": "iifa-aifi.org",
      "type": "citation"
    },
    {
      "text": "019 Smt.html",
      "url": "https://www.iium.edu.my/deed/hadith/muslim/019_smt.html",
      "domain": "iium.edu.my",
      "type": "citation"
    },
    {
      "text": "Jihad In Islamic History",
      "url": "https://press.princeton.edu/books/paperback/9780691138381/jihad-in-islamic-history",
      "domain": "press.princeton.edu",
      "type": "citation"
    },
    {
      "text": "Moghadam Assaf.shia Perception Of Jihad.pdf",
      "url": "https://securitypolicylaw.syr.edu/wp-content/uploads/2013/03/Moghadam-Assaf.Shia-Perception-of-Jihad.pdf",
      "domain": "securitypolicylaw.syr.edu",
      "type": "citation"
    },
    {
      "text": "291615403",
      "url": "https://academic.oup.com/edited-volume/34388/chapter/291615403",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "54",
      "url": "https://digital-commons.usnwc.edu/ils/vol97/iss1/54/",
      "domain": "digital-commons.usnwc.edu",
      "type": "citation"
    },
    {
      "text": "The Issue Of Apostasy In Islam",
      "url": "https://yaqeeninstitute.org/read/paper/the-issue-of-apostasy-in-islam",
      "domain": "yaqeeninstitute.org",
      "type": "citation"
    },
    {
      "text": "14231",
      "url": "https://islamqa.info/en/answers/14231",
      "domain": "islamqa.info",
      "type": "citation"
    },
    {
      "text": "Why Is Death For Apostasy A Thing If The Quranic Verses 18 29 2 256 4 91 Say Otherwise Also Does 5 92 Refer To Apostates",
      "url": "https://www.quora.com/Why-is-death-for-apostasy-a-thing-if-the-Quranic-verses-18-29-2-256-4-91-say-otherwise-Also-does-5-92-refer-to-apostates",
      "domain": "quora.com",
      "type": "citation"
    },
    {
      "text": "Death Penalty For Apostasy According To Quran",
      "url": "https://islam.stackexchange.com/questions/10768/death-penalty-for-apostasy-according-to-quran",
      "domain": "islam.stackexchange.com",
      "type": "citation"
    },
    {
      "text": "Let There Be No Compulsion In Religion",
      "url": "https://wikiislam.net/wiki/Let_There_be_no_Compulsion_in_Religion",
      "domain": "wikiislam.net",
      "type": "citation"
    },
    {
      "text": "Asia Bibi Free Blasphemy Laws",
      "url": "https://www.meforum.org/asia-bibi-free-blasphemy-laws",
      "domain": "meforum.org",
      "type": "citation"
    },
    {
      "text": "There Are Many Others Asia Bibi Calls For Justice For Victims Of Pakistans Blasphemy Laws",
      "url": "https://globalchristianrelief.org/stories/there-are-many-others-asia-bibi-calls-for-justice-for-victims-of-pakistans-blasphemy-laws/",
      "domain": "globalchristianrelief.org",
      "type": "citation"
    },
    {
      "text": "Four In Ten Countries And Territories Worldwide Had Blasphemy Laws In 2019 2",
      "url": "https://www.pewresearch.org/short-reads/2022/01/25/four-in-ten-countries-and-territories-worldwide-had-blasphemy-laws-in-2019-2/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Death Sentence For Apostasy In Nearly A Dozen Countries Report Says",
      "url": "https://www.secularism.org.uk/news/2021/11/death-sentence-for-apostasy-in-nearly-a-dozen-countries-report-says",
      "domain": "secularism.org.uk",
      "type": "citation"
    },
    {
      "text": "Muslims And Exmuslims Statistics On Exmuslims Who",
      "url": "https://www.reddit.com/r/DebateReligion/comments/3ipnwi/muslims_and_exmuslims_statistics_on_exmuslims_who/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "World Map Of Muslim Support Of The Death Penalty",
      "url": "https://www.reddit.com/r/MapPorn/comments/3uecuj/world_map_of_muslim_support_of_the_death_penalty/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Slavery.htm",
      "url": "https://www.answering-islam.org/Silas/slavery.htm",
      "domain": "answering-islam.org",
      "type": "citation"
    },
    {
      "text": "Forgotten Slavery The Arab Muslim Slave Trade Sex Trafficking",
      "url": "https://www.fairplanet.org/dossier/beyond-slavery/forgotten-slavery-the-arab-muslim-slave-trade-sex-trafficking/",
      "domain": "fairplanet.org",
      "type": "citation"
    },
    {
      "text": "3",
      "url": "https://quran.com/en/an-nisa/3",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "Muhammads Polygamy 1161",
      "url": "https://apologeticspress.org/muhammads-polygamy-1161/",
      "domain": "apologeticspress.org",
      "type": "citation"
    },
    {
      "text": "Misreading Slavery And Polygamy In The Quran",
      "url": "https://www.islamicity.org/14269/misreading-slavery-and-polygamy-in-the-quran/",
      "domain": "islamicity.org",
      "type": "citation"
    },
    {
      "text": "33",
      "url": "https://quran.com/en/an-nur/33",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "Slavery.html",
      "url": "https://www.brandeis.edu/projects/fse/muslim/slavery.html",
      "domain": "brandeis.edu",
      "type": "citation"
    },
    {
      "text": "A 50126759",
      "url": "https://www.dw.com/en/east-africas-forgotten-slave-trade/a-50126759",
      "domain": "dw.com",
      "type": "citation"
    },
    {
      "text": "Womens Inheritance Islam",
      "url": "https://al-islam.org/introduction-rights-and-duties-women-islam-ibrahim-amini/womens-inheritance-islam",
      "domain": "al-islam.org",
      "type": "citation"
    },
    {
      "text": "Women In Islamic Law Examining Five Prevalent Myths",
      "url": "https://yaqeeninstitute.org/read/paper/women-in-islamic-law-examining-five-prevalent-myths",
      "domain": "yaqeeninstitute.org",
      "type": "citation"
    },
    {
      "text": "Islam And Womens Rights",
      "url": "https://centerforinquiry.org/blog/islam-and-womens-rights/",
      "domain": "centerforinquiry.org",
      "type": "citation"
    },
    {
      "text": "Diff Verse.html",
      "url": "https://www.brandeis.edu/projects/fse/muslim/diff-verse.html",
      "domain": "brandeis.edu",
      "type": "citation"
    },
    {
      "text": "The Status Of Womens Rights In The Middle East",
      "url": "https://www.stimson.org/2024/the-status-of-womens-rights-in-the-middle-east/",
      "domain": "stimson.org",
      "type": "citation"
    },
    {
      "text": "Factbox Womens Rights In The Arab World Idusbre9ab00i",
      "url": "https://www.reuters.com/article/lifestyle/factbox-womens-rights-in-the-arab-world-idUSBRE9AB00I/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Bukhari:5889",
      "url": "https://sunnah.com/bukhari:5889",
      "domain": "sunnah.com",
      "type": "citation"
    },
    {
      "text": "Muslim:349",
      "url": "https://sunnah.com/muslim:349",
      "domain": "sunnah.com",
      "type": "citation"
    },
    {
      "text": "Abudawud:5271",
      "url": "https://sunnah.com/abudawud:5271",
      "domain": "sunnah.com",
      "type": "citation"
    },
    {
      "text": "Fem Circumcision.html",
      "url": "https://answering-islam.org/Sharia/fem_circumcision.html",
      "domain": "answering-islam.org",
      "type": "citation"
    },
    {
      "text": "Cspii Fgm Index 2025",
      "url": "https://www.cspii.org/methodology/fgm-female-genital-mutilation/cspii-fgm-index-2025/",
      "domain": "cspii.org",
      "type": "citation"
    },
    {
      "text": "Female Genital Mutilation",
      "url": "https://www.who.int/news-room/fact-sheets/detail/female-genital-mutilation",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Womens Rights In The Middle East And North Africa",
      "url": "https://equalitynow.org/what-we-do/womens-rights-around-the-world/womens-rights-in-the-middle-east-and-north-africa/",
      "domain": "equalitynow.org",
      "type": "citation"
    },
    {
      "text": "Sharia Law And The Death Penalty.pdf",
      "url": "https://cdn.penalreform.org/wp-content/uploads/2015/07/Sharia-law-and-the-death-penalty.pdf",
      "domain": "cdn.penalreform.org",
      "type": "citation"
    },
    {
      "text": "The Status Of Dhimmis In The Ottoman Empire",
      "url": "https://fountainmagazine.com/all-issues/2002/issue-40-october-december-2002/the-status-of-dhimmis-in-the-ottoman-empire",
      "domain": "fountainmagazine.com",
      "type": "citation"
    },
    {
      "text": "Number Of Countries Where Religious Groups Were Harassed Reached New Peak Level In 2022",
      "url": "https://www.pewresearch.org/religion/2024/12/18/number-of-countries-where-religious-groups-were-harassed-reached-new-peak-level-in-2022/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "The Worlds Muslims Religion Politics Society Beliefs About Sharia",
      "url": "https://www.pewresearch.org/religion/2013/04/30/the-worlds-muslims-religion-politics-society-beliefs-about-sharia/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Backgrounder International Religious Freedom Justice Persecuted January 2022",
      "url": "https://www.usccb.org/resources/backgrounder-international-religious-freedom-justice-persecuted-january-2022",
      "domain": "usccb.org",
      "type": "citation"
    },
    {
      "text": "Globally Government Restrictions On Religion Reached Peak Levels In 2021 While Social Hostilities Went Down",
      "url": "https://www.pewresearch.org/religion/2024/03/05/globally-government-restrictions-on-religion-reached-peak-levels-in-2021-while-social-hostilities-went-down/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "2 Cairo Declaration Human Rights Islam 1990",
      "url": "https://www.ohchr.org/en/resources/educators/human-rights-education-training/2-cairo-declaration-human-rights-islam-1990",
      "domain": "ohchr.org",
      "type": "citation"
    },
    {
      "text": "Doc 2.pdf",
      "url": "https://www.tandemproject.com/issue_statements/statements/2008/012908_human_files/doc_2.pdf",
      "domain": "tandemproject.com",
      "type": "citation"
    },
    {
      "text": "The Forgotten Islamic Human Rights Document",
      "url": "https://www.openglobalrights.org/the-forgotten-islamic-human-rights-document/",
      "domain": "openglobalrights.org",
      "type": "citation"
    },
    {
      "text": "Death Penalty For Apostasy Selected Sunni And Shia Scholars Views In Favour Of Abolition",
      "url": "https://melbourneasiareview.edu.au/death-penalty-for-apostasy-selected-sunni-and-shia-scholars-views-in-favour-of-abolition/",
      "domain": "melbourneasiareview.edu.au",
      "type": "citation"
    },
    {
      "text": "Islam And Human Rights Clash Or Compatibility",
      "url": "https://blogs.lse.ac.uk/religionglobalsociety/2018/06/islam-and-human-rights-clash-or-compatibility/",
      "domain": "blogs.lse.ac.uk",
      "type": "citation"
    },
    {
      "text": "Ccfbff97f2f5efe1fd2dbb2b5b341cda",
      "url": "https://www.cambridge.org/core/books/islam-and-english-law/compatibility-of-an-islamicsharia-law-system-or-sharia-rules-with-the-european-convention-on-human-rights/CCFBFF97F2F5EFE1FD2DBB2B5B341CDA",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "2024",
      "url": "https://freedomhouse.org/country/saudi-arabia/freedom-world/2024",
      "domain": "freedomhouse.org",
      "type": "citation"
    },
    {
      "text": "2025",
      "url": "https://freedomhouse.org/country/iran/freedom-world/2025",
      "domain": "freedomhouse.org",
      "type": "citation"
    },
    {
      "text": "La Charia Est Elle Compatible Avec Les Droits De Lhomme",
      "url": "https://eclj.org/religious-freedom/pace/la-charia-est-elle-compatible-avec-les-droits-de-lhomme-?lng=en",
      "domain": "eclj.org",
      "type": "citation"
    },
    {
      "text": "Ny.gdp.pcap.cd",
      "url": "https://data.worldbank.org/indicator/NY.GDP.PCAP.CD?locations=1A",
      "domain": "data.worldbank.org",
      "type": "citation"
    },
    {
      "text": "Reports.aspx",
      "url": "https://databank.worldbank.org/data/reports.aspx?source=2\\u0026series=NY.GDP.PCAP.CD\\u0026country=MNA%2CIRN",
      "domain": "databank.worldbank.org",
      "type": "citation"
    },
    {
      "text": "Country Insights",
      "url": "https://hdr.undp.org/data-center/country-insights",
      "domain": "hdr.undp.org",
      "type": "citation"
    },
    {
      "text": "Arab States",
      "url": "https://data.undp.org/regions/arab-states",
      "domain": "data.undp.org",
      "type": "citation"
    },
    {
      "text": "Specific Country Data",
      "url": "https://hdr.undp.org/data-center/specific-country-data",
      "domain": "hdr.undp.org",
      "type": "citation"
    },
    {
      "text": "Gender Inequality Index",
      "url": "https://hdr.undp.org/data-center/thematic-composite-indices/gender-inequality-index",
      "domain": "hdr.undp.org",
      "type": "citation"
    },
    {
      "text": "Rbasgenderequalitystrategy Final.pdf",
      "url": "https://undp.org/sites/g/files/zskgke326/files/2025-01/rbasgenderequalitystrategy_final.pdf",
      "domain": "undp.org",
      "type": "citation"
    },
    {
      "text": "Comparative Analysis Of Corruption Perceptions Muslim Majority Countries Versus Global Averages.html",
      "url": "https://politurco.com/comparative-analysis-of-corruption-perceptions-muslim-majority-countries-versus-global-averages.html",
      "domain": "politurco.com",
      "type": "citation"
    },
    {
      "text": "2023",
      "url": "https://freedomhouse.org/country/saudi-arabia/freedom-world/2023",
      "domain": "freedomhouse.org",
      "type": "citation"
    },
    {
      "text": "2023",
      "url": "https://freedomhouse.org/country/iran/freedom-world/2023",
      "domain": "freedomhouse.org",
      "type": "citation"
    },
    {
      "text": "Countries Regions",
      "url": "https://freedomhouse.org/report/freedom-world/2023/marking-50-years/countries-regions",
      "domain": "freedomhouse.org",
      "type": "citation"
    },
    {
      "text": "Gpi 2023 Web.pdf",
      "url": "https://www.visionofhumanity.org/wp-content/uploads/2023/06/GPI-2023-Web.pdf",
      "domain": "visionofhumanity.org",
      "type": "citation"
    },
    {
      "text": "Middle East",
      "url": "https://www.arabnews.com/node/2333866/middle-east",
      "domain": "arabnews.com",
      "type": "citation"
    },
    {
      "text": "Global Terrorism Index",
      "url": "https://www.visionofhumanity.org/maps/global-terrorism-index/",
      "domain": "visionofhumanity.org",
      "type": "citation"
    },
    {
      "text": "Gti 2024 Web 290224.pdf",
      "url": "https://www.economicsandpeace.org/wp-content/uploads/2024/02/GTI-2024-web-290224.pdf",
      "domain": "economicsandpeace.org",
      "type": "citation"
    },
    {
      "text": "2023 Gender Social Norms Index Gsni",
      "url": "https://hdr.undp.org/content/2023-gender-social-norms-index-gsni",
      "domain": "hdr.undp.org",
      "type": "citation"
    },
    {
      "text": "Top 10 Poorest Muslim Countries In The World",
      "url": "https://sapa-usa.org/top-10-poorest-muslim-countries-in-the-world/",
      "domain": "sapa-usa.org",
      "type": "citation"
    },
    {
      "text": "Muhammad Abduh And His Epistemology Of Reform Its Impact On Rashid Rida Part I 12007",
      "url": "https://www.irfront.org/post/muhammad-abduh-and-his-epistemology-of-reform-its-impact-on-rashid-rida-part-i-12007",
      "domain": "irfront.org",
      "type": "citation"
    },
    {
      "text": "Muhammad Abduh Reformer",
      "url": "https://muslimskeptic.com/2022/10/27/muhammad-abduh-reformer/",
      "domain": "muslimskeptic.com",
      "type": "citation"
    },
    {
      "text": "Islam And Modernism A Study Of The Modern Reform Movement Inagurated By Muhammad Abduh",
      "url": "https://www.icit-digital.org/books/islam-and-modernism-a-study-of-the-modern-reform-movement-inagurated-by-muhammad-abduh",
      "domain": "icit-digital.org",
      "type": "citation"
    },
    {
      "text": "Jamal Aldin Afghani Muhammad Abduh Rashid Rida Hasan Albanna Radicals Modernists",
      "url": "https://abukhadeejah.com/jamal-aldin-afghani-muhammad-abduh-rashid-rida-hasan-albanna-radicals-modernists/",
      "domain": "abukhadeejah.com",
      "type": "citation"
    },
    {
      "text": "134706",
      "url": "https://www.newageislam.com/islamic-personalities/dr-mih-farooqi-new-age-islam/prominent-muslim-reformers-twentieth-century/d/134706",
      "domain": "newageislam.com",
      "type": "citation"
    },
    {
      "text": "Ijtihad Taqlid And The Closing Of The Doors Of Ijtihad",
      "url": "https://islamichistory.info/2021/11/03/ijtihad-taqlid-and-the-closing-of-the-doors-of-ijtihad/",
      "domain": "islamichistory.info",
      "type": "citation"
    },
    {
      "text": "The Relationship Between Taqlid And Ijtihad A Balanced Understanding",
      "url": "https://thethinkingmuslim.com/2025/07/28/the-relationship-between-taqlid-and-ijtihad-a-balanced-understanding/",
      "domain": "thethinkingmuslim.com",
      "type": "citation"
    },
    {
      "text": "2648",
      "url": "https://www.ajis.org/index.php/ajiss/article/view/2648",
      "domain": "ajis.org",
      "type": "citation"
    },
    {
      "text": "The Madhahib Question A Call For Dialogue Part 3",
      "url": "https://www.aljumuah.com/the-madhahib-question-a-call-for-dialogue-part-3/",
      "domain": "aljumuah.com",
      "type": "citation"
    },
    {
      "text": "Maajid Nawaz Irshad Manji And The Call For A Muslim Reformation",
      "url": "https://www.academia.edu/37594992/Maajid_Nawaz_Irshad_Manji_and_the_call_for_a_Muslim_reformation",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "9780674241480",
      "url": "https://www.hup.harvard.edu/books/9780674241480",
      "domain": "hup.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Reclaiming Islam",
      "url": "https://www.spectator.com.au/2014/03/reclaiming-islam/",
      "domain": "spectator.com.au",
      "type": "citation"
    },
    {
      "text": "Maajid Nawaz And His Call To Deform Islam",
      "url": "https://coolnessofhind.wordpress.com/2015/02/19/maajid-nawaz-and-his-call-to-deform-islam/",
      "domain": "coolnessofhind.wordpress.com",
      "type": "citation"
    },
    {
      "text": "The High Risk Strategy Of Muslim Reformers",
      "url": "https://www.aljazeera.com/opinions/2015/9/25/the-high-risk-strategy-of-muslim-reformers",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "The Prospects For Reform In Islam",
      "url": "https://www.hudson.org/national-security-defense/the-prospects-for-reform-in-islam",
      "domain": "hudson.org",
      "type": "citation"
    },
    {
      "text": "The Failure Of Islam To Reform",
      "url": "https://www.theglobalist.com/the-failure-of-islam-to-reform/",
      "domain": "theglobalist.com",
      "type": "citation"
    },
    {
      "text": "Islamic Religious Reform Institutional Need First",
      "url": "https://www.washingtoninstitute.org/policy-analysis/islamic-religious-reform-institutional-need-first",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Reform And Its Perils In Contemporary Islam",
      "url": "https://www.fairobserver.com/world-news/reform-and-its-perils-in-contemporary-islam/",
      "domain": "fairobserver.com",
      "type": "citation"
    },
    {
      "text": "104795",
      "url": "https://www.newageislam.com/ijtihad-rethinking-islam/g%25C3%25B6khan-bacik/reform-islam-it-possible/d/104795",
      "domain": "newageislam.com",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:24:24.242222",
  "elapsed_ms": 617180
}