{
  "topic": "Israel-Hamas War",
  "title": "Israel–Hamas war (also known as the War of Revival by the Israeli government, the Battle of al-Aqsa Flood by Palestinian militant groups, and the October 7 War)",
  "slug": "israel-hamas-war",
  "grokipedia_slug": "Israel–Hamas_war",
  "grokipedia_url": "https://grokipedia.com/page/Israel–Hamas_war",
  "source": "grokipedia",
  "content": "# Israel–Hamas war (also known as the War of Revival by the Israeli government, the Battle of al-Aqsa Flood by Palestinian militant groups, and the October 7 War)\n\nThe Israel–Hamas war erupted on 7 October 2023 with a large-scale, coordinated terrorist assault by Hamas, the Palestinian Islamist militant group governing the Gaza Strip, and allied factions including Palestinian Islamic Jihad, on Israeli civilian communities and military bases in southern Israel, which Hamas named Operation Al-Aqsa Flood, citing the blockade of Gaza and tensions at the Al-Aqsa Mosque. The attack utilized a barrage of over 3,000 rockets and ground breaches by fighters, resulting in 1,139 fatalities—comprising 766 civilians and 373 security personnel—and the taking of 251 hostages, according to final figures released by Israeli authorities. The initial attack represented the deadliest day for Jews since the Holocaust, while Israel's ensuing offensive has become the deadliest conflict for Palestinians since the 1948 Arab Israeli War, with Gaza's health authorities reporting over 67,000 fatalities by October 2025 (see Casualties and verification challenges for details). Israeli forensic assessments and subsequent independent investigations have documented that Palestinian militants committed widespread war crimes throughout the assault. Independent UN inquiries have established \"reasonable grounds\" to believe that recurring patterns of sexual violence occurred across multiple locations.\n\nIsrael launched Operation Swords of Iron (מבצע חרבות ברזל), asserting its right to self-defense under international law. The campaign commenced with airstrikes, a complete siege, and ground operations into Gaza.[6] Israel stated the goal was to neutralize Hamas's military infrastructure and governance, and by early 2025, estimated that it had inflicted heavy losses on Hamas fighters, killing nearly 20,000. Concurrently, UN bodies and rights groups have documented the high civilian death toll and the humanitarian crisis resulting from mass displacement and aid restrictions.[7]\n\nAs of late October 2025, following two years of intense fighting, initial, fragile phases of a U.S.-brokered ceasefire have commenced, including hostage releases, though core issues such as Hamas's demilitarization, prisoner exchanges, the return of displaced civilians, and reconstruction aid persist amid broader regional tensions involving Iran-backed proxies.\n\nThe war has sparked global debates over proportionality, civilian protections, and accountability, with Israel's actions legally framed as necessary self-defense to prevent recurrence of attacks it views as existential threats, contrasted against accusations by UN officials and human rights organizations of collective punishment, forced displacement, and war crimes.\n## Background\n\n### Historical context of the conflict\n\nThe Gaza Strip, a narrow coastal enclave, fell under Egyptian administration following the 1948 Arab-Israeli War, during which Egypt and Jordan retained control over territories not captured by Israel, including Gaza and the West Bank respectively. Egypt administered Gaza as a military governorship from 1949 until Israel's capture of the territory in the 1967 Six-Day War. Israel occupied Gaza militarily for the next several decades, establishing settlements and maintaining security control amid ongoing Palestinian fedayeen raids and broader Arab-Israeli hostilities.\n\nHamas, an acronym for the Islamic Resistance Movement (Ḥarakat al-Muqāwamah al-ʾIslāmiyyah), was founded in December 1987 in Gaza as an offshoot of the Muslim Brotherhood during the First Intifada, positioning itself as a rival to the secular Palestine Liberation Organization (PLO) and emphasizing armed jihad against Israel. Its founding charter, published on August 18, 1988, declares that \"the land of Palestine is an Islamic Waqf [endowment] consecrated for future Moslem generations until Judgement Day\" and rejects any recognition of Israel, framing the conflict as a religious duty to liberate all of historic Palestine through holy war, while incorporating antisemitic tropes such as references to the Protocols of the Elders of Zion.  Hamas's ideology, as an Islamist nationalist movement originating in the Muslim Brotherhood, prioritizes the destruction of the Jewish state over negotiated statehood, distinguishing it from Fatah-led Palestinian nationalism.\n\nIn August–September 2005, Israel implemented a unilateral disengagement plan, evacuating all 21 Gaza settlements (home to about 8,500 settlers) and four small outposts in the northern West Bank, while withdrawing military forces from inside Gaza but retaining control over airspace, maritime access, and borders to prevent arms smuggling and attacks. This move aimed to reduce friction and refocus security efforts, but it removed Israeli presence as a direct buffer against militant buildup. In January 2006, Hamas secured a parliamentary majority in Palestinian legislative elections, winning 74 of 132 seats amid widespread disillusionment with Fatah's corruption and failed peace efforts, leading to an international aid cutoff as donors conditioned support on Hamas renouncing violence and recognizing Israel. \n\nTensions escalated into open conflict between Hamas and Fatah, culminating in June 2007 when Hamas militarily seized control of Gaza in a bloody coup, executing or expelling Fatah officials and security forces, thereby splitting Palestinian governance—with Fatah retaining the West Bank under President Mahmoud Abbas. Hamas's rule in Gaza prompted Israel and Egypt to impose a blockade to curb weapons imports and militant activity, though humanitarian aid continued via international channels. From this base, Hamas intensified rocket and mortar attacks on Israeli communities, triggering Israeli military responses: Operation Cast Lead (December 2008–January 2009, lasting 22 days with over 2,500 rockets fired from Gaza); Operation Pillar of Defense (November 2012, an eight-day air campaign following escalated barrages); Operation Protective Edge (July–August 2014, a 50-day conflict involving tunnels and over 4,500 rockets); and clashes in May 2021 amid Jerusalem tensions, where Hamas fired over 4,000 projectiles. These cycles stemmed from Hamas's refusal to abide by ceasefires or demilitarize, using Gaza's dense urban terrain for military embedding, while Israel sought to degrade rocket capabilities and deter future assaults.\n### Hamas ideology and governance in Gaza\n\nIn May 2017, Hamas issued a \"Document of General Principles and Policies\" that introduced pragmatic adjustments, such as accepting a Palestinian state confined to the 1967 borders as a \"national consensus\" formula without recognizing Israel, and distinguishing its struggle against \"Zionist occupation\" from animosity toward Jews as a religious group. However, this document neither revoked nor superseded the 1988 Covenant, retaining the core commitment to armed resistance and the ultimate goal of Islamic governance over all of Palestine, as evidenced by ongoing Hamas rhetoric and actions post-2017 that reaffirm rejection of Israel's legitimacy.\n\nIn its governance of Gaza, Hamas has prioritized military infrastructure over civilian welfare, maintaining an estimated annual military budget of up to $350 million—funded partly through taxation on Gaza imports (yielding around $620 million yearly in Israeli shekels), extortion, and smuggling—directed toward rocket production, tunnel networks, and the Izz ad-Din al-Qassam Brigades, its designated terrorist military wing.\n\nGaza's economy under Hamas rule has remained characterized by chronic poverty and unemployment rates exceeding 45% pre-October 2023, with international aid—totaling billions since 2007—frequently diverted to sustain the group's arsenal, fighters' salaries, and military projects rather than broad development or infrastructure maintenance, contributing to systemic decay exemplified by corruption, neglect, a 33% water loss rate from leaky networks, and overexploitation of the coastal aquifer rendering 96% of supply undrinkable. Israeli intelligence attributes systematic diversion—including seizures of aid trucks for resale or military stockpiling—to potentially up to 25% of inflows, though U.S. Agency for International Development assessments found no evidence of widespread or systematic theft of American-funded aid, attributing most losses to general looting amid chaos. This exacerbates dependence on Qatar and Iran for supplemental funding. Hamas operates parallel institutions including schools, hospitals, and mosques to propagate its ideology, embedding Islamist teachings that glorify martyrdom and resistance. Politically, it enforces one-party rule through internal security forces that suppress dissent, with documented human rights violations including arbitrary detentions, torture of rivals, summary executions of suspected collaborators (over 20 publicly in 2021 alone), and crackdowns on protests, such as the 2019 demonstrations where security services beat and arrested hundreds. This repressive apparatus, coupled with electoral abstention since 2006, has entrenched Hamas's dominance while fostering a cult of armed struggle over democratic pluralism or economic reform.\n### Pre-October 2023 escalations and intelligence failures\n\nIn the years leading up to October 2023, Gaza-based terrorist groups, including Hamas and Palestinian Islamic Jihad (PIJ), intermittently launched rockets and mortars into Israel, prompting Israeli airstrikes on terrorist infrastructure and leadership. In 2022, Gaza terrorists fired approximately 1,100 projectiles, with the majority—over 1,000—occurring during four days of clashes in August after an Israeli airstrike killed a senior PIJ commander in retaliation for earlier attacks.  These incidents caused no Israeli fatalities but highlighted ongoing border tensions, including incendiary balloons and attempted infiltrations. Hamas, while not directly firing in that escalation, coordinated with PIJ and refrained from intervening to prevent broader conflict.\n\nA major flare-up occurred in May 2023 during Operation Shield and Arrow, where Israel preemptively targeted PIJ commanders following the arrest of a hunger-striking terrorist and intelligence of an imminent attack. PIJ responded by firing over 1,400 rockets toward Israeli population centers, including Tel Aviv and Jerusalem, over five days; Israel's Iron Dome intercepted most, but one civilian was killed by shrapnel in Rehovot.  Hamas upheld an informal ceasefire, issuing statements of support for PIJ but avoiding direct involvement to preserve its military buildup and strategic quietude. These patterns reflected Hamas's doctrine of calibrated aggression—escalating via proxies like PIJ while limiting actions that could provoke a full Israeli ground response, allowing resource diversion to tunnels, weapons, and training.\n\nIsraeli intelligence failures preceding the October 7 attack stemmed from a combination of overlooked signals, analytical biases, and doctrinal overconfidence. More than a year prior, Unit 8200 signals intelligence obtained Hamas's 40-page \"Jericho Wall\" blueprint, which precisely outlined the attack's tactics: mass rocket barrages, drones to neutralize border cameras, paraglider incursions, and ground assaults on military bases and civilian communities using motorcycles and explosives. IDF and Shin Bet officials dismissed it as aspirational, deeming the operation's scale logistically unfeasible for Hamas given Israel's fortified border fence and air defenses. \n\nFurther warnings were ignored, including reports from IDF border observation units—predominantly female soldiers—who documented Hamas training exercises simulating kidnappings and breaches as early as 2018-2022, yet these were downplayed as routine exercises rather than rehearsals for invasion. Egyptian intelligence relayed specific alerts days before October 7 about an impending major Hamas operation, but these were not escalated to senior levels. Post-attack inquiries, including IDF and Shin Bet reviews, attributed the lapses to \"conception\"—a systemic underestimation of Hamas's intent and capabilities, rooted in prioritization of threats from Iran and Hezbollah, faith in technological barriers like the Gaza fence, and Hamas's deliberate low-profile period to mask preparations.  Hamas exploited this by enforcing internal discipline against sporadic attacks, enabling undetected amassing of forces, weapons smuggling, and tactical innovations like drone-disrupted surveillance.\n\n## Hamas's October 7, 2023 attack\n\n### Planning and execution\n\nHamas's military wing, the Izz ad-Din al-Qassam Brigades, spearheaded the planning of the October 7, 2023, assault, known internally as Operation Al-Aqsa Flood. The operation's blueprint, a 40-page document code-named \"Jericho Wall\" by Israeli intelligence, outlined a coordinated offensive involving a massive rocket barrage to overwhelm Israeli defenses, followed by drone strikes to neutralize border surveillance cameras and automated machine guns. This plan was obtained by Israeli officials more than a year prior to the attack, yet dismissed as beyond Hamas's logistical capabilities and deemed aspirational rather than actionable.  \n\nPlanning spanned years, with Hamas conducting joint military exercises under the \"Strong Pillar\" program starting in 2020, simulating hostage-taking, compound raids, and border breaches at 14 training sites across Gaza, some adjacent to the Israeli barrier. These drills culminated in a final exercise just 25 days before the assault. Hamas, commanding approximately 30,000 fighters overall, mobilized 1,500 to 3,000 for the incursion, augmented by allied Palestinian factions including Palestinian Islamic Jihad, Mujahideen Brigades, and Al-Nasser Salah al-Deen Brigades, which had trained alongside Hamas and later claimed participation. Documents recovered from slain fighters post-attack detailed intended tactics such as targeting civilian areas and military installations with explicit instructions for mass killings and abductions to maximize terror.  \n\nExecution commenced at approximately 6:30 a.m. local time on October 7 with thousands of rockets launched from Gaza to saturate Israeli air defenses and create chaos. Simultaneously, Hamas forces breached the Gaza-Israel barrier at over 100 points using explosives, bulldozers, and pickup trucks, while elite Nukhba units infiltrated via motorized paragliders, motorcycles, and maritime landings by speedboat. This multi-vector assault enabled rapid advances into southern Israeli communities, military outposts, and the Nova music festival site, catching Israeli forces off-guard during the Simchat Torah holiday. The operation's scale and surprise element allowed Hamas terrorists to overrun border defenses before a coordinated Israeli response could mobilize.\n\n### Atrocities committed during the assault\n\nHamas terrorists and other Palestinian armed groups carried out deliberate killings, rapes, sexual assaults, and torture of civilians across southern Israel on October 7, 2023, including summary executions, shootings at close range, and the use of grenades and arson in residential areas. In Kibbutz Be'eri, attackers killed at least 97 civilians and 15 security personnel, representing about 10% of the community's population, often by storming homes, firing indiscriminately, and setting structures ablaze with occupants inside. Similar tactics in Kibbutz Kfar Aza resulted in over 50 civilian deaths, with bodies later found mutilated or bound.\n\nAt the Nova music festival near Kibbutz Re'im, Hamas gunmen killed 378 attendees and security personnel, pursuing fleeing civilians across open fields and firing on those hiding in bomb shelters. Victims were shot while attempting to escape in vehicles or on foot, with terrorists using automatic weapons and grenades to maximize casualties in this unarmed gathering of over 3,500 people. The assault, which began around 6:30 a.m., involved coordinated incursions that trapped festivalgoers, leading to bodies strewn across the site amid burned cars and tents.\n\nSexual and gender-based violence was systematically employed, with forensic evidence and eyewitness accounts indicating rape, gang rape, and mutilation in multiple locations including kibbutzim and the festival site. United Nations investigators found \"reasonable grounds\" to believe that such acts, including the insertion of objects causing severe injury to genitals, occurred as part of a pattern to terrorize victims, with bodies recovered showing signs of binding, undressing, and post-mortem degradation. While some initial reports of specific incidents were later debunked, verified testimonies from first responders and survivors confirm widespread sexual assault targeting women and girls.\n\nAdditional atrocities included the torture of captives before execution, such as burning individuals alive and decapitations, documented through videos released by the attackers and forensic examinations of remains. These acts, classified as war crimes and crimes against humanity by multiple investigations, were not isolated but integral to the assault's objective of inflicting maximum civilian suffering.\n### Immediate Israeli casualties and hostage-taking\n\nThe Hamas-led assault on October 7, 2023, penetrated Israeli border defenses through breaches in the Gaza perimeter fence, enabling terrorists to reach at least 22 civilian communities, military outposts, and the Nova music festival site near Kibbutz Re'im. This resulted in the immediate deaths of approximately 1,200 people, the majority civilians, including over 800 murdered in homes, streets, and safe rooms across southern Israeli towns and kibbutzim such as Be'eri, Kfar Aza, Nir Oz, and Netiv HaAsara.  Security forces suffered around 300 fatalities in clashes at bases like Nahal Oz and Re'im, where terrorists overwhelmed positions using rockets, gunfire, and grenades.\n\nAt the Nova festival, attended by over 3,500 people, Hamas gunmen initiated a massacre shortly after dawn, killing hundreds of fleeing civilians in vehicles, fields, and bunkers over several hours; forensic evidence and survivor accounts confirmed systematic executions and arson. Similar tactics in kibbutzim involved house-to-house raids, with terrorists binding and shooting residents, including families and the elderly, as documented in recovered bodycam footage and autopsies showing close-range gunshot wounds and burns. Foreign nationals, including at least 36 Americans, comprised part of the toll, marking the deadliest single-day loss of Jewish lives since the Holocaust.\n\nIn tandem with the killings, terrorists abducted 251 individuals—civilians and soldiers—from attack sites and transported them into Gaza. Comprehensive details on the abductions, hostage conditions, and recovery efforts are covered in the \"Hostage situation and recovery efforts\" section.\n## Israeli military response\n\n### Initial airstrikes and blockade (October 2023)\n\nIn response to Hamas's October 7, 2023, attack, the Israel Defense Forces (IDF) immediately launched airstrikes targeting Hamas military infrastructure in the Gaza Strip, including rocket launch sites and command centers, to suppress ongoing barrages of over 3,000 rockets fired at Israeli communities. These initial strikes, conducted by Israeli Air Force jets, hit dozens of targets within hours of the incursion, aiming to degrade Hamas's operational capabilities and prevent further assaults. On October 8, Israel's security cabinet formally declared a state of war against Hamas, authorizing expanded military operations.\n\nAirstrikes escalated rapidly, with the IDF reporting strikes on over 70 Hamas targets by October 10 and continuing intensive operations that targeted underground tunnels, anti-tank missile positions, and weapon depots throughout the month. By late October, daily strikes reached hundreds of sites, focusing on Hamas's military compounds embedded in civilian areas, which Israel identified as deliberate exploitation of Gaza's urban density to shield fighters. Israeli officials emphasized precision targeting and the use of warnings to minimize civilian harm, though the confined geography and Hamas's tactics complicated efforts.\n\nOn October 9, Defense Minister Yoav Gallant announced a \"complete siege\" of Gaza, ordering the cutoff of all electricity, food, fuel, and water supplies, stating, \"We are fighting human animals and we act accordingly.\" This blockade, enforced by halting imports through crossings and naval restrictions, sought to isolate Hamas combatants, prevent rearmament, and exert pressure amid the hostage crisis involving over 200 captives. The measures led to immediate shortages, including fuel depletion for Gaza's sole power plant by October 12, exacerbating pre-existing vulnerabilities from prior restrictions, though Israel maintained the policy was targeted at Hamas governance rather than civilians.\n\nThe combined airstrikes and blockade marked Israel's strategy of attrition against Hamas leadership and logistics in the opening phase, prior to the ground incursion on October 27, with the IDF claiming elimination of key commanders and destruction of significant rocket stockpiles. Gaza authorities, controlled by Hamas, reported high civilian casualties from the strikes, figures disputed by Israel as inflated and inclusive of combatants without verification. International calls for humanitarian access intensified, but Israel prioritized security, arguing that aid diversion to terrorists—evidenced in past conflicts—necessitated stringent controls.\n\n### Ground invasion initiation (late October–November 2023)\n\nThe Israel Defense Forces (IDF) commenced ground operations in Gaza on October 27, 2023, transitioning from an air campaign to combined arms incursions aimed at dismantling Hamas's military infrastructure in northern Gaza. This followed weeks of airstrikes that targeted Hamas command centers, rocket launch sites, and tunnels, with IDF forces—numbering over 100,000 troops—crossing the border in multiple axes using tanks, infantry, and engineering units supported by artillery and air cover. Initial phases involved limited raids rather than a full-scale invasion, focusing on intelligence gathering, destruction of border obstacles, and elimination of immediate threats to allow for deeper penetration.\n\nPreceding the incursion, on October 13, 2023, Israel issued a military evacuation order directing roughly 1.1 million civilians north of the Wadi Gaza (Salah al-Din Road) to relocate southward within 24 hours, designating the area south of this line as a \"safe zone\" for humanitarian pauses, though subsequent strikes occurred there as well. The order, justified by the IDF as necessary to protect civilians from impending ground maneuvers against Hamas positions embedded in densely populated zones, led to mass displacement amid limited routes and ongoing bombardment, exacerbating a humanitarian crisis with reports of chaos, injuries during movement, and inability for many— including hospital patients—to comply fully. Hamas criticized the directive as collective punishment, while Israeli officials emphasized it as a precautionary measure given Hamas's history of using civilian areas for military purposes.\n\nBy late October, IDF units, including the Givati Brigade, conducted operations in northern strongholds like Jabalia, eliminating over 50 Hamas terrorists in ground engagements and destroying weapons caches, while an airstrike on October 31 targeted a Hamas commander in the Jabalia refugee camp, causing significant collateral damage according to Gaza health authorities. In November, forces advanced toward Gaza City, securing areas such as Beit Hanoun and engaging in urban combat in Shejaiya and Zeitoun neighborhoods, where Hamas fighters employed ambushes, anti-tank missiles, and booby-trapped buildings. The IDF reported neutralizing hundreds of terrorists and exposing extensive tunnel networks, though progress was slowed by Hamas's asymmetric tactics, including human shields and fortified positions in civilian infrastructure.\n\nIDF casualties during this period totaled at least 31 soldiers killed by early November, primarily from explosive devices, sniper fire, and close-range combat, with over 260 wounded; these figures reflect the intensity of fighting against an entrenched adversary but remain low relative to the scale of operations compared to prior conflicts. Hamas claimed to have inflicted heavier losses, including via captured footage of destroyed Israeli vehicles, though independent verification was limited and Israeli assessments disputed exaggerated terrorist reports. Palestinian health officials, controlled by Hamas, reported thousands of deaths in northern Gaza, attributing most to Israeli actions, but these counts include combatants and lack differentiation, with evidence of Hamas embedding forces in residential areas contributing to civilian risks.\n\n### Ceasefire and hostage exchange (November–December 2023)\n\nA framework agreement for a temporary truce was announced on November 22, 2023, following weeks of indirect negotiations mediated primarily by Qatar, with support from Egypt and the United States. The deal stipulated a four-day pause in fighting starting November 24, during which Hamas would release up to 50 civilian hostages—focusing on women and children—in phased daily exchanges for Israel to release 150 Palestinian prisoners, predominantly women and juveniles convicted of non-security-related offenses such as theft or stone-throwing. Additional terms included the withdrawal of Israeli Defense Forces (IDF) from select northern Gaza positions to facilitate the return of displaced civilians, a halt to aerial and ground operations, and a surge in humanitarian aid, with at least 200 aid trucks and four fuel tankers permitted entry into Gaza daily. \n\nThe truce took effect at 7:00 a.m. local time on November 24, marking the first suspension of major hostilities since October 7. On the first day, Hamas released 24 captives—13 Israeli civilians and 11 foreign nationals, including Thai workers—via Rafah into Egypt, where they were transferred to Israel; in reciprocation, Israel freed 39 Palestinian detainees from West Bank prisons. Exchanges continued daily, with subsequent groups including elderly Israelis and children; by the truce's conclusion, Hamas had released 105 living hostages total (81 Israelis and 24 foreigners), exceeding the initial 50 due to three one-day extensions negotiated amid ongoing talks. Israel released 240 Palestinians overall, selected from a list provided by Hamas, many of whom returned to celebrations in the West Bank despite Israeli security concerns over their prior involvement in attacks on civilians. The pause enabled over 1,400 aid trucks to enter Gaza, providing food, water, and medical supplies, though distribution challenges persisted due to Hamas's control over internal logistics. \n\nDuring the seven-day period, both sides adhered to the no-fire clause initially, allowing thousands of Gazans to retrieve belongings from northern ruins, though the IDF reported discovering Hamas explosives and ambushes in vacated areas. Hamas utilized the respite to reposition fighters and resupply via tunnels, while Israeli officials emphasized the truce's limited scope, excluding male combatants or a permanent end to hostilities. Efforts to extend beyond civilian releases faltered, as Hamas demanded guarantees for a full ceasefire and further prisoner swaps involving soldiers, conditions Israel rejected to preserve operational momentum against Hamas's military infrastructure.\n\nThe truce expired at 7:00 a.m. on December 1, 2023, without mutual agreement on continuation; Hamas announced it would withhold further releases absent Israeli commitments to withdraw entirely from Gaza and lift the blockade, prompting projectiles fired toward southern Israel. The IDF responded minutes later with airstrikes on Hamas targets in northern Gaza, citing the barrages as a direct violation that justified resuming the campaign to eliminate terrorist threats and secure remaining hostages. Hamas accused Israel of prior breaches through troop movements near release sites, but independent verification aligned with Israeli accounts of incoming fire initiating the breakdown, underscoring Hamas's strategic use of captives to dictate terms beyond the agreed temporary pause. Fighting intensified thereafter, with over 400 Palestinian deaths reported in initial strikes, as Israel advanced toward objectives in Gaza City. \n\n### Northern Gaza operations (December 2023–March 2024)\n\nFollowing the expiration of the seven-day ceasefire on December 1, 2023, the Israel Defense Forces (IDF) resumed intensive ground operations across northern Gaza, focusing on dismantling entrenched Hamas military infrastructure in densely populated areas such as Jabalia refugee camp and surrounding neighborhoods in Gaza City. These efforts targeted the Hamas Jabalia Battalion, a key component of the group's northern command structure, which had regrouped during the truce and continued launching rockets and ambushes from tunnel networks and civilian buildings. IDF maneuvers involved combined arms tactics, including infantry advances supported by armored units, precision airstrikes, and engineering operations to expose and destroy over 100 kilometers of subterranean tunnels in the region by early 2024.\n\nHeavy fighting persisted through December, with IDF forces encircling Jabalia and conducting raids that eliminated dozens of Hamas operatives daily, including mid-level commanders directing attacks from command posts embedded within residential zones and schools. On December 18, 2023, airstrikes in Jabalia targeted such positions, resulting in reports of over 100 Palestinian deaths according to the Hamas-run Gaza Ministry of Health, though IDF assessments indicated the strikes neutralized terrorist concentrations while attributing civilian casualties to Hamas' use of human shields and failure to heed evacuation warnings. Israeli troops faced close-range threats, including IEDs and anti-tank fire, leading to the deaths of at least 13 soldiers in northern Gaza engagements during late December alone. By mid-January 2024, the IDF reported neutralizing key Hamas leadership and weapon caches, significantly degrading the group's ability to coordinate large-scale operations in the north.\n\nOperations extended into Beit Hanoun and Beit Lahia, where IDF units cleared booby-trapped structures and rocket launch sites, preventing renewed barrages toward Israeli communities. Engineering corps demolished multi-story buildings used as observation posts and staging areas, while intelligence-driven arrests yielded insights into remaining Hamas cells. On January 7, 2024, the IDF declared the dismantlement of Hamas' military framework in northern Gaza complete, estimating over 5,000 terrorists killed in the sector since the ground incursion began, with battalions rendered inoperable through the elimination of 80-90% of their organized fighting force.\n\nThrough March 2024, residual operations mopped up pockets of resistance, with IDF maintaining buffer zones to monitor re-infiltration attempts amid sporadic rocket fire from northern holdouts. The campaign displaced remaining civilians southward, prioritizing the destruction of dual-use infrastructure to prevent Hamas reconstitution, though Gaza Ministry of Health figures claimed thousands of additional deaths in the north during this phase—numbers that include unverified combatant tolls and lack independent combatant-civilian differentiation. Israeli assessments emphasized operational success in securing the area against immediate threats, though analysts noted Hamas' adaptive tactics prolonged low-level insurgency. No major IDF withdrawals occurred until late March, as forces transitioned focus southward while retaining control over key northern corridors.\n\n### Khan Yunis offensive (January–April 2024)\n\nIn late December 2023 and early January 2024, the Israel Defense Forces (IDF) shifted operational focus southward following the dismantling of Hamas infrastructure in northern Gaza, preparing for intensified action in Khan Yunis, Gaza's second-largest city and a known hub for the Hamas Khan Yunis Brigade. On January 22, the IDF launched a multi-brigade ground offensive under the 98th Division, encircling the city and advancing from eastern and western approaches to isolate Hamas forces. This operation aimed to degrade the brigade's command structure, destroy underground tunnels, and eliminate terrorists responsible for rocket fire and the October 7 attacks, with IDF forces conducting targeted raids amid urban combat.\n\nBy January 23–24, IDF troops deepened penetration into Khan Yunis, engaging in close-quarters battles near the refugee camp, Al-Aqsa Hospital, and Nasser Hospital complex, where Hamas was accused of embedding command posts and weapon stores within civilian sites. The IDF reported eliminating numerous terrorists, destroying terror infrastructure, and striking over 3,300 targets including 400 tunnel shafts by late January, with 150 shafts fully neutralized. Intense fighting persisted through February and March, with IDF statements indicating the dismantling of two eastern battalions of the Khan Yunis Brigade and the elimination of multiple commanders, significantly disrupting Hamas's local command and control. Palestinian sources, including the Hamas-controlled Gaza Health Ministry, reported high civilian casualties from airstrikes and ground clashes, though these figures do not differentiate combatants and have been contested by Israel for lacking verification.\n\nThe offensive incurred significant Israeli losses, including 21 soldiers killed on January 23–24 in a booby-trapped building collapse and explosion—the deadliest single incident for the IDF in the war up to that point—bringing cumulative ground operation fatalities to over 220. Hamas claimed responsibility for ambushes using improvised explosives and anti-tank missiles, while the IDF attributed many casualties to Hamas's use of civilian areas for staging attacks, complicating advances. By early April, after four months of sustained operations, the IDF withdrew most forces from Khan Yunis on April 7, stating they had destroyed weapons caches, headquarters, communication centers, and extensive tunnel networks, rendering the area inoperable for Hamas reconstitution in the near term. Independent assessments noted widespread destruction in the city, with satellite imagery showing near-total devastation of terrorist infrastructure but also civilian displacement exceeding 1.5 million Gazans southward.\n\n### Rafah operations and southern Gaza focus (May–August 2024)\n\nOn May 6, 2024, the Israel Defense Forces (IDF) issued evacuation orders for civilians in eastern Rafah, Gaza's southernmost city, which sheltered over one million displaced Palestinians and hosted Hamas's Rafah Brigade along with smuggling tunnels under the Philadelphi Corridor bordering Egypt. The following day, May 7, IDF forces launched a targeted operation seizing the Gaza side of the Rafah crossing, initiating a limited ground incursion to dismantle Hamas infrastructure and prevent arms smuggling, while Hamas continued rocket fire from the area.  This marked the start of broader Rafah operations, shifting Israeli focus southward after prior gains in Khan Yunis, with objectives centered on eliminating the brigade's estimated 4,000-5,000 fighters, destroying underground networks, and securing the border to block resupply routes exploited by Hamas.\n\nIDF divisions, including the 162nd and 98th, advanced methodically into Rafah neighborhoods, encountering Hamas tactics of booby-trapped buildings, ambushes, and tunnel-based evasion rather than sustained frontline combat. By late May, forces gained operational control of the Philadelphi Corridor, a 14-kilometer buffer zone, unearthing and demolishing multiple cross-border tunnels used for smuggling weapons and terrorists.  Operations expanded into central and western Rafah in June, prioritizing tunnel mapping and destruction—over 100 shafts identified in the zone—with airstrikes and ground raids killing scores of terrorists in close-quarters fighting. IDF Chief of Staff Herzi Halevi reported significant progress toward dismantling the Rafah Brigade by mid-June, including the elimination of key commanders and neutralization of command structures.\n\nThrough July, intensified sweeps yielded IDF estimates of over 900 terrorists killed in Rafah, alongside the demolition of extensive tunnel systems and weapon caches hidden in civilian sites. Hamas responses included sporadic rocket barrages toward Israel and guerrilla-style attacks, but operational capacity degraded as Israeli forces isolated battalions and severed resupply lines. By August, Defense Minister Yoav Gallant declared the Rafah Brigade defeated, with 80% of Philadelphi Corridor tunnels destroyed and the majority of above- and below-ground infrastructure neutralized, though mopping-up actions persisted against residual pockets.  Southern Gaza operations extended to adjacent areas like Khan Yunis outskirts, where IDF razed over 50 additional tunnels in mid-August to prevent regrouping, maintaining pressure on Hamas holdouts amid ongoing border security efforts.\n\n### Late 2024 escalations and multi-front pressures\n\nIn late September 2024, cross-border exchanges between Israel and Hezbollah intensified, prompting Israel to launch a limited ground incursion into southern Lebanon on the night of September 30–October 1. Israeli forces, including infantry and armored units, advanced several kilometers into Hezbollah-stronghold areas to target rocket launch sites, command centers, and tunnels, marking the deepest penetration since the 2006 Lebanon War. The operation aimed to degrade Hezbollah's capacity to fire thousands of rockets into northern Israel, which had displaced over 60,000 Israeli civilians since October 2023. By mid-October, Israeli troops had conducted raids in villages such as Maroun al-Ras and Aita al-Shaab, destroying Hezbollah infrastructure while facing ambushes and anti-tank fire.\n\nConcurrently, on October 1, Iran conducted a direct ballistic missile barrage against Israel, launching approximately 180–200 missiles in retaliation for Israeli strikes that killed Hezbollah leader Hassan Nasrallah on September 27 and Hamas political chief Ismail Haniyeh in July. The attack, dubbed \"True Promise II\" by Iran, targeted military sites but caused limited damage after Israeli air defenses, supported by U.S. and allied interceptors, neutralized most projectiles; one Palestinian civilian was killed by debris in the West Bank. Israel responded on October 26 with airstrikes on Iranian military facilities, including missile production sites and air defenses, avoiding nuclear or oil infrastructure to limit escalation. This exchange highlighted Iran's strategy of coordinating proxy assaults from multiple fronts—Lebanon, Yemen, Iraq, Syria, and Gaza—to pressure Israel without full conventional war.\n\nYemen's Houthis, another Iranian-backed group, sustained drone and missile attacks on Israeli targets throughout late 2024, launching over 200 such projectiles since October 2023 to solidarity with Hamas. Notable incidents included ballistic missiles intercepted over Israel in December, prompting Israeli airstrikes on Houthi ports and radar systems, such as the December 19 raid on Sanaa and Hudaydah that killed at least nine. These strikes disrupted Houthi logistics but did not halt their campaign, which also targeted Red Sea shipping to enforce a Gaza blockade. In Gaza, Hamas fired sporadic rockets from northern areas like Jabalia, met with Israeli airstrikes and ground maneuvers to prevent regrouping, amid ongoing efforts to dismantle remaining networks.\n\nThe multi-front dynamics—encompassing Hezbollah's rocket barrages (over 8,000 since October 2023), Houthi projectiles, Iranian missiles, and residual Hamas threats—stretched Israeli defenses, necessitating reallocations from Gaza operations and international coordination for interception. Iran's \"axis of resistance\" doctrine sought to overwhelm Israel through simultaneous proxy actions, though Israeli preemptive strikes on leadership degraded command structures without triggering broader regional war by year's end.\n\n### 2025 ceasefire attempts and fragile truce (January–November 2025)\n\nNegotiations mediated by the United States and Qatar culminated in a ceasefire agreement announced on January 15, 2025, between Israel and Hamas, with implementation beginning on January 19. The deal outlined three phases: an initial six-week period featuring a full ceasefire, Israeli withdrawal from populated areas of Gaza, release of living hostages by Hamas in exchange for Palestinian prisoners, and increased humanitarian aid; subsequent phases involved further exchanges, reconstruction, and discussions on permanent cessation of hostilities. During the first phase, Hamas released approximately 20 hostages, including elderly and ill individuals, while Israel freed over 100 Palestinian prisoners and allowed around 600 aid trucks daily into Gaza, though disputes arose over verification of hostage conditions and aid distribution amid Hamas's control of internal logistics.\n\nThe truce unraveled on March 17, 2025, when Israel initiated a series of airstrikes across Gaza, killing over 400 people according to Gaza health authorities, in response to Hamas's alleged failure to advance Phase 2 negotiations and continued rocket fire from the territory. Israeli officials stated the strikes aimed to pressure Hamas into concessions on permanent demilitarization and hostage remains recovery, as talks had stalled by late March with Israel accusing Hamas of intransigence on disarmament terms. Hamas denied violations and claimed Israel's refusal to commit in writing to non-resumption of hostilities post-Phase 1 justified their position, leading to renewed ground operations and over 700 Palestinian deaths in the ensuing days.\n\nIntermittent talks resumed in April through September 2025, facilitated by U.S. envoys including Steve Witkoff and Jared Kushner, who presented a 20-point plan emphasizing Hamas disarmament, international security oversight in Gaza, and phased hostage returns. Hamas accepted a revised proposal in August, but sticking points persisted over Israeli troop withdrawal timelines and Palestinian prisoner releases. On September 29, U.S. President Donald Trump announced Israel's acceptance of the framework, paving the way for final indirect negotiations in early October.\n\nA new U.S.-brokered ceasefire took effect on October 9, 2025, at noon local time, with Israel approving the resolution for hostage releases and Hamas committing to return remains of deceased captives. The agreement mandated an initial 20 living hostages (mostly women, children, and elderly) and the remains of deceased captives exchanged for Palestinian prisoners, full Israeli withdrawal from Gaza population centers, and restoration of pre-war aid levels at 600 trucks daily, though implementation faced immediate hurdles including restricted Rafah crossing access and mutual accusations of violations. By October 21, U.S. Vice President JD Vance reported the truce was \"going better than expected,\" with partial aid resumption and Hamas beginning searches for hostage bodies in tunnels, but fragility persisted amid reports of Hamas attacks on IDF positions, including ambushes killing soldiers, and Israeli enforcement strikes.\n\nThe October truce's terms included provisional Hamas disarmament monitored by an international force—though nations hesitated to commit troops due to risks of clashes with residual terrorists—and prohibitions on Israeli airstrikes, yet underlying tensions over Gaza governance and Hamas's military reconstitution threatened sustainability. As of October 26, 2025, the ceasefire held tenuously, with U.S. officials dispatching senior envoys to prevent derailment, while aid restrictions and unrecovered hostages underscored unresolved causal factors from prior Hamas intransigence and asymmetric tactics. On November 17, 2025, the UN Security Council adopted Resolution 2803 (2025) by a vote of 13 in favor with two abstentions, endorsing the U.S.-backed Comprehensive Plan for Gaza associated with President Trump's framework, as multiple member states invoked \"peace and security\" in their statements supporting international stabilization efforts.)\n## Strategies and tactics\n\n### Hamas military doctrine and use of civilian infrastructure\n\nHamas's military doctrine, primarily executed by its Izz ad-Din al-Qassam Brigades, emphasizes asymmetric warfare, wherein a militarily inferior force employs irregular tactics to offset the technological and conventional advantages of a state adversary like Israel. This approach involves guerrilla operations, hit-and-run ambushes, and the deliberate integration of military assets into densely populated civilian environments to complicate enemy targeting and amplify political costs through anticipated civilian casualties. Such tactics exploit international humanitarian law (IHL) constraints on Israel's operations, as strikes on legitimate military targets amid civilians risk accusations of disproportionate force, thereby serving Hamas's information warfare objectives.\n\nA core element is the extensive use of Gaza's civilian infrastructure for military purposes, including as command centers, weapon storage, and launch sites, effectively turning non-combatants into involuntary shields. Another core element is Hamas's practice of discouraging or preventing Palestinian civilians from evacuating combat zones following IDF warnings, thereby using them as human shields to increase civilian casualties for political and propaganda purposes. Hamas has systematically embedded rocket launchers, ammunition caches, and operational headquarters in or near schools, mosques, hospitals, and residential buildings, as documented in Israeli intelligence and post-operation findings. For instance, during the 2023–2024 conflict, the Israel Defense Forces (IDF) identified rocket launch sites positioned adjacent to civilian shelters and UN facilities, such as in southern Gaza neighborhoods where launches targeted central Israel.\n\nUnderground tunnel networks, spanning hundreds of kilometers, exemplify this doctrine's subterranean focus, with entrances and routes often concealed beneath hospitals, schools, and aid compounds to enable mobility, resupply, and evasion while protected by overlying civilian structures. IDF raids in November 2023 revealed a major Hamas command-and-control center beneath Al-Shifa Hospital in Gaza City, including tunnels equipped for prolonged habitation and linked to hospital wards. Similar discoveries occurred at the European Hospital in Khan Yunis in May 2024 and UNRWA-affiliated schools in Shujaiya in July 2024, where weapons, hideouts, and tunnel access points were found integrated into the facilities.\n\nThis strategy has been a longstanding policy, predating the October 7, 2023, attack, with Hamas leaders openly advocating the use of civilian areas to deter Israeli responses; for example, operational directives captured by the IDF instructed fighters to position assets amid populations to maximize \"civilian\" fallout for propaganda gains. While Hamas denies systematic shielding, forensic evidence from neutralized sites—such as blast residue, munitions residue, and structural modifications—contradicts these claims, underscoring a calculated reliance on civilian proximity to sustain combat longevity against superior firepower.\n### Israeli operational objectives and defensive measures\n\nIsrael's operational objectives following the October 7, 2023, Hamas attack centered on dismantling the group's military and governance structures in Gaza to prevent future threats, rescuing approximately 250 hostages taken during the assault, and restoring security for southern Israeli communities displaced by the incursion. The Israel Defense Forces (IDF) prioritized targeting Hamas's command-and-control centers, rocket launch sites, and extensive tunnel network, estimated at over 500 kilometers, which enabled cross-border attacks and weapon smuggling. By mid-2025, Defense Minister Israel Katz directed the IDF to focus on destroying remaining tunnels, with about 60% reported intact, as a core task in controlled Gaza areas to neutralize Hamas's subterranean operational capacity.\n\nTo achieve these aims, the IDF employed combined arms tactics, including precision airstrikes, ground incursions, and intelligence-driven raids, aiming to degrade Hamas's fighters and leadership cadre. Operations involved clearing urban areas, such as Gaza City and Khan Yunis, to dismantle weapon caches and training facilities embedded in civilian infrastructure, while facilitating phased civilian evacuations to reduce collateral risks. Subterranean warfare adaptations included specialized units for tunnel detection and flooding, addressing Hamas's doctrine of using underground routes for ambushes and resupply, with IDF assessments indicating significant degradation of Hamas battalions by early 2025.\n\nDefensive measures emphasized multi-layered aerial interception systems to counter Hamas rocket barrages, which exceeded 12,000 projectiles by late 2023. The Iron Dome system, designed for short-range threats, achieved interception rates above 90% for rockets targeting populated areas, diverting or neutralizing thousands during peak salvos, such as the initial October 7 barrage of over 3,000. Complementary systems like David's Sling handled medium-range threats, while border fortifications and rapid-response ground units prevented further infiltrations, bolstered by real-time intelligence from drones and signals intercepts. These defenses mitigated civilian casualties in Israel, with fewer than 50 deaths from rockets attributed to system breakthroughs or duds by 2025.\n\n### Role of tunnels, rockets, and asymmetric warfare\n\nHamas's military strategy in the Israel–Hamas war exemplifies asymmetric warfare, leveraging irregular tactics to counter Israel's conventional superiority in airpower, intelligence, and armored forces. Lacking a standing army or advanced weaponry, Hamas employs underground tunnels for concealment, mobility, and surprise operations, while firing unguided rockets to impose psychological strain and divert Israeli resources. These elements enable prolonged resistance by embedding fighters within civilian areas, complicating Israeli targeting and ground advances, though they also expose Hamas to high attrition from Israel's precision strikes and defensive systems.\n\nThe tunnel network, dubbed the \"Gaza Metro\" by Israeli officials, spans an estimated 350–450 miles (560–720 km) as of early 2024, with some assessments reaching 500–600 km by mid-2025, connecting command centers, weapon storage, and launch sites beneath urban density. Constructed over decades with concrete, ventilation, and rail systems, tunnels facilitate fighter movement to evade aerial surveillance, store munitions including rockets, and enable cross-border raids, as seen in prior incursions. In the war, they supported initial ambushes and sustained operations by shielding Hamas from bombardment, though depths vary from shallow smuggling routes to fortified bunkers exceeding 70 meters.\n\nIsraeli forces have targeted tunnels through flooding, aerial bombs, and ground raids, identifying over 4,700 shafts and destroying segments, including 1,000 rocket launchers linked to tunnel infrastructure by October 2024. Despite these efforts, only about 25% of the network was neutralized by April 2025, due to the system's scale, booby traps, and Hamas's adaptive rebuilding using civilian materials. The IDF's \"contain and clear\" doctrine prioritizes surface control before subterranean entry, employing specialized units with robots and dogs to mitigate risks like collapses or chemical hazards.\n\nRockets form the standoff component of Hamas's arsenal, with over 3,000 launched in the October 7, 2023, barrage alone, followed by thousands more in sporadic salvos through 2025 to harass Israeli border communities and strain defenses. Primarily short-range Qassam or Grad variants—unguided, solid-fuel projectiles with ranges of 4–70 km and low accuracy (often deviating kilometers)—they carry 10–150 kg warheads but cause limited structural damage due to imprecise payloads. Launched from mobile or tunnel-hidden sites, they aim to overwhelm Israel's Iron Dome, which intercepts 85–90% of threats targeting populated areas by predicting trajectories and deploying Tamir missiles. Saturation tactics, including drones as decoys, occasionally saturate batteries, allowing impacts that killed dozens and injured hundreds in Israel since October 2023.\n\nIn asymmetric dynamics, tunnels and rockets synergize: subterranean routes conceal production and firing positions, enabling Hamas to sustain barrages despite Israeli airstrikes on surface launchers, while forcing the IDF into resource-intensive multi-domain operations. This approach prolongs the conflict by exploiting urban terrain for ambushes and human shields, though it incurs heavy Hamas losses—estimated at thousands of fighters—and limits offensive gains beyond terror. Israel's countermeasures, including preemptive mapping via seismic sensors and AI, have degraded capabilities but highlight the challenges of eradicating embedded irregular networks.\n## Casualties and verification challenges\n\n### Israeli military and civilian losses\n\nThe October 7, 2023, Hamas-led attack resulted in 1,139 deaths in Israel, comprising 695 Israeli civilians, 373 security personnel (including Israel Defense Forces soldiers and police), and 71 foreign nationals. These figures, compiled by Israeli authorities from forensic identification and eyewitness accounts, represent the vast majority of Israeli civilian losses in the war, with most victims killed in border communities through deliberate massacres, shootings, and abductions.\n\nSubsequent civilian deaths have been limited, primarily from rocket and drone attacks by Hamas, Palestinian Islamic Jihad, and Hezbollah. Iron Dome interceptions have mitigated most threats, resulting in fewer than 20 additional civilian fatalities from Gaza-launched rockets as of October 2025, including isolated direct hits on residential areas. Hezbollah rocket barrages in northern Israel caused around 40 civilian deaths, prompting mass evacuations of over 60,000 residents from border areas. These losses underscore the effectiveness of Israeli air defenses while highlighting vulnerabilities in multi-front engagements.\n\nIsraeli military losses total approximately 913 Israel Defense Forces (IDF) personnel killed as of October 2025, encompassing combat deaths across Gaza, Lebanon, and other fronts. Of these, 466 occurred during ground operations in Gaza since October 27, 2023, often in close-quarters fighting involving ambushes, booby-trapped structures, and Hamas tunnel networks. An additional 250-300 IDF fatalities stemmed from the October 7 border breaches, with the remainder from Hezbollah clashes and sporadic West Bank incidents. The IDF reports over 5,000 soldiers wounded, with many suffering severe injuries from improvised explosive devices and anti-tank missiles. These numbers, drawn from official IDF announcements and verified by name listings, reflect the intensity of urban warfare against entrenched terrorists.\n\n### Palestinian combatant deaths and Hamas losses\n\nThe Israel Defense Forces (IDF) reported in January 2025 that it had killed nearly 20,000 Hamas fighters and other Palestinian terrorists since the onset of the war on October 7, 2023, though no subsequent official updates have been issued. Pre-war intelligence estimates placed Hamas's core military wing, the Izz ad-Din al-Qassam Brigades, at 25,000 to 30,000 fighters, with affiliated groups like Palestinian Islamic Jihad adding several thousand more, yielding a total combatant force of approximately 30,000 to 40,000. \n\nVerification of these figures remains challenging due to the asymmetry of the conflict, Hamas's embedding within civilian areas, and limited access for independent observers; the IDF bases its counts on intelligence assessments, confirmed identifications from strikes, captured documents, and interrogations of detainees. Among confirmed losses, the IDF eliminated key Hamas leadership, including Mohammed Deif, commander of the Qassam Brigades, in a July 2024 airstrike in Khan Yunis; Muhammad Sinwar, de facto head of the military wing, in May 2025; and numerous brigade and battalion commanders across Gaza's operational zones.  Hamas itself acknowledged the deaths of 16 senior political and military figures by January 2025, including several from its Gaza-based leadership cadre.\n\nClassified IDF intelligence data leaked in August 2025 indicated only 8,900 named terrorists from Hamas and Islamic Jihad killed or presumed dead by May 2025, suggesting public estimates may include unverified or probable casualties to account for operational fog and Hamas's decentralized structure. U.S. intelligence corroborated partial degradation, estimating 30-35% of Hamas's pre-war force eliminated by mid-2024, with subsequent recruitment offsetting some losses to maintain 12,000-23,000 active fighters by early 2025.  Despite these attrition rates, Hamas retained capacity for ambushes and sporadic rocket fire into late 2025, indicating incomplete dismantlement of its command networks and tunnel-based logistics. \n\n### Verification of Palestinian casualty figures\n\nAs of October 2025, the Gaza Health Ministry, controlled by Hamas, reported over 67,000 Palestinian fatalities in aggregate (combatants and civilians combined) since the war's inception. Israeli officials and independent analyses have contested these figures for potential inflation, citing errors including natural deaths, pre-war fatalities, and a failure to distinguish combatants from civilians. However, Action on Armed Violence and statistical analysts have disputed these findings, arguing that the cited discrepancies are consistent with random clerical errors typical of war zones rather than systematic fabrication. Conversely, independent studies such as a January 2025 analysis in The Lancet have estimated around 40% underreporting of traumatic injury deaths up to mid-2024 due to unidentified bodies and rubble.02678-3/fulltext) A UN analysis of a large sample of verified fatalities found that 70% were women and children, serving as a proxy for civilian proportions. This defines children as those under 18, a demographic comprising nearly half (47%) of Gaza's population.\n\n### Palestinian civilian casualties and attribution of responsibility\n\nVerification challenges notwithstanding, the IDF estimated eliminating nearly 20,000 Hamas and affiliated terrorists by January 2025, representing a substantial portion of the group's estimated 30,000-40,000 fighters, though updated combatant kill counts have not been publicly detailed since. Leaked IDF intelligence data from May 2025 identified around 8,900 confirmed or probable terrorists among the then-reported total deaths, suggesting a civilian-to-combatant ratio of approximately 5:1, though such assessments face real-time verification difficulties amid urban combat. Studies of fatality demographics indicate a rising share of fighting-age males (ages 15-45), consistent with combatant involvement.\n\nA primary driver of civilian casualties has been Hamas's deliberate integration of military assets into densely populated civilian sites, including command centers under hospitals, rocket launchers in schools, and tunnels beneath residential zones, tactics amounting to the use of human shields prohibited under international humanitarian law. Hamas officials have publicly endorsed this approach since assuming control of Gaza in 2007, arguing it deters Israeli operations by raising collateral death prospects, with evidence including videos of rockets fired from urban neighborhoods and weapons caches recovered from civilian buildings. This embedding elevates civilian risk in retaliatory strikes, as Hamas fighters operate from areas housing over 2 million in one of the densest urban environments, often rejecting evacuation orders.\n\nIsrael's responses, while causing verified civilian losses from airstrikes and ground operations, incorporate mitigation protocols such as pre-strike warnings via leaflets, calls, and \"knock on the roof\" munitions, alongside precision-guided bombs to limit blast radii, yielding a civilian casualty ratio lower than historical urban warfare averages (typically 6:1 to 9:1).  Attributions emphasize Hamas's initiation via October 7 attacks killing 1,200 Israelis and refusal to separate military from civilian spheres, creating a causal chain where civilian deaths serve Hamas's narrative of victimhood for international pressure. Israeli actions align with military necessity and proportionality given existential threats from Hamas's charter-mandated aim of Israel's destruction.\n\n### Hostage situation and recovery efforts\n\nOn October 7, 2023, Hamas-led terrorists abducted 251 individuals from Israeli communities and a music festival near the Gaza border, including civilians, soldiers, women, children, and foreign nationals, transporting them into Gaza as bargaining leverage amid the attack that killed approximately 1,200 people.\n\nThroughout the conflict, recovery efforts combined military operations, negotiations, and prisoner exchanges. In a November 2023 truce, Hamas released 105 civilian hostages, primarily women and children, in exchange for Israel freeing about 240 Palestinian prisoners. The Israel Defense Forces (IDF) conducted several high-risk raids, rescuing eight hostages by December 2023 and additional individuals in operations such as the August 2024 extraction of Kaid Farhan Elkadi from southern Gaza and a June 2024 mission freeing four from Nuseirat. These rescues often involved intelligence-driven assaults on Hamas-held sites, though some operations resulted in hostage deaths due to crossfire or prior execution by captors.\n\nAt least 85 hostages were confirmed killed, either during the initial abduction, by Hamas execution, or in captivity, with their bodies frequently withheld by the group to prolong negotiations. Israel recovered some remains through combat operations or partial deals, identifying over a dozen deceased by late 2024. Hamas has asserted that Gaza's destruction from Israeli strikes complicates body retrieval, a claim Israel disputes as pretextual delay tactics.\n\nIn October 2025, a U.S.-brokered ceasefire agreement prompted Hamas to release the remaining 20 living hostages on October 13, after 738 days in captivity, in exchange for Israeli prisoner releases and phased withdrawals. This deal also facilitated the handover of 15 deceased hostages' bodies by Hamas, though 13 remain unrecovered, including those of 11 Israelis and two foreigners buried under rubble or in inaccessible areas.\n\nPost-release efforts for the outstanding bodies involve coordinated searches, with Israel permitting Red Cross and Egyptian teams access to IDF-controlled Gaza zones starting October 26, 2025, alongside specialized equipment to locate remains amid contested terrain. Hamas has returned bodies incrementally under truce terms—exchanging one for 15 Palestinian remains—but delays persist, prompting Israeli threats of renewed action if compliance falters. These negotiations underscore Hamas's strategy of using captives to extract concessions, while Israel's multifaceted approach prioritized both force and diplomacy to minimize further losses.\n## Humanitarian and economic impacts\n\n### Gaza's humanitarian crisis and aid delivery\n\n#### Causes of the crisis\n\nThe humanitarian crisis in Gaza escalated following Hamas's October 7, 2023, attack on Israel, which initiated large-scale combat operations by the Israel Defense Forces (IDF) aimed at dismantling Hamas's military capabilities. This has resulted in approximately 1.9 million Palestinians—90% of Gaza's 2.1 million population—being internally displaced, often multiple times, with over 533,000 displacement movements recorded since the October 10, 2025, ceasefire alone. The crisis manifests in acute shortages of food, potable water, electricity, and medical care, alongside the collapse of sanitation systems, leading to disease outbreaks and famine risks in isolated areas.\n\nPrimary causes trace to the integration of Hamas's military infrastructure—such as command centers, rocket launchers, and tunnels—within civilian zones, which exposes non-combatants to IDF strikes targeting those assets and elevates collateral damage during ground operations. This tactical embedding, a longstanding Hamas doctrine, built upon pre-war governance conditions detailed in the subsection on \"Hamas ideology and governance in Gaza.\" Post-attack Israeli measures, including tightened border controls, fuel and electricity cutoffs, and restrictions on dual-use imports to deny Hamas resupply, further disrupted operations of power plants and desalination facilities. Over half of Gaza's water and sanitation sites, including key desalination plants, sustained damage from combat, exacerbating sewage overflows and contamination as treatment plants shut down without fuel or power.\n\n#### Aid inflows and facilitation\n\nAid delivery to Gaza has been primarily channeled through land crossings under Israeli control, such as Kerem Shalom and Rafah (via Egypt), where trucks undergo rigorous security inspections to prevent the smuggling of weapons, explosives, or dual-use materials that could benefit Hamas. Mitigation efforts center on coordinated aid facilitation by Israel's Coordinator of Government Activities in the Territories (COGAT), which enabled entry of 66,474 trucks carrying 1.3 million tons of supplies from October 7, 2023, to January 18, 2025, surpassing pre-war monthly averages after initial security adjustments. Israel opened evacuation and aid corridors, such as the Salah al-Din Road route on November 5, 2023, and designated secure convoy paths with daily operational windows post-July 2025. Following the October 2025 ceasefire, daily aid inflows rose to an average of 89-94 trucks, though volumes remain below UN targets. Israeli inspections at crossings prioritize preventing misuse of aid for military purposes. Delays at inspection sites—often lasting days—stem from the need to scan for prohibited items, a measure Israel deems essential given Hamas's history of embedding military infrastructure in civilian areas. For details on Hamas's governance and resource allocation priorities, see \"Hamas ideology and governance in Gaza\". Aid organizations, including over 100 NGOs, have reported that new Israeli authorization requirements introduced in August 2025 further restricted entry of critical supplies like medical equipment and shelter materials deemed unauthorized. This volume represented a fraction of pre-war daily averages exceeding 500 trucks, coordinated by the UN's Logistics Cluster.\n\n#### Distribution obstacles\n\nInside Gaza, distribution encounters severe impediments from widespread infrastructure destruction, impassable roads due to rubble and ongoing skirmishes. Internal challenges, including looting, Hamas oversight of logistics, and security risks from terrorist activity, hinder effective reach. UN data notes recurring security incidents, such as armed looting en route to destinations, exacerbating shortages in northern Gaza where access remains limited. A July 2025 U.S. Agency for International Development (USAID) internal review found no evidence of widespread or systematic theft of U.S.-funded aid by Hamas, attributing most losses to general looting by armed groups amid chaos rather than organized capture.\n\n#### International assistance mechanisms\n\nInternational efforts have supplemented land routes with alternative mechanisms, including airdrops initiated by the U.S., Jordan, UAE, and France in early 2024—totaling hundreds of sorties but criticized as inefficient for large-scale needs—and resumed in July-August 2025 by Israel and Germany to bypass ground risks. Maritime initiatives, such as the EU's Cyprus-to-Gaza corridor launched in March 2024 and a short-lived U.S. floating pier (JLOTS) in 2024, aimed to deliver bulk aid but faced operational challenges like weather disruptions and onshore distribution failures, delivering far less than land convoys. Funding streams include Qatar's provision of over $1 billion in Gaza support since 2014—routed with Israeli coordination but effectively sustaining Hamas governance—and EU emergency allocations, such as €50 million added in September 2025 for UN and NGO partners. The U.S. has channeled humanitarian assistance through agencies like the World Food Programme, though overall inflows remain constrained by the same security and governance issues impeding effective reach to civilians.\n\n### Israel's internal displacements and economic costs\n\nFollowing the Hamas invasion on October 7, 2023, Israeli authorities ordered the evacuation of approximately 120,000 residents from 28 southern communities within 7 kilometers of the Gaza border, including kibbutzim and towns like Sderot and Netivot, due to ongoing rocket fire and infiltration risks. Escalating Hezbollah rocket and drone attacks from Lebanon, beginning in solidarity with Hamas, led to the evacuation of over 60,000 residents from 22 northern communities near the border, such as Metula and Kiryat Shmona, starting in October 2023 and intensifying through 2024. At the conflict's peak in late 2023 and early 2024, these measures displaced more than 180,000 Israelis in total, with many housed in hotels, temporary shelters, or with relatives, straining national resources for compensation and relocation support. By mid-2025, partial returns had occurred—particularly in the north following reduced Hezbollah activity—with about 74% of northern evacuees resettling, though around 90,000 remained displaced nationwide as of June 2024, facing psychological trauma, property damage, and barriers to reconstruction amid persistent threats.\n\nThe economic toll on Israel has been substantial, driven by heightened defense expenditures, workforce disruptions from mass reservist mobilization, and contractions in key sectors. The initial call-up of 360,000 reservists—about 8% of the workforce—disrupted businesses, agriculture, and high-tech industries, contributing to labor shortages and a 2% GDP contraction in the final quarter of 2023. Direct war-related costs, including military operations, civilian compensation, and infrastructure repairs, reached NIS 170 billion (approximately $46 billion) from October 2023 to the end of 2024, per Bank of Israel projections, with cumulative estimates climbing to NIS 250-300 billion ($67-88 billion) by mid-2025. Defense spending surged over 50% since October 2023, with projections for an average of around 11% of GDP annually through the decade, financed partly through budget deficits that expanded from 1.5% of GDP in 2023 to 7.7% by late 2024 and a targeted 5.2% for 2025 after a NIS 30 billion ($9 billion) budget increase.\n\nIndirect impacts compounded these burdens: tourism plummeted by over 80% in 2023-2024 due to security concerns, construction halted in evacuated zones affecting 10% of national output, and consumer confidence eroded, though tech exports provided resilience with GDP growth projected at 1-2% for 2025 amid ongoing strains. Overall, the Bank of Israel estimated total war costs for 2023-2025 at $55.6 billion, equivalent to roughly 10% of annual GDP, with long-term projections reaching $400 billion over the decade including debt servicing and opportunity costs. These expenditures, necessitated by sustained asymmetric threats from Hamas rockets and Hezbollah precision strikes, have elevated Israel's public debt-to-GDP ratio while prioritizing national security over pre-war fiscal expansions.\n## Legal proceedings and war crimes allegations\n\n### Hamas violations: October 7 crimes against humanity\n\nOn October 7, 2023, Hamas, alongside allied Palestinian armed groups including Palestinian Islamic Jihad, initiated a multi-pronged assault on southern Israel, breaching the Gaza-Israel barrier at over 100 points using bulldozers, explosives, motorcycles, paragliders, and speedboats, while firing thousands of rockets toward civilian areas. The attackers targeted residential communities such as Kibbutz Be'eri, Kibbutz Kfar Aza, and the town of Sderot, as well as the Supernova music festival near Kibbutz Re'im, where non-combatants were attending. This operation, dubbed \"Al-Aqsa Flood\" by Hamas, involved deliberate incursions into civilian spaces, resulting in the deaths of approximately 1,200 individuals, including around 800 civilians and foreign nationals, with the remainder comprising soldiers and security personnel killed in combat or ambushes.\n\nThe assailants systematically targeted non-combatants, executing summary killings through gunfire at close range, grenades, and knives, often after binding victims or herding them into safe rooms before setting structures ablaze. Evidence from forensic examinations revealed mutilated bodies, including instances of decapitation and burns consistent with arson on living individuals or corpses, as documented in Israeli morgues and verified by international observers. Over 250 civilians and soldiers were abducted and transported to Gaza, including women, children, and the elderly, with captives subjected to torture, starvation, and sexual violence in some cases during transit and captivity. A United Nations mission led by Pramila Patten, Special Representative on Sexual Violence in Conflict, found reasonable grounds to believe that rape and gang rape occurred at multiple sites, including the Nova festival and Kibbutz Re'im, with \"convincing information\" of sexualized torture against hostages.\n\nThese acts constituted a widespread and systematic attack directed against Israel's civilian population, qualifying as crimes against humanity under the Rome Statute, including extermination, murder, persecution on national and ethnic grounds, and other inhumane acts intentionally causing great suffering. International Criminal Court Prosecutor Karim Khan applied for arrest warrants in May 2024 against Hamas leaders Yahya Sinwar, Mohammed Deif, and Ismail Haniyeh, citing their command responsibility for war crimes such as willful killing, torture, and rape, as well as the crimes against humanity outlined above; warrants were subsequently issued for Deif and others amid ongoing proceedings. Human Rights Watch independently documented murder and wrongful imprisonment as crimes against humanity, alongside war crimes like intentional attacks on civilians and hostage-taking, based on witness testimonies, videos released by the perpetrators, and forensic evidence. Hamas's own broadcasts and captured documents indicated premeditated intent to maximize civilian terror, rejecting distinctions between combatants and non-combatants.\n\n### Allegations against Israel: proportionality and civilian harm\n\nCritics, including human rights organizations such as Human Rights Watch and Amnesty International, have alleged that Israel's military operations in Gaza violate the principle of proportionality under international humanitarian law (IHL), which requires that anticipated civilian harm not be excessive in relation to the concrete military advantage expected from an attack. These claims often reference the high reported death toll in Gaza, with the Gaza Health Ministry stating over 71,200 total deaths as of October 22, 2025 (see \"Casualties and verification challenges\" for analysis of these figures).\n\nIsrael's defenders, including legal experts and the Israel Defense Forces (IDF), counter that proportionality is evaluated on a case-by-case basis for each strike, not in aggregate, and that Hamas's deliberate embedding of military assets in densely populated civilian areas—such as tunnels under hospitals like Al-Shifa and command centers in schools—inevitably increases collateral risks while shifting moral responsibility for civilian harm to Hamas. The IDF has reported eliminating over 17,000 terrorists by mid-2024, using precision-guided munitions, evacuation warnings via phone calls, leaflets, and \"roof-knocking\" munitions in thousands of operations to mitigate harm, with internal assessments claiming compliance with IHL thresholds where military gains, such as degrading Hamas rocket capabilities or leadership, outweighed expected losses. Independent analyses, including from the U.S. government, have acknowledged that while civilian casualties remain tragically high, they align with urban warfare patterns against an enemy employing human shields, as evidenced by IDF-released footage of Hamas fighters operating from civilian sites.\n\nSpecific incidents fueling allegations include the October 17, 2023, Al-Ahli Arab Hospital explosion, initially blamed on Israel but later attributed by U.S. and Israeli intelligence to a misfired Palestinian Islamic Jihad rocket, highlighting challenges in attribution amid Hamas-controlled information flows. Similarly, strikes on UNRWA facilities and apartment blocks have been cited as disproportionate by UN reports, yet investigations revealed Hamas munitions storage and operational use in many cases, complicating claims of indiscriminate targeting. Critics from outlets like the BBC have pointed to individual strikes, such as one in September 2024 killing civilians near a targeted terrorist, as evidence of insufficient precautions, though the IDF emphasized prior mitigation efforts and the military necessity of neutralizing imminent threats. These debates underscore broader concerns over IHL application in asymmetric urban conflicts, where Hamas's tactics—documented in prior Gaza wars and corroborated by captured documents—prioritize civilian endangerment to amplify international pressure on Israel.\n\n### International Court of Justice genocide case against Israel\n\nSouth Africa instituted proceedings against Israel at the International Court of Justice (ICJ) on December 29, 2023, alleging that Israel's military operations in Gaza following the October 7, 2023, Hamas attacks constituted violations of the 1948 Genocide Convention, including acts committed with intent to destroy, in whole or in part, the Palestinian group in Gaza.  South Africa's application cited statements by Israeli officials as evidence of genocidal intent and claimed Israel's actions, such as bombings and restrictions on aid, demonstrated genocidal conduct, though the ICJ has not ruled on the merits of these allegations.\n\nOral hearings on South Africa's request for provisional measures occurred on January 11 and 12, 2024. On January 26, 2024, the ICJ issued an order by majority votes (e.g., 16-1 to indicate measures) finding it plausible that Palestinians in Gaza had rights under the Genocide Convention at stake and ordering Israel to: take all measures within its power to prevent acts of genocide; prevent and punish direct and public incitement to genocide; enable provision of urgently needed humanitarian aid without impediment; ensure preservation of evidence related to genocide allegations; and report on compliance within one month. The court did not order a halt to military operations, emphasizing that provisional measures address irreparable harm without prejudging the case's merits, where proving specific genocidal intent remains required.\n\nSubsequent orders followed South Africa's requests for modification. On March 28, 2024, the ICJ rejected a request to order a ceasefire but reaffirmed the January measures, noting the worsening situation in Gaza. On May 24, 2024, amid Israel's Rafah operations, the court by 13-2 votes reaffirmed prior measures and unanimously ordered Israel to keep the Rafah crossing open for aid, unhindered provision of basic services and assistance, while halting military actions that could inflict conditions leading to physical destruction of Palestinians. Israel has submitted compliance reports, asserting efforts to minimize civilian harm, target only Hamas terrorists, and facilitate aid despite Hamas's alleged diversion and use of human shields.\n\nIsrael rejected the genocide allegations as \"baseless\" and \"morally repugnant\" in a December 6, 2023, foreign ministry statement, arguing its actions constitute lawful self-defense under Article 51 of the UN Charter against Hamas's October 7 attacks, which killed 1,200 Israelis and took 250 hostages, with no intent to destroy Palestinians as a group but rather to dismantle Hamas infrastructure embedded among civilians (see \"Casualties and verification challenges\" for analysis of casualty figures). Israel estimates over 14,000 Hamas fighters killed as of mid-2024.\n\nCritics, including legal scholars and Israeli officials, have questioned the case's foundation, noting the ICJ's reliance on contested evidence without adversarial fact-finding at the provisional stage and potential institutional bias, such as judges with records of anti-Israel positions (e.g., ICJ President Nawaf Salam's past statements equating Israeli actions with terrorism).  The proceedings ignore Hamas's genocidal charter and October 7 atrocities, which South Africa initially condemned but later contextualized, raising concerns of politicization over jurisprudence; the ICJ has no enforcement mechanism, and non-compliance risks diplomatic isolation rather than direct sanctions.\n\nThe case remains in early stages, with written pleadings ongoing; Israel's counter-memorial deadline was extended to March 12, 2026. Interventions under Article 63 have been filed by Türkiye, with others like Brazil considering participation, potentially broadening the dispute to test interpretations of the Genocide Convention. No final ruling on genocide has been issued, as such requires establishing dolus specialis (specific intent) beyond provisional plausibility.\n\n### International Criminal Court investigations\n\nOn May 20, 2024, ICC Prosecutor Karim A.A. Khan announced applications for arrest warrants against three Hamas leaders—Yahya Sinwar, Mohammed Deif (Mohammed Diab Ibrahim Al-Masri), and Ismail Haniyeh—for war crimes and crimes against humanity committed during the October 7, 2023, attacks on Israel, including murder as a crime against humanity, extermination, torture, rape, and other forms of sexual violence, as well as taking hostages and intentionally directing attacks against civilians. Khan's application cited evidence that these acts formed part of a systematic attack against Israel's civilian population, resulting in approximately 1,200 deaths and over 250 abductions. Separately, the same applications targeted Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant for alleged war crimes (including starvation of civilians as a method of warfare and intentionally directing attacks against civilian populations) and crimes against humanity (extermination and persecution), purportedly linked to Israel's military operations in Gaza following October 7, which Khan claimed intentionally deprived civilians of essentials like food, water, and medical supplies from October 2023 onward.\n\nThe ICC's jurisdiction in the \"Situation in the State of Palestine\" stems from Palestine's 2015 accession to the Rome Statute, which the Court interprets as covering Gaza, the West Bank, and East Jerusalem since June 13, 2014; however, Israel, a non-party to the Statute, has consistently rejected this, arguing the ICC lacks authority over its nationals and that Palestine does not qualify as a state capable of conferring jurisdiction, while emphasizing its own domestic investigations as fulfilling complementarity requirements. On November 21, 2024, Pre-Trial Chamber I rejected Israel's challenges under Articles 17, 18, and 19 of the Rome Statute, affirming jurisdiction and issuing warrants for Netanyahu, Gallant, and Deif (with prior applications for Sinwar and Haniyeh noted, though both were killed by Israeli operations in October 2024 and July 2024, respectively, and Deif reportedly in July 2024). The Chamber found reasonable grounds for the charges, requiring 124 Rome Statute states parties to arrest and surrender the named individuals if encountered.\n\nIsrael denounced the warrants as antisemitic and illegitimate, asserting they equate deliberate terrorist atrocities with lawful self-defense against an existential threat, and vowed non-cooperation; Netanyahu called the decision a \"black day in the history of nations.\" The United States, also a non-party, condemned the move as \"outrageous,\" with President Biden stating it drew false equivalence between Hamas's barbarism and Israel's actions, potentially undermining U.S.-ICC relations further amid prior sanctions threats. Critics, including legal scholars, have questioned the ICC's selective focus and jurisdictional overreach, noting its history of investigations disproportionately targeting Israel compared to other conflicts and reliance on potentially biased Palestinian sources without equivalent scrutiny of Hamas's use of human shields or diversion of aid, which causal analysis suggests exacerbates civilian risks more than Israeli policies alone. On October 17, 2025, Pre-Trial Chamber I rejected Israel's further request to withdraw the warrants, and on October 18, 2025, dismissed an appeal, maintaining their validity despite ongoing Israeli evidentiary submissions on domestic probes.\n\nAs of October 2025, no arrests have occurred, with warrants complicating travel for Netanyahu and Gallant to states parties; Hamas has rejected the process outright, viewing it as insufficiently addressing alleged Israeli crimes. The investigation continues under Khan, who has emphasized impartiality but faced accusations of political motivation, including reports of external pressures to drop Israeli cases. Empirical data on Gaza casualties—over 43,000 reported deaths by mid-2025, per Gaza Health Ministry figures (see \"Casualties and verification challenges\" for analysis)—remains contested in supporting proportionality claims, underscoring challenges in attributing responsibility amid Hamas's embedded military tactics.\n## International involvement and reactions\n\n### United States military and diplomatic support\n\nFollowing the Hamas attacks on October 7, 2023, President Joe Biden affirmed Israel's right to self-defense and deployed the USS Gerald R. Ford carrier strike group to the eastern Mediterranean Sea on October 8, 2023, to deter regional escalation. On October 14, 2023, the Pentagon ordered a second carrier, the USS Dwight D. Eisenhower, along with additional Air Force fighter jets, to the region as Israel prepared a ground operation in Gaza. These deployments were extended multiple times, with the Ford remaining until at least December 2023, contributing to a sustained U.S. naval presence amid threats from Iran-backed groups. By mid-2025, U.S. carrier operations in the Middle East accounted for significant steaming days, reflecting ongoing commitments tied to the conflict.\n\nThe United States provided at least $21.7 billion in military aid to Israel from October 7, 2023, through September 2025, encompassing direct appropriations, arms transfers, and drawdowns from U.S. stockpiles. This included $16.3 billion in legislated direct military assistance, such as precision-guided munitions, artillery shells, and Iron Dome interceptors, with emergency transfers bypassing standard congressional review processes starting in October 2023. Specific shipments involved over 14,000 MK-84 2,000-pound bombs and thousands of other munitions approved in early 2024, despite internal U.S. debates over their use in densely populated areas. Under the 2016 memorandum of understanding, baseline annual aid of $3.3 billion in Foreign Military Financing continued, supplemented by supplemental packages enacted in April 2024. Aid flowed across the Biden and incoming Trump administrations, prioritizing Israel's defense against Hamas rocket fire and proxy threats.\n\nDiplomatically, the Biden administration vetoed multiple UN Security Council resolutions perceived as unbalanced, including one on October 18, 2023, calling for humanitarian pauses without condemning Hamas; another on December 8, 2023, demanding an immediate ceasefire; a February 20, 2024, measure for unconditional halt; and further vetoes in November 2024 and June 2025 rejecting unconditional ceasefires that omitted Hamas disarmament. U.S. officials argued these resolutions undermined Israel's security by failing to address Hamas's use of human shields and ongoing hostilities, while the U.S. separately facilitated limited aid corridors and hostage negotiations. Publicly, Biden urged Israel to minimize civilian casualties and improve aid access, though without conditioning aid on compliance, maintaining staunch opposition to Hamas governance in postwar Gaza.\n\n### Iran and proxy escalations (Hezbollah, Houthis)\n\nIran has leveraged its \"Axis of Resistance\" network, including Hezbollah in Lebanon and the Houthis in Yemen, to conduct attacks on Israel since the onset of the Hamas assault on October 7, 2023, with the intent of straining Israeli military resources across multiple fronts and compelling a halt to operations in Gaza. These proxies, armed and funded by Iran's Islamic Revolutionary Guard Corps (IRGC), have fired over 28,000 rockets, missiles, and drones toward Israel collectively since October 2023, though direct Iranian orchestration of the initial Hamas attack remains unproven. Iran's strategy emphasizes asymmetric warfare to avoid full-scale direct confrontation until escalations in 2024-2025 shifted dynamics toward open exchanges.\n\nHezbollah, Iran's most capable proxy with an estimated arsenal of 150,000 rockets pre-escalation, began firing Katyusha rockets and anti-tank missiles into northern Israel on October 8, 2023, explicitly in solidarity with Hamas. This initiated near-daily exchanges along the Israel-Lebanon border, displacing over 60,000 Israelis from communities like Kiryat Shmona and prompting limited Israeli ground incursions into southern Lebanon by late 2024. Israeli airstrikes targeted Hezbollah command structures, killing senior leaders such as Fuad Shukr in July 2024 and Ibrahim Aqil in September 2024, alongside an estimated 4,000-5,000 Hezbollah fighters by early 2025 according to Israeli assessments. Lebanese health authorities reported over 4,000 deaths in Lebanon from October 2023 to January 2025, predominantly combatants, with Israel suffering 50 military fatalities and 12 civilian deaths in the north. A fragile ceasefire took effect in November 2024, but sporadic violations persisted into October 2025, including Israeli strikes killing three in southern Lebanon on October 26.\n\nThe Houthis, another IRGC-backed group controlling much of Yemen, launched their first ballistic missile toward Israel on October 19, 2023, followed by drone and missile barrages intercepted by Israeli and U.S. defenses. From November 2023, they expanded to over 100 attacks on commercial shipping in the Red Sea and Gulf of Aden, targeting vessels with perceived Israeli links under the banner of enforcing a blockade on Israel in support of Gaza. These actions, totaling nearly 500 strikes on shipping and Israel by April 2025, forced rerouting of global trade around Africa, increasing shipping costs by up to 40% and prompting U.S.-led coalition airstrikes on Houthi sites starting January 2024. Following an Israel-Hamas ceasefire on January 19, 2025, the Houthis pledged to limit attacks to Israeli-linked targets but maintained a monitoring role, with renewed threats and incidents reported as late as September 2025, including strikes on ships and Israeli territory. No Houthi attacks have caused fatalities in Israel, but their maritime campaign has indirectly heightened economic pressures on Israel via disrupted supply chains.\n\nThese proxy campaigns, coordinated through IRGC Quds Force channels, have imposed multi-front burdens on Israel but also exposed vulnerabilities in the proxy network, with Hezbollah's degradation and Houthi isolation underscoring limits to Iran's deterrence strategy without risking broader war.\n\n### Arab states' positions and normalization efforts\n\nFollowing the October 7, 2023, Hamas attack on Israel, several Arab states issued statements condemning the violence while emphasizing the need to address Palestinian grievances, though their responses varied by regime stability and strategic interests. Egypt and Jordan, bound by longstanding peace treaties with Israel, publicly denounced the Hamas assault but criticized Israel's subsequent military operations in Gaza as disproportionate, with Egyptian President Abdel Fattah el-Sisi warning of regional escalation and Jordan's King Abdullah II calling for de-escalation to preserve stability. The United Arab Emirates (UAE) and Bahrain, Abraham Accords signatories, explicitly rejected the attacks as terrorism while maintaining diplomatic channels open, with UAE officials stressing that such actions undermined Palestinian aspirations. Morocco and Sudan echoed similar condemnations initially, though Sudan's fragile government limited its engagement amid internal conflicts.\n\nDespite vocal public criticisms of Israel's Gaza campaign—often highlighting civilian casualties and humanitarian crises—leaked U.S. documents revealed that key Arab states, including Jordan, Egypt, and Gulf monarchies, expanded military and intelligence cooperation with Israel during the war to counter shared threats like Iranian proxies. This pragmatic alignment persisted, driven by mutual interests in containing Iran and Islamist extremism, even as Arab League summits in 2023 and 2024 demanded ceasefires and aid corridors. Qatar, hosting Hamas's political leadership since 2012, adopted a distinct mediator role alongside Egypt and the U.S., facilitating hostage negotiations and truce talks, though it faced tensions after Israeli strikes on Hamas figures in Doha in September 2025.\n\nNormalization efforts under the Abraham Accords, formalized in 2020 between Israel, UAE, Bahrain, Morocco, and Sudan, demonstrated resilience amid the war, with bilateral trade and flights continuing—UAE-Israel commerce reached $2.6 billion in 2024 despite protests—though public sentiment soured and expansion stalled. Saudi Arabia suspended advanced normalization talks post-October 7, conditioning progress on a credible Palestinian state pathway and Gaza reconstruction, yet maintained covert security ties and participated in joint air defenses against Iranian drones in April 2024. By July 2025, Saudi Arabia, Qatar, and Egypt joined a rare joint statement urging Hamas to disarm and cede Gaza governance, signaling elite Arab consensus against Islamist militancy despite populist pressures. The October 8, 2025, U.S.-brokered ceasefire between Israel and Hamas revived cautious optimism for Saudi-Israeli ties, potentially tied to U.S. security guarantees, though dependent on post-war Gaza stability.\n\n### United Nations and NGO responses: biases and failures\n\nThe United Nations has faced criticism for systemic biases against Israel in its responses to the Israel-Hamas war, exemplified by disproportionate resolutions targeting Israel. In 2024, the UN General Assembly adopted 17 resolutions condemning Israel, compared to only six addressing the rest of the world combined, a pattern reflecting long-standing institutional asymmetries where Israel receives more scrutiny than countries with ongoing conflicts or human rights abuses elsewhere. The UN Human Rights Council has similarly convened multiple special sessions on Israel since October 2023, while downplaying Hamas's use of civilian infrastructure for military purposes, such as embedding command centers in hospitals and schools. UN Secretary-General António Guterres's October 2023 statement following the Hamas attacks, which noted the assault \"did not happen in a vacuum\" without immediate condemnation of Hamas's atrocities, was widely viewed as providing undue contextual equivocation that minimized the unprovoked nature of the assault.\n\nUNRWA, the UN agency responsible for Palestinian refugees, exhibited operational failures tied to Hamas infiltration, including direct involvement of its staff in the October 7, 2023, attacks. An internal UN investigation confirmed that nine UNRWA employees \"may have been involved\" in the Hamas-led assault, leading to their termination, while Israeli intelligence identified at least 12 UNRWA staff participating, including in hostage-taking and logistics.  Further evidence revealed UNRWA facilities used as Hamas weapon storage sites and tunnel entrances, with pre-war Israeli cooperation on aid symbiosis disrupted by these ties, raising questions about the agency's neutrality and effectiveness in preventing aid diversion to terrorists. These lapses contributed to failures in humanitarian delivery, as Hamas systematically looted supplies, yet UNRWA continued operations without robust vetting, perpetuating dependency and enabling belligerent reuse of resources.\n\nUN reporting on Gaza casualties has relied heavily on data from the Hamas-controlled Gaza Ministry of Health (GMO), leading to inflated and unverified figures that obscured combatant-civilian distinctions. The UN's Office for the Coordination of Humanitarian Affairs (OCHA) initially cited GMO statistics claiming over 14,500 child and 9,500 women deaths by May 2024, but later halved these estimates after revisions, highlighting methodological flaws including unidentified deaths and failure to account for Hamas's embedding of fighters among civilians.  Independent analyses have documented GMO's removal of thousands of names from lists and reliance on media reports rather than verified records, yet UN bodies persisted in amplifying these without cross-verification, contributing to skewed narratives of disproportionate harm.  This uncritical dependence, amid Hamas's documented policy of human shielding, represents a failure to apply rigorous evidentiary standards, eroding the UN's credibility in conflict assessment.\n\nNon-governmental organizations (NGOs) such as Human Rights Watch (HRW) and Amnesty International have mirrored UN shortcomings through selective reporting that emphasizes Israeli actions while minimizing Hamas's violations of international humanitarian law. HRW and Amnesty reports post-October 2023 often invoked genocide allegations against Israel without equivalent scrutiny of Hamas's deliberate targeting of civilians or use of prohibited weapons from populated areas, employing legal terminology to frame Israel's defensive operations as inherently disproportionate.  Amnesty's December 2023 analysis, for instance, focused on Gaza destruction while omitting Hamas's rocket fire from civilian zones, a tactic that foreseeably elevates casualty risks, and both organizations have rejected joint campaigns against Hamas indoctrination despite evidence of its role in perpetuating violence. Critics, including analyses of funding influences and historical patterns, attribute this to institutional biases favoring narratives aligned with certain donor priorities, resulting in a failure to advocate balanced accountability and instead amplifying unverified claims from Hamas-affiliated sources. Such distortions have hindered objective humanitarian advocacy, as NGOs prioritized advocacy against Israel over pressuring Hamas to release hostages or cease embedding operations in aid facilities.\n\n### European and global public opinion divides\n\nPublic opinion in Western Europe regarding the Israel–Hamas war has exhibited stark divisions, with favorability toward Israel reaching historic lows by mid-2025. A YouGov survey across six countries (Denmark, France, Germany, Great Britain, Italy, and Sweden) conducted in May 2025 found that only 13% to 21% of respondents held favorable views of Israel, while 63% to 70% viewed it unfavorably; approval of Israel's military response in Gaza ranged from 6% to 16%. In the United Kingdom, a YouGov poll in October 2025 indicated that a record share of Britons deemed Israel's actions in Gaza unjustified, up six percentage points from prior surveys. Similarly, a July 2025 poll in Germany showed 74% of respondents favoring a tougher governmental stance toward Israel amid the conflict. These sentiments contrast with official European Union positions, which have largely affirmed Israel's right to self-defense while calling for humanitarian pauses, highlighting a gap between elite consensus and public mood influenced by reports of civilian casualties in Gaza.\n\nPro-Palestinian demonstrations across Europe have underscored these divides, drawing massive crowds despite bans or restrictions in some cities. In October 2025, organizers estimated 250,000 participants in Rome for protests supporting Palestinians and condemning Israel's interception of a Gaza-bound aid flotilla, a figure corroborated by police; comparable turnouts occurred in Amsterdam and other capitals like Madrid and Barcelona, with tens of thousands marching under Palestinian flags. Such events, recurring since October 2023, have been driven by leftist groups, Muslim communities, and youth activists, often featuring chants against Israeli actions, though they have occasionally included antisemitic rhetoric prompting police interventions. Counter-protests in support of Israel have been smaller and less frequent, reflecting minority pro-Israel sentiment among Jewish communities and conservative factions.\n\nGlobally, views of Israel have deteriorated, particularly in the United States, where partisan and generational cleavages have intensified. A Pew Research Center survey in October 2025 revealed that 39% of Americans believed Israel was exceeding bounds in its operations against Hamas, a rise from 27% in late 2023; a Gallup poll in July 2025 pegged approval of Israel's military actions at a record low of 32%. Younger Americans under 30 showed pronounced sympathy for Palestinians, with only 16% favoring U.S. military aid to Israel per a 2024 Pew analysis, compared to 56% among those 65 and older; an August 2025 poll indicated 60% of 18- to 24-year-olds tilting toward Hamas over Israel. Republicans maintained higher support for Israel (83% positive per Gallup), while Democrats' favorable views dropped to 40% or below. In 24 countries surveyed by Pew in spring 2025, majorities expressed negative opinions of Israel and its leadership, with sharper hostility in regions like Latin America and parts of Asia; Muslim-majority nations exhibited near-universal condemnation of Israel's campaign, framing it as disproportionate aggression. These global fissures, amplified by social media and varying media coverage, have strained alliances and fueled debates over aid, boycotts, and cease-fire terms.\n\n## Aftermath and ongoing implications\n\n### Destruction of Hamas infrastructure and leadership\n\nIsraeli Defense Forces (IDF) operations have focused on dismantling Hamas's extensive underground tunnel network, which served as a primary enabler for terrorist mobility, storage of weapons, and command operations. By October 2024, the IDF reported discovering 4,700 tunnel shafts and destroying segments totaling hundreds of kilometers, though assessments indicate residual tunnels remain a significant threat as of October 2025. Specialized units, including Yahalom engineering troops, employed flooding, explosives, and direct breaches to neutralize these structures, often located beneath civilian sites such as hospitals and UN facilities repurposed by Hamas for military use.\n\nAirstrikes and ground raids have targeted over 40,000 Hamas-linked sites since October 2023, including more than 1,000 rocket launchers, weapons caches, and observation posts. In 2024-2025 operations, such as those in Gaza City and Rafah, IDF forces uncovered and destroyed rocket storehouses, sniper positions, and operational tunnels embedded in buildings, with divisions like the 143rd and 36th leading efforts to expand tunnel hunts and neutralize launch infrastructure. These actions have degraded Hamas's ability to sustain rocket barrages, reducing launch capacity from thousands in late 2023 to sporadic firing by mid-2025.\n\nThe campaign has also eliminated key Hamas leadership, disrupting operational command. Yahya Sinwar, Gaza leader and planner of the October 7, 2023, attacks, was killed by IDF ground forces in Rafah on October 16, 2024. Ismail Haniyeh, Hamas's political chief, was assassinated in Tehran on July 31, 2024. Mohammad Sinwar, brother of Yahya and a senior military figure, was confirmed killed by September 2025. These losses, alongside the deaths of mid-level commanders like Mohammed Deif (military wing head, killed July 13, 2024), have hollowed out Hamas's top echelons, with IDF estimates indicating over 20,000 combatants eliminated by March 2025.\n\nDespite these gains, Hamas has adapted by dispersing operations and leveraging surviving infrastructure, maintaining limited governance and retaliatory capacity into late 2025, underscoring the challenges of fully eradicating a deeply entrenched terrorist network.\n\n### Prospects for Gaza reconstruction and governance\n\nFollowing the ceasefire agreement reached on October 8, 2025, between Israel and Hamas under a U.S.-brokered proposal, prospects for Gaza's reconstruction hinge on demilitarization, deradicalization, and international funding tied to governance reforms that prevent Hamas resurgence.  The territory faces extensive destruction from two years of conflict, with assessments indicating over 60 million tonnes of debris, including unexploded ordnance, requiring up to a decade for clearance alone at an estimated $1.2 billion cost.  Structural damage affects more than 80% of buildings, with around 300,000 housing units destroyed or damaged, alongside shattered infrastructure for water, electricity, and sanitation. \n\nReconstruction costs are projected at $70 billion by joint UN, World Bank, and EU assessments, revised upward from $53 billion earlier in 2025, encompassing not only physical rebuilding but also economic revitalization to address 90% population displacement and extreme deprivation.   Full recovery could span decades, with European, Arab, Canadian, and U.S. pledges contingent on mechanisms to ensure aid avoids diversion to terrorists, as occurred under prior Hamas rule where funds fueled tunnels and rockets rather than civilian needs.  Proposals emphasize phased economic development, including a technocratic administration and international oversight to \"rebuild and energize\" Gaza, but implementation falters without verifiable Hamas disarmament. \n\nGovernance remains contested, with U.S. President Trump's 20-point plan outlining a reformed Palestinian Authority (PA) role in administration and security post-demilitarization, excluding Hamas and UNRWA due to their histories of aid misuse and incitement.  Israel insists on overriding security control to avert future attacks, rejecting full PA handover without reforms addressing the Authority's corruption—perceived by 87% of Palestinians as systemic—and ineffectiveness that enabled Hamas's 2006 electoral gains and 2007 takeover.  Hamas, despite tentative plan acceptance, seeks to retain security influence and has appointed pro-group figures to a proposed technocratic government, refusing full disarmament amid fears of Israeli re-entry.  \n\nAlternative international ideas, such as a Gaza International Transitional Authority led by figures like Tony Blair, aim for interim non-Palestinian oversight to sideline both Hamas remnants and the discredited PA, but face criticism for fragmenting Palestinian unity and lacking local buy-in.  The PA's own $67 billion five-year plan envisions its dominance, yet public distrust—fueled by corruption, expired leadership mandates, and failure to counter Hamas—undermines viability, with 78% of Palestinians demanding President Abbas's resignation.   Without addressing these, reconstruction risks repeating cycles where aid bolsters militancy, as Hamas's retention of weapons and ideology perpetuates instability despite economic incentives.  Israel's position prioritizes preventing asymmetric threats through buffer zones and vetting, essential for sustainable rebuilding given Hamas's foundational charter advocating Israel's destruction. \n\n### Broader regional security dynamics\n\nThe Israel-Hamas war prompted escalations involving Iran's proxy militias, forming a multi-front challenge to Israeli security while testing the resilience of regional alliances. Hezbollah initiated cross-border attacks from Lebanon starting October 8, 2023, in solidarity with Hamas, firing over 1,700 rockets by early 2025 and resulting in 15 Israeli civilian deaths and more than 150 injuries. Israeli responses inflicted heavy losses on Hezbollah, with the group estimating up to 4,000 fighters killed by late 2024, alongside the elimination of senior commanders like Fuad Shukr and Ibrahim Aqil. These clashes remained largely limited to northern border areas, avoiding a full-scale invasion despite Hezbollah's threats, as the group calibrated actions to signal support for Hamas without triggering broader war.\n\nIn Yemen, Houthi forces began targeting commercial shipping in the Red Sea from November 2023, claiming solidarity with Gaza by attacking vessels linked to Israel or its allies, disrupting 22-23% of global maritime trade and forcing rerouting around Africa, which increased shipping costs and delays. By mid-2025, the Houthis had conducted over 100 attacks using missiles and drones, sinking ships and prompting U.S.-led naval coalitions to intercept threats, though insurance premiums for Red Sea voyages more than doubled amid ongoing risks. Iranian-supplied weaponry enabled these operations, but coalition strikes degraded Houthi capabilities without halting their campaign, highlighting vulnerabilities in Iran's \"axis of resistance\" strategy.\n\nIran escalated directly against Israel in 2024, launching approximately 300 drones and missiles in April following an Israeli strike on its Damascus consulate, and 180-200 ballistic missiles in October after assassinations of Hamas leader Ismail Haniyeh and Hezbollah's Fuad Shukr. Both barrages were largely intercepted by Israeli and U.S.-allied defenses, causing minimal damage but exposing limitations in Iran's offensive reach and air defenses. These actions, framed by Tehran as retaliation tied to the Gaza conflict, strained its proxy network amid internal economic pressures and losses in Lebanon and Yemen, weakening overall regional deterrence.\n\nThe war reinforced anti-Iran alignments among Sunni Arab states, with the Abraham Accords—normalizing ties between Israel and the UAE, Bahrain, Morocco, and Sudan—proving resilient despite public protests over Gaza. Security cooperation persisted, including intelligence sharing against Iranian threats, though diplomatic expansions stalled and Saudi normalization talks paused amid the violence. This dynamic underscored a causal shift: Israel's targeted degradation of proxy capabilities diminished Iran's forward posture, bolstering deterrence against multi-axis aggression while exposing fractures in Tehran's influence over non-state actors.\n\n### Lessons on deterrence and intelligence\n\nThe October 7, 2023, Hamas attack exposed fundamental flaws in Israel's deterrence strategy against non-state actors driven by ideological extremism, as Hamas leaders prioritized offensive jihad and martyrdom over self-preservation, rendering punitive measures insufficient to prevent escalation. Prior operations, such as the 2021 Guardian of the Walls campaign, inflicted heavy losses on Hamas—killing over 250 fighters and destroying infrastructure—yet failed to deter rebuilding, with Hamas amassing 3,000 rockets and training forces undetected, demonstrating that \"cumulative deterrence\" assumes a rational cost-benefit calculus absent in groups viewing paradise as reward for dying in attack. Experts argue this miscalculation stemmed from Israel's overconfidence in economic incentives and border barriers, like the Gaza fence completed in 2021, which Hamas breached using bulldozers and explosives in under an hour, underscoring that passive containment invites deception and adaptation by committed adversaries.\n\nA core lesson is the limits of deterrence-by-denial against entities like Hamas, where tactical innovations—such as paragliders, motorcycles, and simulated drills dismissed as routine—bypassed technological edges like the Iron Dome, which intercepted 90% of rockets but could not prevent ground incursions killing 1,200 Israelis. Post-attack analyses from Israeli security institutes highlight that true deterrence requires not just retaliation but sustained disruption of command structures and ideological recruitment, as intermittent campaigns allowed Hamas to portray restraint as weakness, bolstering internal support. This contrasts with state actors, where survival instincts prevail; against Hamas, whose charter mandates Israel's destruction, experts recommend shifting to proactive degradation of capabilities, akin to counterinsurgency models emphasizing governance vacuums in Gaza that enabled rearmament via smuggling tunnels.\n\nIsrael's intelligence apparatus, including Shin Bet and Aman, suffered a catastrophic failure on October 7 due to a combination of collection gaps and analytical complacency, missing Hamas's \"Jericho Wall\" plan despite its detailed capture in 2016 and partial signals like increased training observed in summer 2023. Hamas employed strict compartmentalization and deception, feigning economic focus under Qatar funding—$30 million monthly—to mask military preparations, while Israeli analysts fixated on signals intelligence from phones, underutilizing human sources amid Gaza access restrictions post-2007 blockade. Warnings, including Egypt's alert days prior and IDF border observers' reports of Hamas \"simulations\" in May 2023, were downplayed as aspirational rather than operational, reflecting \"conceptzia\"—a doctrinal blind spot assuming Hamas avoided all-out war to preserve rule.\n\nKey intelligence lessons emphasize reforming against groupthink and over-reliance on technology; post-event inquiries revealed fragmented analysis, with no unified all-source fusion center, leading to siloed assessments that buried anomalies in routine data noise. Enhancing human intelligence through deeper penetration of Hamas networks, alongside AI-augmented pattern recognition for behavioral shifts, is advocated, as Hamas's low-activity facade pre-attack drowned actionable intel in false positives. Broader reforms include elevating tactical warnings to strategic levels and institutionalizing devil's advocacy to counter confirmation bias, evident in ignored female spotters' data on Hamas shifts, ensuring future operations integrate empirical behavioral analysis over assumptions of enemy rationality.",
  "external_references": [
    {
      "text": "War Of Revival Cabinet Approves Netanyahus Controversial Renaming Of Gaza War",
      "url": "https://www.timesofisrael.com/war-of-revival-cabinet-approves-netanyahus-controversial-renaming-of-gaza-war/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Swords Of Iron War In The South 7 Oct 2023",
      "url": "https://www.gov.il/en/pages/swords-of-iron-war-in-the-south-7-oct-2023",
      "domain": "gov.il",
      "type": "citation"
    },
    {
      "text": "00000199 2e28 Df0a A3bd 7f7c09e30000",
      "url": "https://www.haaretz.com/israel-news/2025-10-06/ty-article-static/.premium/two-years-of-hell-a-timeline-of-key-events-in-the-israel-gaza-war/00000199-2e28-df0a-a3bd-7f7c09e30000",
      "domain": "haaretz.com",
      "type": "citation"
    },
    {
      "text": "Hamass October 7 Attack Visualizing Data",
      "url": "https://www.csis.org/analysis/hamass-october-7-attack-visualizing-data",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Who Is Hamas",
      "url": "https://govextra.gov.il/mda/hamas/who-is-hamas/",
      "domain": "govextra.gov.il",
      "type": "citation"
    },
    {
      "text": "20240304 Israel Owb Crsv Report.pdf",
      "url": "https://www.un.org/sexualviolenceinconflict/wp-content/uploads/2024/03/report/mission-report-official-visit-of-the-office-of-the-srsg-svc-to-israel-and-the-occupied-west-bank-29-january-14-february-2024/20240304-Israel-oWB-CRSV-report.pdf",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "Israelatwar",
      "url": "https://www.ajc.org/Israelatwar",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "7",
      "url": "https://press.armywarcollege.edu/parameters/vol54/iss1/7/",
      "domain": "press.armywarcollege.edu",
      "type": "citation"
    },
    {
      "text": "1162806",
      "url": "https://news.un.org/en/story/2025/05/1162806",
      "domain": "news.un.org",
      "type": "citation"
    },
    {
      "text": "Arab Israeli War",
      "url": "https://history.state.gov/milestones/1945-1952/arab-israeli-war",
      "domain": "history.state.gov",
      "type": "citation"
    },
    {
      "text": "Brief History Gazas Centuries War 2023 10 13",
      "url": "https://www.reuters.com/world/middle-east/brief-history-gazas-centuries-war-2023-10-13/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "A Timeline Of The Gaza Strip In Modern History",
      "url": "https://www.pbs.org/newshour/world/a-timeline-of-the-gaza-strip-in-modern-history",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Doctrine Hamas",
      "url": "https://www.wilsoncenter.org/article/doctrine-hamas",
      "domain": "wilsoncenter.org",
      "type": "citation"
    },
    {
      "text": "Hamas.asp",
      "url": "https://avalon.law.yale.edu/21st_century/hamas.asp",
      "domain": "avalon.law.yale.edu",
      "type": "citation"
    },
    {
      "text": "880818.htm",
      "url": "https://irp.fas.org/world/para/docs/880818.htm",
      "domain": "irp.fas.org",
      "type": "citation"
    },
    {
      "text": "Disengagement",
      "url": "https://www.adl.org/resources/backgrounder/disengagement",
      "domain": "adl.org",
      "type": "citation"
    },
    {
      "text": "Palestinian Politics Timeline 2006 Election",
      "url": "https://www.usip.org/palestinian-politics-timeline-2006-election",
      "domain": "usip.org",
      "type": "citation"
    },
    {
      "text": "Hamas Wins Huge Majority",
      "url": "https://www.aljazeera.com/news/2006/1/26/hamas-wins-huge-majority",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Israel4",
      "url": "https://www.theguardian.com/world/2007/jun/15/israel4",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Israelconflicttimeline",
      "url": "https://www.ajc.org/IsraelConflictTimeline",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "Hamas 2017 Document Full",
      "url": "https://www.middleeasteye.net/news/hamas-2017-document-full",
      "domain": "middleeasteye.net",
      "type": "citation"
    },
    {
      "text": "Hamas Strategic Rebranding.html",
      "url": "https://www.rand.org/pubs/commentary/2017/05/hamas-strategic-rebranding.html",
      "domain": "rand.org",
      "type": "citation"
    },
    {
      "text": "Hamas A Document Of General Principles Policies",
      "url": "https://israeled.org/hamas-a-document-of-general-principles-policies/",
      "domain": "israeled.org",
      "type": "citation"
    },
    {
      "text": "Hamas Its Own Words",
      "url": "https://www.adl.org/resources/article/hamas-its-own-words",
      "domain": "adl.org",
      "type": "citation"
    },
    {
      "text": "Gaza Plagued Poverty Hamas No Shortage Cash Come Rcna121099",
      "url": "https://www.nbcnews.com/news/world/gaza-plagued-poverty-hamas-no-shortage-cash-come-rcna121099",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "The Economy Of Hamas And How Israel Should Deal With It",
      "url": "https://jcpa.org/the-economy-of-hamas-and-how-israel-should-deal-with-it/",
      "domain": "jcpa.org",
      "type": "citation"
    },
    {
      "text": "C1kz42j92jmo",
      "url": "https://www.bbc.com/news/articles/c1kz42j92jmo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Svetlova The Primary Victims Of Hamas Are Palestinian",
      "url": "https://jstribune.com/svetlova-the-primary-victims-of-hamas-are-palestinian/",
      "domain": "jstribune.com",
      "type": "citation"
    },
    {
      "text": "Watering Down The Facts Israel The Palestinians Access To Water",
      "url": "https://honestreporting.com/watering-down-the-facts-israel-the-palestinians-access-to-water/",
      "domain": "honestreporting.com",
      "type": "citation"
    },
    {
      "text": "Humanitarian Aid Gaza",
      "url": "https://www.inss.org.il/publication/humanitarian-aid-gaza/",
      "domain": "inss.org.il",
      "type": "citation"
    },
    {
      "text": "Usaid Analysis Found No Evidence Massive Hamas Theft Gaza Aid 2025 07 25",
      "url": "https://www.reuters.com/world/middle-east/usaid-analysis-found-no-evidence-massive-hamas-theft-gaza-aid-2025-07-25/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "624521 West Bank And Gaza 2024 Human Rights Report.pdf",
      "url": "https://www.state.gov/wp-content/uploads/2025/08/624521_WEST-BANK-AND-GAZA-2024-HUMAN-RIGHTS-REPORT.pdf",
      "domain": "state.gov",
      "type": "citation"
    },
    {
      "text": "Why Hamas Still Relies On Violent Repression To Control Gaza 42461",
      "url": "https://theconversation.com/why-hamas-still-relies-on-violent-repression-to-control-gaza-42461",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "2024",
      "url": "https://freedomhouse.org/country/gaza-strip/freedom-world/2024",
      "domain": "freedomhouse.org",
      "type": "citation"
    },
    {
      "text": "Palestine Hamas Security Services Must Stop Targeting Protesters In Reprisal And Respect Freedom Of Peaceful Assembly In Gaza",
      "url": "https://www.amnesty.org/en/latest/news/2025/05/palestine-hamas-security-services-must-stop-targeting-protesters-in-reprisal-and-respect-freedom-of-peaceful-assembly-in-gaza/",
      "domain": "amnesty.org",
      "type": "citation"
    },
    {
      "text": "Palestinian Rocket And Mortar Attacks Against Israel",
      "url": "https://www.jewishvirtuallibrary.org/palestinian-rocket-and-mortar-attacks-against-israel",
      "domain": "jewishvirtuallibrary.org",
      "type": "citation"
    },
    {
      "text": "Palestinian Terrorism Against Israel 2022 Methods Trends And Description",
      "url": "https://www.terrorism-info.org.il/en/palestinian-terrorism-against-israel-2022-methods-trends-and-description/",
      "domain": "terrorism-info.org.il",
      "type": "citation"
    },
    {
      "text": "World Middle East 65544214",
      "url": "https://www.bbc.com/news/world-middle-east-65544214",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Operation Shield And Arrow May 9 13 2023",
      "url": "https://besacenter.org/operation-shield-and-arrow-may-9-13-2023/",
      "domain": "besacenter.org",
      "type": "citation"
    },
    {
      "text": "Operation Shield Arrow Gaza Israel Hamas Pij",
      "url": "https://www.atlanticcouncil.org/blogs/menasource/operation-shield-arrow-gaza-israel-hamas-pij/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Why Hamas Attacked When It Did",
      "url": "https://www.csis.org/analysis/why-hamas-attacked-when-it-did",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Israel Hamas Attack Intelligence.html",
      "url": "https://www.nytimes.com/2023/11/30/world/middleeast/israel-hamas-attack-intelligence.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "The Intel On Hamas Attack Plan Was There But Idf Simply Refused To Believe It Probe Finds",
      "url": "https://www.timesofisrael.com/the-intel-on-hamas-attack-plan-was-there-but-idf-simply-refused-to-believe-it-probe-finds/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "The October 7 Attack An Assessment Of The Intelligence Failings",
      "url": "https://ctc.westpoint.edu/the-october-7-attack-an-assessment-of-the-intelligence-failings/",
      "domain": "ctc.westpoint.edu",
      "type": "citation"
    },
    {
      "text": "Israel Shin Bet Security Failure October 7 Attack",
      "url": "https://www.npr.org/2025/03/05/nx-s1-5318591/israel-shin-bet-security-failure-october-7-attack",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Puar.13955",
      "url": "https://onlinelibrary.wiley.com/doi/10.1111/puar.13955",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "World Middle East 67480680",
      "url": "https://www.bbc.com/news/world-middle-east-67480680",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Hamas Documents Plans Israel Attack",
      "url": "https://www.washingtonpost.com/world/2023/10/21/hamas-documents-plans-israel-attack/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas War Timeline Major Events Since October 7 2023",
      "url": "https://www.cbsnews.com/news/israel-hamas-war-timeline-major-events-since-october-7-2023/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/International/timeline-surprise-rocket-attack-hamas-israel/story?id=103816006",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "October 7 Crimes Against Humanity War Crimes Hamas Led Groups",
      "url": "https://www.hrw.org/news/2024/07/17/october-7-crimes-against-humanity-war-crimes-hamas-led-groups",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "A Hrc 56 Crp 3.pdf",
      "url": "https://www.ohchr.org/sites/default/files/documents/hrbodies/hrcouncil/sessions-regular/session56/a-hrc-56-crp-3.pdf",
      "domain": "ohchr.org",
      "type": "citation"
    },
    {
      "text": "Beeri Massacre.html",
      "url": "https://www.nytimes.com/interactive/2023/12/22/world/europe/beeri-massacre.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Idf Details Failure To Defend Kibbutz Beeri During October 7 Atrocities",
      "url": "https://www.fdd.org/analysis/2024/07/11/idf-details-failure-to-defend-kibbutz-beeri-during-october-7-atrocities/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Palestine Videos Hamas Led Attacks Verified",
      "url": "https://www.hrw.org/news/2023/10/18/israel/palestine-videos-hamas-led-attacks-verified",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "Mde1588032024english.pdf",
      "url": "https://www.amnesty.org/en/wp-content/uploads/2024/12/MDE1588032024ENGLISH.pdf",
      "domain": "amnesty.org",
      "type": "citation"
    },
    {
      "text": "October 7 Nova Festival Victims.html",
      "url": "https://www.nytimes.com/2024/10/07/world/middleeast/october-7-nova-festival-victims.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Swords Of Iron Civilian Casualties",
      "url": "https://www.gov.il/en/pages/swords-of-iron-civilian-casualties",
      "domain": "gov.il",
      "type": "citation"
    },
    {
      "text": "The October 7 Massacre Explained",
      "url": "https://www.idf.il/en/mini-sites/remembering-the-october-7-massacre/the-october-7-massacre-explained/",
      "domain": "idf.il",
      "type": "citation"
    },
    {
      "text": "Oct 7 Attacks Hamas Israel Sexual Violence.html",
      "url": "https://www.nytimes.com/2023/12/28/world/middleeast/oct-7-attacks-hamas-israel-sexual-violence.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Sc15621.doc.htm",
      "url": "https://press.un.org/en/2024/sc15621.doc.htm",
      "domain": "press.un.org",
      "type": "citation"
    },
    {
      "text": "Evidence Points To Systematic Use Of Rape By Hamas In 7 October Attacks",
      "url": "https://www.theguardian.com/world/2024/jan/18/evidence-points-to-systematic-use-of-rape-by-hamas-in-7-october-attacks",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Hamas Israel Sexual Violence Rape War Oct 7 Rcna217401",
      "url": "https://www.nbcnews.com/world/israel/hamas-israel-sexual-violence-rape-war-oct-7-rcna217401",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "October 7 Forensic Analysis Shows Hamas Abuses Many False Israeli Claims",
      "url": "https://www.aljazeera.com/news/2024/3/21/october-7-forensic-analysis-shows-hamas-abuses-many-false-israeli-claims",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Questions And Answers Hamas Led Armed Groups October 7 2023 Assault Israel",
      "url": "https://www.hrw.org/news/2024/07/17/questions-and-answers-hamas-led-armed-groups-october-7-2023-assault-israel",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "Coi War Crimes Hamas Israel October 7 Gaza Hostages",
      "url": "https://www.atlanticcouncil.org/blogs/menasource/coi-war-crimes-hamas-israel-october-7-gaza-hostages/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Uk Parliaments Landmark Report Details October 7th Hamas Atrocities",
      "url": "https://www.worldjewishcongress.org/en/news/uk-parliaments-landmark-report-details-october-7th-hamas-atrocities",
      "domain": "worldjewishcongress.org",
      "type": "citation"
    },
    {
      "text": "Two Year Anniversary Of October 7th Attack",
      "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/10/two-year-anniversary-of-october-7th-attack",
      "domain": "state.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11415105",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11415105/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Israel The West Bank And Gaza",
      "url": "https://www.state.gov/reports/country-reports-on-terrorism-2023/israel-the-west-bank-and-gaza",
      "domain": "state.gov",
      "type": "citation"
    },
    {
      "text": "Hamas Hostages Israel War Gaza",
      "url": "https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Major Moments Israel Gaza War 2025 01 15",
      "url": "https://www.reuters.com/world/middle-east/major-moments-israel-gaza-war-2025-01-15/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Liveblog October 10 2023",
      "url": "https://www.timesofisrael.com/liveblog-october-10-2023/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Conflict Between Israel Palestinians Gaza 2023 10 07",
      "url": "https://www.reuters.com/world/middle-east/conflict-between-israel-palestinians-gaza-2023-10-07/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israel Gaza Attack Hostages Response Intl Hnk",
      "url": "https://edition.cnn.com/2023/10/08/middleeast/israel-gaza-attack-hostages-response-intl-hnk",
      "domain": "edition.cnn.com",
      "type": "citation"
    },
    {
      "text": "Hamas Says It Fires Israeli Troops Pressing Gaza Ground Assault 2023 10 31",
      "url": "https://www.reuters.com/world/middle-east/hamas-says-it-fires-israeli-troops-pressing-gaza-ground-assault-2023-10-31/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israeli Defense Minister Orders Complete Siege On Gaza After Hamas Surprise Attack",
      "url": "https://www.pbs.org/newshour/world/israeli-defense-minister-orders-complete-siege-on-gaza-after-hamas-surprise-attack",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Israel Gaza Hamas Fighting Monday Intl Hnk",
      "url": "https://www.cnn.com/2023/10/09/middleeast/israel-gaza-hamas-fighting-monday-intl-hnk",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Israel Announces Total Blockade On Gaza",
      "url": "https://www.aljazeera.com/news/2023/10/9/israel-announces-total-blockade-on-gaza",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Israel Opt Israel Must Lift Illegal And Inhumane Blockade On Gaza As Power Plant Runs Out Of Fuel",
      "url": "https://www.amnesty.org/en/latest/news/2023/10/israel-opt-israel-must-lift-illegal-and-inhumane-blockade-on-gaza-as-power-plant-runs-out-of-fuel/",
      "domain": "amnesty.org",
      "type": "citation"
    },
    {
      "text": "Eu Calls Humanitarian Pauses Gaza Aid Israel Raids Enclave 2023 10 26",
      "url": "https://www.reuters.com/world/middle-east/eu-calls-humanitarian-pauses-gaza-aid-israel-raids-enclave-2023-10-26/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israel Unlawful Gaza Blockade Deadly Children",
      "url": "https://www.hrw.org/news/2023/10/18/israel-unlawful-gaza-blockade-deadly-children",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "Swords Of Iron Idf Casualties",
      "url": "https://www.gov.il/en/pages/swords-of-iron-idf-casualties",
      "domain": "gov.il",
      "type": "citation"
    },
    {
      "text": "Israel Stages Large Overnight Ground Raid Into Gaza Strip",
      "url": "https://www.aljazeera.com/news/2023/10/26/israel-stages-large-overnight-ground-raid-into-gaza-strip",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Fear Confusion As Israel Issues Evacuation Order For Northern Gaza",
      "url": "https://www.aljazeera.com/news/2023/10/13/fear-confusion-as-israel-issues-evacuation-order-for-northern-gaza",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Why Israels Gaza Evacuation Order So Alarming",
      "url": "https://www.hrw.org/news/2023/10/16/why-israels-gaza-evacuation-order-so-alarming",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "Idf Forces Led By The Givati Brigade Operate In Northern Gaza Eliminate 50 Terrorists",
      "url": "https://www.idf.il/en/mini-sites/idf-press-releases-israel-at-war/october-23-pr/idf-forces-led-by-the-givati-brigade-operate-in-northern-gaza-eliminate-50-terrorists/",
      "domain": "idf.il",
      "type": "citation"
    },
    {
      "text": "Israel Military Central Gaza Fighting Hamas",
      "url": "https://www.npr.org/2023/10/31/1209646548/israel-military-central-gaza-fighting-hamas",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Israeli Troops Roll Into Gaza City As Ground Offensive Intensifies Idf Toll Rises",
      "url": "https://www.timesofisrael.com/israeli-troops-roll-into-gaza-city-as-ground-offensive-intensifies-idf-toll-rises/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Israeli Army Shows Devastation Northern Gaza Invasion Grinds 2023 11 08",
      "url": "https://www.reuters.com/world/middle-east/israeli-army-shows-devastation-northern-gaza-invasion-grinds-2023-11-08/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israelhamas War Hostage Deal Ceasefire Gaza 2023 11 22",
      "url": "https://www.reuters.com/world/middle-east/israelhamas-war-hostage-deal-ceasefire-gaza-2023-11-22/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas War News 11 21 2023 39f5ae0bdb4e32f0e69115aa43446132",
      "url": "https://apnews.com/article/israel-hamas-war-news-11-21-2023-39f5ae0bdb4e32f0e69115aa43446132",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas War News 11 24 2023 172256dd593189f7b37f7c62f4739c6b",
      "url": "https://apnews.com/article/israel-hamas-war-news-11-24-2023-172256dd593189f7b37f7c62f4739c6b",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Gaza Israel Hostages Palestinian Prisoners Release",
      "url": "https://www.npr.org/2023/11/25/1215176593/gaza-israel-hostages-palestinian-prisoners-release",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Mediator Qatar Says Truce Gaza Start Friday 2023 11 23",
      "url": "https://www.reuters.com/world/middle-east/mediator-qatar-says-truce-gaza-start-friday-2023-11-23/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas War News 12 1 2023 C944c736efdf8993c7a17cf683d6e364",
      "url": "https://apnews.com/article/israel-hamas-war-news-12-1-2023-c944c736efdf8993c7a17cf683d6e364",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "World Middle East 67589259",
      "url": "https://www.bbc.com/news/world-middle-east-67589259",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Idf Dismantles Hamas In Northern Gaza Three Months Into The Gaza War",
      "url": "https://www.fdd.org/analysis/2024/01/07/idf-dismantles-hamas-in-northern-gaza-three-months-into-the-gaza-war/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "World Middle East 67904259",
      "url": "https://www.bbc.com/news/world-middle-east-67904259",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "World Middle East 67749557",
      "url": "https://www.bbc.com/news/world-middle-east-67749557",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Idf Says It Has Completed The Dismantling Of Hamas Military Framework 106170527",
      "url": "https://abcnews.go.com/International/live-updates/israel-hamas-war-2024/idf-says-it-has-completed-the-dismantling-of-hamas-military-framework-106170527",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Israel Drawdown Gaza Khan Younis Hamas War",
      "url": "https://www.npr.org/2024/01/01/1222387655/israel-drawdown-gaza-khan-younis-hamas-war",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Israels Operation Swords Of Iron Update 1 24 24 2.pdf",
      "url": "https://jinsa.org/wp-content/uploads/2024/01/Israels-Operation-Swords-of-Iron-Update-1-24-24-2.pdf",
      "domain": "jinsa.org",
      "type": "citation"
    },
    {
      "text": "24h Operational Update January 23 2024",
      "url": "https://www.idf.il/en/mini-sites/idf-press-releases-israel-at-war/january-24-pr/24h-operational-update-january-23-2024/",
      "domain": "idf.il",
      "type": "citation"
    },
    {
      "text": "Hostilities Gaza Strip And Israel Flash Update 101",
      "url": "https://www.ochaopt.org/content/hostilities-gaza-strip-and-israel-flash-update-101",
      "domain": "ochaopt.org",
      "type": "citation"
    },
    {
      "text": "Idf Consolidates Gains In Khan Younis.php",
      "url": "https://www.longwarjournal.org/archives/2024/01/idf-consolidates-gains-in-khan-younis.php",
      "domain": "longwarjournal.org",
      "type": "citation"
    },
    {
      "text": "Press Briefing By Idf Spokesperson Rear Admiral Daniel Hagari January 29th 2024",
      "url": "https://www.idf.il/en/mini-sites/israel-at-war/briefings-by-idf-spokesperson-bg-effie-defrin/january-24-press-briefings/press-briefing-by-idf-spokesperson-rear-admiral-daniel-hagari-january-29th-2024/",
      "domain": "idf.il",
      "type": "citation"
    },
    {
      "text": "After Year War Hamas Militarily Weakened Far Eliminated",
      "url": "https://acleddata.com/report/after-year-war-hamas-militarily-weakened-far-eliminated",
      "domain": "acleddata.com",
      "type": "citation"
    },
    {
      "text": "Deadliest Day For Israeli Forces Gaza War",
      "url": "https://www.theguardian.com/world/2024/jan/23/deadliest-day-for-israeli-forces-gaza-war",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Israel Khan Younis Withdrawal Gaza Intl",
      "url": "https://www.cnn.com/2024/04/07/middleeast/israel-khan-younis-withdrawal-gaza-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Idf Ends Operations In Khan Younis As Gaza War Reaches Six Months",
      "url": "https://www.fdd.org/analysis/op_eds/2024/04/08/idf-ends-operations-in-khan-younis-as-gaza-war-reaches-six-months/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israel Gaza Eastern Rafah Evacuation Notice Hnk Intl",
      "url": "https://www.cnn.com/2024/05/06/middleeast/israel-gaza-eastern-rafah-evacuation-notice-hnk-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Idf Takes Control Of Gaza Side Of Rafah Crossing",
      "url": "https://www.fdd.org/analysis/2024/05/07/idf-takes-control-of-gaza-side-of-rafah-crossing/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israeli Tanks Advance Central Rafah Gaza Intl",
      "url": "https://www.cnn.com/2024/05/28/middleeast/israeli-tanks-advance-central-rafah-gaza-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Rafah Brief 5 7 24 Zs 1.pdf",
      "url": "https://jinsa.org/wp-content/uploads/2024/05/Rafah-brief-5-7-24-ZS-1.pdf",
      "domain": "jinsa.org",
      "type": "citation"
    },
    {
      "text": "In Rafah Idf Focuses On Tunnels With Aim Of Destroying Hamas Brigade Within A Month",
      "url": "https://www.timesofisrael.com/in-rafah-idf-focuses-on-tunnels-with-aim-of-destroying-hamas-brigade-within-a-month/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Idf Unearths More Tunnels Gains Control Of Philadelphi Corridor",
      "url": "https://www.fdd.org/analysis/2024/05/30/idf-unearths-more-tunnels-gains-control-of-philadelphi-corridor/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israel Idf Philadelphi Corridor Rafah Gaza Control Palestine War Hamas",
      "url": "https://www.theguardian.com/world/article/2024/may/30/israel-idf-philadelphi-corridor-rafah-gaza-control-palestine-war-hamas",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Artc Idf Chief Says Significant Progress In Destroying Hamas Rafah Brigade",
      "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-chief-says-significant-progress-in-destroying-hamas-rafah-brigade",
      "domain": "i24news.tv",
      "type": "citation"
    },
    {
      "text": "Israeli Defense Minister Announces The Defeat Of Hamass Rafah Brigade.php",
      "url": "https://www.longwarjournal.org/archives/2024/08/israeli-defense-minister-announces-the-defeat-of-hamass-rafah-brigade.php",
      "domain": "longwarjournal.org",
      "type": "citation"
    },
    {
      "text": "Israel Confronts Hamas In Southern Gaza Amid Regional Threats.php",
      "url": "https://www.longwarjournal.org/archives/2024/08/israel-confronts-hamas-in-southern-gaza-amid-regional-threats.php",
      "domain": "longwarjournal.org",
      "type": "citation"
    },
    {
      "text": "Artc Rafah Brigade Dismantled 80 Of Philadelphi Corridor Tunnels Destroyed",
      "url": "https://www.i24news.tv/en/news/israel-at-war/artc-rafah-brigade-dismantled-80-of-philadelphi-corridor-tunnels-destroyed",
      "domain": "i24news.tv",
      "type": "citation"
    },
    {
      "text": "Israeli Forces Raze 50 Terror Tunnels In Southern Gaza",
      "url": "https://www.fdd.org/analysis/flash-briefs/2024/08/15/israeli-forces-raze-50-terror-tunnels-in-southern-gaza/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israel Ground Offensive Lebanon",
      "url": "https://www.npr.org/2024/10/01/g-s1-25657/israel-ground-offensive-lebanon",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Israel Ground Incursion Lebanon Explainer Intl Hnk",
      "url": "https://edition.cnn.com/2024/10/01/middleeast/israel-ground-incursion-lebanon-explainer-intl-hnk",
      "domain": "edition.cnn.com",
      "type": "citation"
    },
    {
      "text": "C9vp7dg3ml1o",
      "url": "https://www.bbc.com/news/articles/c9vp7dg3ml1o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Iran Israel Hezbollah Lebanon Attack",
      "url": "https://www.npr.org/2024/10/01/g-s1-25707/iran-israel-hezbollah-lebanon-attack",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "C9dyxxgxv1jo",
      "url": "https://www.bbc.com/news/articles/c9dyxxgxv1jo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Iran Update October 1 2024",
      "url": "https://understandingwar.org/research/middle-east/iran-update-october-1-2024/",
      "domain": "understandingwar.org",
      "type": "citation"
    },
    {
      "text": "Cj6zxy55pyro",
      "url": "https://www.bbc.com/news/articles/cj6zxy55pyro",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Israel Strikes Houthi Targets After Ballistic Missile Attacks On Israel",
      "url": "https://www.fdd.org/analysis/op_eds/2024/12/27/israel-strikes-houthi-targets-after-ballistic-missile-attacks-on-israel/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israel Houthis Yemen Gaza War 1435d3ac2f16e2faed608fdb5a100e71",
      "url": "https://apnews.com/article/israel-houthis-yemen-gaza-war-1435d3ac2f16e2faed608fdb5a100e71",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Irans Multi Front War On Israel",
      "url": "https://www.aipac.org/resources/irans-multi-front-war-on-israel",
      "domain": "aipac.org",
      "type": "citation"
    },
    {
      "text": "Isael Gaza One Year Hamas Fighting Hnk Intl",
      "url": "https://www.cnn.com/2024/10/08/middleeast/isael-gaza-one-year-hamas-fighting-hnk-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Special Report For Years Iran Planned A Simultaneous Invasion Of Israel Only One Was Carried Out",
      "url": "https://israel-alma.org/special-report-for-years-iran-planned-a-simultaneous-invasion-of-israel-only-one-was-carried-out/",
      "domain": "israel-alma.org",
      "type": "citation"
    },
    {
      "text": "Ceasefire Israel Hamas Gaza Hostage Release",
      "url": "https://www.npr.org/2025/01/15/g-s1-42883/ceasefire-israel-hamas-gaza-hostage-release",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Full Text Of The Hostage Ceasefire Agreement Reached Between Israel And Hamas",
      "url": "https://www.timesofisrael.com/full-text-of-the-hostage-ceasefire-agreement-reached-between-israel-and-hamas/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "20250129 Understanding The Israel Hamas Ceasefire Agreement.cfm",
      "url": "https://www.american.edu/sis/news/20250129-understanding-the-israel-hamas-ceasefire-agreement.cfm",
      "domain": "american.edu",
      "type": "citation"
    },
    {
      "text": "Israel Launches Deadly Series Of Attack On Gaza",
      "url": "https://www.npr.org/2025/03/17/g-s1-54401/israel-launches-deadly-series-of-attack-on-gaza",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Israel Breaks Ceasefire As It Strikes Gaza Killing Hundreds",
      "url": "https://www.npr.org/2025/03/19/nx-s1-5332204/israel-breaks-ceasefire-as-it-strikes-gaza-killing-hundreds",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Israel Hamas Trump Peace Deal Gaza Striptimeline",
      "url": "https://www.cbsnews.com/news/israel-hamas-trump-peace-deal-gaza-striptimeline/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas Deal Timeline When Will The Hostages Be Released",
      "url": "https://www.ajc.org/news/israel-hamas-deal-timeline-when-will-the-hostages-be-released",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "Israel Hamas Gaza Ceasefire Agreement 10 09 25",
      "url": "https://www.cnn.com/world/live-news/israel-hamas-gaza-ceasefire-agreement-10-09-25",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas Agree Gaza Ceasefire Return Hostages 2025 10 09",
      "url": "https://www.reuters.com/world/middle-east/israel-hamas-agree-gaza-ceasefire-return-hostages-2025-10-09/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Ckgyr8e0gl2o",
      "url": "https://www.bbc.com/news/articles/ckgyr8e0gl2o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "2 Soldiers Killed 3 Wounded In Attack On Troops In Gaza Idf Launches Wave Of Strikes On Hamas",
      "url": "https://www.timesofisrael.com/2-soldiers-killed-3-wounded-in-attack-on-troops-in-gaza-idf-launches-wave-of-strikes-on-hamas/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Cd9k2dj37wqo",
      "url": "https://www.bbc.com/news/articles/cd9k2dj37wqo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Hamas Search Israel Hostages Bodies Egypt",
      "url": "https://www.cbsnews.com/news/hamas-search-israel-hostages-bodies-egypt/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "What Israel And Hamas Actually Want From The Gaza Ceasefire",
      "url": "https://www.newyorker.com/news/q-and-a/what-israel-and-hamas-actually-want-from-the-gaza-ceasefire",
      "domain": "newyorker.com",
      "type": "citation"
    },
    {
      "text": "Gaza Ceasefire International Security Force Hamas.html",
      "url": "https://www.nytimes.com/2025/10/21/world/middleeast/gaza-ceasefire-international-security-force-hamas.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas Fragile Ceasefire Tested Word Go",
      "url": "https://www.chathamhouse.org/2025/10/israel-hamas-fragile-ceasefire-tested-word-go",
      "domain": "chathamhouse.org",
      "type": "citation"
    },
    {
      "text": "2803(2025",
      "url": "https://docs.un.org/en/S/RES/2803(2025",
      "domain": "docs.un.org",
      "type": "citation"
    },
    {
      "text": "1166391",
      "url": "https://news.un.org/en/story/2025/11/1166391",
      "domain": "news.un.org",
      "type": "citation"
    },
    {
      "text": "3416",
      "url": "https://www.washingtoninstitute.org/media/3416",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Hjs Hamass Human Shield Strategy In Gaza Report Web.pdf",
      "url": "https://henryjacksonsociety.org/wp-content/uploads/2025/05/HJS-Hamass-Human-Shield-Strategy-in-Gaza-Report-WEB.pdf",
      "domain": "henryjacksonsociety.org",
      "type": "citation"
    },
    {
      "text": "Hamas Human Shields.pdf",
      "url": "https://stratcomcoe.org/cuploads/pfiles/hamas_human_shields.pdf",
      "domain": "stratcomcoe.org",
      "type": "citation"
    },
    {
      "text": "Hamas Tells Gaza Residents Stay Home Israel Ground Offensive Looms 2023 10 13",
      "url": "https://www.reuters.com/world/middle-east/hamas-tells-gaza-residents-stay-home-israel-ground-offensive-looms-2023-10-13/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Idf Gaza Resident Says Hamas Preventing Evacuations Thousands Return North",
      "url": "https://www.timesofisrael.com/idf-gaza-resident-says-hamas-preventing-evacuations-thousands-return-north/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Hamas Exploitation Of Civilians",
      "url": "https://www.gov.il/en/pages/hamas-exploitation-of-civilians",
      "domain": "gov.il",
      "type": "citation"
    },
    {
      "text": "Hamas Places Rocket Launch Sites Near Civilian Shelters In Gaza",
      "url": "https://www.fdd.org/analysis/2024/04/24/hamas-places-rocket-launch-sites-near-civilian-shelters-in-gaza/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israel Photos Hamas Gaza Weapons Un Facilities Including Schools",
      "url": "https://www.cbsnews.com/news/israel-photos-hamas-gaza-weapons-un-facilities-including-schools/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Hamas Operations In Hospitals",
      "url": "https://www.idf.il/en/mini-sites/hamas-operations-in-hospitals/",
      "domain": "idf.il",
      "type": "citation"
    },
    {
      "text": "Israeli Military Says Hamas Hiding Tunnels Operations Centres Gaza Hospital 2023 10 27",
      "url": "https://www.reuters.com/world/middle-east/israeli-military-says-hamas-hiding-tunnels-operations-centres-gaza-hospital-2023-10-27/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Idf Uncovers Hamas Hideout Facilities In Medical Clinic And Unrwa School",
      "url": "https://www.fdd.org/analysis/2024/07/01/idf-uncovers-hamas-hideout-facilities-in-medical-clinic-and-unrwa-school/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Subterranean Operations Israeli Defense Force Lessons From Gaza",
      "url": "https://www.army.mil/article/288356/subterranean_operations_israeli_defense_force_lessons_from_gaza",
      "domain": "army.mil",
      "type": "citation"
    },
    {
      "text": "Analyzing Israels Strategy In Gaza",
      "url": "https://www.brookings.edu/events/analyzing-israels-strategy-in-gaza/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Katz Top Strategic Objective In Gaza Now Is Destroying Hamas Tunnels Of Which 60 Are Intact",
      "url": "https://www.timesofisrael.com/liveblog_entry/katz-top-strategic-objective-in-gaza-now-is-destroying-hamas-tunnels-of-which-60-are-intact/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Israels New Approach To Tunnels A Paradigm Shift In Underground Warfare",
      "url": "https://mwi.westpoint.edu/israels-new-approach-to-tunnels-a-paradigm-shift-in-underground-warfare/",
      "domain": "mwi.westpoint.edu",
      "type": "citation"
    },
    {
      "text": "What The Gaza War Reveals About The Limitations Of Missile Defense",
      "url": "https://www.atlanticcouncil.org/blogs/menasource/what-the-gaza-war-reveals-about-the-limitations-of-missile-defense/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Israel Not Publishing Iron Dome Performance Data",
      "url": "https://www.fdd.org/analysis/2023/10/23/israel-not-publishing-iron-dome-performance-data/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Hamas Asymmetric Advantage Gaza Cronin",
      "url": "https://www.foreignaffairs.com/israel/hamas-asymmetric-advantage-gaza-cronin",
      "domain": "foreignaffairs.com",
      "type": "citation"
    },
    {
      "text": "Hamas Tunnels Explained",
      "url": "https://www.popularmechanics.com/military/weapons/a46041927/hamas-tunnels-explained/",
      "domain": "popularmechanics.com",
      "type": "citation"
    },
    {
      "text": "Gaza Tunnels Stretch At Least 350 Miles Far Longer Than Past Estimate Report",
      "url": "https://www.timesofisrael.com/gaza-tunnels-stretch-at-least-350-miles-far-longer-than-past-estimate-report/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Gaza Tunnels",
      "url": "https://www.inss.org.il/publication/gaza-tunnels/",
      "domain": "inss.org.il",
      "type": "citation"
    },
    {
      "text": "Targeting Gazas Tunnels",
      "url": "https://lieber.westpoint.edu/targeting-gazas-tunnels/",
      "domain": "lieber.westpoint.edu",
      "type": "citation"
    },
    {
      "text": "One Year War Israel Strikes 40000 Hamas Targets Gaza 2024 10 07",
      "url": "https://www.reuters.com/world/middle-east/one-year-war-israel-strikes-40000-hamas-targets-gaza-2024-10-07/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israel Only Destroyed 25 Gaza Tunnels 18 Months War",
      "url": "https://www.newarab.com/news/israel-only-destroyed-25-gaza-tunnels-18-months-war",
      "domain": "newarab.com",
      "type": "citation"
    },
    {
      "text": "Idf Aims To Capture 75 Of Gaza Strip In 2 Months In New Offensive Against Hamas",
      "url": "https://www.timesofisrael.com/idf-aims-to-capture-75-of-gaza-strip-in-2-months-in-new-offensive-against-hamas/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Hamas Advanced Weaponry Rockets Artillery Drones Cyber",
      "url": "https://jcpa.org/article/hamas-advanced-weaponry-rockets-artillery-drones-cyber/",
      "domain": "jcpa.org",
      "type": "citation"
    },
    {
      "text": "Are Hamas Qassam Rockets Not Very Destructive",
      "url": "https://skeptics.stackexchange.com/questions/50732/are-hamas-qassam-rockets-not-very-destructive",
      "domain": "skeptics.stackexchange.com",
      "type": "citation"
    },
    {
      "text": "7 Things You Need To Know About Israels Iron Dome Defense System",
      "url": "https://www.ajc.org/news/7-things-you-need-to-know-about-israels-iron-dome-defense-system",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "Missile Defense In The Israel Hamas War",
      "url": "https://www.lawfaremedia.org/article/missile-defense-in-the-israel-hamas-war",
      "domain": "lawfaremedia.org",
      "type": "citation"
    },
    {
      "text": "391285",
      "url": "https://www.defenseone.com/ideas/2023/10/how-hamas-evaded-israels-iron-dome-air-defense-system/391285/",
      "domain": "defenseone.com",
      "type": "citation"
    },
    {
      "text": "Tunnels In Gaza",
      "url": "https://mrandrewfox.substack.com/p/tunnels-in-gaza",
      "domain": "mrandrewfox.substack.com",
      "type": "citation"
    },
    {
      "text": "1057610x.2024.2347843",
      "url": "https://www.tandfonline.com/doi/full/10.1080/1057610X.2024.2347843",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "How Many Palestinians Has Israels Gaza Offensive Killed 2025 10 07",
      "url": "https://www.reuters.com/world/middle-east/how-many-palestinians-has-israels-gaza-offensive-killed-2025-10-07/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/International/israel-hamas-wars-devastating-human-toll-after-2/story?id=126252242",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Authorities Name 44 Soldiers 30 Police Officers Killed In Hamas Attack",
      "url": "https://www.timesofisrael.com/authorities-name-44-soldiers-30-police-officers-killed-in-hamas-attack/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "A 74203922",
      "url": "https://www.dw.com/en/hamas-strength-israel-gaza-october-7/a-74203922",
      "domain": "dw.com",
      "type": "citation"
    },
    {
      "text": "Hamas Leaders Killed By Israel Those Who Remain 2025 09 29",
      "url": "https://www.reuters.com/world/middle-east/hamas-leaders-killed-by-israel-those-who-remain-2025-09-29/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Who Were The Terror Leaders Killed By Israel Since Oct 7 Prior To The Doha Strike",
      "url": "https://www.timesofisrael.com/who-were-the-terror-leaders-killed-by-israel-since-oct-7-prior-to-the-doha-strike/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "3467968",
      "url": "https://www.aa.com.tr/en/middle-east/hamas-releases-list-of-16-senior-leaders-killed-during-israel-s-war-on-gaza/3467968",
      "domain": "aa.com.tr",
      "type": "citation"
    },
    {
      "text": "Israeli Intelligence Database 83 Percent Civilians Militants",
      "url": "https://www.972mag.com/israeli-intelligence-database-83-percent-civilians-militants/",
      "domain": "972mag.com",
      "type": "citation"
    },
    {
      "text": "Israel Says It Has Killed Half Hamas Initial Force Size Gaza 1905972",
      "url": "https://www.newsweek.com/israel-says-it-has-killed-half-hamas-initial-force-size-gaza-1905972",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Article 835754",
      "url": "https://www.jpost.com/middle-east/article-835754",
      "domain": "jpost.com",
      "type": "citation"
    },
    {
      "text": "Hamas Diminished Not Destroyed Reasserts Gaza Rcna238188",
      "url": "https://www.nbcnews.com/world/middle-east/hamas-diminished-not-destroyed-reasserts-gaza-rcna238188",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Hjs Questionable Counting %e2%80%93 Hamas Report Web.pdf",
      "url": "https://henryjacksonsociety.org/wp-content/uploads/2024/12/HJS-Questionable-Counting-%E2%80%93-Hamas-Report-web.pdf",
      "domain": "henryjacksonsociety.org",
      "type": "citation"
    },
    {
      "text": "Piis0140 6736(24",
      "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(24",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Cn5wel11pgdo",
      "url": "https://www.bbc.com/news/articles/cn5wel11pgdo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Israel Gaza Hamas Children Population War Palestinians",
      "url": "https://www.npr.org/2023/10/19/1206479861/israel-gaza-hamas-children-population-war-palestinians",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Hamas Using Palestinian Civilians As Human Shields To Attack Israel Na87m Z6s6j C5ba4",
      "url": "https://www.aipac.org/resources/hamas-using-palestinian-civilians-as-human-shields-to-attack-israel-na87m-z6s6j-c5ba4",
      "domain": "aipac.org",
      "type": "citation"
    },
    {
      "text": "On The Ground In Gaza What I Saw Of Israels Military Operations",
      "url": "https://jinsa.org/on-the-ground-in-gaza-what-i-saw-of-israels-military-operations/",
      "domain": "jinsa.org",
      "type": "citation"
    },
    {
      "text": "Israel Has Created New Standard Urban Warfare Why Will No One Admit It Opinion 1883286",
      "url": "https://www.newsweek.com/israel-has-created-new-standard-urban-warfare-why-will-no-one-admit-it-opinion-1883286",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Israeli Hostages Rescues Releases Ceasefire Talks 2025 10 08",
      "url": "https://www.reuters.com/world/middle-east/israeli-hostages-rescues-releases-ceasefire-talks-2025-10-08/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "00000199 Dbe2 D7e9 Adfd Dbe7c4660000",
      "url": "https://www.haaretz.com/israel-news/2025-10-13/ty-article-magazine/these-are-the-seven-israeli-hostages-released-by-hamas-from-gaza-in-the-first-round/00000199-dbe2-d7e9-adfd-dbe7c4660000",
      "domain": "haaretz.com",
      "type": "citation"
    },
    {
      "text": "What Do We Know About The Hostage Ceasefire Deal Between Israel Hamas",
      "url": "https://www.timesofisrael.com/what-do-we-know-about-the-hostage-ceasefire-deal-between-israel-hamas/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "World Middle East 67477240",
      "url": "https://www.bbc.com/news/world-middle-east-67477240",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "S1bnmd1cgg",
      "url": "https://www.ynetnews.com/article/s1bnmd1cgg",
      "domain": "ynetnews.com",
      "type": "citation"
    },
    {
      "text": "The 16 Hostages Whose Bodies Are Still Held In Gaza",
      "url": "https://www.timesofisrael.com/the-16-hostages-whose-bodies-are-still-held-in-gaza/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Hamas Gaza Israeli Hostage Latam Intl",
      "url": "https://www.cnn.com/2025/10/18/middleeast/hamas-gaza-israeli-hostage-latam-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Gaza Israel Hamas Hostages Ceasefire 10 13 2025 9e4921406e846189c90144609c1a9530",
      "url": "https://apnews.com/article/gaza-israel-hamas-hostages-ceasefire-10-13-2025-9e4921406e846189c90144609c1a9530",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Israeli Hostage Release Hamas Gaza Last Living",
      "url": "https://www.theguardian.com/world/2025/oct/13/israeli-hostage-release-hamas-gaza-last-living",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Cpvl9k4mw8no",
      "url": "https://www.bbc.com/news/articles/cpvl9k4mw8no",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "0000019a 2101 Dd96 Af9b 391d08fc0000",
      "url": "https://www.haaretz.com/israel-news/2025-10-26/ty-article/.premium/israel-allows-red-cross-egyptian-teams-in-idf-held-gaza-areas-to-recover-hostage-bodies/0000019a-2101-dd96-af9b-391d08fc0000",
      "domain": "haaretz.com",
      "type": "citation"
    },
    {
      "text": "Hamas Expands Search For Hostage Bodies In Gaza As Egypt Joins Effort",
      "url": "https://www.euronews.com/2025/10/26/hamas-expands-search-for-hostage-bodies-in-gaza-as-egypt-joins-effort",
      "domain": "euronews.com",
      "type": "citation"
    },
    {
      "text": "Hostage Families Urge Every Possible Sanction On Hamas To Secure Captives Return",
      "url": "https://www.timesofisrael.com/hostage-families-urge-every-possible-sanction-on-hamas-to-secure-captives-return/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Article 871730",
      "url": "https://www.jpost.com/israel-news/article-871730",
      "domain": "jpost.com",
      "type": "citation"
    },
    {
      "text": "Crisis In Gaza",
      "url": "https://www.rescue.org/crisis-in-gaza",
      "domain": "rescue.org",
      "type": "citation"
    },
    {
      "text": "Occupied Palestinian Territory",
      "url": "https://www.unocha.org/occupied-palestinian-territory",
      "domain": "unocha.org",
      "type": "citation"
    },
    {
      "text": "Gaza Humanitarian Response Situation Report No 1",
      "url": "https://reliefweb.int/report/occupied-palestinian-territory/gaza-humanitarian-response-situation-report-no-1",
      "domain": "reliefweb.int",
      "type": "citation"
    },
    {
      "text": "1165517",
      "url": "https://news.un.org/en/story/2025/07/1165517",
      "domain": "news.un.org",
      "type": "citation"
    },
    {
      "text": "Understanding The Recent Conflict In Gaza Dhlfm 95xlk Fkphm",
      "url": "https://www.aipac.org/resources/understanding-the-recent-conflict-in-gaza-dhlfm-95xlk-fkphm",
      "domain": "aipac.org",
      "type": "citation"
    },
    {
      "text": "Siege Gazas Water",
      "url": "https://www.csis.org/analysis/siege-gazas-water",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Israel Cut Off Electricity Gaza Hamas Ceasefire Negotiations",
      "url": "https://www.theguardian.com/world/2025/mar/09/israel-cut-off-electricity-gaza-hamas-ceasefire-negotiations",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "World Middle East 68969239",
      "url": "https://www.bbc.com/news/world-middle-east-68969239",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Water Being Used Weapon War Gaza",
      "url": "https://www.doctorswithoutborders.org/latest/water-being-used-weapon-war-gaza",
      "domain": "doctorswithoutborders.org",
      "type": "citation"
    },
    {
      "text": "Informe Msf Choking Gaza Eng.pdf",
      "url": "https://www.msf.es/sites/default/files/2025-09/Informe-MSF-Choking-Gaza-ENG.pdf",
      "domain": "msf.es",
      "type": "citation"
    },
    {
      "text": "Humanitarian Effort Within The Gaza Strip",
      "url": "https://gaza-aid-data.gov.il/mainhome/humanitarian-effort-within-the-gaza-strip/",
      "domain": "gaza-aid-data.gov.il",
      "type": "citation"
    },
    {
      "text": "Cn437jjygl9o",
      "url": "https://www.bbc.com/news/articles/cn437jjygl9o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "20251023 Aid To Gaza Still A Fraction Of Promised Amounts Un Data",
      "url": "https://www.france24.com/en/live-news/20251023-aid-to-gaza-still-a-fraction-of-promised-amounts-un-data",
      "domain": "france24.com",
      "type": "citation"
    },
    {
      "text": "3722518",
      "url": "https://www.aa.com.tr/en/middle-east/gaza-government-says-986-aid-trucks-entered-gaza-strip-since-ceasefire-far-short-of-agreed-total/3722518",
      "domain": "aa.com.tr",
      "type": "citation"
    },
    {
      "text": "20251026 06",
      "url": "https://www3.nhk.or.jp/nhkworld/en/news/20251026_06/",
      "domain": "www3.nhk.or.jp",
      "type": "citation"
    },
    {
      "text": "Humanitarian Aid Gaza Two Month Summary July 2025",
      "url": "https://new.embassies.gov.il/multilateral-organizations-france/en/news/humanitarian-aid-gaza-two-month-summary-july-2025",
      "domain": "new.embassies.gov.il",
      "type": "citation"
    },
    {
      "text": "Cj6ynz22871o",
      "url": "https://www.bbc.com/news/articles/cj6ynz22871o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Under Siege The Humanitarian Aid Crisis In Palestine",
      "url": "https://www.nextcenturyfoundation.org/under-siege-the-humanitarian-aid-crisis-in-palestine/",
      "domain": "nextcenturyfoundation.org",
      "type": "citation"
    },
    {
      "text": "Crossings",
      "url": "https://www.ochaopt.org/data/crossings",
      "domain": "ochaopt.org",
      "type": "citation"
    },
    {
      "text": "Gaza Aid Why Sea And Air Routes Risk Being Distraction",
      "url": "https://www.thenewhumanitarian.org/analysis/2024/03/13/gaza-aid-why-sea-and-air-routes-risk-being-distraction",
      "domain": "thenewhumanitarian.org",
      "type": "citation"
    },
    {
      "text": "Israel Announces Daily Pauses Gaza Fighting Aid Airdrops Begin 2025 07 27",
      "url": "https://www.reuters.com/world/middle-east/israel-announces-daily-pauses-gaza-fighting-aid-airdrops-begin-2025-07-27/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Sea Corridor Aid Gaza",
      "url": "https://www.theguardian.com/world/2024/mar/08/sea-corridor-aid-gaza",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Oig%2520final%2520report%2520 %2520jlots%2520maritime%2520corridor%2520evaluation.pdf",
      "url": "https://oig.usaid.gov/sites/default/files/2024-08/OIG%2520Final%2520Report%2520-%2520JLOTS%2520Maritime%2520Corridor%2520Evaluation.pdf",
      "domain": "oig.usaid.gov",
      "type": "citation"
    },
    {
      "text": "Us Pier In Gaza And The Chances Of Successful Delivery Of Aid By Sea",
      "url": "https://strategiecs.com/en/analyses/us-pier-in-gaza-and-the-chances-of-successful-delivery-of-aid-by-sea",
      "domain": "strategiecs.com",
      "type": "citation"
    },
    {
      "text": "Qatar Hamas Funds Israel Backing Intl",
      "url": "https://www.cnn.com/2023/12/11/middleeast/qatar-hamas-funds-israel-backing-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Eu Provides Additional Eu50 Million Emergency Humanitarian Aid Palestine",
      "url": "https://reliefweb.int/report/occupied-palestinian-territory/eu-provides-additional-eu50-million-emergency-humanitarian-aid-palestine",
      "domain": "reliefweb.int",
      "type": "citation"
    },
    {
      "text": "Humanitarian Aid In Gaza Whats Really Happening",
      "url": "https://www.ajc.org/news/humanitarian-aid-in-gaza-whats-really-happening",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "Army Okays Return To Towns Along Gaza Border As State Readies Incentives",
      "url": "https://www.timesofisrael.com/army-okays-return-to-towns-along-gaza-border-as-state-readies-incentives/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Cglkkrj94ldo",
      "url": "https://www.bbc.com/news/articles/cglkkrj94ldo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Report Un Silent On Israeli Idps",
      "url": "https://unwatch.org/report-un-silent-on-israeli-idps/",
      "domain": "unwatch.org",
      "type": "citation"
    },
    {
      "text": "Article 862627",
      "url": "https://www.jpost.com/israel-news/article-862627",
      "domain": "jpost.com",
      "type": "citation"
    },
    {
      "text": "Bank Israel Chief Critical 2025 Wartime Budget 2025 03 26",
      "url": "https://www.reuters.com/world/middle-east/bank-israel-chief-critical-2025-wartime-budget-2025-03-26/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Takeover Of Gaza City Could Cost Israel Nis 100 Billion Expert Estimates",
      "url": "https://www.timesofisrael.com/takeover-of-gaza-city-could-cost-israel-nis-100-billion-expert-estimates/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Israel War Economy Reservist Compensation",
      "url": "https://jacobin.com/2025/09/israel-war-economy-reservist-compensation",
      "domain": "jacobin.com",
      "type": "citation"
    },
    {
      "text": "Israel Approves Increase To Budget To Cover Ongoing Costs Of War",
      "url": "https://www.bloomberg.com/news/articles/2025-08-19/israel-approves-increase-to-budget-to-cover-ongoing-costs-of-war",
      "domain": "bloomberg.com",
      "type": "citation"
    },
    {
      "text": "Economic Impact Of Gaza War In Israel",
      "url": "https://www.statista.com/topics/12698/economic-impact-of-gaza-war-in-israel/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Economic Impact Israel War",
      "url": "https://www.focus-economics.com/blog/economic-impact-israel-war/",
      "domain": "focus-economics.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=gTjxFX-8Q3Q",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Israels Economy Faces An Uncertain Truce Dividend 2025 10 09",
      "url": "https://www.reuters.com/commentary/breakingviews/israels-economy-faces-an-uncertain-truce-dividend-2025-10-09/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Statement Icc Prosecutor Karim Aa Khan Kc Applications Arrest Warrants Situation State",
      "url": "https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state",
      "domain": "icc-cpi.int",
      "type": "citation"
    },
    {
      "text": "Israeli Forensic Teams Describe Signs Torture Abuse 2023 10 15",
      "url": "https://www.reuters.com/world/middle-east/israeli-forensic-teams-describe-signs-torture-abuse-2023-10-15/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Israel West Bank Mission",
      "url": "https://www.un.org/sexualviolenceinconflict/press-release/israel-west-bank-mission/",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "How Does International Humanitarian Law Apply Israel And Gaza",
      "url": "https://www.hrw.org/news/2023/10/27/how-does-international-humanitarian-law-apply-israel-and-gaza",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "Damning Evidence Of War Crimes As Israeli Attacks Wipe Out Entire Families In Gaza",
      "url": "https://www.amnesty.org/en/latest/news/2023/10/damning-evidence-of-war-crimes-as-israeli-attacks-wipe-out-entire-families-in-gaza/",
      "domain": "amnesty.org",
      "type": "citation"
    },
    {
      "text": "Gaza Genocide Claims Are Based On Skewed Facts Sometimes Deliberately Says Study Author",
      "url": "https://www.timesofisrael.com/gaza-genocide-claims-are-based-on-skewed-facts-sometimes-deliberately-says-study-author/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas And International Law What You Need To Know",
      "url": "https://www.ajc.org/news/israel-hamas-and-international-law-what-you-need-to-know",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "Israels Proportional And Humanitarian Response",
      "url": "https://www.fdd.org/analysis/2023/10/29/israels-proportional-and-humanitarian-response/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "213 Executive Summary.pdf",
      "url": "https://besacenter.org/wp-content/uploads/2025/07/213-Executive-summary.pdf",
      "domain": "besacenter.org",
      "type": "citation"
    },
    {
      "text": "13537121.2024.2394289",
      "url": "https://www.tandfonline.com/doi/full/10.1080/13537121.2024.2394289",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Gaza Fatality Data Has Become Completely Unreliable",
      "url": "https://www.washingtoninstitute.org/policy-analysis/gaza-fatality-data-has-become-completely-unreliable",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Cr5r76e127do",
      "url": "https://www.bbc.com/news/articles/cr5r76e127do",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "203454",
      "url": "https://www.icj-cij.org/node/203454",
      "domain": "icj-cij.org",
      "type": "citation"
    },
    {
      "text": "Icj Southafrica Israel Genocide 29dec2023",
      "url": "https://www.un.org/unispal/document/icj-southafrica-israel-genocide-29dec2023/",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "203447",
      "url": "https://www.icj-cij.org/node/203447",
      "domain": "icj-cij.org",
      "type": "citation"
    },
    {
      "text": "192",
      "url": "https://www.icj-cij.org/case/192",
      "domain": "icj-cij.org",
      "type": "citation"
    },
    {
      "text": "203847",
      "url": "https://www.icj-cij.org/node/203847",
      "domain": "icj-cij.org",
      "type": "citation"
    },
    {
      "text": "204100",
      "url": "https://www.icj-cij.org/node/204100",
      "domain": "icj-cij.org",
      "type": "citation"
    },
    {
      "text": "Icj Genocide Case What Are Israels Main Arguments",
      "url": "https://www.aljazeera.com/news/2024/1/12/icj-genocide-case-what-are-israels-main-arguments",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "The Bias Of Icj President Nawaf Salam 1.pdf",
      "url": "https://unwatch.org/wp-content/uploads/2024/07/The-Bias-of-ICJ-President-Nawaf-Salam-1.pdf",
      "domain": "unwatch.org",
      "type": "citation"
    },
    {
      "text": "The Icjs New Chief Judge Has A History Of Bias Against Israel",
      "url": "https://www.fdd.org/analysis/2024/02/19/the-icjs-new-chief-judge-has-a-history-of-bias-against-israel/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Israel And Icj Comparing International Court Cases During Gaza War",
      "url": "https://www.washingtoninstitute.org/policy-analysis/israel-and-icj-comparing-international-court-cases-during-gaza-war",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Home",
      "url": "https://www.icj-cij.org/home",
      "domain": "icj-cij.org",
      "type": "citation"
    },
    {
      "text": "Palestine",
      "url": "https://www.icc-cpi.int/palestine",
      "domain": "icc-cpi.int",
      "type": "citation"
    },
    {
      "text": "Situation State Palestine Icc Pre Trial Chamber I Rejects State Israels Challenges",
      "url": "https://www.icc-cpi.int/news/situation-state-palestine-icc-pre-trial-chamber-i-rejects-state-israels-challenges",
      "domain": "icc-cpi.int",
      "type": "citation"
    },
    {
      "text": "Icc Rejects Israeli Appeal Against Arrest Warrants For Netanyahu And Gallant",
      "url": "https://www.timesofisrael.com/icc-rejects-israeli-appeal-against-arrest-warrants-for-netanyahu-and-gallant/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Bidens Icc Hypocrisy Undermines International Law",
      "url": "https://www.brookings.edu/articles/bidens-icc-hypocrisy-undermines-international-law/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Reexamining The Question Of Icc Jurisdiction Regarding The Israel Hamas War",
      "url": "https://jcpa.org/reexamining-the-question-of-icc-jurisdiction-regarding-the-israel-hamas-war/",
      "domain": "jcpa.org",
      "type": "citation"
    },
    {
      "text": "0902ebd180ccfb3b.pdf",
      "url": "https://www.icc-cpi.int/sites/default/files/CourtRecords/0902ebd180ccfb3b.pdf",
      "domain": "icc-cpi.int",
      "type": "citation"
    },
    {
      "text": "What You Need To Know About The Icc And The Israel Hamas War",
      "url": "https://www.ajc.org/news/what-you-need-to-know-about-the-icc-and-the-israel-hamas-war",
      "domain": "ajc.org",
      "type": "citation"
    },
    {
      "text": "Icc Prosecutor Warned To Drop Netanyahu Case Or Be Destroyed Report",
      "url": "https://www.aljazeera.com/news/2025/7/16/icc-prosecutor-warned-to-drop-netanyahu-case-or-be-destroyed-report",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Icc Palestine Case Aftermath Arrest Warrants Decisions Part One",
      "url": "https://lieber.westpoint.edu/icc-palestine-case-aftermath-arrest-warrants-decisions-part-one/",
      "domain": "lieber.westpoint.edu",
      "type": "citation"
    },
    {
      "text": "Us Aircraft Carriers What They Bring Middle East 2023 10 15",
      "url": "https://www.reuters.com/world/us-aircraft-carriers-what-they-bring-middle-east-2023-10-15/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Us Aircraft Carrier Eisenhower Israel Gaza Intl Hnk Ml",
      "url": "https://edition.cnn.com/2023/10/14/middleeast/us-aircraft-carrier-eisenhower-israel-gaza-intl-hnk-ml",
      "domain": "edition.cnn.com",
      "type": "citation"
    },
    {
      "text": "Pentagon Orders Aircraft Carrier To Remain In Mediterranean Amid Israel Hamas War",
      "url": "https://www.timesofisrael.com/pentagon-orders-aircraft-carrier-to-remain-in-mediterranean-amid-israel-hamas-war/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Middle East Aircraft Carrier Commitment Keeps Pressure On U S Fleet Deployment Data Shows",
      "url": "https://news.usni.org/2025/06/18/middle-east-aircraft-carrier-commitment-keeps-pressure-on-u-s-fleet-deployment-data-shows",
      "domain": "news.usni.org",
      "type": "citation"
    },
    {
      "text": "U S Military Aid And Arms Transfers To Israel October 2023 September 2025",
      "url": "https://quincyinst.org/research/u-s-military-aid-and-arms-transfers-to-israel-october-2023-september-2025/",
      "domain": "quincyinst.org",
      "type": "citation"
    },
    {
      "text": "Us Aid Israel Four Charts",
      "url": "https://www.cfr.org/article/us-aid-israel-four-charts",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Costs%2520of%2520war Us%2520support%2520since%2520oct%25207%2520final%2520v2.pdf",
      "url": "https://watson.brown.edu/costsofwar/files/cow/imce/papers/2023/2024/Costs%2520of%2520War_US%2520Support%2520Since%2520Oct%25207%2520FINAL%2520v2.pdf",
      "domain": "watson.brown.edu",
      "type": "citation"
    },
    {
      "text": "Rl33222.51.pdf",
      "url": "https://www.congress.gov/crs_external_products/RL/PDF/RL33222/RL33222.51.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Us Has Given Least 217 Billion Military Aid Israel War Gaza Began Report Says.html",
      "url": "https://www.military.com/daily-news/2025/10/07/us-has-given-least-217-billion-military-aid-israel-war-gaza-began-report-says.html",
      "domain": "military.com",
      "type": "citation"
    },
    {
      "text": "1142507",
      "url": "https://news.un.org/en/story/2023/10/1142507",
      "domain": "news.un.org",
      "type": "citation"
    },
    {
      "text": "U S Vetoes Un Resolution Backed By Many Nations Demanding An Immediate Cease Fire In Gaza",
      "url": "https://www.pbs.org/newshour/world/u-s-vetoes-un-resolution-backed-by-many-nations-demanding-an-immediate-cease-fire-in-gaza",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "U S Vetoes Call For Ceasefire In Gaza For A Third Time",
      "url": "https://www.npr.org/2024/02/20/1232763327/u-s-vetoes-call-for-ceasefire-in-gaza-for-a-third-time",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Us Will Veto Un Security Council Resolution Gaza War Its Current Form Says 2024 11 20",
      "url": "https://www.reuters.com/world/middle-east/us-will-veto-un-security-council-resolution-gaza-war-its-current-form-says-2024-11-20/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Veto Of The United Nations Security Council Resolution On Gaza",
      "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/06/veto-of-the-united-nations-security-council-resolution-on-gaza",
      "domain": "state.gov",
      "type": "citation"
    },
    {
      "text": "Us Vetoes Gaza Ceasefire Un Security Council",
      "url": "https://www.theguardian.com/world/2025/jun/04/us-vetoes-gaza-ceasefire-un-security-council",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Confrontation Between United States And Iran",
      "url": "https://www.cfr.org/global-conflict-tracker/conflict/confrontation-between-united-states-and-iran",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Escalating War Between Israel Hezbollah And Iran",
      "url": "https://www.csis.org/analysis/escalating-war-between-israel-hezbollah-and-iran",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Israel And Palestine",
      "url": "https://www.hrw.org/world-report/2025/country-chapters/israel-and-palestine",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "Hezbollah And Israel A Timeline Of Conflict",
      "url": "https://www.aljazeera.com/news/2024/9/18/hezbollah-and-israel-a-timeline-of-conflict",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Lebanon Hezbollah Attacks Endangered Civilians",
      "url": "https://www.hrw.org/news/2025/03/07/israel/lebanon-hezbollah-attacks-endangered-civilians",
      "domain": "hrw.org",
      "type": "citation"
    },
    {
      "text": "A 74474581",
      "url": "https://www.dw.a/en/lebanon-attacks-stoke-fear-of-renewed-escalation/a-74474581",
      "domain": "dw.a",
      "type": "citation"
    },
    {
      "text": "Israeli Strikes Kill Three In Lebanon Before Army Targets Un Patrol",
      "url": "https://www.aljazeera.com/news/2025/10/26/israeli-strikes-kill-three-in-lebanon-before-army-targets-un-patrol",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Red Sea",
      "url": "https://www.crisisgroup.org/visual-explainers/red-sea/",
      "domain": "crisisgroup.org",
      "type": "citation"
    },
    {
      "text": "Houthi Shipping Attacks Israel Red Sea 002a52ed270245427fbe29a0118c3711",
      "url": "https://apnews.com/article/houthi-shipping-attacks-israel-red-sea-002a52ed270245427fbe29a0118c3711",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Houthis Attack Commercial Ship In The Red Sea Israeli Forces Strike Targets In Yemen",
      "url": "https://news.usni.org/2025/07/07/houthis-attack-commercial-ship-in-the-red-sea-israeli-forces-strike-targets-in-yemen",
      "domain": "news.usni.org",
      "type": "citation"
    },
    {
      "text": "Israel Gaza Ceasefire Red Sea Freight Containerships.html",
      "url": "https://www.cnbc.com/2025/10/13/israel-gaza-ceasefire-red-sea-freight-containerships.html",
      "domain": "cnbc.com",
      "type": "citation"
    },
    {
      "text": "After The Gaza Cease Fire Whats Next For The Houthis",
      "url": "https://www.atlanticcouncil.org/blogs/menasource/after-the-gaza-cease-fire-whats-next-for-the-houthis/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Miscalculations Iran And Its Proxies Have Created New Possibilities Middle East",
      "url": "https://www.hoover.org/research/miscalculations-iran-and-its-proxies-have-created-new-possibilities-middle-east",
      "domain": "hoover.org",
      "type": "citation"
    },
    {
      "text": "Despite Houthi Pledge Limit Attacks Red Sea Remains Highly Volatile",
      "url": "https://www.washingtoninstitute.org/policy-analysis/despite-houthi-pledge-limit-attacks-red-sea-remains-highly-volatile",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "International Reactions Hamas Attack Israel",
      "url": "https://www.washingtoninstitute.org/policy-analysis/international-reactions-hamas-attack-israel",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Israel Hamas War The Arab World",
      "url": "https://israelpolicyforum.org/israel-hamas-war-the-arab-world/",
      "domain": "israelpolicyforum.org",
      "type": "citation"
    },
    {
      "text": "Us Israel Arab Military Leaked Documents",
      "url": "https://www.washingtonpost.com/national-security/2025/10/11/us-israel-arab-military-leaked-documents/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "C20z3ykyxwzo",
      "url": "https://www.bbc.com/news/articles/c20z3ykyxwzo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "How Israels Bombing Impacts Qatars Role As Mediator In The War With Hamas",
      "url": "https://www.npr.org/2025/09/14/nx-s1-5538121/how-israels-bombing-impacts-qatars-role-as-mediator-in-the-war-with-hamas",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "The Abraham Accords After Gaza A Change Of Context",
      "url": "https://carnegieendowment.org/research/2025/04/the-abraham-accords-after-gaza-a-change-of-context?lang=en",
      "domain": "carnegieendowment.org",
      "type": "citation"
    },
    {
      "text": "Abraham Accords Five Years Resilience And Roadblocks",
      "url": "https://www.washingtoninstitute.org/policy-analysis/abraham-accords-five-years-resilience-and-roadblocks",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Abraham Accords 5 Years",
      "url": "https://www.inss.org.il/publication/abraham-accords-5-years/",
      "domain": "inss.org.il",
      "type": "citation"
    },
    {
      "text": "Saudi Israeli Normalization Is Still Possible If The United States Plays It Smart",
      "url": "https://www.atlanticcouncil.org/in-depth-research-reports/issue-brief/saudi-israeli-normalization-is-still-possible-if-the-united-states-plays-it-smart/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Arab League Hamas Gaza Israel Intl",
      "url": "https://edition.cnn.com/2025/07/30/middleeast/arab-league-hamas-gaza-israel-intl",
      "domain": "edition.cnn.com",
      "type": "citation"
    },
    {
      "text": "What Could The Israel Gaza Deal Mean For The Middle East",
      "url": "https://www.brookings.edu/articles/what-could-the-israel-gaza-deal-mean-for-the-middle-east/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Un Condemns Israel 17 Times 6 On Rest Of World Combined",
      "url": "https://unwatch.org/un-condemns-israel-17-times-6-on-rest-of-world-combined/",
      "domain": "unwatch.org",
      "type": "citation"
    },
    {
      "text": "Double Standards Debate Un",
      "url": "https://www.crisisgroup.org/middle-east-north-africa/israelpalestine/double-standards-debate-un",
      "domain": "crisisgroup.org",
      "type": "citation"
    },
    {
      "text": "Cnvyyz8461yo",
      "url": "https://www.bbc.com/news/articles/cnvyyz8461yo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Unrwa",
      "url": "https://govextra.gov.il/unrwa/unrwa/",
      "domain": "govextra.gov.il",
      "type": "citation"
    },
    {
      "text": "Un Bias Against Israel",
      "url": "https://new.embassies.gov.il/philippines/en/news/un-bias-against-israel",
      "domain": "new.embassies.gov.il",
      "type": "citation"
    },
    {
      "text": "Un Halves Its Estimate Women And Children Killed Gaza",
      "url": "https://www.cfr.org/blog/un-halves-its-estimate-women-and-children-killed-gaza",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Untangling Uns Gaza Fatality Data",
      "url": "https://www.washingtoninstitute.org/policy-analysis/untangling-uns-gaza-fatality-data",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "Hamas Run Health Ministry Quietly Removes Thousands From Gaza Death Toll Researchers Find",
      "url": "https://www.euronews.com/2025/04/03/hamas-run-health-ministry-quietly-removes-thousands-from-gaza-death-toll-researchers-find",
      "domain": "euronews.com",
      "type": "citation"
    },
    {
      "text": "Hjs Hamas Casualty Reports Report Web Correct.pdf",
      "url": "https://henryjacksonsociety.org/wp-content/uploads/2025/04/HJS-Hamas-Casualty-Reports-Report-WEB-correct.pdf",
      "domain": "henryjacksonsociety.org",
      "type": "citation"
    },
    {
      "text": "Article 866183",
      "url": "https://www.jpost.com/israel-news/article-866183",
      "domain": "jpost.com",
      "type": "citation"
    },
    {
      "text": "Papers.cfm",
      "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1534066",
      "domain": "papers.ssrn.com",
      "type": "citation"
    },
    {
      "text": "Amnesty Internationals Propaganda On Gaza",
      "url": "https://ngo-monitor.org/reports/amnesty-internationals-propaganda-on-gaza/",
      "domain": "ngo-monitor.org",
      "type": "citation"
    },
    {
      "text": "682148",
      "url": "https://www.theatlantic.com/ideas/archive/2025/03/ngos-anti-israel-bias/682148/",
      "domain": "theatlantic.com",
      "type": "citation"
    },
    {
      "text": "Israel Under Fire Ngo Warfare From Human Rights Watch To Campus Mobs",
      "url": "https://jcpa.org/article/israel-under-fire-ngo-warfare-from-human-rights-watch-to-campus-mobs/",
      "domain": "jcpa.org",
      "type": "citation"
    },
    {
      "text": "Amnesty Internationals Cruel Assault On Israel",
      "url": "https://ngo-monitor.org/reports/amnesty-internationals-cruel-assault-on-israel/",
      "domain": "ngo-monitor.org",
      "type": "citation"
    },
    {
      "text": "Idf Leaders Warn Hamas Tunnels In Gaza Are Still A Major Weapon And Need To Be Destroyed",
      "url": "https://nypost.com/2025/10/13/world-news/idf-leaders-warn-hamas-tunnels-in-gaza-are-still-a-major-weapon-and-need-to-be-destroyed/",
      "domain": "nypost.com",
      "type": "citation"
    },
    {
      "text": "Israel Hamas War 700 Day Report Final Compressed.pdf",
      "url": "https://councilforsecureamerica.org/wp-content/uploads/2025/09/Israel-Hamas-War-700-Day-Report-FINAL-compressed.pdf",
      "domain": "councilforsecureamerica.org",
      "type": "citation"
    },
    {
      "text": "Idf Hits 130 Hamas Sites Expands Tunnel Hunt Across Gaza Report",
      "url": "https://risingkashmir.com/idf-hits-130-hamas-sites-expands-tunnel-hunt-across-gaza-report/",
      "domain": "risingkashmir.com",
      "type": "citation"
    },
    {
      "text": "500 Targets Struck In Gaza Offensive",
      "url": "https://www.ifcj.org/news/stand-for-israel-blog/500-targets-struck-in-gaza-offensive",
      "domain": "ifcj.org",
      "type": "citation"
    },
    {
      "text": "Hamas Leaders Killed By Israel Those Who Remain 2025 09 09",
      "url": "https://www.reuters.com/world/middle-east/hamas-leaders-killed-by-israel-those-who-remain-2025-09-09/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "World Middle East 67103298",
      "url": "https://www.bbc.com/news/world-middle-east-67103298",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Gaza After Two Years Israel Expands Control And Sows Chaos Hamas Adapts Survive",
      "url": "https://acleddata.com/report/gaza-after-two-years-israel-expands-control-and-sows-chaos-hamas-adapts-survive",
      "domain": "acleddata.com",
      "type": "citation"
    },
    {
      "text": "5555653 Gaza Ceasefire Hamas Control",
      "url": "https://thehill.com/policy/international/5555653-gaza-ceasefire-hamas-control/",
      "domain": "thehill.com",
      "type": "citation"
    },
    {
      "text": "Guide Trumps Twenty Point Gaza Peace Deal",
      "url": "https://www.cfr.org/article/guide-trumps-twenty-point-gaza-peace-deal",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Cr5e4ee9r13o",
      "url": "https://www.bbc.com/news/articles/cr5e4ee9r13o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Rebuilding Gaza Could Cost More Than 120 Billion",
      "url": "https://www.jns.org/rebuilding-gaza-could-cost-more-than-120-billion/",
      "domain": "jns.org",
      "type": "citation"
    },
    {
      "text": "Fact Check Team How Will Gaza Rebuild Palestinian Authority Infrastructure United Nations Europe Japan Humanitarian",
      "url": "https://thenationaldesk.com/news/fact-check-team/fact-check-team-how-will-gaza-rebuild-palestinian-authority-infrastructure-united-nations-europe-japan-humanitarian",
      "domain": "thenationaldesk.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/International/rebuilding-gaza-decades-cost-70b-experts/story?id=126593739",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "World Bank Un And Eu Raise Estimated Cost Of Gaza Reconstruction To 70 Billion",
      "url": "https://www.timesofisrael.com/world-bank-un-and-eu-raise-estimated-cost-of-gaza-reconstruction-to-70-billion/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Unog Press Briefing 14oct25",
      "url": "https://www.un.org/unispal/document/unog-press-briefing-14oct25/",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "Un Says States Willing Fund Gazas 70 Bln Rebuild 2025 10 14",
      "url": "https://www.reuters.com/world/middle-east/un-says-states-willing-fund-gazas-70-bln-rebuild-2025-10-14/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Gaza Reconstruction Government",
      "url": "https://www.npr.org/2025/10/16/g-s1-93590/gaza-reconstruction-government",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Gaza Peace Plan The 14 Year Rehearsal",
      "url": "https://www.visionofhumanity.org/gaza-peace-plan-the-14-year-rehearsal/",
      "domain": "visionofhumanity.org",
      "type": "citation"
    },
    {
      "text": "Twenty Questions About The Next Phase Of An Israel Hamas Deal",
      "url": "https://www.atlanticcouncil.org/blogs/new-atlanticist/twenty-questions-about-the-next-phase-of-an-israel-hamas-deal/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Us Rejects Hamas Unrwa Roles In Gaza As Israeli Aid Blockade Persists",
      "url": "https://www.aljazeera.com/news/2025/10/24/us-rejects-hamas-unrwa-roles-in-gaza-as-israeli-aid-blockade-persists",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "How Palestinian Authority Failed Its People",
      "url": "https://www.washingtoninstitute.org/policy-analysis/how-palestinian-authority-failed-its-people",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "The Pas Return To Gaza Is Impractical And Unwanted",
      "url": "https://jcpa.org/the-pas-return-to-gaza-is-impractical-and-unwanted/",
      "domain": "jcpa.org",
      "type": "citation"
    },
    {
      "text": "Hamas Aims Keep Grip Gaza Security Cant Commit Disarm Senior Official Says 2025 10 17",
      "url": "https://www.reuters.com/world/middle-east/hamas-aims-keep-grip-gaza-security-cant-commit-disarm-senior-official-says-2025-10-17/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Article 871132",
      "url": "https://www.jpost.com/israel-news/defense-news/article-871132",
      "domain": "jpost.com",
      "type": "citation"
    },
    {
      "text": "Cn51w77vlp9o",
      "url": "https://www.bbc.com/news/articles/cn51w77vlp9o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Gaza Peace Plans.html",
      "url": "https://www.nytimes.com/2025/09/29/world/middleeast/gaza-peace-plans.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Postwar Gaza Authority Gita Tony Blair",
      "url": "https://www.theguardian.com/world/2025/sep/29/postwar-gaza-authority-gita-tony-blair",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "3719045",
      "url": "https://www.aa.com.tr/en/middle-east/palestinian-government-unveils-67-billion-five-year-plan-for-gaza-reconstruction/3719045",
      "domain": "aa.com.tr",
      "type": "citation"
    },
    {
      "text": "How Palestinian Authority Failed Its People",
      "url": "https://www.washingtoninstitute.org/policy-assessment/how-palestinian-authority-failed-its-people",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "The Palestinian Authority Is Facing A Legitimacy Crisis Can It Be Reformed To Govern A Palestinian State 263042",
      "url": "https://theconversation.com/the-palestinian-authority-is-facing-a-legitimacy-crisis-can-it-be-reformed-to-govern-a-palestinian-state-263042",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "Hamas Cant Rebuild Gaza Trumps Plan Work Palestinians Must Be Given Hope",
      "url": "https://www.chathamhouse.org/2025/10/hamas-cant-rebuild-gaza-trumps-plan-work-palestinians-must-be-given-hope",
      "domain": "chathamhouse.org",
      "type": "citation"
    },
    {
      "text": "Gaza Israel Hamas Rehabilitation Post War",
      "url": "https://www.atlanticcouncil.org/blogs/menasource/gaza-israel-hamas-rehabilitation-post-war/",
      "domain": "atlanticcouncil.org",
      "type": "citation"
    },
    {
      "text": "Plan Postwar Gaza",
      "url": "https://www.wilsoncenter.org/publication/plan-postwar-gaza",
      "domain": "wilsoncenter.org",
      "type": "citation"
    },
    {
      "text": "Political Instability Lebanon",
      "url": "https://www.cfr.org/global-conflict-tracker/conflict/political-instability-lebanon",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Hezbollah Said To Estimate Up To 4000 Fighters May Have Been Killed In War",
      "url": "https://www.timesofisrael.com/hezbollah-said-to-estimate-up-to-4000-fighters-may-have-been-killed-in-war/",
      "domain": "timesofisrael.com",
      "type": "citation"
    },
    {
      "text": "Can Regional War Be Avoided Middle East",
      "url": "https://www.csis.org/analysis/can-regional-war-be-avoided-middle-east",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Impact Of The Israel Hamas War On Shipping In The Red Sea",
      "url": "https://www.statista.com/topics/12046/impact-of-the-israel-hamas-war-on-shipping-in-the-red-sea/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Red Sea Insurance Soars After Deadly Houthi Ship Attacks 2025 07 10",
      "url": "https://www.reuters.com/business/autos-transportation/red-sea-insurance-soars-after-deadly-houthi-ship-attacks-2025-07-10/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Houthis Threaten To Target All Ships Belonging To Companies Conducting Commerce With Israel",
      "url": "https://www.fdd.org/analysis/2025/07/28/houthis-threaten-to-target-all-ships-belonging-to-companies-conducting-commerce-with-israel/",
      "domain": "fdd.org",
      "type": "citation"
    },
    {
      "text": "Houthi Shipping Attacks Patterns And Expectations 2025",
      "url": "https://www.washingtoninstitute.org/policy-analysis/houthi-shipping-attacks-patterns-and-expectations-2025",
      "domain": "washingtoninstitute.org",
      "type": "citation"
    },
    {
      "text": "What Know About Israeli Strike Iran",
      "url": "https://www.csis.org/analysis/what-know-about-israeli-strike-iran",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "2025 Irans Threat Regional And Euro Atlantic Security Gsm Report",
      "url": "https://www.nato-pa.int/document/2025-irans-threat-regional-and-euro-atlantic-security-gsm-report",
      "domain": "nato-pa.int",
      "type": "citation"
    },
    {
      "text": "The Middle Easts Next Aftershocks.html",
      "url": "https://www.rand.org/pubs/commentary/2025/01/the-middle-easts-next-aftershocks.html",
      "domain": "rand.org",
      "type": "citation"
    },
    {
      "text": "Lieberman",
      "url": "https://www.inss.org.il/strategic_assessment/lieberman/",
      "domain": "inss.org.il",
      "type": "citation"
    },
    {
      "text": "Deterrence",
      "url": "https://www.inss.org.il/strategic_assessment/deterrence/",
      "domain": "inss.org.il",
      "type": "citation"
    },
    {
      "text": "Nine Critical Lessons From Israels October 7 War And What They Mean For Sof",
      "url": "https://irregularwarfare.org/articles/nine-critical-lessons-from-israels-october-7-war-and-what-they-mean-for-sof/",
      "domain": "irregularwarfare.org",
      "type": "citation"
    },
    {
      "text": "Article 869558",
      "url": "https://www.jpost.com/opinion/article-869558",
      "domain": "jpost.com",
      "type": "citation"
    },
    {
      "text": "Dostri",
      "url": "https://www.armyupress.army.mil/journals/military-review/online-exclusive/2023-ole/dostri/",
      "domain": "armyupress.army.mil",
      "type": "citation"
    },
    {
      "text": "Failed Deterrence And Misplaced Compellence In Gaza",
      "url": "https://globalsecurityreview.com/failed-deterrence-and-misplaced-compellence-in-gaza/",
      "domain": "globalsecurityreview.com",
      "type": "citation"
    },
    {
      "text": "How Could Israeli Intelligence Miss Hamas Invasion Plans",
      "url": "https://www.csis.org/analysis/how-could-israeli-intelligence-miss-hamas-invasion-plans",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Israels Oct 7 Early Warning Failure Who Is To Blame",
      "url": "https://warontherocks.com/2024/10/israels-oct-7-early-warning-failure-who-is-to-blame/",
      "domain": "warontherocks.com",
      "type": "citation"
    },
    {
      "text": "Fulltext.pdf",
      "url": "https://bura.brunel.ac.uk/bitstream/2438/30042/4/FullText.pdf",
      "domain": "bura.brunel.ac.uk",
      "type": "citation"
    },
    {
      "text": "03071847.2025.2487510",
      "url": "https://www.tandfonline.com/doi/full/10.1080/03071847.2025.2487510",
      "domain": "tandfonline.com",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:24:16.959641",
  "elapsed_ms": 609897
}