{
  "topic": "January 6 United States Capitol Attack",
  "title": "January 6 United States Capitol riot (2021)",
  "slug": "january-6-united-states-capitol-attack",
  "grokipedia_slug": "January_6_United_States_Capitol_attack",
  "grokipedia_url": "https://grokipedia.com/page/January_6_United_States_Capitol_attack",
  "source": "grokipedia",
  "content": "# January 6 United States Capitol riot (2021)\n\nThe January 6, 2021, riot at the United States Capitol involved thousands of supporters of outgoing President Donald Trump gathering in Washington, D.C., to protest the certification of the 2020 presidential election results, with initial breaches of barriers occurring around 12:53 p.m. while Trump's Ellipse speech was ongoing, before the main post-speech crowd marched the 1.5-mile distance, culminating in some overcoming police barriers and entering the building during a joint session of Congress, temporarily halting proceedings for several hours. The rally preceding the advance featured Trump's remarks encouraging attendees to \"march to the Capitol building to peacefully and patriotically make your voices heard,\" alongside repeated calls to \"fight like hell\" against perceived election irregularities. Property damage from the incursion totaled approximately $2.73 million, primarily to doors, windows, and furnishings, far less than initial estimates that included broader security costs.\n\nThe unrest resulted in injuries to over 140 law enforcement officers, one protester—Ashli Babbitt—fatally shot by Capitol Police while attempting to breach a barricaded door, and four other deaths among participants from medical emergencies during or shortly after the events; Officer Brian Sicknick collapsed from strokes the following evening, with no evidence linking his death directly to protester violence. Federal prosecutors have secured over 1,100 convictions related to the riot as of late 2024, with the majority involving misdemeanor charges such as unauthorized entry or disorderly conduct rather than violent felonies, though a small number faced seditious conspiracy counts tied to group planning.\n\nDebates persist over the event's nature and causes, including security lapses by Capitol Police and National Guard delays despite prior intelligence of potential unrest, the role of FBI informants embedded in crowds, and comparisons to scale with contemporaneous urban riots that caused billions in damages and dozens of deaths but elicited different institutional responses. Empirical analyses highlight that while some participants engaged in vandalism and assaults, video evidence shows many inside the building for brief periods without destruction, and few bore weapons beyond improvised items, challenging narratives of widespread armed insurrection. The incident spurred congressional investigations, impeachment proceedings against Trump (acquitted by Senate), and ongoing civil litigation, underscoring divisions over election integrity and protest rights.\n## Background\n\nThe United States Capitol has a long history of incidents involving political violence and security breaches, including the 1954 shooting by Puerto Rican nationalists that wounded five members of Congress, the 1971 bombing by the Weather Underground causing approximately $300,000 in damage with no injuries, the 1983 bombing by the Armed Resistance Unit that damaged Senate offices without casualties, and the 1998 shooting in the Russell Senate Office Building that killed two Capitol Police officers. The 2021 riot was one such event, occurring amid heightened tensions over the certification of the 2020 presidential election results and claims of widespread election fraud.\n\n### 2020 Presidential Election Disputes\n\nThe 2020 United States presidential election featured narrow margins in several swing states that determined the outcome, with Joe Biden defeating Donald Trump by 11,779 votes in Georgia (0.23% margin), 10,457 votes in Arizona (0.3%), 20,682 votes in Wisconsin (0.63%), and 80,555 votes in Pennsylvania (1.16%). These razor-thin results, totaling 123,473 votes across the four states that flipped from Trump's 2016 victories, prompted extensive post-election scrutiny, including recounts and audits that ultimately affirmed Biden's wins but did not fully assuage public skepticism among Republicans, with polls showing 70-80% of GOP voters doubting the results' integrity.\n\nProcedural irregularities in vote counting fueled specific disputes, such as the late-night reporting of over 170,000 absentee ballots from Milwaukee on November 4, 2020, around 3-4 a.m., which overwhelmingly favored Biden by a 3-to-1 ratio and shifted Wisconsin's statewide lead. This \"ballot dump,\" as termed by observers, occurred after in-person votes were tallied but absentee processing continued into early morning due to high volume in Democratic strongholds, leading to Trump campaign lawsuits alleging improper handling, though courts rejected fraud claims while noting the timing's optics. In Detroit's TCF Center, Republican poll challengers reported denied access and windows obscured with cardboard during absentee ballot processing on November 4, prompting affidavits from over 130 witnesses and lawsuits like Costantino v. City of Detroit, which alleged misconduct but were dismissed for lack of evidence of outcome-altering irregularities.\n\nTrump's legal team filed over 60 lawsuits challenging election procedures and results across battleground states, securing minor victories like a Pennsylvania ruling invalidating undated mail ballots but failing in most cases to alter certifications, often due to procedural barriers such as laches or standing rather than merits adjudication. In Texas v. Pennsylvania, the U.S. Supreme Court dismissed Texas's challenge to changes in election rules in Georgia, Michigan, Pennsylvania, and Wisconsin on December 11, 2020, citing lack of standing without addressing substantive claims of unequal treatment under the Electors Clause. Post-election audits, including Georgia's hand recount confirming Biden's margin, Arizona's Maricopa County forensic review (which increased Biden's lead by 360 votes), and Wisconsin's partial recount upholding results, verified tabulations but highlighted issues like signature mismatches and chain-of-custody concerns that sustained doubts without proving widespread fraud.\n### Trump's Post-Election Actions and Rally Call\n\nFollowing the November 3, 2020, presidential election, President Donald Trump delivered remarks from the White House on November 4, declaring that his campaign had secured a decisive victory despite many votes remaining uncounted in key battleground states. In the speech, Trump stated, \"We were getting ready to win this election. Frankly, we did win this election,\" while asserting wins in states like Pennsylvania and Michigan that were not yet finalized, prompting rebukes from election officials and his opponent, Joe Biden, for prematurely influencing public perception amid ongoing tabulation. \n\nTrump's post-election communications amplified allegations of widespread voter fraud and irregularities, coining and promoting the \"Stop the Steal\" slogan through social media posts and retweets starting in early November. Over the following weeks, he issued dozens of statements on Twitter and at rallies claiming the election had been \"rigged\" due to issues like mail-in ballots and Dominion voting machines, though federal agencies and courts largely dismissed these as unsubstantiated. Trump coordinated with personal attorneys Rudy Giuliani and Sidney Powell to file over 60 lawsuits challenging results in battleground states, with Giuliani leading press conferences alleging coordinated Democratic fraud, while Powell promoted theories of foreign interference via voting software—efforts that yielded few legal successes but sustained public mobilization. \n\nAmid these challenges, Trump exerted direct pressure on state officials to revisit vote counts, exemplified by his January 2, 2021, phone call to Georgia Secretary of State Brad Raffensperger, where he urged, \"I just want to find 11,780 votes,\" matching Biden's margin, and referenced unverified claims of shredded ballots and dead voters. Raffensperger's office, after audits confirming the results, resisted altering certification, noting no evidence supported the demands.\n\nOn December 19, 2020, Trump announced via Twitter a \"Save America\" rally in Washington, D.C., on January 6, 2021—the date of congressional certification of electoral votes—stating, \"Big protest in D.C. on January 6th. Be there, will be wild!\" The event was explicitly framed as opposition to the certification process, which Trump portrayed as ratifying a stolen election, though he had previously emphasized peaceful participation in protests, tweeting calls to \"peacefully and patriotically make your voices heard\" in related contexts. This rally call followed a pattern of urging supporters to demonstrate against perceived fraud while pursuing parallel legal and political avenues to delay or contest certification.\n\n### Societal and Political Tensions Leading Up\n\nThe United States experienced profound societal divisions in 2020, exacerbated by widespread unrest following the death of George Floyd on May 25, 2020, while in police custody in Minneapolis. Protests against perceived police brutality, often organized under the Black Lives Matter banner, spread to over 2,000 cities and towns, with many devolving into riots involving arson, looting, and clashes with law enforcement. These events resulted in at least 25 deaths associated with the demonstrations and related political unrest, including victims of riot-related violence, shootings during curfew violations, and confrontations. Insured property damages from the riots totaled between $1 billion and $2 billion, marking the costliest civil disorder in U.S. insurance history, surpassing the 1992 Los Angeles riots. In contrast, conservative responses to political grievances during this period, including opposition to COVID-19 lockdowns and election irregularities, remained largely confined to peaceful rallies and legal challenges, without comparable widespread destruction or fatalities.\n\nThese events deepened partisan polarization, as mainstream media outlets frequently described the riots as \"mostly peaceful\" despite empirical evidence of violence in over 220 locations, including federal buildings set ablaze and billions in economic losses. Such framing, coupled with institutional reluctance to classify the unrest as riots—despite over 14,000 arrests—fostered perceptions of unequal application of narrative standards, eroding trust in media among conservative audiences. Meanwhile, the 2020 presidential election, held on November 3, amplified tensions, with former President Donald Trump and supporters alleging irregularities in mail-in voting, ballot processing, and observer access in key states like Pennsylvania, Georgia, and Michigan. Legal efforts to investigate these claims yielded mixed results, but dismissals often cited procedural grounds rather than substantive merits, further entrenching skepticism.\n\nSocial media platforms intensified divisions through content moderation policies targeting election-related discourse. Beginning in November 2020 and continuing into December, Twitter affixed warning labels to Trump's tweets asserting fraud, such as \"This claim about election fraud is disputed,\" limiting visibility and replies without providing linked evidence for rebuttals. These interventions, justified by platforms as combating misinformation, were criticized for subjective enforcement favoring one political viewpoint, given prior tolerance for unverified claims during the summer unrest. The cumulative effect contributed to a sense of institutional capture, prompting Trump's permanent suspension from Twitter on January 8, 2021, after the Capitol events.\n\nPublic opinion reflected this distrust: by early January 2021, polls indicated that approximately 70% of Republicans believed the election had been marred by widespread fraud sufficient to alter the outcome, with majorities doubting Joe Biden's legitimacy as president-elect. An AP-NORC survey conducted January 28 to February 1, 2021—capturing sentiment immediately post-January 6—found 70% of Republicans viewing Biden's win as illegitimate, a view held by only 6% of Democrats. Rasmussen Reports data from February 2021 corroborated that most GOP voters rejected the election's fairness, attributing doubts to unresolved anomalies like late-night ballot dumps and expanded no-excuse absentee voting amid pandemic rules. This widespread Republican skepticism, amid broader societal fractures, set the stage for heightened mobilization around certifying the Electoral College results on January 6.\n## Planning and Security Preparations\n\n### Rally Organization by Trump Allies\n\nThe rally at the Ellipse on January 6, 2021, was primarily organized by Women for America First, a pro-Trump group, which applied to the National Park Service for a permit on December 19, 2020, initially estimating 5,000 attendees before amending it to 30,000. The permit authorized a static demonstration on the Ellipse southwest quadrant from 9:00 a.m. to 4:00 p.m., explicitly stating no intent to march to the Capitol or elsewhere. No separate permit was obtained for any procession to the Capitol, rendering the subsequent march unpermitted under D.C. regulations.\n\nParallel efforts by activist Ali Alexander through the Stop the Steal movement promoted multiple rallies in Washington, D.C., from November 2020 onward, framing them as peaceful protests to contest the 2020 election results and urge congressional objections during certification. Alexander's social media posts and event announcements emphasized non-violent assembly and free speech, without directives for armed confrontation or structural disruption of government proceedings. Broader online mobilization by Trump supporters relied on decentralized platforms like Parler and Facebook groups, where discussions centered on turnout for demonstration rather than tactical violence, with no verifiable evidence of centralized instructions to bring weapons or execute forcible entry.\n\nGroups such as the Proud Boys and Oath Keepers maintained presence at the rally and subsequent events, with internal communications showing some operational coordination among members for self-protection during protests. However, early FBI investigations in 2021 assessed that the overall gathering lacked a singular, orchestrated plot for insurrection, attributing actions to opportunistic escalation by individuals rather than a unified directive from Trump allies. Department of Justice statements from that period similarly noted insufficient evidence of premeditated, large-scale violence planning tied to rally organizers, highlighting instead ad hoc decisions by subsets of attendees. This decentralized structure, evident in the absence of hierarchical commands for armament or breach tactics, aligned with patterns of spontaneous crowd dynamics over premeditated overthrow.\n\n### Intelligence Assessments and Warnings Ignored\n\nIn December 2020, the Department of Homeland Security (DHS) issued a National Terrorism Advisory System bulletin warning of potential violence from domestic extremists in response to the presidential election results, but it focused on risks to state capitols and infrastructure rather than the U.S. Capitol specifically, classifying threats as primarily from lone actors or small groups with low operational sophistication. The Federal Bureau of Investigation (FBI) similarly disseminated internal reports noting heightened rhetoric among militias and extremists regarding election disputes, yet assessed the likelihood of coordinated violence against federal buildings as low, with no actionable intelligence forecasting a mass breach of the Capitol to disrupt certification proceedings.\n\nThe U.S. Capitol Police (USCP) intelligence operations experienced significant lapses, including the failure to elevate or act on multiple tips about armed individuals planning to \"storm\" the Capitol, which were dismissed as hyperbolic speech or protected First Amendment activity rather than indicators of intent. For instance, on January 3, 2021, USCP received an FBI intelligence report explicitly stating that \"Congress itself is the target\" amid discussions of violence at the Capitol, but this was not escalated to leadership or integrated into operational planning, contributing to understaffing and inadequate barriers. Social media monitoring by USCP also overlooked patterns in posts from groups like the Proud Boys and Oath Keepers referencing breaching perimeters, as analysts prioritized general protest dynamics over specific threat vectors.\n\nA June 2021 bipartisan Senate report highlighted systemic inter-agency silos that hindered intelligence sharing, such as the Secret Service withholding details on rally-related threats from USCP and the FBI not fully disseminating field office memos on extremist mobilization to Capitol security partners. National Guard intelligence units identified potential for unrest but faced delays in approval chains, with relevant data not looped into DHS or FBI fusion centers prior to January 6. These breakdowns reflected not just collection gaps but analytical underestimation, where vague online agitation was not connected to operational risks despite historical precedents of election-related disturbances.\n\n### Capitol Police and Federal Agency Responses\n\nThe United States Capitol Police (USCP) entered January 6, 2021, with approximately 1,200 officers on duty, significantly below levels recommended for high-threat events, amid chronic understaffing that left the force operating with hundreds of vacancies. Despite prior intelligence indicating potential violence targeting Congress, physical barriers around the Capitol were not reinforced or expanded into a hardened perimeter, and riot shields were improperly stored, rendering them unusable. USCP leadership, including Chief Steven Sund, had requested National Guard support as early as January 3, but these pleas were denied multiple times by House and Senate Sergeants at Arms, who deferred to congressional leadership approval processes.\n\nSund reiterated urgent requests for Guard deployment during the initial breach, but approvals were delayed for over 70 minutes as the requests ascended \"the chain\" involving Speaker Nancy Pelosi's office and Pentagon officials. Pelosi, whose office shared oversight of Capitol security via the House Administration Committee, later acknowledged in unaired footage, \"I take responsibility\" for inadequate preparations, contradicting claims attributing delays solely to former President Trump. A House Administration Committee review highlighted systemic leadership failures, including politicization of USCP operations that hindered proactive measures like enhanced staffing or equipment readiness.\n\nFederal agencies contributed to preparation shortfalls through inadequate intelligence sharing. The FBI maintained over 20 confidential human sources embedded in protest-affiliated groups in the preceding weeks but failed to synthesize or elevate warnings of an imminent Capitol breach to USCP or other protectors. A 2023 Senate report criticized the FBI and Department of Homeland Security's intelligence arm for \"fundamental\" failures in assessing threat severity, despite obtaining raw data on violent intentions, resulting in no escalated alerts for reinforced defenses. While no FBI personnel were authorized to incite or participate in the breach, the presence of informants underscored missed opportunities to preempt security gaps.\n\n## Chronology of Events on January 6, 2021\n\n### Pipe bombs at RNC and DNC headquarters\n\nOn January 5, 2021, surveillance footage captured a hooded suspect—wearing a gray sweatshirt, face mask, gloves, eyeglasses, and distinctive Nike Air Max Speed Turf sneakers while carrying a backpack—planting two pipe bombs between approximately 7:52 p.m. and 8:14 p.m. The suspect placed the Democratic National Committee (DNC) bomb next to a bench on the west side at approximately 7:52 p.m., then the Republican National Committee (RNC) bomb in an alleyway near a dumpster around 8:14 p.m. The devices were assessed as viable and capable of detonation, causing serious injury or death if triggered.\n\nA U.S. Secret Service advance sweep the next morning, from 8:30 a.m. to 10:30 a.m. on January 6, used two canine teams but overlooked the DNC bomb despite its proximity to the entry ramp, with lapses attributed to inconsistent protocols focusing on interior paths and select exterior areas without explosive ordnance disposal deployment; a 2024 DHS Office of Inspector General report raised concerns about these failures and recommended policy updates, with the Secret Service implementing related policy changes post-January 6.\n\nThen-Vice President-elect Kamala Harris arrived at the DNC around 11:25 a.m., her motorcade passing within 20 feet of the undiscovered DNC bomb and remaining inside for about 1 hour and 40 minutes. The RNC bomb was discovered at approximately 12:38 p.m. by a passerby, and the DNC bomb at 1:05 p.m. by U.S. Capitol Police officers on patrol, prior to the primary Capitol breaches. Following its discovery, Harris was evacuated.\n\nPost-discovery, limited urgency allowed the passage of schoolchildren, Speaker Pelosi's motorcade, and over 40 vehicles before robot deployment at 1:43 p.m. The discoveries redirected USCP countersurveillance units and bomb squads away from the Capitol and prevented the repositioning of approximately 400 bicycle racks scheduled to reinforce Capitol barriers that afternoon.\n\nAccording to a January 2025 House Administration Subcommittee report, the redirecting of Capitol Police contributed to security vulnerabilities. The same report critiqued the FBI's lack of progress despite substantial leads, extensive video evidence, and tips. Specific issues included reportedly corrupted or overwritten cell-phone geolocation data potentially identifying the suspect (though the cellular carrier stated it was never notified of any issue by the FBI), an individual who searched online for “pipe bomb DC” after placement but before discovery, and five persons whose cell-phone location data on January 5 matched the suspect’s route (pp. 3–4, 66–68).\n\nOn December 4, 2025, the FBI arrested Brian J. Cole, Jr., a 30-year-old resident of Woodbridge, Virginia, and charged him with transporting and planting the pipe bombs near the RNC and DNC headquarters.\n### Trump's Ellipse Speech and Key Statements\n\nWhile Vice President-elect Kamala Harris remained inside the DNC headquarters amid the unfolding pipe bomb discoveries, President Trump began his speech at the \"Save America\" rally on the Ellipse near the White House, which lasted from approximately 12:00 p.m. to 1:10 p.m. ET.  The address focused primarily on allegations of widespread fraud in the 2020 presidential election, which Trump described as having been \"won by a landslide.\" He referenced specific instances of purported irregularities in states like Georgia, Pennsylvania, and Michigan, urging persistence in legal and political challenges to the results.\n\nThroughout the speech, Trump employed the word \"fight\" or its variants approximately 20 times, typically in a rhetorical sense to denote political activism, electoral objections, and opposition to perceived Democratic tactics rather than physical confrontation. For instance, he stated, \"We will not let them silence your voices... We're going to fight like hell,\" in the context of defending voting rights and contesting congressional certification. Toward the conclusion, he emphasized, \"We fight. We fight like hell. And if you don't fight like hell, you're not going to have a country anymore,\" immediately preceding a call to proceed to the Capitol for objection purposes, but without instructions for unlawful entry or violence. Earlier, Trump explicitly directed attendees to \"march over to the Capitol building to peacefully and patriotically make your voices heard,\" the sole use of \"peacefully\" in direct reference to the planned movement. He added, \"I know that everyone here will soon be marching over to the Capitol building,\" indicating an expectation of a demonstration to support Republican objections during the joint session of Congress.\n\nFollowing the speech's end, Trump did not join the march but returned to the White House. As events unfolded at the Capitol, he issued tweets reinforcing law and order, including one at 2:38 p.m. ET stating, \"Please support our Capitol Police and Law Enforcement. They are truly on the side of our Country. Stay peaceful!\" approximately 38 minutes after the initial perimeter breach around 2:00 p.m. ET. Another at 3:13 p.m. ET read, \"I am asking for everyone at the US Capitol to remain peaceful. No violence! Remember, WE are the Party of Law \\u0026 Order – respect the Law and our great men and women in Blue. Thank you!\" Estimates indicate around 53,000 people attended the Ellipse rally, but only a subset—approximately 10,000—reached the Capitol vicinity, with geolocation and attendance data suggesting the majority dispersed without proceeding further.\n### Initial Breach of Perimeter Barriers\n\nWhile President Trump continued his speech from the Ellipse—approximately 1.5 miles away from the Capitol, with the majority of the rally crowd still in attendance—a small, separate team, seemingly led by a man named Ray Epps, began overwhelming the west perimeter barriers around 12:53 p.m. A few dozen people rapidly overturned unsecured bike-rack barriers, as Epps stood front and center at the barrier line, giving directional signals to others and effectively coordinating the initial push into the space. This action involved a smaller vanguard not directly from the rally, highlighting disjointed early movements amid inadequate perimeter securing.\n\nThe breached perimeter was located at the northwest pedestrian approach to the Capitol grounds, adjacent to the Peace Monument—the most direct and unavoidable walkway for rally attendees marching from the Ellipse along Pennsylvania and Constitution Avenues. This location served as the first major access route onto the west lawn for virtually all participants arriving after President Trump's speech. By opening this single entrance approximately 45 minutes before the main crowd reached the area, Epps’s breach team effectively created the principal unobstructed pathway through which thousands would subsequently enter the grounds.\n\nIn the minutes following the initial 12:53 p.m. breach at the Peace Monument entrance, individuals dismantled, pulled apart, or otherwise removed portions of the temporary bike-rack barricades, snow fencing, and \"Area Closed\" signage that had marked the restricted perimeter, further opening the primary pedestrian walkway for arriving crowds.\nThese visible barriers and signs had served as the primary indicators of the formal restriction in effect on January 6. (The Capitol grounds are ordinarily open to the public.)\nConsequently, when the main wave of rally attendees arrived at approximately 1:30–1:40 p.m., they encountered an apparently open public lawn with no barriers or prominent warning signs remaining at the primary northwest entrance, leading some to proceed onto the grounds without immediate realization that they were entering a federally restricted zone. (Nevertheless, between 2021 and 2024, more than 1,200 defendants were charged with an 18 U.S.C. § 1752 misdemeanor or felony for entering restricted Capitol grounds.)\n\nFirearms were rare among those crossing the perimeter; Department of Justice records show that, among more than 1,265 federal defendants charged in connection with the events, only about six faced specific allegations of carrying loaded guns onto the grounds.\n\nThese early failures contrasted with pre-event intelligence indicating risks of civil disturbance, as detailed in the U.S. Capitol Police Inspector General's assessment, which criticized departmental leadership for inadequate intelligence dissemination, equipment readiness, and contingency planning that left perimeter defenses under-resourced despite warnings of targeted unrest at the Capitol. The report underscored systemic lapses in evaluating threat scale, contributing to the ease with which outer barriers collapsed within minutes of crowd contact.\n### Crowd Movement to the Capitol\n\nFollowing the conclusion of President Trump's speech at the Ellipse around 1:10 p.m., a substantial portion of the estimated 10,000 to 30,000 attendees began marching toward the U.S. Capitol along Constitution Avenue, with reports indicating 10,000 to 20,000 participants converging on the area by mid-afternoon. The procession, prompted by Trump's exhortation to \"walk down to the Capitol,\" proceeded with chants and flags but without initial reports of widespread violence, reflecting spontaneous momentum driven by grievances over the election certification rather than premeditated coordination.\n\nFrom approximately 1:00 p.m. to 2:30 p.m., as thousands continued to arrive on the west lawn, an unidentified man positioned high atop the inauguration media tower used a bullhorn to deliver near-continuous commands—audible across the entire grounds—instructing the crowd to “keep moving forward,” “fill the stairs,” and, after the first entries into the building, to “fill up the Capitol,” creating a persistent directional pressure for roughly ninety uninterrupted minutes. The unidentified man was never arrested by the FBI.\n\nResistance remained minimal due to understaffing at the outer perimeter, where Capitol Police had positioned fewer than 100 officers against an estimated 2,000 to 3,000 protesters converging on that flank by midday.[74] Members of this larger contingent employed improvised means, including flagpoles, helmets, and collective shoving, to dismantle or vault the barriers, rather than deploying coordinated or factory-made breaching tools indicative of premeditated assault.[75]\n### Entry and Activities Within the Capitol\n\nEntry into the U.S. Capitol commenced around 2:10 p.m. EST following breaches of outer barriers, with initial access gained via broken windows and forced doors on the northwest side. At approximately 2:13 p.m., U.S. Capitol Police officers opened the Columbus Doors on the east front, enabling hundreds to enter in a procession with limited immediate opposition, as captured in surveillance and bystander video footage.  As the larger contingent arrived around 1:30 p.m., some entry points saw limited confrontation, with security footage later reviewed by congressional figures revealing Capitol Police officers in certain areas appearing to facilitate or not impede passage, such as escorting individuals through doorways shortly after 2:00 p.m. Subsequent entries occurred through the Senate Wing Door and Rotunda doors around 2:25 p.m., where crowds similarly advanced into interior spaces after initial forcible gains.\n\nInside the building, the bulk of entrants—estimated at 2,000 to 2,500 individuals—conducted non-violent actions, such as documenting and photographing legislative chambers, historical artifacts, and unsecured documents left in the Senate and House areas; chanting phrases like \"USA,\" \"Stop the Steal,\" and \"1776\"; and milling through hallways and offices in groups, often described in contemporaneous footage as akin to an unscheduled tour following the prior evacuation of lawmakers to secure locations.  These activities persisted across floors, with participants pausing at podiums and desks, though no coordinated efforts to disrupt evacuated proceedings were evident in primary visual records.\n\nLimited violent or destructive acts were perpetrated by a minority, including the ransacking of Speaker Nancy Pelosi's office suite around 2:30 p.m., where select items like electronics and furniture were displaced or removed; defacement of statues and murals with markers; and breakage of interior windows and barriers to access restricted zones. Official assessments pegged total interior property damage at $2.73 million, encompassing shattered glass, vandalized artwork, and repaired fixtures, without evidence of fires, looting on a mass scale, or structural demolition comparable to damages in urban unrest events of prior years. \n\nThe interior occupation endured roughly three to four hours, concluding as reinforcements cleared remaining holdouts by 5:40 p.m., after which certification proceedings resumed; all congressional members had been evacuated without physical harm prior to peak entries. \n### Confrontations with Law Enforcement\n\nAs protesters breached outer perimeter barriers around 12:53 p.m. and advanced toward the Capitol's west terrace, initial clashes escalated with physical shoves and the deployment of chemical irritants by crowd members against law enforcement lines. U.S. Capitol Police and Metropolitan Police Department officers faced bear spray—a potent capsaicin-based aerosol intended for wildlife—discharged directly into faces and eyes, as documented in multiple DOJ prosecutions. For instance, videos captured rioters ripping off officers' helmets and gas masks before spraying irritants, with one case involving Julian Khater and George Tanios assaulting Officer Brian Sicknick using a chemical agent mistaken initially for bear spray. Physical pushes and grabs overwhelmed smaller police formations, with rioters using stolen riot shields to crush officers and flagpoles or metal whips as improvised weapons in targeted assaults.\n\nApproximately 140 officers from the U.S. Capitol Police and D.C. Metropolitan Police Department reported injuries sustained during these confrontations, with about 80 from Capitol Police and 60 from MPD. The majority were non-life-threatening, including bruises, lacerations, chemical burns from irritants, concussions from blunt impacts, and respiratory issues from pepper or bear spray exposure; more severe cases involved rib fractures and one mild heart attack, but no officer gunshot wounds resulted from protester actions. Department of Justice records from over 1,400 prosecutions show no charges for protesters discharging firearms at officers, despite some individuals carrying handguns or rifles on Capitol grounds; confrontations relied on melee weapons, chemicals, and crowd surges rather than gunfire.\n\nCertain officer responses varied, with evidence indicating uneven resistance in some areas; a high-ranking Capitol Police commander, a Trump supporter, instructed subordinates not to don full riot gear on January 6 to avoid an overly aggressive appearance, contributing to initial under-equipment. Videos and accounts also show instances where officers removed helmets or appeared to de-escalate by allowing passage, potentially reflecting sympathy or tactical restraint amid outnumbered positions. Testimonies, such as that of Officer Harry Dunn describing intense racial slurs and violence, have faced scrutiny against Capitol CCTV footage, which in reviewed segments shows him less directly engaged in claimed assaults or overhearing epithets without video corroboration of direct targeting. These discrepancies highlight reliance on empirical video over potentially exaggerated personal accounts in assessing confrontation dynamics.\n## Human Costs and Material Damage\n\n### Deaths Among Protesters and Officers\n\nOne protester, Ashli Babbitt, a 35-year-old Air Force veteran, was fatally shot by U.S. Capitol Police Lieutenant Michael Byrd at approximately 2:44 p.m. as she attempted to climb through a shattered window into the Speaker's Lobby, an area adjacent to the House chamber where members of Congress were evacuating. Babbitt was unarmed, and the U.S. Department of Justice investigation concluded there was insufficient evidence to support criminal charges against the officer, determining the shooting did not violate departmental policy despite the absence of an immediate weapon threat from her individually.\n\nThree other protesters died from medical emergencies on January 6. Kevin Greeson, 55, from Athens, Alabama, collapsed at approximately 4:08 p.m. on a sidewalk west of the Capitol and died of hypertensive atherosclerotic cardiovascular disease (a heart attack), ruled natural causes by the D.C. Chief Medical Examiner. Rosanne Boyland, 34, from Kennesaw, Georgia, lost consciousness amid a crowd surge near a Capitol entrance and was pronounced dead later that day; the medical examiner attributed her death to acute amphetamine intoxication, classified as accidental, contradicting initial reports of trampling by fellow protesters or police action. Benjamin Philips, 50, from Ringtown, Pennsylvania, suffered a stroke during the events, also ruled natural causes by cardiovascular disease.\n\nNo law enforcement officers died from injuries sustained during the January 6 events on that day. Capitol Police Officer Brian Sicknick, 42, who engaged with protesters including being sprayed with a chemical irritant, returned to his division office that evening before suffering two strokes from a basilar artery blood clot; he died on January 7, with the D.C. Chief Medical Examiner ruling natural causes unrelated to trauma. Subsequent suicides among responding officers—such as Howard Liebengood on January 9, Jeffrey Smith on January 15, Gunther Hashida in July, and Kyle DeFreytag in July—occurred in the following months but were not determined to be directly caused by specific physical injuries or events from January 6.\n\n### Injuries to Participants and Police\n\nApproximately 140 law enforcement officers sustained physical injuries during the clashes at the U.S. Capitol on January 6, 2021, including about 73 from the U.S. Capitol Police (USCP) and 65 from the Metropolitan Police Department (MPD). Common injuries included exposure to chemical irritants such as bear spray and pepper spray deployed by participants, blunt force trauma from improvised weapons like flagpoles, pipes, and baseball bats, as well as strains, sprains, and abrasions from physical exertion, falls, and being crushed against barricades. About 15 officers required hospitalization for conditions ranging from concussions and broken bones to chemical burns, though most injuries were treated on-site or outpatient and did not involve life-threatening conditions.\n\nInjuries among participants were less systematically quantified in official tallies, with reports indicating dozens affected primarily by law enforcement's use of less-lethal munitions, including rubber bullets, pepper balls, and flash-bang devices deployed to regain control of breached areas. These resulted in contusions, lacerations, and temporary sensory impairments, but no evidence emerged of mass casualties or extended hospital stays among the crowd, consistent with the overall non-lethal scale of medical responses. The asymmetry in documented injuries—far higher among officers—reflects the intensity of direct confrontations where participants outnumbered and physically overwhelmed defensive lines, though participant injuries stemmed mainly from crowd-control countermeasures rather than mutual assaults.\n\nIn empirical contrast to the 2020 unrest across U.S. cities, where over 2,000 police officers reported injuries from sustained rioting involving arson and projectiles, the January 6 events produced no comparable volume of severe or prolonged officer trauma, with all affected personnel returning to limited duty within weeks absent extraordinary medical interventions. This underscores the contained, single-site nature of the Capitol incident, where injuries, while significant for responders, did not escalate to patterns of widespread debilitation observed in multi-day disorders elsewhere.\n\n### Extent of Property Damage and Artifacts Affected\n\nThe total estimated property damage from the January 6, 2021, riot at the U.S. Capitol was approximately $2.73 million, encompassing repairs to broken windows, doors, furniture, and other structural elements, according to federal assessments provided to congressional appropriators. This figure represented an update from an initial estimate of around $1.5 million and focused narrowly on physical destruction rather than broader security or cleanup expenditures.\n\nDamage primarily involved shattered glass in doors and windows, defaced or broken office furniture, and scattered debris in congressional spaces, with no evidence of large-scale arson or systematic looting within the building. Historical artifacts sustained limited harm, including chemical residue from irritants on six sculptures, two paintings, and presidential busts such as that of Thomas Jefferson, requiring an estimated $25,000 in restoration by Capitol curators. No irreplaceable artworks were destroyed, and initial inspections confirmed that major structural or artistic elements of the Capitol endured without permanent alteration despite the intrusion.\n\nIn context, the Capitol's damage costs were modest compared to those from a single night of unrest in Portland, Oregon, on May 29, 2020, during which protesters inflicted approximately $23 million in property destruction and lost revenue downtown, per local police estimates. This disparity underscores the contained nature of the Capitol's material losses relative to narratives emphasizing widespread devastation.\n\n## Immediate Aftermath and Response\n\n### Clearing the Capitol and Resuming Proceedings\n\nLaw enforcement, including U.S. Capitol Police and federal reinforcements, conducted sweeps to remove remaining intruders from the Capitol building, achieving substantial clearance by approximately 6:00 p.m., roughly four hours after the initial breaches. This process followed President Trump's 2:38 p.m. tweet urging peace and support for law enforcement, with another at 3:13 p.m. ET calling for those at the Capitol to \"remain peaceful,\" stating: \"I am asking for everyone at the U.S. Capitol to remain peaceful. No violence! Remember, WE are the Party of Law \\u0026 Order – respect the Law and our great men and women in Blue. Thank you!\"\n\nAt 4:17 p.m., Trump posted a video from the White House in which he acknowledged supporters' grievances over the election while directing them to disperse, saying: \"I know your pain... You do not want to be doing this... Go home. We love you. You're very special.\" These communications aligned with de-escalation efforts amid chants targeting Vice President Mike Pence, who had been evacuated to a secure location earlier that afternoon along with senators and representatives sheltered in undisclosed areas. No members of Congress suffered physical harm during the evacuations or occupation, preserving continuity of government operations.\n\nBy 6:50 p.m., Capitol Police issued an \"all clear\" for interior sweeps, allowing for post-occupation cleaning and bomb detection to confirm the building's habitability. The joint session of Congress reconvened shortly after 8:00 p.m., with Pence returning to the Senate chamber to preside over the resumption of electoral vote certification, which proceeded without further interruptions until completion in the early hours of January 7. This swift return to proceedings, spanning less than six hours from peak intrusion, demonstrated effective protocols for restoring legislative functions amid the disruption.\n\n### Deployment Delays of National Guard\n\nThe D.C. National Guard, under federal control through the Department of Defense rather than direct authority of D.C. Mayor Muriel Bowser, faced multiple layers of approval before deployment on January 6, 2021. Capitol Police Chief Steven Sund requested National Guard assistance at approximately 12:58 p.m., shortly before the initial breach of outer barriers, but this was initially denied by the Capitol Police Board, which includes the House Sergeant at Arms appointed by then-Speaker Nancy Pelosi and requires board consensus for such mobilizations. Bowser had publicly discouraged additional federal law enforcement or National Guard deployments beyond a limited, unarmed contingent of about 340 for traffic control in the days prior, citing concerns over escalation. White House Chief of Staff Mark Meadows also reached out to Mayor Bowser prior to January 6 to offer further National Guard assistance, including up to 10,000 troops if needed for crowd management at the rally, but she declined, affirming her request for only around 340 unarmed personnel for traffic support. Though she requested expanded assistance around 1:34 p.m. and again at 2:00 p.m.\n\nArmy Secretary Ryan McCarthy testified that Department of Defense leaders imposed unusual restrictions on the Guard's operations that day, including requirements for high-level approvals, contributing to hesitation amid fears of politicizing the military's image similar to criticisms during 2020 civil unrest responses. Internal DoD communications and later Inspector General transcripts revealed \"optics\" concerns as a factor in delaying verbal authorization until approximately 3:00 p.m., despite the Guard's readiness at the armory; troops did not depart until 5:04 p.m. and reached the Capitol at 5:40 p.m., over four hours after urgent requests began. McCarthy emphasized a lack of pre-event intelligence anticipating a direct assault on the Capitol, which compounded procedural caution within the chain of command.\n\nThese delays stemmed from bureaucratic protocols prioritizing civilian oversight—such as the Capitol Police Board's gatekeeping role and DoD's deference to executive and congressional signals—over rapid response, with Bowser's limited jurisdiction over the federally controlled D.C. Guard and Pelosi's indirect influence via appointees highlighting structural constraints rather than proactive command. In contrast, following the Capitol's clearance later that evening, over 5,200 National Guard members from multiple jurisdictions were mobilized to Washington, D.C., by mid-January, securing the area without further disturbances and demonstrating the force's prior availability absent approval hurdles.\n### Initial Political Reactions from Key Figures\n\nPresident Donald Trump, who had addressed supporters earlier that day at the Ellipse rally praising their patriotism and urging them to \"fight like hell,\" issued his first tweet at 2:38 p.m. ET approximately 38 minutes after the initial breach, calling for those at the Capitol to \"remain peaceful\" and respect law enforcement, followed by another at 3:13 p.m. ET reinforcing support for law enforcement. Approximately one hour later, at around 4:17 p.m., Trump released a video statement acknowledging the protesters' grievances over the election while telling them to \"go home,\" stating, \"We love you. You're very special,\" but reiterating unsubstantiated claims of election fraud.\n\nPresident-elect Joe Biden, in remarks delivered later that afternoon around 4:00 p.m. ET, condemned the events as an \"unprecedented assault\" on democracy and called on Trump to make a direct public demand for the mob to disperse, emphasizing that the actions bordered on sedition. House Speaker Nancy Pelosi, evacuated from the Capitol, described the intrusion as an \"outrageous\" attack and immediately advocated for invoking the 25th Amendment to remove Trump, later referring to him as a \"domestic enemy\" in private discussions during the evacuation.\n\nSenate Minority Leader Mitch McConnell, resuming Senate proceedings that evening, labeled the breach a \"failed insurrection\" by those who \"stormed the Capitol when the election was certified,\" attributing it to lies about the vote and stating that participants had failed to defend the Constitution. Senate Majority Leader Chuck Schumer dismissed Trump's later calls for peace as insufficient during the ongoing chaos, expressing skepticism privately and later characterizing the events as an insurrection incited by Trump's refusal to concede.\n\nReactions among Republicans revealed divisions: while McConnell and others like Senator John Cornyn condemned the violence outright, figures such as Senators Josh Hawley and Ted Cruz, who had planned to object to electoral certification citing voter fraud concerns, faced criticism for actions perceived as encouraging the crowd—Hawley's pre-breach fist salute drawing particular rebuke from party leaders—though both later disavowed the unrest.\n\nMedia coverage varied in real-time framing, with outlets like CNN quickly describing the breach as an \"insurrection\" and domestic terrorism by early afternoon, while Fox News emphasized it as a \"riot\" by Trump supporters, reflecting partisan lenses on the crowd's intent versus spontaneous disorder.\n\n## Investigations and Official Inquiries\n\n### House January 6 Select Committee Findings\n\nThe House Select Committee to Investigate the January 6th Attack on the United States Capitol was established by a 222-190 vote on June 30, 2021, primarily along party lines, with the stated purpose of examining the causes, events, and aftermath of the Capitol breach. The committee consisted of seven Democrats appointed by Speaker Nancy Pelosi and two Republicans, Liz Cheney and Adam Kinzinger, selected after Pelosi rejected several nominees proposed by House Minority Leader Kevin McCarthy, leading to a Republican boycott and rendering the panel effectively without minority party input or cross-examination capabilities. Over 18 months, it issued over 100 subpoenas for records, including those from Trump administration officials, and conducted hundreds of interviews, culminating in eight public hearings in 2022 and a final report released on December 22, 2022.\n\nThe committee's central findings centered on former President Donald Trump's alleged role in a \"multi-part conspiracy\" to overturn the 2020 election results, including pressuring Vice President Mike Pence to reject electoral votes, promoting false elector schemes, and failing to promptly stop the violence despite awareness of it. It highlighted excerpts from Trump's January 6 rally speech urging supporters to \"fight like hell,\" recommending criminal referrals against him for offenses such as obstruction of an official proceeding and conspiracy to defraud the United States. However, hearings often presented edited video clips of the speech that omitted Trump's explicit calls to march \"peacefully and patriotically\" to the Capitol, a directive aired in full context during the event but not emphasized by the committee.\n\nCritics, including subsequent Republican-led reviews, have characterized the inquiry as partisan and selective, arguing it prioritized a narrative of Trump-orchestrated insurrection while omitting exculpatory evidence, such as the lack of direct orders from Trump to breach the Capitol or broader security planning failures predating his involvement. The absence of a minority report, combined with the committee's dissolution and transfer of records—some of which faced delays or disputes over completeness—limited opportunities for rebuttal or independent verification of its interpretations. This approach echoed patterns of institutional bias critiqued in contemporaneous probes like the 2023 Durham report on FBI handling of prior election-related investigations, which highlighted rushed judgments and overlooked contradictions in pursuit of preconceived threats.\n\n### Senate Reports on Security Failures\n\nIn June 2021, a bipartisan Senate report jointly issued by the Committees on Rules and Administration and Homeland Security and Governmental Affairs outlined over a dozen critical failures in security planning, intelligence dissemination, and response coordination ahead of and during the January 6, 2021, Capitol breach. The report, led by Senators Amy Klobuchar (D-MN), Roy Blunt (R-MO), Gary Peters (D-MI), and Rob Portman (R-OH), emphasized systemic lapses by the U.S. Capitol Police (USCP), the Capitol Police Board, and federal intelligence agencies, rather than attributing the events to any organized external plot by protesters. Key shortcomings included the USCP's underestimation of violence risks despite available threat indicators, inadequate equipment and staffing for USCP officers (such as insufficient riot gear and non-functional communication devices), and fragmented intelligence sharing among agencies like the FBI and DHS, which failed to produce actionable warnings for congressional leaders.\n\nA central failure highlighted was the Capitol Police Board's refusal to request National Guard deployment prior to January 6, despite USCP Chief Steven Sund's urgent pleas for reinforcements on January 3 and 4, citing escalating intelligence on potential unrest. The Board, comprising the House and Senate Sergeants at Arms and the Architect of the Capitol, deferred action due to concerns over \"optics\" and historical precedents of Guard presence at the Capitol, resulting in a three-hour delay in mobilization once the breach began. Sund, who resigned on January 7 amid the fallout, later testified that House Sergeant at Arms Paul Irving—whose office reports to Speaker Nancy Pelosi—consulted Pelosi's chief of staff before denying the request, prioritizing perceptions of militarization over preparedness. Irving and Senate Sergeant at Arms Michael Stenger also resigned shortly after, underscoring accountability gaps in congressional security oversight.\n\nThe report made no determinations of protester coordination or intent, instead recommending structural reforms such as elevating Capitol security decision-making to an independent entity, enhancing inter-agency intelligence fusion centers, and mandating preemptive Guard assessments for high-threat certification dates. These findings, drawn from interviews with over 50 officials and document reviews, portrayed the breach as a preventable outcome of defensive inertia and bureaucratic silos, not external orchestration.\n\n### FBI and DOJ Preliminary Probes\n\nThe Federal Bureau of Investigation (FBI) received multiple tips indicating potential violence prior to January 6, 2021, including warnings from field offices about extremists planning to \"storm\" the Capitol and specific threats shared via open sources and confidential human sources (CHS). Despite these indicators, the FBI did not conduct a nationwide canvass of its field offices for additional intelligence, a step later identified as a basic oversight that contributed to underestimating the threat.\n\nThe Department of Justice (DOJ), in coordination with the FBI, launched immediate investigations post-event, with the FBI issuing public appeals for tips and digital media on January 6 itself. By January 8, 2021, the DOJ had filed initial charges against 13 individuals primarily for unlawful entry and related misdemeanors, marking the start of a rapid arrest phase focused on identifying participants via video evidence and public submissions.\n\nPreliminary probes revealed the presence of over two dozen FBI CHS in Washington, D.C., on January 6, including some tasked with monitoring groups like the Proud Boys, though none were authorized to enter the Capitol or incite violence. These informants provided reporting on domestic extremists but did not uncover evidence of coordinated entrapment or directive involvement by federal agents in the events.\n\nBy February 2021, the DOJ had arrested approximately 300 individuals, with the majority facing misdemeanor charges such as parading or unlawful entry rather than felony violence, reflecting early emphasis on trespass over assault in the probe's scope.\n\nA Senate Homeland Security and Governmental Affairs Committee (HSGAC) review later documented intelligence failures, noting that much of the planning occurred \"in plain sight\" on public platforms like social media, yet was not adequately escalated or disseminated by the FBI and DHS to Capitol security.\n\n## Legal Consequences and Trials\n\n### Federal Charges and Prosecution Statistics\n\nAs of early 2025, federal prosecutors had filed charges against 1,583 individuals in connection with the January 6, 2021, Capitol riot, marking one of the largest criminal investigations in U.S. history.  Of these, approximately 608 defendants—about 38%—faced felony charges specifically for assaulting, resisting, or impeding law enforcement officers, often involving physical violence or use of weapons.\n\nThe remaining charges, comprising the majority, centered on non-violent offenses such as unlawfully entering or remaining in a restricted federal building (18 U.S.C. § 1752, a misdemeanor) or parading, demonstrating, or picketing inside Capitol grounds (40 U.S.C. § 5104, also a misdemeanor). Approximately 94% of charged defendants faced at least one version of the entering-or-remaining charge, with hundreds prosecuted solely for such conduct without evidence of violence or property damage. Other common felonies included obstruction of an official proceeding (18 U.S.C. § 1512(c)(2)), filed against over 310 individuals, though many of these lacked direct ties to violent acts. Seditious conspiracy charges (18 U.S.C. § 2384), the most serious among them, were limited to 18 defendants, mainly leaders of organized groups like the Oath Keepers and Proud Boys, with most resulting in convictions via trial or plea.\n\nProsecution outcomes emphasized plea agreements, with 1,270 convictions recorded by January 6, 2025, including 1,009 guilty pleas—79% of all convictions and 64% of total arrestees. Among pleas, 682 were to misdemeanors (about two-thirds), while 327 involved felonies. Trials accounted for the remaining 261 convictions, often yielding higher sentences for violent or leadership roles. Sentencing for non-violent misdemeanor entry offenses typically averaged 1-2 months incarceration, with about half of such defendants receiving jail time averaging 58 days and others probation or fines; felony assault convictions, by contrast, carried multi-year terms. These patterns reflected aggressive charging under the Department of Justice, contrasting with lighter dispositions in contemporaneous urban unrest cases from 2020, where federal prosecutions were fewer and sentences often deferred or minimal.\n\n### Notable Convictions and Sentencing Patterns\n\nEnrique Tarrio, former leader of the Proud Boys, was convicted in May 2023 of seditious conspiracy for orchestrating efforts to oppose the congressional certification of the 2020 election results by force, including planning the group's actions on January 6 despite his absence from Washington, D.C., due to a prior arrest. He received a 22-year sentence on September 5, 2023, the longest imposed at that time among January 6 defendants, based on evidence of encrypted communications and coordination with co-defendants to disrupt proceedings. Similarly, Stewart Rhodes, founder of the Oath Keepers, was convicted in November 2022 of seditious conspiracy for directing members to prepare for and engage in armed opposition to the electoral count, including establishing a \"quick reaction force\" outside the city with weapons. Rhodes was sentenced to 18 years on May 25, 2023, with the court citing his leadership in fostering a belief that violence was necessary to prevent a perceived unconstitutional transfer of power.\n\nA significant portion of January 6 convictions relied on 18 U.S.C. § 1512(c)(2), an obstruction statute originally aimed at evidence tampering in corporate fraud cases, applied here to defendants' physical presence inside the Capitol as captured on video surveillance and body cameras. Prosecutors argued that entering the building and remaining amid the breach constituted corruptly impeding the joint session of Congress, leading to guilty verdicts or pleas for hundreds based primarily on footage showing non-violent entry or brief presence without direct evidence of intent to alter records or documents. The Supreme Court in *Fischer v. United States* (June 28, 2024) narrowed the statute's scope, holding that it requires proof of intent to impair the availability or integrity of specific evidence or records, vacating Fischer's conviction and prompting dismissals or resentencings in dozens of cases where video evidence alone supported the charge.\n\nRepublican figures, including former President Donald Trump, have characterized many convicted defendants as \"political prisoners\" subjected to overcharging and selective prosecution, arguing that misdemeanor trespassing was inflated to felonies like obstruction without evidence of violent intent or actual disruption of official records. House Republicans launched inquiries in 2023 into alleged mistreatment of detainees, contending that pretrial conditions and charge enhancements reflected bias rather than proportionate justice for what they describe as largely peaceful protestors. These critiques highlight disparities in sentencing, where leaders like Tarrio and Rhodes faced decades for coordination absent direct violence, while questioning whether lower-level participants' video-documented actions met the narrowed evidentiary threshold post-*Fischer*.\n\n### Legal Consequences for Journalists\n\nSeveral individuals affiliated with alternative media outlets faced charges related to their activities on January 6, while personnel from mainstream outlets present inside the Capitol were not prosecuted.\n\nSteve Baker of Blaze Media pleaded guilty to four misdemeanor charges for entering the Capitol and filming inside.\n\nStephen Horn, an independent journalist, was convicted of four misdemeanors, including disorderly conduct in the Capitol, after scaling a statue and chanting \"U.S.A.\".\n\nOwen Shroyer of Infowars was sentenced to 60 days in prison for leading chants outside the Capitol and marching protesters toward it, despite not entering the building.\n\nSamuel Montoya, an Infowars editor, was charged for live-streaming inside the Capitol and impeding passage; he was sentenced to four months of home detention despite claiming journalistic intent.\n\nIn contrast, New York Times reporters and photographers entered the Capitol through breached entrances and moved freely through the rotunda, Statuary Hall, and Senate wing without facing federal charges.\n\nAssociated Press photographer John Minchillo, Reuters staff, and Getty Images photographers captured images from inside the Capitol, including during the occupation of the Senate dais and rotunda, yet none were prosecuted or placed on FBI wanted lists.\n\nNPR correspondent Lisa Desjardins and photographer Sarah Ferris, along with PBS NewsHour staff, were inside the Capitol complex during the breach and broadcast live, but faced no investigations or charges.\n\n### Post-2024 Election Pardons and Reassessments\n\nOn January 20, 2025, President Donald Trump issued a proclamation granting clemency to nearly 1,500 individuals charged or convicted for offenses related to the events at or near the U.S. Capitol on January 6, 2021, including full pardons for many and commutations to time served for others. The action encompassed defendants facing charges from unauthorized entry to assaulting officers, with commutations specifically applied to figures such as Oath Keepers leader Stewart Rhodes, Kelly Meggs, and Proud Boys associates. Trump described the measures as rectifying a \"grave national injustice\" stemming from what he termed politically motivated prosecutions, prioritizing non-violent participants while extending relief broadly.\n\nSubsequent to the pardons, several recipients encountered legal scrutiny for unrelated conduct. By June 2025, at least 10 pardoned individuals had been rearrested or charged with new crimes, including burglaries and threats. In October 2025, Christopher Moynihan, a 34-year-old from Clinton, New York, became the first known pardoned defendant arrested for post-pardon threats, charged with making terroristic threats against House Minority Leader Hakeem Jeffries. These incidents involved offenses distinct from January 6 charges, such as direct threats via social media or physical confrontations.\n\nThe 2025 electoral vote certification on January 6 proceeded uneventfully, with Congress convening a joint session to tally votes confirming Trump's reelection without disruptions or violence, under enhanced security protocols designated as a National Special Security Event. This contrasted with 2021 events, as no objections or interruptions halted proceedings, reflecting stabilized political conditions post-2024 election.\n\nReassessments of the January 6 events intensified after the 2024 election, with public opinion polls indicating softening views on the scale and intent of participant actions. Surveys from late 2024 and early 2025 showed partisan divides persisting but overall attitudes toward the rioters and Trump's involvement mellowing, with fewer respondents endorsing narratives of organized insurrection compared to immediate post-event polling. Republican disapproval of the events continued to decline, contributing to broader reevaluation amid Trump's return to office. These shifts aligned with critiques of prior investigations, emphasizing evidentiary gaps in claims of coordinated rebellion over spontaneous protest.\n## Controversies and Alternative Interpretations\n\n### Debate Over \"Insurrection\" Label and Intent\n\nCritics of the \"insurrection\" label argue that the events of January 6, 2021, fail to meet the legal and historical criteria for an insurrection under U.S. law, which typically requires an organized, armed uprising aimed at overthrowing or resisting governmental authority. 18 U.S.C. § 2383 defines rebellion or insurrection as inciting, assisting, or engaging in violent resistance against the United States or its laws, implying coordinated force to subvert constitutional processes. No participants were charged under this statute, and federal prosecutors instead pursued charges like seditious conspiracy for a small number (14 convictions), civil disorder, or misdemeanors such as entering restricted areas, reflecting the absence of elements like widespread armed overthrow. \n\nEmpirical data underscores the limited violence: no deaths were caused by firearms discharged by protesters, with fatalities including one protester shot by Capitol Police, three medical emergencies among participants, and one officer's later stroke unrelated to direct combat. Of over 1,400 charged by mid-2024, approximately 10-15% faced assault-related counts, primarily non-lethal (e.g., using flagpoles or bear spray), while the majority (over 80%) were for non-violent offenses like trespassing or parading, with conviction rates exceeding 99% due to video evidence of unauthorized entry rather than organized rebellion. This contrasts with historical insurrections, such as the 1861 secessionist threats during Lincoln's inauguration, where armed militias openly mobilized to prevent certification but were deterred without breaching the Capitol, highlighting January 6's lack of sustained, armed intent to seize power.\n\nAlternative interpretations emphasize that most entrants (estimates suggest over 80% based on footage and charging patterns) passed through breached barriers without resistance, akin to a disorganized protest escalation rather than a premeditated coup. Left-leaning outlets like *The New York Times* have framed it as a \"constitutional self-coup\" attempt by Trump allies to retain power unconstitutionally. Conversely, conservative analysts, such as Roger Kimball in *Imprimis* (Hillsdale College), describe it as a \"hoax\" narrative, arguing no evidence supports a coordinated plot to violently overthrow the government, with the crowd's actions more resembling rowdy trespass than insurrectionary rebellion.\n\n### Evidence of Government Informants and Provocateurs\n\nThe Federal Bureau of Investigation maintained confidential human sources (CHSs), commonly referred to as informants, within domestic groups monitored for potential extremism, including the Proud Boys and Oath Keepers, prior to January 6, 2021. A December 2024 report by the Department of Justice Office of the Inspector General (DOJ OIG) confirmed that 26 FBI CHSs were present in Washington, D.C., on January 6, with three specifically tasked to report on activities of the Proud Boys; however, none were undercover FBI employees, and the FBI did not deploy any agents to incite or participate in unlawful actions.\n\nDuring the seditious conspiracy trials of Proud Boys and Oath Keepers members in 2023, defense attorneys revealed the presence of FBI informants embedded in these groups, including one who had infiltrated the Oath Keepers' inner circle for months and testified on behalf of defendants, arguing that the individuals acted defensively rather than offensively. Defense filings contended that prosecutors withheld exculpatory information (Brady material) related to these informants' knowledge of group plans, potentially undermining claims of coordinated intent to breach the Capitol. Courts did not find evidence of entrapment, as informant communications did not direct participants to commit crimes, though the revelations fueled scrutiny over intelligence handling and transparency in prosecutions.\n\nRay Epps, a Trump supporter filmed on January 5 and 6 encouraging crowds to enter the Capitol building—\"We need to go into the Capitol!\"—drew attention for not facing initial felony charges despite his visible role, leading to unsubstantiated claims he was a government provocateur. Epps was charged in September 2023 with a single misdemeanor count of disorderly conduct on restricted grounds, pleading guilty and receiving one year of probation in January 2024; the FBI and DOJ have repeatedly denied he was an informant or agent, attributing delays to standard investigative processes rather than protection.\n\nThe DOJ and FBI maintain that informants provided pre-event intelligence but were not authorized to enter the Capitol, incite violence, or lead breaches, with the OIG report finding no evidence contradicting this and rebuking theories of orchestrated provocation. Empirical review of trial evidence and informant reports shows their activities focused on observation, not causation of the crowd's entry points or barriers' compromise, which occurred amid broader participant momentum independent of directed input. While informant presence raised questions about narrative framing in public discourse—given mainstream outlets' emphasis on participant agency over institutional roles—no verified data links them to initiating the riot's escalation. A 2025 disclosure by FBI Director Kash Patel indicated that 274 plainclothes FBI agents from the Washington Field Office were deployed in the D.C. area starting around 2:30 p.m., after the riot declaration, to assist with crowd control and address threats such as pipe bombs, with no prior embedding in crowds or evidence of incitement.\n\n### Intelligence and Leadership Failures on Security Side\n\nThe U.S. Department of Homeland Security's Office of Intelligence and Analysis (DHS I\\u0026A) identified specific threat information related to the January 6, 2021, events at the Capitol prior to the breach but failed to issue any formal intelligence products disseminating these threats to relevant stakeholders, including Capitol security officials. Similarly, both the Federal Bureau of Investigation (FBI) and DHS received numerous tips about potential violence, including online posts explicitly threatening the Capitol, yet downplayed or failed to adequately share this \"massive amount\" of intelligence with local law enforcement and Capitol protectors, contributing to inadequate pre-event preparations.\n\nWithin the U.S. Capitol Police (USCP), the intelligence unit possessed available data on potential threats but did not incorporate it into operational planning or threat assessments shared with leadership, as testified by former USCP Chief Steven Sund, who described the events as stemming from a fundamental \"intelligence failure\" that undermined defensive readiness. Sund had requested National Guard support multiple times in the days leading up to January 6—specifically on January 3 and January 4—but these were denied by House Sergeant at Arms Paul Irving and Senate Sergeant at Arms Michael Stenger, who cited insufficient intelligence warranting such deployment and concerns over \"optics\" of militarized presence, despite prior Guard use for 2020 protests. Irving, reporting to House leadership including Speaker Nancy Pelosi's office, prioritized these non-threat-based factors in security decisions, including repositioning barricades the day before the event.\n\nOn the day of the breach, deployment of the D.C. National Guard (DCNG)—stationed just two miles away—was further delayed by approximately four hours due to miscommunications among Pentagon officials and explicit concerns over the visual implications of troops at the Capitol, as revealed in Department of Defense Inspector General transcripts, rather than any operational incapacity. These leadership choices on the security apparatus side—spanning intelligence dissemination, preemptive resource allocation, and real-time response—directly enabled the perimeter breaches, as opposed to post-event attributions emphasizing external factors.\n\nA bipartisan Senate Rules Committee report released in June 2021, examining these lapses, concluded that failures in threat assessment, planning, and inter-agency coordination represented a \"failure of leadership\" across Capitol protection entities, recommending structural reforms to prevent recurrence. This assessment contrasted with the House January 6 Select Committee's narrower focus, which largely omitted detailed scrutiny of these institutional shortcomings in favor of other narratives.\n\n### Media Portrayals Versus Empirical Evidence\n\nMainstream media outlets such as CNN and MSNBC frequently characterized the January 6, 2021, events as a \"deadly insurrection\" orchestrated by an armed mob intent on overthrowing the government. For instance, coverage emphasized comparisons to historical coups while highlighting the presence of weapons and violent intent among participants.\n\nIn contrast, empirical data on fatalities reveals that of the five deaths associated with the events, only one—Ashli Babbitt, shot by Capitol Police—was directly attributable to violence during the breach; the others included two heart attacks among protesters (Kevin Greeson and Benjamin Philips), an apparent overdose (Rosanne Boyland), and U.S. Capitol Police Officer Brian Sicknick, who died the following day of natural causes (strokes). No deaths were caused by gunfire from rioters, and medical examiners attributed most to pre-existing conditions exacerbated by the chaos rather than direct assault.\n\nRegarding armament, while prosecutors documented improvised weapons like flagpoles, bear spray, and bats used by some entrants, and a small number of firearms were recovered from individuals on Capitol grounds (typically outside the building), federal records indicate no mass deployment of lethal firearms inside the Capitol itself, contradicting portrayals of a heavily \"armed militia\" storming en masse. The breach lasted approximately four hours, with the building cleared by evening, and most participants dispersed without prolonged occupation or widespread destruction beyond broken windows and furniture.\n\nRelease of over 40,000 hours of Capitol surveillance footage in 2023, selectively aired by Fox News host Tucker Carlson, depicted segments showing orderly movement through hallways, minimal resistance from officers in some areas (including instances of apparent facilitation), and groups appearing to conduct guided-like tours rather than coordinated combat. These visuals, previously withheld from public view, highlighted that violence was concentrated in specific zones while much of the incursion involved non-aggressive presence, challenging narratives of uniform lethality.\n\nPublic perception shifted measurably following such disclosures; polls from 2021 showed over 60% of Americans viewing the events as an insurrection or attack on democracy, but by 2024-2025, overall condemnation had softened to around 50%, with Republican disapproval dropping further amid revelations of selective footage and contextual evidence. This evolution underscores how initial media emphasis on worst-case vignettes, amid institutional biases toward amplifying threats from right-leaning protests (in contrast to muted coverage of 2020 unrest), influenced early consensus before broader data access tempered views.\n\n## Broader Impact and Legacy\n\n### Effects on U.S. Political Discourse\n\nThe second impeachment trial of former President Donald Trump, concluding on February 13, 2021, with a Senate vote of 57-43 to convict on the charge of incitement of insurrection—falling short of the two-thirds majority required for removal—intensified partisan divides over the events of January 6. While Democrats and seven Republicans argued the attack warranted accountability, the acquittal underscored Republican insistence that Trump's rhetoric did not constitute direct causation and that security lapses bore partial responsibility, framing the discourse around free speech versus democratic norms.\n\nElectoral results in subsequent cycles contradicted predictions of widespread voter backlash against Republican figures associated with January 6 narratives. In the 2022 midterms, Republicans secured a narrow House majority with 222 seats to Democrats' 213, gaining nine net seats despite pre-election polling anticipating Democratic gains from perceived extremism linked to the event. This outcome, coupled with Trump's 2024 presidential victory—certified by Congress on January 6, 2025, without disruption—demonstrated sustained mobilization among his base, who viewed prosecutions of participants as selective persecution rather than justice, energizing turnout in key states.\n\nThe event exacerbated existing polarization, with public opinion remaining sharply divided: a 2023 survey found 50% of Americans characterizing January 6 as an \"insurrection that threatened democracy,\" while 19% saw it as legitimate political protest, and views correlated strongly with partisan affiliation. Trust in federal institutions eroded further, as evidenced by Pew Research data showing only 22% of Americans trusting the government to do what is right \"just about always\" or \"most of the time\" by May 2024, down from pre-2021 levels and reflecting heightened skepticism toward agencies like the FBI amid revelations of unindicted informants present during the breach.\n\nBy 2025, January 6 had solidified as a partisan touchstone: conservatives increasingly invoked it to critique institutional overreach and \"deep state\" interference, citing over 1,200 federal charges against participants as evidence of politicized justice that alienated working-class voters; liberals, conversely, maintained it as emblematic of authoritarian threats, though without translating into decisive electoral shifts against Trump-aligned candidates. This dynamic fueled a cycle of mutual distrust, with NPR/Ipsos polling post-event revealing 59% of Americans believing U.S. democracy faced crisis, disproportionately among Republicans questioning official narratives.\n\n### Reforms to Capitol Security Protocols\n\nFollowing the January 6, 2021, breach, U.S. Capitol security protocols emphasized physical fortifications, including the rapid installation of extensive temporary fencing topped with razor wire around the complex to deter unauthorized access. These measures, erected in the immediate aftermath, formed part of broader security expenditures that, combined with repairs to damages from the event, exceeded $30 million by February 2021, as testified by the Architect of the Capitol.  The fencing alone cost at least $19 million for its temporary setup and maintenance, reflecting a reactive emphasis on visible barriers amid calls from Capitol Police leadership for permanent installations to address perceived vulnerabilities. \n\nDespite advocacy for enduring barriers, the fencing was largely dismantled starting in July 2021 after assessments indicated reduced immediate threats, though it has been periodically reinstalled for events such as State of the Union addresses in 2022.  National Guard deployments supplemented these efforts, with roughly 5,000 troops providing support to Capitol Police post-inauguration, maintaining rotations for heightened security periods rather than indefinite occupation. This military augmentation, extended for specific alerts, prioritized rapid response capabilities over structural overhauls.\n\nOperational reforms within the Capitol Police included staffing increases, enhanced training, and procedural updates for emergency support, culminating in over 100 targeted improvements by 2023 to mitigate intelligence and coordination gaps exposed on January 6.  However, deeper reforms to intelligence protocols—such as those critiqued in Senate reviews for agencies' failure to fully process pre-event warnings—remained constrained, with emphasis on physical and tactical fixes rather than overhauling surveillance frameworks like FISA Section 702, which underwent separate reauthorization amid unrelated debates.\n\nThese enhancements have correlated with no subsequent mass breaches of the Capitol, despite persistent individual threats to officials, underscoring the event's singularity driven by acute electoral tensions rather than chronic insurgency risks. The absence of repeats supports a view that indefinite high-cost measures may exceed the empirically low probability of analogous disruptions, prioritizing deterrence of isolated provocations over addressing underlying causal disputes in political processes.\n\n### Shifts in Public Perception by 2025\n\nBy early 2025, surveys indicated a softening in American public attitudes toward the January 6, 2021, Capitol events, with reduced emphasis on labeling them an \"insurrection\" and greater acceptance of narratives framing the gathering as primarily a protest marred by isolated violence. A January 6, 2025, analysis by the Christian Science Monitor cited multiple polls showing diminished blame directed at former President Trump and the participants, particularly among Republicans, amid post-2024 election reassessments that prioritized electoral legitimacy over prior condemnations. This evolution reflected empirical fatigue with sustained media amplification, as evidenced by a December 2024 Rasmussen Reports survey where 49% of likely voters endorsed case-by-case pardons for those charged, signaling normalized discourse on clemency rather than uniform outrage.\n\nCultural outputs further highlighted perceptual divides, with conservative-leaning documentaries and publications advancing theses of entrapment or overreach by authorities, contrasting official memorials that maintained the violence-centric frame. President Trump's September 2025 public statements labeling the events the \"January 6th Hoax\" and alleging FBI orchestration resonated in these circles, though such claims lacked corroboration from federal investigations and were critiqued by mainstream outlets for relying on unverified informant roles. Polling data from late 2024, including Pew Research observations of surging Republican trust in vote integrity post-Trump's victory, underscored how electoral outcomes facilitated domestic reconciliation, diminishing the events' salience as a partisan wedge.\n\nInternationally, the incidents exerted minimal enduring influence on global views by 2025, as foreign commentary shifted from initial alarm to observations of U.S. institutional resilience demonstrated by the uneventful 2024 election certification. A January 9, 2025, assessment by the Institut Montaigne noted the absence of recurring violence, interpreting it as temporary appeasement rather than systemic fragility, with broader focus returning to transatlantic policy divergences over domestic symbolism. This muted global echo contrasted with persistent U.S. polarization, where perception shifts were confined largely to partisan realignments rather than consensus.",
  "external_references": [
    {
      "text": "Planning And Execution Timeline For The National Guards Involvement In The January 6 2021 Violent Attack At The Us Capitol.pdf",
      "url": "https://media.defense.gov/2021/Jan/11/2002563151/-1/-1/0/PLANNING-AND-EXECUTION-TIMELINE-FOR-THE-NATIONAL-GUARDS-INVOLVEMENT-IN-THE-JANUARY-6-2021-VIOLENT-ATTACK-AT-THE-US-CAPITOL.PDF",
      "domain": "media.defense.gov",
      "type": "citation"
    },
    {
      "text": "Gpo J6 Report 2 7.pdf",
      "url": "https://www.govinfo.gov/content/pkg/GPO-J6-REPORT/pdf/GPO-J6-REPORT-2-7.pdf",
      "domain": "govinfo.gov",
      "type": "citation"
    },
    {
      "text": "Read Trumps Jan 6 Speech A Key Part Of Impeachment Trial",
      "url": "https://www.npr.org/2021/02/10/966396848/read-trumps-jan-6-speech-a-key-part-of-impeachment-trial",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Capitol Riot Costs Go Up Government Estimates 273 Million In Property Damage",
      "url": "https://www.forbes.com/sites/zacharysmith/2022/04/08/capitol-riot-costs-go-up-government-estimates-273-million-in-property-damage/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Peterson Kurt Statement Of Facts Redacted 1 0.pdf",
      "url": "https://www.justice.gov/d9/peterson_kurt_-_statement_of_facts_redacted_1_0.pdf",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Officer Brian Sicknick",
      "url": "http://www.uscp.gov/about/honoring-our-fallen/officer-brian-sicknick",
      "domain": "uscp.gov",
      "type": "citation"
    },
    {
      "text": "New Jan 6 Arrests Sentences Ahead 2024 Election Rcna178505",
      "url": "https://www.nbcnews.com/politics/justice-department/new-jan-6-arrests-sentences-ahead-2024-election-rcna178505",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Jury Convicts Four Leaders Proud Boys Seditious Conspiracy Related Us Capitol Breach",
      "url": "https://www.justice.gov/archives/opa/pr/jury-convicts-four-leaders-proud-boys-seditious-conspiracy-related-us-capitol-breach",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Hsgac\\u0026rulesreport Examiningu.s.capitolattack %2520executivesummary.pdf",
      "url": "https://www.hsgac.senate.gov/wp-content/uploads/imo/media/doc/HSGAC\\u0026RulesReport_ExaminingU.S.CapitolAttack_%2520ExecutiveSummary.pdf",
      "domain": "hsgac.senate.gov",
      "type": "citation"
    },
    {
      "text": "Gao 23 106625.pdf",
      "url": "https://www.gao.gov/assets/gao-23-106625.pdf",
      "domain": "gao.gov",
      "type": "citation"
    },
    {
      "text": "1954",
      "url": "https://history.house.gov/Exhibitions-and-Publications/1954-Shooting/1954/",
      "domain": "history.house.gov",
      "type": "citation"
    },
    {
      "text": "Weather Underground Bombings",
      "url": "https://www.fbi.gov/history/famous-cases/weather-underground-bombings",
      "domain": "fbi.gov",
      "type": "citation"
    },
    {
      "text": "Bomb Explodes 1983.htm",
      "url": "https://www.senate.gov/about/historic-buildings-spaces/capitol/bomb-explodes-1983.htm",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Crec 1998 07 27 Pt1 Pgh6459 3.pdf",
      "url": "https://www.congress.gov/105/crec/1998/07/27/CREC-1998-07-27-pt1-PgH6459-3.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Federalelections2020.pdf",
      "url": "https://www.fec.gov/resources/cms-content/documents/federalelections2020.pdf",
      "domain": "fec.gov",
      "type": "citation"
    },
    {
      "text": "2020ap002038.html",
      "url": "https://law.justia.com/cases/wisconsin/supreme-court/2020/2020ap002038.html",
      "domain": "law.justia.com",
      "type": "citation"
    },
    {
      "text": "Detail",
      "url": "https://healthyelections-case-tracker.stanford.edu/detail?id=367",
      "domain": "healthyelections-case-tracker.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Remarks President Trump Election",
      "url": "https://trumpwhitehouse.archives.gov/briefings-statements/remarks-president-trump-election/",
      "domain": "trumpwhitehouse.archives.gov",
      "type": "citation"
    },
    {
      "text": "Trump Premature Victory Claim 434024",
      "url": "https://www.politico.com/news/2020/11/04/trump-premature-victory-claim-434024",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "What Donald Trump Said Election Victory Speech Full Transcript 1544716",
      "url": "https://www.newsweek.com/what-donald-trump-said-election-victory-speech-full-transcript-1544716",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Blogs Trending 55009950",
      "url": "https://www.bbc.com/news/blogs-trending-55009950",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Ch1.html",
      "url": "https://www.govinfo.gov/content/pkg/GPO-J6-REPORT/html-submitted/ch1.html",
      "domain": "govinfo.gov",
      "type": "citation"
    },
    {
      "text": "556831",
      "url": "https://www.c-span.org/program/campaign-2020/trump-campaign-news-conference-on-legal-challenges/556831",
      "domain": "c-span.org",
      "type": "citation"
    },
    {
      "text": "Rudy Giuliani Trump Campaign Press Conference Transcript November 19 Election Fraud Claims",
      "url": "https://www.rev.com/transcripts/rudy-giuliani-trump-campaign-press-conference-transcript-november-19-election-fraud-claims",
      "domain": "rev.com",
      "type": "citation"
    },
    {
      "text": "50119",
      "url": "https://www.congress.gov/committee-print/117th-congress/house-committee-print/50119",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Tweets December 19 2020",
      "url": "https://www.presidency.ucsb.edu/documents/tweets-december-19-2020",
      "domain": "presidency.ucsb.edu",
      "type": "citation"
    },
    {
      "text": "Timeline What Trump Told Supporters For Months Before They Attacked",
      "url": "https://www.npr.org/2021/02/08/965342252/timeline-what-trump-told-supporters-for-months-before-they-attacked",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Capitol Mob Trump Supporters.html",
      "url": "https://www.nytimes.com/2021/01/06/us/politics/capitol-mob-trump-supporters.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Americans Killed Protests Political Unrest Acled",
      "url": "https://www.theguardian.com/world/2020/oct/31/americans-killed-protests-political-unrest-acled",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Riots Cost Property Damage",
      "url": "https://www.axios.com/2020/09/16/riots-cost-property-damage",
      "domain": "axios.com",
      "type": "citation"
    },
    {
      "text": "Joe Biden Donald Trump Capitol Siege Coronavirus Pandemic Elections 79599e3eef68732134c94375a26897f7",
      "url": "https://apnews.com/article/joe-biden-donald-trump-capitol-siege-coronavirus-pandemic-elections-79599e3eef68732134c94375a26897f7",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Most Gop Voters Still Don T Think Biden Was Elected Fairly",
      "url": "https://www.rasmussenreports.com/public_content/politics/elections/election_2020/most_gop_voters_still_don_t_think_biden_was_elected_fairly",
      "domain": "rasmussenreports.com",
      "type": "citation"
    },
    {
      "text": "21 0278 Women For America First Ellispse Permit Redacted.pdf",
      "url": "https://www.nps.gov/aboutus/foia/upload/21-0278-Women-for-America-First-Ellispse-permit_REDACTED.pdf",
      "domain": "nps.gov",
      "type": "citation"
    },
    {
      "text": "Group Planned Jan 6 Rally Lied Capitol March Plans Government Report S Rcna130343",
      "url": "https://www.nbcnews.com/politics/politics-news/group-planned-jan-6-rally-lied-capitol-march-plans-government-report-s-rcna130343",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/US/stop-steal-organizer-ali-alexander-appears-federal-grand/story?id=85664204",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Select Committee Issues Subpoenas Related January 6th Stop Steal Rally Us",
      "url": "http://january6th-benniethompson.house.gov/news/press-releases/select-committee-issues-subpoenas-related-january-6th-stop-steal-rally-us",
      "domain": "january6th-benniethompson.house.gov",
      "type": "citation"
    },
    {
      "text": "Hmkp 117 Go00 20210902 Sd005.pdf",
      "url": "https://docs.house.gov/meetings/GO/GO00/20210902/114020/HMKP-117-GO00-20210902-SD005.pdf",
      "domain": "docs.house.gov",
      "type": "citation"
    },
    {
      "text": "Fbi Dhs Domestic Terrorism Strategic Report.pdf",
      "url": "https://www.fbi.gov/file-repository/fbi-dhs-domestic-terrorism-strategic-report.pdf",
      "domain": "fbi.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Police Ignored Intelligence Warnings Ahead Jan 6 Riots Watchdog N1264054",
      "url": "https://www.nbcnews.com/politics/congress/capitol-police-ignored-intelligence-warnings-ahead-jan-6-riots-watchdog-n1264054",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "230627 Hsgac Majority Report Jan 6 Intel.pdf",
      "url": "https://www.hsgac.senate.gov/wp-content/uploads/230627_HSGAC-Majority-Report_Jan-6-Intel.pdf",
      "domain": "hsgac.senate.gov",
      "type": "citation"
    },
    {
      "text": "Govpub Y4 G74 9 Purl Gpo214084.pdf",
      "url": "https://www.govinfo.gov/content/pkg/GOVPUB-Y4_G74_9-PURL-gpo214084/pdf/GOVPUB-Y4_G74_9-PURL-gpo214084.pdf",
      "domain": "govinfo.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Police Officers 3 Years On Capitol Still At Risk",
      "url": "https://fop.net/2024/01/capitol-police-officers-3-years-on-capitol-still-at-risk/",
      "domain": "fop.net",
      "type": "citation"
    },
    {
      "text": "Fbi Homeland Security Ignored Massive Amount Of Intelligence Before Jan 6 Senate Report Says",
      "url": "https://www.pbs.org/newshour/politics/fbi-homeland-security-ignored-massive-amount-of-intelligence-before-jan-6-senate-report-says",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Ex Capitol Police Chief Rebuffs Claims National Guard Was Never Called During Ri",
      "url": "https://www.npr.org/2021/01/11/955548910/ex-capitol-police-chief-rebuffs-claims-national-guard-was-never-called-during-ri",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "New Obtained Hbo Footage Shows Pelosi Again Taking Responsibility For Capitol Security On January 6",
      "url": "https://cha.house.gov/2024/8/new-obtained-hbo-footage-shows-pelosi-again-taking-responsibility-for-capitol-security-on-january-6",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "Nancy Pelosi Contradicts Her Own Narrative Of January 6 Hbo Footage Shows",
      "url": "https://cha.house.gov/2024/6/nancy-pelosi-contradicts-her-own-narrative-of-january-6-hbo-footage-shows",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "145dd5a70e967deec1f511764d3e6fa1.final Interim Report.pdf",
      "url": "https://cha.house.gov/_cache/files/6/d/6dae7b82-7683-4f56-a177-ba98695e600d/145DD5A70E967DEEC1F511764D3E6FA1.final-interim-report.pdf",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "Senate Report Intelligence Agencies Failed To Fulfill Their Mission Ahead Of Jan",
      "url": "https://www.npr.org/2023/06/27/1184498329/senate-report-intelligence-agencies-failed-to-fulfill-their-mission-ahead-of-jan",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "No Undercover Fbi Agents At Jan 6 Riot Watchdog Finds In Rebuke To Conspiracy Theories",
      "url": "https://www.pbs.org/newshour/politics/no-undercover-fbi-agents-at-jan-6-riot-watchdog-finds-in-rebuke-to-conspiracy-theories",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "View",
      "url": "https://www.fbi.gov/video-repository/january-5-pipe-bomb-investigation-new-footage-of-suspect-placing-bomb-at-dnc/view",
      "domain": "fbi.gov",
      "type": "citation"
    },
    {
      "text": "Fbi New Videos 2021 D C Pipe Bomb Suspect Dnc Rnc",
      "url": "https://www.cbsnews.com/news/fbi-new-videos-2021-d-c-pipe-bomb-suspect-dnc-rnc/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Oig 24 42 Aug24 Redacted.pdf",
      "url": "https://www.oig.dhs.gov/sites/default/files/assets/2024-08/OIG-24-42-Aug24-Redacted.pdf",
      "domain": "oig.dhs.gov",
      "type": "citation"
    },
    {
      "text": "500000 Reward Remains In Effect For Information About Capitol Hill Pipe Bomber",
      "url": "https://www.fbi.gov/contact-us/field-offices/washingtondc/news/500000-reward-remains-in-effect-for-information-about-capitol-hill-pipe-bomber",
      "domain": "fbi.gov",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/US/new-dhs-watchdog-report-details-close-kamala-harris/story?id=112475866",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Top Takeaways From Dhs Oig Redacted Report On Secret Service January 6 Failures",
      "url": "https://cha.house.gov/2024/8/top-takeaways-from-dhs-oig-redacted-report-on-secret-service-january-6-failures",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "F503cd6c839f28ceb7d4216055e45035.joint Pipe Bomb Report Cn Bd Cn Mj Db Bd Cn Bd Db Bd Db Bd Db Bd Db Bd Final Version Redacted2.pdf",
      "url": "https://cha.house.gov/_cache/files/f/e/fe4f4a06-d98a-4437-8891-792c5d406213/F503CD6C839F28CEB7D4216055E45035.joint-pipe-bomb-report-cn-bd-cn-mj-db-bd-cn-bd-db-bd-db-bd-db-bd-db-bd---final-version-redacted2.pdf",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "Man Charged Planting Explosive Devices Outside Rnc And Dnc January 5 2021",
      "url": "https://www.justice.gov/usao-dc/pr/man-charged-planting-explosive-devices-outside-rnc-and-dnc-january-5-2021",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Harris Was Inside Dnc On Jan 6 When Pipe Bomb Was Discovered Outside 526695",
      "url": "https://www.politico.com/news/2022/01/06/harris-was-inside-dnc-on-jan-6-when-pipe-bomb-was-discovered-outside-526695",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "A Timeline Of How The Jan 6 Attack Unfolded Including Who Said What And When",
      "url": "https://www.npr.org/2022/01/05/1069977469/a-timeline-of-how-the-jan-6-attack-unfolded-including-who-said-what-and-when",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Donald Trump Speech Campaign Rally The Ellipse January 6 2021",
      "url": "https://rollcall.com/factbase/trump/transcript/donald-trump-speech-campaign-rally-the-ellipse-january-6-2021",
      "domain": "rollcall.com",
      "type": "citation"
    },
    {
      "text": "Democrats Use Rally Footage To Argue Incitement",
      "url": "https://www.pbs.org/newshour/politics/democrats-use-rally-footage-to-argue-incitement",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "World Us Canada 55640437",
      "url": "https://www.bbc.com/news/world-us-canada-55640437",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Trump January 6 Speech Transcript",
      "url": "https://www.cnn.com/2021/02/08/politics/trump-january-6-speech-transcript",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Capitol Siege Elections Donald Trump Presidential Elections Election 2020 3315609c4152b4429930a17191b5a217",
      "url": "https://apnews.com/article/capitol-siege-elections-donald-trump-presidential-elections-election-2020-3315609c4152b4429930a17191b5a217",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Tweets January 6 2021",
      "url": "https://www.presidency.ucsb.edu/documents/tweets-january-6-2021",
      "domain": "presidency.ucsb.edu",
      "type": "citation"
    },
    {
      "text": "Trumps False Mlk Speech Jan 6 Crowd Size",
      "url": "https://www.politifact.com/factchecks/2024/aug/09/donald-trump/trumps-false-mlk-speech-jan-6-crowd-size/",
      "domain": "politifact.com",
      "type": "citation"
    },
    {
      "text": "World Us Canada 56004916",
      "url": "https://www.bbc.com/news/world-us-canada-56004916",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Trump Capitol Riot Timeline.html",
      "url": "https://www.nytimes.com/interactive/2021/01/15/us/trump-capitol-riot-timeline.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Ead6e41f 5dd1 4e43 Bc59 Ffaaa70828cc Video.html",
      "url": "https://www.washingtonpost.com/video/politics/video-shows-ray-epps-at-initial-capitol-breach-on-jan-6/2022/01/18/ead6e41f-5dd1-4e43-bc59-ffaaa70828cc_video.html",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Hsgac Rules Jan 6 Report",
      "url": "https://www.rules.senate.gov/download/hsgac-rules-jan-6-report",
      "domain": "rules.senate.gov",
      "type": "citation"
    },
    {
      "text": "Dl",
      "url": "https://www.justice.gov/usao-dc/media/1337761/dl?inline",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "2411664",
      "url": "https://law.justia.com/cases/federal/district-courts/FSupp2/89/29/2411664/",
      "domain": "law.justia.com",
      "type": "citation"
    },
    {
      "text": "Benjamin%20martin%20criminal%20complaint.pdf",
      "url": "https://extremism.gwu.edu/sites/g/files/zaxdzs5746/files/Benjamin%20Martin%20Criminal%20Complaint.pdf",
      "domain": "extremism.gwu.edu",
      "type": "citation"
    },
    {
      "text": "Interpreting The Key Misdemeanor Charge In Jan. 6 Cases",
      "url": "https://www.lawfaremedia.org/article/interpreting-the-key-misdemeanor-charge-in-jan.-6-cases",
      "domain": "lawfaremedia.org",
      "type": "citation"
    },
    {
      "text": "Trump Claimed There Was Not One Gun Jan 6 Rioters Capitol Riot",
      "url": "https://www.cbsnews.com/news/trump-claimed-there-was-not-one-gun-jan-6-rioters-capitol-riot/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Missouri Man Sentenced Felony Weapons Charge Actions During Jan 6 Capitol Breach",
      "url": "https://www.justice.gov/usao-dc/pr/missouri-man-sentenced-felony-weapons-charge-actions-during-jan-6-capitol-breach",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/Politics/inspector-general-blasts-capitol-police-preparedness-jan-riot/story?id=77073581",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Capitol Police Riot Report.html",
      "url": "https://www.nytimes.com/2021/04/13/us/politics/capitol-police-riot-report.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Gao 22 105001.pdf",
      "url": "https://www.gao.gov/assets/gao-22-105001.pdf",
      "domain": "gao.gov",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/Politics/trump-boasted-crowd-size-jan-riot-book/story?id=80504801",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Scaffold Commander Delusion",
      "url": "https://www.thebulwark.com/p/scaffold-commander-delusion",
      "domain": "thebulwark.com",
      "type": "citation"
    },
    {
      "text": "Capitol Insurrection Visual Timeline",
      "url": "https://www.washingtonpost.com/nation/interactive/2021/capitol-insurrection-visual-timeline/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "4987910",
      "url": "https://www.c-span.org/clip/public-affairs-event/user-clip-capitol-police-opened-a-door-and-300-people-walked-in/4987910",
      "domain": "c-span.org",
      "type": "citation"
    },
    {
      "text": "Fact Check Did An Inside Man Open",
      "url": "https://thedispatch.com/article/fact-check-did-an-inside-man-open/",
      "domain": "thedispatch.com",
      "type": "citation"
    },
    {
      "text": "A Timeline Of The Governments Response On Jan 6 2021",
      "url": "https://americanoversight.org/resource/a-timeline-of-the-governments-response-on-jan-6-2021/",
      "domain": "americanoversight.org",
      "type": "citation"
    },
    {
      "text": "Reporters Video From Inside Senate On Jan 6 Shows A Crowd Prepared For Violence",
      "url": "https://www.npr.org/2021/02/25/971319812/reporters-video-from-inside-senate-on-jan-6-shows-a-crowd-prepared-for-violence",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Explaining The Missing Context Of Tucker Carlsons Jan 6 Presentation",
      "url": "https://www.factcheck.org/2023/03/explaining-the-missing-context-of-tucker-carlsons-jan-6-presentation/",
      "domain": "factcheck.org",
      "type": "citation"
    },
    {
      "text": "Capitol Footage Police Trump Insurrection Mob",
      "url": "https://www.buzzfeednews.com/article/zoetillman/capitol-footage-police-trump-insurrection-mob",
      "domain": "buzzfeednews.com",
      "type": "citation"
    },
    {
      "text": "Capitol Rioters.html",
      "url": "https://www.nytimes.com/2021/01/09/us/capitol-rioters.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "04 8 2022",
      "url": "https://www.politico.com/minutes/congress/04-8-2022/",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "Law Enforcement And Social Media Identifying U S Capitol Mob Members",
      "url": "https://www.npr.org/sections/insurrection-at-the-capitol/2021/01/07/954518782/law-enforcement-and-social-media-identifying-u-s-capitol-mob-members",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Us Capitol Riot Inside Senate Chamber",
      "url": "https://www.cbsnews.com/news/us-capitol-riot-inside-senate-chamber/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Read Full Senate Investigation Details Security Breakdowns Surrounding Capitol Attack",
      "url": "https://www.pbs.org/newshour/politics/read-full-senate-investigation-details-security-breakdowns-surrounding-capitol-attack",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Wisconsin Man Sentenced Prison Assaulting Police Chemical Bear Spray During Jan 6",
      "url": "https://www.justice.gov/usao-dc/pr/wisconsin-man-sentenced-prison-assaulting-police-chemical-bear-spray-during-jan-6",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Police Describe January 6 193615215.html",
      "url": "https://news.yahoo.com/capitol-police-describe-january-6-193615215.html",
      "domain": "news.yahoo.com",
      "type": "citation"
    },
    {
      "text": "65 09f0cb62 416c 420c 877f 86d714eb82fe",
      "url": "https://www.wusa9.com/article/news/national/capitol-riots/watch-new-video-shows-assault-on-officer-brian-sicknick-during-capitol-riot/65-09f0cb62-416c-420c-877f-86d714eb82fe",
      "domain": "wusa9.com",
      "type": "citation"
    },
    {
      "text": "Videos Show Bear Spray Attack On Capitol Officers During Jan 6 Riot",
      "url": "https://abc3340.com/news/nation-world/videos-show-bear-spray-attack-on-capitol-officers-during-jan-6-riot",
      "domain": "abc3340.com",
      "type": "citation"
    },
    {
      "text": "An Officer Who Was Attacked On January 6 Says He Still Lives With The Aftermath",
      "url": "https://www.npr.org/2024/01/06/1223287081/an-officer-who-was-attacked-on-january-6-says-he-still-lives-with-the-aftermath",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "1015298660461978",
      "url": "https://www.facebook.com/CBSNews/posts/andrew-taake-was-accused-of-attacking-police-officers-with-bear-spray-and-a-meta/1015298660461978/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "60743642 60e2 11eb 9430 E7c77b5b0297 Story.html",
      "url": "https://www.washingtonpost.com/local/public-safety/police-union-says-140-officers-injured-in-capitol-riot/2021/01/27/60743642-60e2-11eb-9430-e7c77b5b0297_story.html",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Capitol Riot Police Officer Injuries.html",
      "url": "https://www.nytimes.com/2021/02/11/us/politics/capitol-riot-police-officer-injuries.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Police Union Over 140 Officers Injured In Capitol Siege Nsi5xcpt1sielyvj",
      "url": "https://www.police1.com/officer-safety/articles/police-union-over-140-officers-injured-in-capitol-siege-NSi5xcpt1sIELYvJ/",
      "domain": "police1.com",
      "type": "citation"
    },
    {
      "text": "January 6 Prosecutions Justice Department",
      "url": "https://www.cnn.com/2024/01/04/politics/january-6-prosecutions-justice-department",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Us Capitol Attack Rioters Had Weapons Including Firearms 2025 01 16",
      "url": "https://www.reuters.com/fact-check/us-capitol-attack-rioters-had-weapons-including-firearms-2025-01-16/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Yes Capitol Rioters Were Armed Here Are The Weapons Prosecutors Say They Used",
      "url": "https://www.npr.org/2021/03/19/977879589/yes-capitol-rioters-were-armed-here-are-the-weapons-prosecutors-say-they-used",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Capitol Police Officers Concerns January 6 Documents",
      "url": "https://www.cnn.com/2021/09/17/politics/capitol-police-officers-concerns-january-6-documents",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Capitol Police Suspends 6 Officers Investigates Dozens More After Capitol Riots",
      "url": "https://www.npr.org/sections/insurrection-at-the-capitol/2021/02/19/969441904/capitol-police-suspends-6-officers-investigates-dozens-more-after-capitol-riots",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Glenn Beck Blog Medias Hero Capitol Police Officer Caught In Lies About January 6",
      "url": "https://www.iheart.com/content/glenn-beck-blog-medias-hero-capitol-police-officer-caught-in-lies-about-january-6/",
      "domain": "iheart.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=dzsSCaX9nYQ",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Department Justice Closes Investigation Death Ashli Babbitt",
      "url": "https://www.justice.gov/usao-dc/pr/department-justice-closes-investigation-death-ashli-babbitt",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Uscp Completes Internal Investigation January 6 Officer Involved",
      "url": "http://www.uscp.gov/media-center/press-releases/uscp-completes-internal-investigation-january-6-officer-involved",
      "domain": "uscp.gov",
      "type": "citation"
    },
    {
      "text": "53806608 97cf 11eb A6d0 13d207aadb78 Story.html",
      "url": "https://www.washingtonpost.com/local/public-safety/trump-riot-death-medical-exainer/2021/04/07/53806608-97cf-11eb-a6d0-13d207aadb78_story.html",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Mzmp3ms2jzgthkagbm2ypcrg5i",
      "url": "https://www.kiro7.com/news/trending/dc-medical-examiner-confirms-causes-death-4-who-died-jan-6-capitol-riot/MZMP3MS2JZGTHKAGBM2YPCRG5I/",
      "domain": "kiro7.com",
      "type": "citation"
    },
    {
      "text": "2 People Who Died Capitol Riot Died Natural Causes Medical Examiner Rules 1581804",
      "url": "https://www.newsweek.com/2-people-who-died-capitol-riot-died-natural-causes-medical-examiner-rules-1581804",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Medical Examiner Finds Uscp Officer Brian Sicknick Died Natural Causes",
      "url": "http://www.uscp.gov/media-center/press-releases/medical-examiner-finds-uscp-officer-brian-sicknick-died-natural-causes",
      "domain": "uscp.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Police Officer Brian Sicknick Died Of Natural Causes Medical Examiner Ru",
      "url": "https://www.npr.org/2021/04/19/988876722/capitol-police-officer-brian-sicknick-died-of-natural-causes-medical-examiner-ru",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Jan 6 Capitol Deaths.html",
      "url": "https://www.nytimes.com/2022/01/05/us/politics/jan-6-capitol-deaths.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Plaw 117publ32.htm",
      "url": "https://www.congress.gov/117/plaws/publ32/PLAW-117publ32.htm",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Police Injuries",
      "url": "https://www.cnn.com/2022/03/07/politics/capitol-police-injuries",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "23 0928 Ops Report January 6th 2021.pdf",
      "url": "https://www.dhs.gov/sites/default/files/2023-09/23_0928_OPS-Report-January-6th-2021.pdf",
      "domain": "dhs.gov",
      "type": "citation"
    },
    {
      "text": "Tell Congress To Investigate The 2020 Blm Antifa Riots As Well As January 6th",
      "url": "https://nationalpolice.org/tell-congress-to-investigate-the-2020-blm-antifa-riots-as-well-as-january-6th/",
      "domain": "nationalpolice.org",
      "type": "citation"
    },
    {
      "text": "Architect Of The Capitol Outlines 30 Million In Damages From Pro Trump Riot",
      "url": "https://www.npr.org/sections/insurrection-at-the-capitol/2021/02/24/970977612/architect-of-the-capitol-outlines-30-million-in-damages-from-pro-trump-riot",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Capitol Curators Estimate 25k Damage To Art",
      "url": "https://hyperallergic.com/627541/capitol-curators-estimate-25k-damage-to-art/",
      "domain": "hyperallergic.com",
      "type": "citation"
    },
    {
      "text": "4563422001",
      "url": "https://www.usatoday.com/story/news/politics/2021/02/23/capitol-riot-thomas-jefferson-statue-among-damage-officials-say/4563422001/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Us Capitol Art Damage.html",
      "url": "https://www.nytimes.com/2021/01/07/arts/design/us-capitol-art-damage.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Portland Police Plan To Address Nightly Protests",
      "url": "https://katu.com/news/local/portland-police-plan-to-address-nightly-protests",
      "domain": "katu.com",
      "type": "citation"
    },
    {
      "text": "Coronavirus Closures Inflated 23 Million Reported In Downtown Portland Protest Damages.html",
      "url": "https://www.oregonlive.com/portland/2020/07/coronavirus-closures-inflated-23-million-reported-in-downtown-portland-protest-damages.html",
      "domain": "oregonlive.com",
      "type": "citation"
    },
    {
      "text": "January 6 U S Capitol Attack",
      "url": "https://www.britannica.com/event/January-6-U-S-Capitol-attack",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Trumps Jan 6 Speech Texts Calls What Former President Said During Capitol Riot 1665967",
      "url": "https://www.newsweek.com/trumps-jan-6-speech-texts-calls-what-former-president-said-during-capitol-riot-1665967",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Democracy Under Siege An Hour By Hour Look Assault Us Capitol 2022 01 04",
      "url": "https://www.reuters.com/world/us/democracy-under-siege-an-hour-by-hour-look-assault-us-capitol-2022-01-04/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Us Capitol Riot Timeline",
      "url": "https://www.cnn.com/2022/07/10/politics/jan-6-us-capitol-riot-timeline",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Clear Capitol Pence Pleaded Timeline Riot Shows N1263729",
      "url": "https://www.nbcnews.com/politics/congress/clear-capitol-pence-pleaded-timeline-riot-shows-n1263729",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Mike Pence Lawmakers Evacuated Capitol House Protestors 2021 1",
      "url": "https://www.businessinsider.com/mike-pence-lawmakers-evacuated-capitol-house-protestors-2021-1",
      "domain": "businessinsider.com",
      "type": "citation"
    },
    {
      "text": "Ab62e434 567c 11eb A08b F1381ef3d207 Story.html",
      "url": "https://www.washingtonpost.com/politics/pence-rioters-capitol-attack/2021/01/15/ab62e434-567c-11eb-a08b-f1381ef3d207_story.html",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Ted Cruz Electoral College",
      "url": "https://www.texastribune.org/2021/01/06/ted-cruz-electoral-college/",
      "domain": "texastribune.org",
      "type": "citation"
    },
    {
      "text": "Chairman Loudermilk Publishes Never Before Released Anthony Ornato Transcribed Interview",
      "url": "https://cha.house.gov/2024/3/chairman-loudermilk-publishes-never-before-released-anthony-ornato-transcribed-interview",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "1346530358674792466",
      "url": "https://x.com/MayorBowser/status/1346530358674792466",
      "domain": "x.com",
      "type": "citation"
    },
    {
      "text": "Dod Details National Guard Response To Capitol Attack",
      "url": "https://www.nationalguard.mil/News/Article/2466077/dod-details-national-guard-response-to-capitol-attack/",
      "domain": "nationalguard.mil",
      "type": "citation"
    },
    {
      "text": "General Testimony Dc National Guard Request Pentagon Delayed 946be1248dad2b2763bcdd0def6c2a1a",
      "url": "https://apnews.com/article/general-testimony-dc-national-guard-request-pentagon-delayed-946be1248dad2b2763bcdd0def6c2a1a",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "New Dod Ig Transcripts Contradict Pentagon January 6 Report Outline Optics Concerns As Reason For Dcng Delay",
      "url": "https://cha.house.gov/2024/9/new-dod-ig-transcripts-contradict-pentagon-january-6-report-outline-optics-concerns-as-reason-for-dcng-delay",
      "domain": "cha.house.gov",
      "type": "citation"
    },
    {
      "text": "Miscues Confusion National Guard Delay Jan 6.html",
      "url": "https://www.nytimes.com/2024/05/07/us/politics/miscues-confusion-national-guard-delay-jan-6.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Guard Response Not To Blame For Deadly Capitol Riot Former Army Secretary Testifies",
      "url": "https://www.militarytimes.com/news/pentagon-congress/2021/01/26/guard-response-not-to-blame-for-deadly-capitol-riot-former-army-secretary-testifies/",
      "domain": "militarytimes.com",
      "type": "citation"
    },
    {
      "text": "Chrg 117hhrg44570.htm",
      "url": "https://www.govinfo.gov/content/pkg/CHRG-117hhrg44570/html/CHRG-117hhrg44570.htm",
      "domain": "govinfo.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Police Request National Guard 473650",
      "url": "https://www.politico.com/news/2021/03/04/capitol-police-request-national-guard-473650",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "Trump Video Telling Protesters At Capitol Building To Go Home Transcript",
      "url": "https://www.rev.com/transcripts/trump-video-telling-protesters-at-capitol-building-to-go-home-transcript",
      "domain": "rev.com",
      "type": "citation"
    },
    {
      "text": "Joe Biden Riots Capitol Speech",
      "url": "https://www.cnn.com/2021/01/06/politics/joe-biden-riots-capitol-speech",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Biden Condemns Riots At Capitol Calls On Trump To Demand End To Siege.html",
      "url": "https://www.cnbc.com/2021/01/06/biden-condemns-riots-at-capitol-calls-on-trump-to-demand-end-to-siege.html",
      "domain": "cnbc.com",
      "type": "citation"
    },
    {
      "text": "Cz73yyrw2rlo",
      "url": "https://www.bbc.com/news/articles/cz73yyrw2rlo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Insurrection.html",
      "url": "https://www.nytimes.com/2021/01/06/us/politics/insurrection.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "3687759 Schumer Said During Jan 6 Insurrection That Trump Statement Telling Rioters To Leave Was Bs",
      "url": "https://thehill.com/homenews/senate/3687759-schumer-said-during-jan-6-insurrection-that-trump-statement-telling-rioters-to-leave-was-bs/",
      "domain": "thehill.com",
      "type": "citation"
    },
    {
      "text": "Gop Leaders Condemn Sen Josh Hawley After Pro Trump Riot At U S Capitol",
      "url": "https://www.npr.org/2021/01/08/955103447/gop-leaders-condemn-sen-josh-hawley-after-pro-trump-riot-at-u-s-capitol",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Democrats Republicans Reaction Trump",
      "url": "https://www.washingtonpost.com/politics/2021/01/06/democrats-republicans-reaction-trump/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "A Look At How Different U S Media Outlets Covered The Pro Trump Riot On Capitol",
      "url": "https://www.npr.org/2021/01/07/954562181/a-look-at-how-different-u-s-media-outlets-covered-the-pro-trump-riot-on-capitol-",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Domestic Terrorism Capitol Hill Reliable Sources January 6",
      "url": "https://www.cnn.com/2021/01/07/media/domestic-terrorism-capitol-hill-reliable-sources-january-6",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "House Creates Jan 6 Select Committee",
      "url": "https://rollcall.com/2021/06/30/house-creates-jan-6-select-committee/",
      "domain": "rollcall.com",
      "type": "citation"
    },
    {
      "text": "January 6 Committee Explainer",
      "url": "https://www.washingtonpost.com/politics/2022/01/04/january-6-committee-explainer/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "January 6th Committee Final Report",
      "url": "https://www.govinfo.gov/collection/january-6th-committee-final-report",
      "domain": "govinfo.gov",
      "type": "citation"
    },
    {
      "text": "1",
      "url": "https://www.congress.gov/committee-report/117th-congress/house-report/216/1",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Trump Lit That Fire Of Capitol Insurrection Jan 6 Committee Report Says",
      "url": "https://www.pbs.org/newshour/politics/trump-lit-that-fire-of-capitol-insurrection-jan-6-committee-report-says",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Jan 6 Report Takeaways Highlights 00074819",
      "url": "https://www.politico.com/news/2022/12/23/jan-6-report-takeaways-highlights-00074819",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "January 6th Committee",
      "url": "https://en.wikipedia.org/wiki/January_6th_Committee",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "5019130",
      "url": "https://www.c-span.org/clip/january-6-hearings/user-clip-january-6-committee-plays-deceptively-edited-video/5019130",
      "domain": "c-span.org",
      "type": "citation"
    },
    {
      "text": "Trump Accuses Jan 6 Committee Selective Editing Rcna34164",
      "url": "https://www.nbcnews.com/politics/donald-trump/trump-accuses-jan-6-committee-selective-editing-rcna34164",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "4525079 Gop Report Seeks To Discredit Jan 6 Committee Exonerate Trump",
      "url": "https://thehill.com/homenews/house/4525079-gop-report-seeks-to-discredit-jan-6-committee-exonerate-trump/",
      "domain": "thehill.com",
      "type": "citation"
    },
    {
      "text": "New White House Move Jan 6 Transcripts Saga 00137977",
      "url": "https://www.politico.com/live-updates/2024/01/26/congress/new-white-house-move-jan-6-transcripts-saga-00137977",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "Klobuchar Blunt Peters Portman Release Bipartisan Report Investigating January 6th Capitol Attack",
      "url": "https://www.rules.senate.gov/news/press-releases/klobuchar-blunt-peters-portman-release-bipartisan-report-investigating-january-6th-capitol-attack",
      "domain": "rules.senate.gov",
      "type": "citation"
    },
    {
      "text": "Capitol Riot Security Failures Report 492070",
      "url": "https://www.politico.com/news/2021/06/08/capitol-riot-security-failures-report-492070",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "Oig 22 29 Mar22 Redacted.pdf",
      "url": "https://www.oig.dhs.gov/sites/default/files/assets/2022-04/OIG-22-29-Mar22-Redacted.pdf",
      "domain": "oig.dhs.gov",
      "type": "citation"
    },
    {
      "text": "Fbi Nypd Told Capitol Police About Possibility Violence Riot Senior N1253646",
      "url": "https://www.nbcnews.com/news/crime-courts/fbi-nypd-told-capitol-police-about-possibility-violence-riot-senior-n1253646",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Justice Dept Watchdog Report Fbi Jan 6 Intelligence Confidential Human Sources",
      "url": "https://www.cbsnews.com/news/justice-dept-watchdog-report-fbi-jan-6-intelligence-confidential-human-sources/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Fbi Seeking Information Related To Violent Activity At The Us Capitol Building 010621",
      "url": "https://www.fbi.gov/contact-us/field-offices/washingtondc/news/press-releases/fbi-seeking-information-related-to-violent-activity-at-the-us-capitol-building-010621",
      "domain": "fbi.gov",
      "type": "citation"
    },
    {
      "text": "Thirteen Charged Federal Court Following Riot United States Capitol",
      "url": "https://www.justice.gov/archives/opa/pr/thirteen-charged-federal-court-following-riot-united-states-capitol",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Hhrg 119 Ju13 20250225 Sd013 U13.pdf",
      "url": "https://www.congress.gov/119/meeting/house/117924/documents/HHRG-119-JU13-20250225-SD013-U13.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Proud Boys Fbi Informants.html",
      "url": "https://www.nytimes.com/2023/03/24/us/proud-boys-fbi-informants.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Cn850jj44mjo",
      "url": "https://www.bbc.com/news/articles/cn850jj44mjo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Capitol Riot Arrests Sentences",
      "url": "https://time.com/6133336/jan-6-capitol-riot-arrests-sentences/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "Peters Report Finds Significant Intelligence Failures By Fbi And Dhs In Lead Up To January 6th Capitol Attack",
      "url": "https://www.hsgac.senate.gov/media/dems/peters-report-finds-significant-intelligence-failures-by-fbi-and-dhs-in-lead-up-to-january-6th-capitol-attack/",
      "domain": "hsgac.senate.gov",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/US/jan-6-capitol-attack-investigation-stands-numbers-doj/story?id=117353000",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "The High Water Mark Of The Jan. 6 Prosecutions",
      "url": "https://www.lawfaremedia.org/article/the-high-water-mark-of-the-jan.-6-prosecutions",
      "domain": "lawfaremedia.org",
      "type": "citation"
    },
    {
      "text": "Jan 6 Prosecutions Cases Charges By The Numbers",
      "url": "https://www.livenowfox.com/news/jan-6-prosecutions-cases-charges-by-the-numbers",
      "domain": "livenowfox.com",
      "type": "citation"
    },
    {
      "text": "What Is Seditious Conspiracy Which Is Among The Most Serious Crimes Trump Pardoned 248060",
      "url": "https://theconversation.com/what-is-seditious-conspiracy-which-is-among-the-most-serious-crimes-trump-pardoned-248060",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "January 6 Riot Sentences",
      "url": "https://www.washingtonpost.com/dc-md-va/2024/01/05/january-6-riot-sentences/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Proud Boys Leader Sentenced 22 Years Prison Seditious Conspiracy And Other Charges",
      "url": "https://www.justice.gov/usao-dc/pr/proud-boys-leader-sentenced-22-years-prison-seditious-conspiracy-and-other-charges",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "Court Sentences Two Oath Keepers Leaders 18 Years Prison Seditious Conspiracy And Other",
      "url": "https://www.justice.gov/usao-dc/pr/court-sentences-two-oath-keepers-leaders-18-years-prison-seditious-conspiracy-and-other",
      "domain": "justice.gov",
      "type": "citation"
    },
    {
      "text": "23 5572 L6hn.pdf",
      "url": "https://www.supremecourt.gov/opinions/23pdf/23-5572_l6hn.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Justices Rule For Jan 6 Defendant",
      "url": "https://www.scotusblog.com/2024/06/justices-rule-for-jan-6-defendant/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Rioters Defiant Judges Trump 4c42aabc97c5aa7ffa25430d7f3be3f2",
      "url": "https://apnews.com/article/jan-6-rioters-defiant-judges-trump-4c42aabc97c5aa7ffa25430d7f3be3f2",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Prisoners Republican Investigation.html",
      "url": "https://www.nytimes.com/2023/03/09/us/politics/jan-6-prisoners-republican-investigation.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Steve Baker Capitol Riot Blaze News Writer 2db0b3855c6b5aa88d9d16c189a93959",
      "url": "https://apnews.com/article/steve-baker-capitol-riot-blaze-news-writer-2db0b3855c6b5aa88d9d16c189a93959",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Stephen Horn Convicted",
      "url": "https://www.washingtonpost.com/dc-md-va/2023/09/18/jan-6-stephen-horn-convicted/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Infowars Host Owen Shroyer Gets 2 Months In Prison In Capitol Insurrection Case",
      "url": "https://www.pbs.org/newshour/politics/infowars-host-owen-shroyer-gets-2-months-in-prison-in-capitol-insurrection-case",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Samuel Montoya Infowars Sentencing January 6 2021",
      "url": "https://www.cbsnews.com/news/samuel-montoya-infowars-sentencing-january-6-2021/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Capitol Lockdown.html",
      "url": "https://www.nytimes.com/2021/01/07/us/politics/capitol-lockdown.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Donald Trump New York Journalists Media Social Media Cba6bd7b93be0ade1da714a32c33d74c",
      "url": "https://apnews.com/article/donald-trump-new-york-journalists-media-social-media-cba6bd7b93be0ade1da714a32c33d74c",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Granting Pardons And Commutation Of Sentences For Certain Offenses Relating To The Events At Or Near The United States Capitol On January 6 2021",
      "url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/",
      "domain": "whitehouse.gov",
      "type": "citation"
    },
    {
      "text": "Trump Jan 6 Pardons",
      "url": "https://www.cbsnews.com/news/trump-jan-6-pardons/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "C5y7l47xrpko",
      "url": "https://www.bbc.com/news/articles/c5y7l47xrpko",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Trump Issues Pardons For 1500 Defendants Charged In Jan 6 Attack On U S Capitol",
      "url": "https://washingtonstatestandard.com/2025/01/20/repub/trump-issues-pardons-for-1500-defendants-charged-in-jan-6-attack-on-u-s-capitol/",
      "domain": "washingtonstatestandard.com",
      "type": "citation"
    },
    {
      "text": "At Least 10 Pardoned Insurrectionists Face Other Criminal Charges",
      "url": "https://www.citizensforethics.org/reports-investigations/crew-investigations/at-least-10-pardoned-insurrectionists-face-other-criminal-charges/",
      "domain": "citizensforethics.org",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/US/hakeem-jeffries-death-threat-arrest/story?id=126723774",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Pardoned Capitol Rioter Charged Threatening Hakeem Jeffries Nyc Trump",
      "url": "https://www.cbsnews.com/news/pardoned-capitol-rioter-charged-threatening-hakeem-jeffries-nyc-trump/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Rioter Pardoned Trump Charged Threats Hakeem Jeffries Rcna238854",
      "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-pardoned-trump-charged-threats-hakeem-jeffries-rcna238854",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Watch Live House Convenes Before Joint Session For Electoral College Vote Count To Confirm Trump Victory",
      "url": "https://www.pbs.org/newshour/politics/watch-live-house-convenes-before-joint-session-for-electoral-college-vote-count-to-confirm-trump-victory",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "2025 Counting And Certification Electoral Votes Designated National",
      "url": "https://www.secretservice.gov/newsroom/releases/2024/09/2025-counting-and-certification-electoral-votes-designated-national",
      "domain": "secretservice.gov",
      "type": "citation"
    },
    {
      "text": "654035",
      "url": "https://www.c-span.org/program/joint-session-of-congress/joint-session-of-congress-to-count-electoral-college-votes/654035",
      "domain": "c-span.org",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/Politics/expect-congress-convenes-certify-presidential-vote/story?id=117349768",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "January 6 Capitol Riot Trump Poll Pardon",
      "url": "https://www.csmonitor.com/USA/Politics/2025/0106/january-6-capitol-riot-trump-poll-pardon",
      "domain": "csmonitor.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 American Attitudes Polling Trump",
      "url": "https://www.washingtonpost.com/politics/2025/01/06/jan-6-american-attitudes-polling-trump/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Poll Analysis Republicans Jan 6 Attack",
      "url": "https://www.cbsnews.com/news/poll-analysis-republicans-jan-6-attack/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Public View Of The Events Of January 6 2021",
      "url": "https://www.statista.com/chart/33714/public-view-of-the-events-of-january-6-2021/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Fbi Informants Proud Boys Jan 6.html",
      "url": "https://www.nytimes.com/2022/11/14/us/politics/fbi-informants-proud-boys-jan-6.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Oath Keepers Trial January 6.html",
      "url": "https://www.nytimes.com/2022/11/08/us/politics/oath-keepers-trial-january-6.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Doj Ig Reveals Number Fbi Confidential Sources Ground During Jan 6",
      "url": "https://www.foxnews.com/politics/doj-ig-reveals-number-fbi-confidential-sources-ground-during-jan-6",
      "domain": "foxnews.com",
      "type": "citation"
    },
    {
      "text": "Doj Oig Releases Report Fbis Handling Its Confidential Human Sources And Intelligence",
      "url": "https://oig.justice.gov/news/doj-oig-releases-report-fbis-handling-its-confidential-human-sources-and-intelligence",
      "domain": "oig.justice.gov",
      "type": "citation"
    },
    {
      "text": "Proud Boys Informants",
      "url": "https://www.washingtonpost.com/dc-md-va/2023/03/30/proud-boys-informants/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Ray Epps A Target Of Jan 6 Conspiracy Theories Gets A Year Of Probation For His Capitol Riot Role",
      "url": "https://www.pbs.org/newshour/politics/ray-epps-a-target-of-jan-6-conspiracy-theories-gets-a-year-of-probation-for-his-capitol-riot-role",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Ray Epps Center Of A Jan 6 Conspiracy Theory Is Charged With A Misdemeanor Over Capitol Insurrection",
      "url": "https://www.pbs.org/newshour/politics/ray-epps-center-of-a-jan-6-conspiracy-theory-is-charged-with-a-misdemeanor-over-capitol-insurrection",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "Ray Epps Sentenced January 6.html",
      "url": "https://www.nytimes.com/2024/01/09/us/politics/ray-epps-sentenced-january-6.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Hhrg 119 Ju13 20250225 Sd015 U15.pdf",
      "url": "https://www.congress.gov/119/meeting/house/117924/documents/HHRG-119-JU13-20250225-SD015-U15.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Justice Inspector General January 6 Fbi Report",
      "url": "https://www.cnn.com/2024/12/12/politics/justice-inspector-general-january-6-fbi-report",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Fbi Director Kash Patel Reveals 274 Agents Deployed Jan 6",
      "url": "https://www.foxnews.com/politics/fbi-director-kash-patel-reveals-274-agents-deployed-jan-6",
      "domain": "foxnews.com",
      "type": "citation"
    },
    {
      "text": "Hhrg 118 Ha06 Wstate Sunds 20230919.pdf",
      "url": "https://docs.house.gov/meetings/HA/HA06/20230919/116368/HHRG-118-HA06-Wstate-SundS-20230919.pdf",
      "domain": "docs.house.gov",
      "type": "citation"
    },
    {
      "text": "Testimony Irving.pdf",
      "url": "https://www.rules.senate.gov/imo/media/doc/Testimony_Irving.pdf",
      "domain": "rules.senate.gov",
      "type": "citation"
    },
    {
      "text": "Transcript All Chris Hayes 10 8 21 N1281211",
      "url": "https://www.msnbc.com/transcripts/transcript-all-chris-hayes-10-8-21-n1281211",
      "domain": "msnbc.com",
      "type": "citation"
    },
    {
      "text": "Sitroom.html",
      "url": "http://www.cnn.com/TRANSCRIPTS/sitroom.html",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "How Many Died As A Result Of Capitol Riot",
      "url": "https://www.factcheck.org/2021/11/how-many-died-as-a-result-of-capitol-riot/",
      "domain": "factcheck.org",
      "type": "citation"
    },
    {
      "text": "11126614",
      "url": "https://abc7chicago.com/post/jan-6-insurrection-us-capitol-yields-biggest-federal-investigation-history/11126614/",
      "domain": "abc7chicago.com",
      "type": "citation"
    },
    {
      "text": "Tucker Carlson January 6 Footage",
      "url": "https://www.cnn.com/2023/03/06/politics/tucker-carlson-january-6-footage",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Vote 117 1 00059.htm",
      "url": "https://www.senate.gov/legislative/LIS/roll_call_votes/vote1171/vote_117_1_00059.htm",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Senate Acquits Trump In Impeachment Trial Again",
      "url": "https://www.npr.org/sections/trump-impeachment-trial-live-updates/2021/02/13/967098840/senate-acquits-trump-in-impeachment-trial-again",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Trump Second Impeachment Senate Vote",
      "url": "https://www.politico.com/interactives/2021/trump-second-impeachment-senate-vote/",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "2022 Midterm Elections House Control 79475a4fc11e4375cd0dded651b9eede",
      "url": "https://apnews.com/article/2022-midterm-elections-house-control-79475a4fc11e4375cd0dded651b9eede",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Election News Results",
      "url": "https://www.nytimes.com/live/2022/11/16/us/election-news-results",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Jan 6 Trump Election Certification Capitol B8284b9b6b22f78ab7f23f8c8b3c3da3",
      "url": "https://apnews.com/article/jan-6-trump-election-certification-capitol-b8284b9b6b22f78ab7f23f8c8b3c3da3",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Polls Show Americans Are Divided On The Significance Of January 6",
      "url": "https://www.brookings.edu/articles/polls-show-americans-are-divided-on-the-significance-of-january-6/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Public Trust In Government 1958 2024",
      "url": "https://www.pewresearch.org/politics/2024/06/24/public-trust-in-government-1958-2024/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "American Democracy Poll Jan 6",
      "url": "https://www.npr.org/2022/01/03/1069764164/american-democracy-poll-jan-6",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Capitol Riot Damage.html",
      "url": "https://www.nytimes.com/2021/02/24/us/politics/capitol-riot-damage.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "6813761002",
      "url": "https://www.usatoday.com/story/news/politics/2021/02/25/capitol-riot-costs-security-fence-cost-least-19-million/6813761002/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Us Capitol Permanent Fence 463573",
      "url": "https://www.politico.com/news/2021/01/28/us-capitol-permanent-fence-463573",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "Fencing Around Us Capitol Come Down Six Months After Jan 6 Attack 2021 07 09",
      "url": "https://www.reuters.com/world/us/fencing-around-us-capitol-come-down-six-months-after-jan-6-attack-2021-07-09/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Fence Reinstalled Capitol Building Ahead Bidens State Union Rcna17866",
      "url": "https://www.nbcnews.com/politics/congress/fence-reinstalled-capitol-building-ahead-bidens-state-union-rcna17866",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "National Guard Security Mission At Us Capitol Concludes",
      "url": "https://www.nationalguard.mil/News/Article-View/Article/2628628/national-guard-security-mission-at-us-capitol-concludes/",
      "domain": "nationalguard.mil",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/Politics/capitol-police-chief-highlights-post-jan-6-security/story?id=96091032",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Capitol Police January 6 Riot Changes Prevention",
      "url": "https://www.cbsnews.com/news/capitol-police-january-6-riot-changes-prevention/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Capitol Riot Damage Cost 30 Million Trump",
      "url": "https://www.axios.com/2021/02/24/capitol-riot-damage-cost-30-million-trump",
      "domain": "axios.com",
      "type": "citation"
    },
    {
      "text": "49 Favor J6 Riot Pardons On Case By Case Basis",
      "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/49_favor_j6_riot_pardons_on_case_by_case_basis",
      "domain": "rasmussenreports.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/Politics/trump-suggests-false-claims-fbi-agents-involvement-jan/story?id=126045170",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "Striking Findings From 2024",
      "url": "https://www.pewresearch.org/short-reads/2024/12/06/striking-findings-from-2024/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Four Years After Capitol Attack January 6 Violence Appeased Or Simply Deferred",
      "url": "https://www.institutmontaigne.org/en/expressions/four-years-after-capitol-attack-january-6-violence-appeased-or-simply-deferred",
      "domain": "institutmontaigne.org",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:24:15.977831",
  "elapsed_ms": 608915
}