{
  "topic": "Johnson & Johnson",
  "title": "Johnson & Johnson",
  "slug": "johnson-and-johnson",
  "grokipedia_slug": "Johnson_&_Johnson",
  "grokipedia_url": null,
  "source": "generated",
  "content": "# Johnson & Johnson\n\n# Johnson & Johnson\n\n## Introduction\n\nJohnson & Johnson (J&J) is a multinational corporation headquartered in New Brunswick, New Jersey, United States, specializing in pharmaceuticals, medical devices, and consumer health products. Founded in 1886, it is one of the largest and most diversified healthcare companies in the world, with a presence in over 60 countries and products sold in more than 175 countries. J&J is renowned for its commitment to health and well-being, often summarized by its credo, which prioritizes the needs of patients, customers, and communities [Johnson & Johnson History](https://www.jnj.com/about-jnj/history). The company is publicly traded on the New York Stock Exchange under the ticker symbol JNJ and is a component of the Dow Jones Industrial Average.\n\n## Historical Background\n\nJohnson & Johnson was established in 1886 by three brothers—Robert Wood Johnson, James Wood Johnson, and Edward Mead Johnson—in New Brunswick, New Jersey. Inspired by the antiseptic techniques pioneered by Joseph Lister, the company initially focused on producing sterile surgical dressings, a revolutionary concept at the time that aimed to reduce post-surgical infections [History of J&J](https://www.jnj.com/about-jnj/history). Their first products included ready-to-use surgical dressings and bandages, which set a new standard for medical care.\n\n- **Early Innovations**: In 1894, J&J introduced one of its most iconic products, Johnson's Baby Powder, marking its entry into consumer goods. The company also pioneered the first commercial first-aid kits in 1888, initially designed for railroad workers [Baby Powder History](https://www.jnj.com/our-heritage).\n- **Expansion and Diversification**: By the early 20th century, J&J expanded internationally, establishing its first overseas affiliate in Canada in 1919. The company entered the pharmaceutical sector with the acquisition of McNeil Laboratories in 1959, which brought Tylenol (acetaminophen) into its portfolio [Tylenol Acquisition](https://www.jnj.com/about-jnj/company-history).\n- **Key Milestones**: In 1982, J&J faced a major crisis when cyanide-laced Tylenol capsules led to seven deaths in the Chicago area. The company’s swift response—recalling 31 million bottles and introducing tamper-proof packaging—became a benchmark for corporate crisis management [Tylenol Crisis](https://www.pbs.org/newshour/health/tylenol-murders-1982).\n\nThroughout the 20th and 21st centuries, J&J continued to grow through acquisitions and innovation, including the purchase of Janssen Pharmaceutica in 1961, which bolstered its pharmaceutical research capabilities, and the development of medical devices like the first disposable contact lenses through its subsidiary Acuvue [Janssen History](https://www.janssen.com/about-us).\n\n## Current Status and Relevance\n\nAs of 2023, Johnson & Johnson remains a global leader in healthcare, with annual revenues exceeding $94 billion in 2022 [J&J Annual Report 2022](https://www.jnj.com/investors/annual-reports). The company operates through three main segments:\n\n- **Pharmaceuticals**: J&J’s pharmaceutical division, primarily through Janssen, focuses on areas like oncology, immunology, and neuroscience. Key drugs include Imbruvica (for cancer) and Stelara (for autoimmune diseases), contributing significantly to revenue.\n- **Medical Devices**: This segment includes surgical tools, orthopedic implants, and vision care products like Acuvue contact lenses. J&J is a leader in robotic-assisted surgery through its Ethicon subsidiary [Ethicon Overview](https://www.ethicon.com/na/).\n- **Consumer Health**: In 2023, J&J completed the spin-off of its consumer health business into a separate publicly traded company called Kenvue, which now manages iconic brands like Band-Aid, Listerine, and Neutrogena [Kenvue Spin-off](https://www.jnj.com/media-center/press-releases/johnson-johnson-completes-separation-of-kenvue-inc).\n\nJ&J has played a pivotal role in global health initiatives, including the development of a single-dose COVID-19 vaccine through Janssen, which received emergency use authorization in 2021 [COVID-19 Vaccine](https://www.jnj.com/coronavirus/covid-19-vaccine). However, the company has faced legal and reputational challenges, notably lawsuits related to its talc-based baby powder, alleged to contain asbestos and linked to ovarian cancer, though J&J maintains the product is safe [Talc Lawsuits](https://www.reuters.com/business/healthcare-pharmaceuticals/johnson-johnson-talc-litigation-2023-08-02/).\n\n## Notable Facts and Details\n\n- **Corporate Credo**: Established in 1943 by Robert Wood Johnson II, the J&J Credo outlines the company’s responsibility to patients, employees, communities, and shareholders. It remains a guiding principle for corporate decisions [J&J Credo](https://www.jnj.com/credo).\n- **Research and Development**: J&J invests heavily in R&D, spending approximately $14.6 billion in 2022 to innovate across its segments [J&J R&D Investment](https://www.jnj.com/investors/annual-reports).\n- **Sustainability Efforts**: The company has committed to achieving carbon neutrality for its operations by 2030 and supports global health equity programs, such as providing affordable medications in low-income countries [Sustainability Goals](https://www.jnj.com/caring-protecting/sustainability).\n- **Legal Controversies**: Beyond the talc lawsuits, J&J has faced scrutiny over its role in the opioid crisis, agreeing to a $5 billion settlement in 2021 as part of a broader agreement with states over the marketing of painkillers [Opioid Settlement](https://www.npr.org/2021/07/21/1019130275/johnson-johnson-opioid-settlement).\n\n## Related Topics\n\n- **Healthcare Industry**: J&J’s operations span a significant portion of the global healthcare market, competing with companies like Pfizer, Medtronic, and Procter & Gamble.\n- **Pharmaceutical Innovations**: The company’s contributions to drug development, particularly in oncology and vaccines, align with broader trends in personalized medicine and immunotherapy.\n- **Consumer Health Products**: With the spin-off of Kenvue, J&J’s historical impact on everyday health products like bandages and oral care remains relevant to consumer goods markets.\n- **Corporate Ethics**: The Tylenol crisis and subsequent credo-driven responses highlight J&J’s influence on corporate responsibility standards.\n\n## References\n\n- [Johnson & Johnson History](https://www.jnj.com/about-jnj/history)\n- [Baby Powder History](https://www.jnj.com/our-heritage)\n- [Tylenol Acquisition](https://www.jnj.com/about-jnj/company-history)\n- [Tylenol Crisis](https://www.pbs.org/newshour/health/tylenol-murders-1982)\n- [Janssen History](https://www.janssen.com/about-us)\n- [J&J Annual Report 2022](https://www.jnj.com/investors/annual-reports)\n- [Ethicon Overview](https://www.ethicon.com/na/)\n- [Kenvue Spin-off](https://www.jnj.com/media-center/press-releases/johnson-johnson-completes-separation-of-kenvue-inc)\n- [COVID-19 Vaccine](https://www.jnj.com/coronavirus/covid-19-vaccine)\n- [Talc Lawsuits](https://www.reuters.com/business/healthcare-pharmaceuticals/johnson-johnson-talc-litigation-2023-08-02/)\n- [J&J Credo](https://www.jnj.com/credo)\n- [J&J R&D Investment](https://www.jnj.com/investors/annual-reports)\n- [Sustainability Goals](https://www.jnj.com/caring-protecting/sustainability)\n- [Opioid Settlement](https://www.npr.org/2021/07/21/1019130275/johnson-johnson-opioid-settlement)",
  "external_references": [],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:22:37.589274",
  "elapsed_ms": 510527
}