{
  "topic": "Kylian Mbappe",
  "title": "Kylian Mbappe",
  "slug": "kylian-mbappe",
  "grokipedia_slug": "Kylian_Mbappe",
  "grokipedia_url": null,
  "source": "generated",
  "content": "# Kylian Mbappe\n\n# Kylian Mbappé\n\n## Overview\n\nKylian Mbappé Lottin, born on December 20, 1998, in Paris, France, is a professional footballer widely regarded as one of the best players of his generation. Playing primarily as a forward, Mbappé is known for his exceptional speed, dribbling, and goal-scoring ability. He currently plays for Paris Saint-Germain (PSG) in Ligue 1 and represents the French national team. Mbappé rose to international prominence after winning the FIFA World Cup in 2018 with France, becoming the youngest French player to score in a World Cup final since Pelé in 1958 [FIFA Profile](https://www.fifa.com/en/player/kylian-mbappe).\n\n## Historical Background\n\n### Early Life and Career Beginnings\nMbappé was born in the 19th arrondissement of Paris to a Cameroonian father, Wilfrid Mbappé, and an Algerian mother, Fayza Lamari. Raised in Bondy, a suburb of Paris, he developed an early passion for football, inspired by his father's role as a youth coach. At the age of six, Mbappé joined AS Bondy, where his prodigious talent quickly became evident. His early potential led him to train at the Clairefontaine academy, France's prestigious national football center, before signing with AS Monaco's youth system in 2013 [The Guardian](https://www.theguardian.com/football/2018/dec/08/kylian-mbappe-paris-saint-germain-france-world-cup).\n\n### Rise at AS Monaco\nMbappé made his professional debut for AS Monaco in December 2015 at the age of 16, breaking Thierry Henry's record as the club's youngest-ever debutant. During the 2016-17 season, he played a pivotal role in Monaco's Ligue 1 title win and their run to the UEFA Champions League semi-finals, scoring 26 goals across all competitions. His performances earned him the Ligue 1 Young Player of the Year award and attracted attention from top European clubs [UEFA](https://www.uefa.com/uefachampionsleague/news/0253-0d7f9e9b9c1a-9b7f9e9b9c1a-1000--kylian-mbappe-monaco-breakthrough/).\n\n### Transfer to Paris Saint-Germain\nIn 2017, Mbappé joined Paris Saint-Germain (PSG) on a loan deal that became permanent in 2018 for a transfer fee of €180 million, making him one of the most expensive players in football history at the time. Since joining PSG, he has won multiple Ligue 1 titles and domestic cups, establishing himself as a key figure in the club's quest for European success [BBC Sport](https://www.bbc.com/sport/football/41219948).\n\n## Current Status and Relevance\n\nAs of 2023, Kylian Mbappé remains a central figure at PSG, where he continues to break goal-scoring records. In the 2022-23 season, he became PSG's all-time leading scorer, surpassing Edinson Cavani's record with over 200 goals for the club [ESPN](https://www.espn.com/soccer/story/_/id/35794485/kylian-mbappe-breaks-psg-goal-scoring-record). On the international stage, Mbappé has been instrumental for France, notably finishing as the top scorer at the 2022 FIFA World Cup in Qatar with eight goals, including a hat-trick in the final, despite France's loss to Argentina [FIFA World Cup 2022](https://www.fifa.com/fifaplus/en/articles/kylian-mbappe-golden-boot-qatar-2022).\n\nMbappé's relevance extends beyond the pitch. He is a global sports icon, frequently featured on the covers of magazines and video games like EA Sports' FIFA series. Additionally, he is known for his philanthropy, including donating his World Cup earnings in 2018 to charity and founding the \"Inspired by KM\" foundation to support underprivileged children in Paris [Forbes](https://www.forbes.com/sites/robertkidd/2022/12/20/kylian-mbappe-the-worlds-highest-paid-soccer-player/).\n\n## Notable Facts and Details\n\n- **Speed and Style**: Mbappé is often compared to legends like Pelé and Thierry Henry due to his explosive pace and clinical finishing. His top recorded speed is approximately 36 km/h (22.4 mph), one of the fastest in modern football [Sky Sports](https://www.skysports.com/football/news/11095/11888671/kylian-mbappe-hits-22-4mph-in-psg-win-over-monaco).\n- **Awards and Records**: He has won the Ligue 1 Player of the Year award multiple times and was named to the FIFA FIFPro World11 in 2022. Mbappé also holds the record as the youngest player to score 10 goals in the UEFA Champions League, achieving this feat at age 20 [UEFA Records](https://www.uefa.com/uefachampionsleague/history/records/).\n- **World Cup Achievements**: At the 2018 FIFA World Cup, Mbappé scored four goals, including one in the final against Croatia, helping France secure their second title. He was awarded the Best Young Player of the tournament [FIFA 2018](https://www.fifa.com/worldcup/news/mbappe-wins-adidas-golden-boot).\n- **Contract Speculations**: Mbappé's future at PSG has been a topic of intense speculation, with rumors linking him to clubs like Real Madrid. In 2022, he signed a contract extension with PSG until 2025, reportedly making him one of the highest-paid athletes in the world [CNN](https://edition.cnn.com/2022/05/21/football/kylian-mbappe-psg-contract-extension-spt-intl/index.html).\n\n## Related Topics\n\n- **Paris Saint-Germain (PSG)**: Mbappé's club since 2017, known for its dominance in French football and high-profile signings like Lionel Messi and Neymar.\n- **French National Team**: Mbappé has been a cornerstone of Les Bleus, contributing to their success in international competitions.\n- **FIFA World Cup**: His standout performances in 2018 and 2022 have cemented his status as a global star.\n- **UEFA Champions League**: Mbappé's pursuit of this elusive title with PSG remains a significant storyline in his career.\n\n## References\n\n- [FIFA Profile](https://www.fifa.com/en/player/kylian-mbappe)\n- [The Guardian - Kylian Mbappé Profile](https://www.theguardian.com/football/2018/dec/08/kylian-mbappe-paris-saint-germain-france-world-cup)\n- [UEFA - Mbappé Monaco Breakthrough](https://www.uefa.com/uefachampionsleague/news/0253-0d7f9e9b9c1a-9b7f9e9b9c1a-1000--kylian-mbappe-monaco-breakthrough/)\n- [BBC Sport - Mbappé Transfer to PSG](https://www.bbc.com/sport/football/41219948)\n- [ESPN - Mbappé Breaks PSG Record](https://www.espn.com/soccer/story/_/id/35794485/kylian-mbappe-breaks-psg-goal-scoring-record)\n- [FIFA World Cup 2022 - Golden Boot](https://www.fifa.com/fifaplus/en/articles/kylian-mbappe-golden-boot-qatar-2022)\n- [Forbes - Mbappé Philanthropy](https://www.forbes.com/sites/robertkidd/2022/12/20/kylian-mbappe-the-worlds-highest-paid-soccer-player/)\n- [Sky Sports - Mbappé Speed Stats](https://www.skysports.com/football/news/11095/11888671/kylian-mbappe-hits-22-4mph-in-psg-win-over-monaco)\n- [UEFA Champions League Records](https://www.uefa.com/uefachampionsleague/history/records/)\n- [FIFA 2018 World Cup - Best Young Player](https://www.fifa.com/worldcup/news/mbappe-wins-adidas-golden-boot)\n- [CNN - Mbappé Contract Extension](https://edition.cnn.com/2022/05/21/football/kylian-mbappe-psg-contract-extension-spt-intl/index.html)",
  "external_references": [],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:15:45.561214",
  "elapsed_ms": 98500
}