{
  "topic": "Kyoto Protocol",
  "title": "Kyoto Protocol",
  "slug": "kyoto-protocol",
  "grokipedia_slug": "Kyoto_Protocol",
  "grokipedia_url": "https://grokipedia.com/page/Kyoto_Protocol",
  "source": "grokipedia",
  "content": "# Kyoto Protocol\n\nThe Kyoto Protocol is an international treaty linked to the United Nations Framework Convention on Climate Change, adopted on 11 December 1997 in Kyoto, Japan, which requires Annex I parties—primarily developed nations—to meet quantified emission limitation and reduction obligations for six greenhouse gases during specified commitment periods, aiming to stabilize atmospheric concentrations at levels preventing dangerous anthropogenic interference with the climate system. The protocol entered into force on 16 February 2005 following ratification by at least 55 parties accounting for 55% of 1990 emissions, with Russia’s 2004 approval providing the necessary threshold, and ultimately garnered 192 parties though notable absences included the United States, which signed but did not ratify, and Canada, which withdrew in 2011. For the first commitment period from 2008 to 2012, Annex I parties collectively committed to reducing emissions by an average of about 5% below 1990 levels, with individual targets varying—such as an 8% reduction for the European Union and 7% for the United States if ratified—implemented through flexible mechanisms including international emissions trading, the Clean Development Mechanism allowing credits from developing country projects, and Joint Implementation among Annex I parties. A second commitment period under the Doha Amendment from 2013 to 2020 extended targets for participating parties, though with reduced participation and no legally binding force due to insufficient ratifications, highlighting the protocol's challenges in sustaining global buy-in. While some Annex I parties achieved targets through mechanisms and economic shifts like the post-Soviet collapse in Eastern Europe, empirical assessments indicate the protocol exerted limited influence on global emissions trajectories, as non-Annex I nations like China—exempt from binding targets—saw rapid emission growth, resulting in net increases in worldwide greenhouse gases during and after commitment periods and underscoring causal limitations from incomplete coverage of major emitters. The protocol's emphasis on differentiated responsibilities based on historical emissions reflected common but differentiated responsibilities principle, yet critics noted economic burdens on compliant nations without commensurate global mitigation, paving the way for successor agreements like the Paris Accord that incorporate broader participation albeit with non-binding nationally determined contributions.\n\n## Historical Development\n\n### Negotiation and Adoption\n\nThe negotiations for the Kyoto Protocol originated from the United Nations Framework Convention on Climate Change (UNFCCC), which entered into force on March 21, 1994. At the first Conference of the Parties (COP 1) in Berlin from March 28 to April 7, 1995, parties adopted the Berlin Mandate, initiating a process to negotiate stronger, quantified emission limitation and reduction objectives within specified time-frames for Annex I Parties (developed countries) for the period beyond 2000. These negotiations built on the UNFCCC's framework, focusing on commitments for industrialized nations due to their historical responsibility for greenhouse gas emissions.\n\nSubsequent sessions, including COP 2 in Geneva in July 1996, advanced preparatory work, emphasizing the need for binding targets and timetables. The core negotiations culminated at COP 3, held at the Kyoto International Conference Center in Kyoto, Japan, from December 1 to 11, 1997. After two and a half years of intensive discussions involving over 150 countries, the Kyoto Protocol was adopted by consensus on December 11, 1997. The adoption marked the first international treaty to establish legally binding emission reduction targets for developed countries, aiming for an average reduction of at least 5 percent below 1990 levels during the 2008-2012 commitment period.\n\nThe protocol's text was finalized amid compromises on flexibility mechanisms, such as emissions trading and the Clean Development Mechanism, to facilitate acceptance by Annex I Parties. It was opened for signature on March 16, 1998, in New York, with initial signatories including the United States under President Bill Clinton, though subsequent ratification faced domestic political hurdles. The negotiation process highlighted divisions between developed and developing countries, with the latter insisting on the principle of common but differentiated responsibilities, exempting them from binding targets. Official records from the UNFCCC document the protocol's evolution from initial party proposals through drafting sessions, underscoring the technical and diplomatic challenges in achieving agreement.\n\n### Ratification and Entry into Force\n\nThe Kyoto Protocol was opened for signature on March 16, 1998, in New York, and closed on March 15, 1999, after which it could be acceded to by non-signatories. Article 25 stipulated that the Protocol would enter into force on the ninetieth day following ratification, acceptance, approval, or accession by not less than 55 parties to the United Nations Framework Convention on Climate Change (UNFCCC), provided that among these parties, those included in Annex I accounted for at least 55 percent of the total carbon dioxide emissions for 1990 from all Annex I parties. This dual threshold created significant hurdles, as Annex I parties—primarily industrialized nations—held the majority of historical emissions responsibility under the Protocol's framework.\n\nRatification progressed unevenly, with early adopters including many European Union members and Japan by the early 2000s. Canada deposited its instrument of ratification on December 17, 2002. The United States, which signed the Protocol on November 12, 1998, did not ratify it; the Senate's Byrd-Hagel Resolution in July 1997 had required any climate agreement to include binding targets for developing countries and not disadvantage the U.S. economy, conditions unmet by the Protocol. Without U.S. participation—representing about 36 percent of 1990 Annex I emissions—the threshold hinged on other major emitters, particularly Russia, which accounted for approximately 17 percent.\n\nRussia's State Duma approved ratification on October 22, 2004, with the instrument deposited on November 18, 2004, fulfilling the emissions criterion as prior ratifications by Annex I parties reached about 51 percent. Consequently, the Protocol entered into force on February 16, 2005, binding 141 parties at that point, including 35 Annex I countries with quantified emission limitation commitments for the 2008-2012 period. This activation imposed legal obligations on ratifying Annex I parties to pursue their targets, though non-ratification by the U.S. and initial hesitancy from nations like Australia—until its ratification in December 2007—limited the agreement's global coverage of emissions sources.\n\n### Key Withdrawals and Non-Ratifications\n\nThe United States signed the Kyoto Protocol on November 12, 1998, but never ratified it, preventing it from becoming legally binding domestically. In advance of the Kyoto negotiations, the U.S. Senate unanimously passed the Byrd-Hagel Resolution on July 25, 1997, declaring it would not ratify any protocol that exempted developing countries from binding emissions targets or caused serious harm to the U.S. economy. The Clinton administration signed the treaty but did not submit it to the Senate for ratification, citing the need for revisions to address Senate concerns over asymmetric obligations for major emitters like China and India. Upon taking office in 2001, President George W. Bush rejected the protocol outright, arguing it unfairly disadvantaged the U.S. economy while failing to mandate reductions from large developing-nation emitters, rendering it ineffective for global emissions control. This non-ratification excluded the U.S., responsible for about 36% of Annex I emissions in 1990, from the protocol's quantified targets, significantly undermining its potential scope.\n\nCanada ratified the Kyoto Protocol on December 17, 2002, committing to reduce emissions to 6% below 1990 levels by 2008-2012, but formally withdrew effective December 15, 2012, becoming the only country to do so. The Conservative government under Prime Minister Stephen Harper notified the United Nations of its intent to withdraw on December 12, 2011, just before the deadline that would have imposed steeper penalties under the second commitment period. By 2009, Canadian emissions had risen over 30% above 1990 levels, far exceeding the target and exposing the country to potential fines of up to CAD 14 billion through international trading mechanisms. Officials cited the protocol's structural flaws, including non-binding commitments for major emitters like China (which surpassed U.S. emissions post-ratification) and the impracticality of meeting targets without economic disruption, as rendering continued participation futile. Withdrawal avoided enforcement under Article 18 penalties and allowed pursuit of domestic policies like sector-by-sector regulations, though it drew criticism from environmental groups for abandoning multilateral obligations.\n\nOther Annex I countries, such as Australia, initially delayed ratification—ratifying only on December 3, 2007, after a change in government—but ultimately participated in the first commitment period without withdrawing. Japan, Russia, and New Zealand remained parties but declined quantified targets for the 2013-2020 Doha Amendment period, citing insufficient global coverage and economic burdens, though this did not constitute full withdrawal from the original protocol. Non-Annex I developing countries faced no emissions caps, leading to near-universal ratification among them, but several small states like Andorra and Monaco acceded late or not at all during the initial phases, though their emissions were negligible. These limited withdrawals and holdouts highlighted the protocol's challenges in securing buy-in from high-emission economies essential for meaningful global impact.\n\n## Objectives and Core Principles\n\n### Emission Reduction Targets\n\nThe Kyoto Protocol mandated quantified emission limitation and reduction commitments (QELRCs) for 37 Annex I Parties and the European Union during the first commitment period from 2008 to 2012, targeting a weighted average reduction of 5.2 percent in aggregate anthropogenic emissions of six greenhouse gases—carbon dioxide (CO₂), methane (CH₄), nitrous oxide (N₂O), hydrofluorocarbons (HFCs), perfluorocarbons (PFCs), and sulphur hexafluoride (SF₆)—below 1990 levels. These targets were differentiated according to national circumstances, with base years generally set at 1990, though some economies in transition could use multi-year averages from 1985–1990 for certain gases.\n\nIndividual targets varied, allowing some Parties like Australia and Iceland limited increases while requiring steeper cuts from others such as the European Union. The following table summarizes key QELRCs:\n\n| Party/Group | Target (% change from base year) |\n|-------------|---------------------------------|\n| European Union-15 (and associated states: Bulgaria, Czech Republic, Estonia, Latvia, Liechtenstein, Lithuania, Monaco, Romania, Slovakia, Slovenia, Switzerland) | -8 |\n| United States | -7 |\n| Canada, Hungary, Japan, Poland | -6 |\n| Croatia | -5 |\n| New Zealand, Russian Federation, Ukraine | 0 |\n| Norway | +1 |\n| Australia | +8 |\n| Iceland | +10 |\n\nThe United States signed the Protocol in 1998 but did not ratify it, rendering its -7 percent target non-binding. The European Union's -8 percent target operated under a bubble mechanism, permitting internal redistribution among member states to achieve the collective goal.\n\nFor the second commitment period from 2013 to 2020, the Doha Amendment established new QELRCs for participating Parties, aiming for an aggregate emissions reduction of at least 18 percent below 1990 levels across the same basket of greenhouse gases. Participation was substantially reduced, with major emitters like Japan, Russia, and Canada opting out, limiting coverage to primarily European countries and a few others such as Australia and Belarus. Individual targets under the Amendment included -20 percent for the European Union and its member states, reflecting heightened ambition among adherents but underscoring the Protocol's diminishing global scope. The Amendment entered into force on December 31, 2020, after requisite ratifications.\n\n### Common but Differentiated Responsibilities\n\nThe principle of *common but differentiated responsibilities* (CBDR), as articulated in Article 3.1 of the United Nations Framework Convention on Climate Change (UNFCCC), stipulates that all parties share responsibility for addressing climate change but that obligations vary based on historical contributions to greenhouse gas emissions and respective capabilities, with developed countries expected to lead. This principle originated from the 1992 Rio Earth Summit, where negotiations balanced demands from developing nations for equity—citing industrialized countries' cumulative emissions since the Industrial Revolution, estimated at over 70% of historical CO2 from fossil fuels by 1990—against developed nations' offers of financial and technological support. In the Kyoto Protocol, adopted on December 11, 1997, CBDR manifested through the distinction between Annex I parties (primarily OECD members and economies in transition, numbering 36 with binding targets) and non-Annex I parties (developing countries, exempt from quantified reductions). Annex I countries committed to an average 5% reduction in emissions of six greenhouse gases below 1990 levels during the 2008–2012 period, reflecting their greater per capita emissions (e.g., U.S. at 20 metric tons CO2 equivalent per capita in 1990 versus global average of 4 tons) and economic capacity.\n\nUnder CBDR, non-Annex I parties faced no emission caps, only softer obligations to formulate national programs for sustainable development and report inventories, justified by arguments that poverty alleviation and industrialization in nations like China and India necessitated emission growth to achieve parity with developed states' historical per capita accumulations (e.g., developing countries' share of cumulative CO2 emissions remained below 30% through 2000). This differentiation aimed to promote equity, with developed parties providing new and additional financial resources via mechanisms like the Global Environment Facility, totaling commitments of $2.5 billion annually by 2000 for adaptation and mitigation in developing countries. However, implementation revealed tensions: U.S. ratification stalled in 1997 Senate rejection (95–0 vote) partly over CBDR's perceived unfairness, as it excluded major future emitters like China, whose emissions rose from 2.4 billion tons CO2 in 2000 to over 9 billion by 2019, surpassing the U.S. as the largest annual emitter by 2006. \n\nEmpirical outcomes underscore CBDR's causal limitations in curbing global emissions: Annex I parties achieved a collective 22% reduction below 1990 levels by 2012 (driven by EU declines and Eastern European economic transitions), yet non-Annex I emissions surged 140% from 1990 to 2009, accounting for nearly all net global increase and rendering Protocol targets insufficient against rising atmospheric concentrations (CO2 from 355 ppm in 1990 to 391 ppm by 2012). Critics, including analyses from legal and economic perspectives, argue CBDR entrenched inequities by freezing differentiation despite shifting emission profiles—China's output equaled the EU-U.S. combined by 2010—failing to adapt to capabilities like India's $3 trillion GDP by 2020 or Brazil's technological advancements, thus prioritizing historical accounting over current causal drivers of emissions growth.  Proponents counter that CBDR enabled broader participation, fostering voluntary actions in non-Annex I (e.g., China's renewable investments), but UNFCCC data confirms global emissions continued upward, with non-Annex I contributions exceeding 50% of totals by 2005, highlighting the principle's static equity framework amid dynamic economic realities.\n\n## Provisions and Mechanisms\n\n### Commitment Periods\n\nThe first commitment period of the Kyoto Protocol spanned from 1 January 2008 to 31 December 2012, during which Annex I Parties—primarily industrialized nations—were obligated to achieve quantified emission limitation and reduction objectives for six greenhouse gases: carbon dioxide, methane, nitrous oxide, hydrofluorocarbons, perfluorocarbons, and sulphur hexafluoride. These targets, specified in Annex B of the Protocol, required an overall average reduction of 5% below 1990 baseline levels across participating parties, with individual commitments varying by country: for instance, the European Union targeted an 8% reduction, Japan 6%, and Australia permitted an 8% increase. The United States, despite signing, did not ratify and thus faced no binding obligations, while Canada later withdrew in 2011 prior to the period's end.\n\nCompliance was assessed based on average annual emissions over the five-year period, allowing flexibility through mechanisms like emissions trading, joint implementation, and the Clean Development Mechanism to meet targets cost-effectively. Assigned Amount Units (AAUs) were allocated to each Annex I Party equivalent to their permitted emissions, with penalties for shortfalls including a 30% surplus in the subsequent period and suspension of eligibility for flexibility mechanisms. By the period's conclusion, aggregate emissions from Annex I Parties with targets declined by approximately 12.5% relative to 1990 levels, attributed in part to economic restructuring in Eastern Europe and renewable energy shifts in Western Europe, though global emissions rose due to growth in non-Annex I nations.\n\nThe Doha Amendment, adopted at COP 18 on 8 December 2012, established a second commitment period from 1 January 2013 to 31 December 2020, aiming to extend binding targets amid stalled multilateral progress. Revised Annex B targets sought an aggregate 18% reduction below 1990 levels for participating parties, with the European Union committing to a 20% cut and other nations like Australia and Norway setting similar or deeper reductions; however, major emitters such as Japan, Russia, and New Zealand declined new quantified targets, and Canada, Japan, and Russia effectively opted out. Only 38 parties, representing roughly 15% of global emissions, ratified the amendment, which entered into force on 31 December 2020 after meeting the required acceptances. This limited participation underscored the Protocol's diminishing scope, paving the way for the Paris Agreement's broader, nationally determined contributions.\n\n### Flexibility Mechanisms\n\nThe flexibility mechanisms of the Kyoto Protocol, defined in Articles 6, 12, and 17, consist of international emissions trading (IET), joint implementation (JI), and the clean development mechanism (CDM). These project-based and market-oriented tools were intended to lower compliance costs for Annex I Parties by permitting the transfer of emission reduction credits across borders, supplementing domestic actions with international offsets. Adopted to address the economic inefficiencies of uniform domestic reductions, they aimed to harness market incentives for global emission mitigation while prioritizing cost-effectiveness over territorial limits.\n\nInternational emissions trading, governed by Article 17, enabled Annex I Parties to buy and sell Assigned Amount Units (AAUs), each equivalent to one metric ton of CO2-equivalent emissions. Parties exceeding their targets could sell surplus AAUs to those falling short, with trading limited to governments to prevent private speculation. This mechanism facilitated transfers of \"hot air\"—surplus allowances from post-Soviet economic collapses in countries like Russia and Ukraine, which accounted for much of the traded volume but yielded negligible additional reductions. By 2012, IET volumes reached approximately 2.5 billion tons of CO2-equivalent, though prices remained low (often under €5 per ton) due to oversupply, undermining incentives for genuine abatement.\n\nJoint implementation, under Article 6, allowed Annex I Parties to earn Emission Reduction Units (ERUs) from emission-reduction projects in other Annex I countries, particularly economies in transition with outdated infrastructure. Projects required verification of reductions beyond business-as-usual baselines by independent bodies, with ERUs convertible to AAUs for compliance. Operationalized via Track 1 (host-country approval) and Track 2 (international oversight) modalities post-Marrakesh Accords in 2001, JI generated over 900 million ERUs by 2012, concentrated in energy efficiency and methane capture in Eastern Europe. Critics noted additionality challenges, where baselines often overstated counterfactual emissions, potentially inflating credits without proportional environmental gains.\n\nThe clean development mechanism, outlined in Article 12, permitted Annex I Parties to invest in projects in non-Annex I countries, earning Certified Emission Reductions (CERs) for verified reductions contributing to sustainable development. Administered by the CDM Executive Board established in 2001, it emphasized host-country benefits like technology transfer, though empirical assessments indicate limited net developmental impacts amid governance issues and credit leakage. By the end of the first commitment period in 2012, the CDM registered over 7,800 projects, issuing 1.5 billion CERs, primarily from Chinese wind and HFC-23 destruction initiatives, offsetting about 1% of global emissions at costs averaging $5-10 per ton. However, audits revealed non-additional credits in up to 85% of some project types, such as industrial gas decomposition, where reductions would have occurred under baseline regulations, eroding the mechanism's integrity. Overall, while flexibility mechanisms enabled Annex I compliance at reduced costs—estimated at 20-50% savings versus domestic-only efforts—they contributed minimally to global emission trajectories, as non-Annex I growth outpaced offsets.\n\n### Compliance and Enforcement\n\nThe Kyoto Protocol established a Compliance Committee comprising a facilitative branch, tasked with providing advice and promoting compliance, and an enforcement branch, responsible for addressing cases of non-compliance with emission targets or reporting obligations. The enforcement branch could declare a party in non-compliance, suspend its eligibility to participate in flexibility mechanisms such as emissions trading or joint implementation, require the party to submit a compliance action plan within 30 days, and mandate compensation for excess emissions at a rate of 1.3 assigned amount units per tonne of shortfall, deducted from the subsequent commitment period. Decisions by the enforcement branch required a three-quarters majority vote, including approval from the party involved, to ensure procedural rigor.\n\nCompliance assessment relied on annual greenhouse gas inventories submitted by Annex I parties, reviewed through an expert in-country review process coordinated by the UNFCCC secretariat, with preliminary findings from the first commitment period (2008–2012) indicating that 24 of 36 Annex I parties with targets achieved their quantified emission limitation and reduction commitments, often aided by flexibility mechanisms, land-use changes, and economic restructuring in Eastern Europe. Non-compliance declarations were rare; for instance, the enforcement branch found Kazakhstan in violation of reporting guidelines under Articles 5 and 7 in 2013, prompting remedial actions, while Ukraine faced a determination in 2015 for failing to retire sufficient units to cover emissions, resulting in required adjustments for the second commitment period. No financial penalties were imposed, as the regime emphasized capacity-building over punitive measures, limiting its deterrent effect.\n\nEnforcement proved largely facilitative rather than coercive, with critics noting insufficient incentives for adherence, particularly given the absence of binding targets for major developing emitters and reliance on voluntary national registries prone to data discrepancies. The second commitment period under the 2012 Doha Amendment (2013–2020) mirrored this structure but saw diminished participation, with only 67 parties ratifying by 2020, undermining collective enforcement as key Annex I nations like Japan, Russia, and Canada opted out or withdrew. Empirical reviews highlight that while the mechanism fostered transparency in reporting, its effectiveness was constrained by weak sanctions and geopolitical opt-outs, contributing to overall protocol shortfalls in curbing global emissions trajectories.\n\n## Participation Categories\n\n### Annex I Countries\n\nAnnex I Parties under the United Nations Framework Convention on Climate Change (UNFCCC), which underpins the Kyoto Protocol, encompass industrialized countries that were members of the Organisation for Economic Co-operation and Development (OECD) in 1992, along with countries with economies in transition (EITs) from Central and Eastern Europe and the former Soviet Union. This classification, established at the 1992 Earth Summit in Rio de Janeiro, identifies these nations as historically responsible for the majority of cumulative anthropogenic greenhouse gas emissions due to their advanced economic development. The group totals 43 parties, including Australia, Austria, Belgium, Canada, the European Union member states, Japan, New Zealand, Norway, Russia, Switzerland, and the United States, among others.\n\nIn the Kyoto Protocol, adopted on December 11, 1997, and entering into force on February 16, 2005, Annex I Parties assumed the lead role in mitigating climate change through binding commitments. While all Annex I Parties must submit detailed annual inventories of anthropogenic greenhouse gas emissions from sources and removals by sinks, covering six key gases (carbon dioxide, methane, nitrous oxide, hydrofluorocarbons, perfluorocarbons, and sulfur hexafluoride), only those listed in Annex B—a subset excluding initial non-ratifiers like the United States, Australia (until 2007), and Belarus—faced legally enforceable quantified emission limitation and reduction objectives (QELROs) for the first commitment period from 2008 to 2012.  These targets required an aggregate reduction of at least 5% below 1990 baseline levels across Annex B Parties, with individual assignments varying: for instance, the European Union targeted an 8% cut, Japan 6%, Canada 6%, and Russia stabilization at 1990 levels.\n\nEconomies in transition within Annex I, such as Bulgaria, Poland, and Ukraine, received targets permitting stabilization or modest increases from 1990 levels to account for their post-Cold War economic restructuring, though actual emissions in many cases declined sharply—Russia's by approximately 30% by 2008—primarily due to the collapse of energy-intensive Soviet-era industries rather than targeted climate policies. Annex I Parties could employ flexibility mechanisms, including emissions trading, joint implementation, and the clean development mechanism, to meet targets cost-effectively, though compliance was monitored through a rigorous review process under the Protocol's enforcement branch, with potential penalties of a 30% surplus emissions penalty for shortfalls in subsequent periods. Unlike non-Annex I developing countries, which faced no binding reduction mandates, Annex I status imposed differentiated responsibilities emphasizing historical emitters' obligation to pioneer emission controls while providing financial and technological support to less developed nations.\n\n### Non-Annex I Countries\n\nNon-Annex I parties to the Kyoto Protocol, primarily developing countries, faced no legally binding greenhouse gas emission reduction targets during the protocol's first commitment period from 2008 to 2012. This exemption reflected the framework's adherence to the principle of common but differentiated responsibilities, attributing primary historical responsibility for atmospheric greenhouse gas accumulation to industrialized nations listed in Annex I. Instead, these parties were required to submit periodic national communications detailing their greenhouse gas inventories, mitigation efforts, and adaptation needs, with reporting obligations less stringent than those for Annex I parties.\n\nThese countries played a central role in the protocol's Clean Development Mechanism (CDM), which permitted Annex I parties to fund emission-reduction projects in Non-Annex I territories to generate certified emission reductions (CERs) applicable toward their own targets. The CDM aimed to promote sustainable development in host countries through technology transfer, foreign investment, and capacity building, with over 7,800 registered projects by 2012 primarily in nations like China, India, and Brazil. However, empirical analyses indicate limited net technology transfer beyond equipment sales, with host countries often retaining project benefits while Annex I investors claimed credits, raising questions about additionality and long-term developmental impacts.\n\nDespite the absence of caps, emissions from Non-Annex I parties expanded rapidly amid economic industrialization and population growth. From 1990 to 2009, carbon dioxide emissions from fuel combustion in these countries more than doubled, contrasting with relative stagnation or declines in Annex I emissions post-1990 due to deindustrialization and efficiency gains. Global greenhouse gas emissions rose approximately 44% between 1997 and 2012, with Non-Annex I contributions—led by China's surge from 2.4 billion tonnes CO2 equivalent in 1990 to over 9 billion by 2012—overwhelming Annex I reductions and preventing net global progress. This disparity highlighted causal limitations in the protocol's design: unconstrained growth in emerging economies offset binding cuts elsewhere, as developing nations prioritized poverty alleviation and energy access over emission restraint.\n\n## Implementation Outcomes\n\n### Emission Reductions in Annex I Parties\n\nAnnex I parties that ratified the Kyoto Protocol and accepted binding targets under Annex B collectively reduced greenhouse gas emissions by an average of 12.5% below 1990 levels during the 2008-2012 commitment period, exceeding the protocol's 5% reduction goal. This outcome included significant contributions from flexibility mechanisms, which accounted for up to one-third of credited reductions through emissions trading, joint implementation projects, and certified emission reductions from the clean development mechanism.\n\nEmissions declines were uneven across parties. Economies in transition, including Russia and Ukraine, achieved reductions exceeding 40% from 1990 levels due to post-Soviet economic contraction and industrial decline predating the protocol's 2005 entry into force, creating surplus assigned amount units available for trading. In contrast, the European Union's member states reduced emissions by approximately 15-20% through policies like the EU Emissions Trading System and renewable energy directives, though per capita trends varied. Japan and Australia met targets primarily via mechanism credits, with domestic emissions rising slightly before adjustments.\n\nNon-ratifying Annex I parties like the United States increased emissions by 7% from 1990 to 2012, driven by economic growth and fossil fuel reliance, while Canada withdrew from the protocol in 2011 after emissions rose 25% above 1990 levels. Overall compliance relied on aggregating surpluses from low-emission parties to offset shortfalls elsewhere, highlighting the protocol's dependence on baseline economic shifts rather than uniform policy-driven cuts. By 2012, total emissions for committed parties stood well below assigned amounts, enabling carryover to the second period, though critics note these figures exclude consumption-based emissions and leakage to non-Annex I nations.\n\n### Global Emission Trends\n\nGlobal greenhouse gas emissions continued to rise following the adoption of the Kyoto Protocol in 1997, with energy-related CO2 emissions increasing from approximately 22 Gt in 1990 to 36.8 Gt in 2022, a growth of over 67%. This upward trajectory persisted despite the Protocol's binding targets for Annex I countries, as emissions in non-Annex I developing nations surged due to rapid industrialization and economic expansion, particularly in China and India. By 2023, global GHG emissions reached an estimated 51.8 GtCO2eq, reflecting a 1.2% increase from the previous year and underscoring the Protocol's limited influence on overall worldwide trends.\n\nEmissions from Annex I parties, which included most industrialized nations, showed relative stabilization or decline compared to 1990 baselines, aided by structural shifts such as the economic collapse of former Soviet states and efficiency improvements in Western Europe and Japan. Aggregate Annex I CO2 emissions from fuel combustion remained roughly flat or decreased modestly between 1990 and 2009, while non-Annex I emissions more than doubled in the same period, driven by coal-intensive growth in Asia. For the second commitment period (2013-2020), participating developed countries achieved an average annual reduction of 22% below 1990 levels, yet this was insufficient to offset the 72% rise in global fossil CO2 emissions since 1990.\n\nThe divergence highlights the Protocol's design limitations, as non-Annex I countries—exempt from quantitative targets under the principle of common but differentiated responsibilities—accounted for the majority of incremental emissions growth. China's CO2 emissions, for instance, expanded from about 2.5 Gt in 1990 to over 11 Gt by 2022, surpassing the combined output of all Annex I nations. Additionally, international trade facilitated \"emission transfers,\" with net flows from developing to developed countries rising from 0.4 GtCO2 in 1990 to 1.6 GtCO2 in 2008, as manufacturing relocated to lower-regulation jurisdictions. These trends indicate that while Kyoto prompted targeted reductions in committed parties, it failed to curb the global ascent fueled by unconstrained development in emerging economies.\n\n### Economic and Trade Impacts\n\nThe implementation of the Kyoto Protocol imposed compliance costs on Annex I parties, with economic models estimating GDP reductions ranging from 0.1% to over 1% annually during the first commitment period (2008–2012) without international trading, though flexibility mechanisms like emissions trading and joint implementation could mitigate losses by 20–25%.  For the United States, which did not ratify, hypothetical full compliance with unrestricted trading among Annex I countries was projected to cost approximately 0.9% of GDP under realistic assumptions. Empirical assessments post-ratification indicated that Annex I status correlated with slower economic growth, with non-Annex I countries capturing growth opportunities equivalent to about 7% of Annex I GDP (roughly USD 2,273 billion in foregone output) due to regulatory burdens on energy-intensive sectors.\n\nTrade distortions arose primarily from carbon leakage, where emission reductions in Annex I countries shifted production—and associated emissions—to non-committed developing economies without binding targets, such as China and India. Empirical analysis found that Kyoto commitments increased imported carbon emissions into ratifying countries by approximately 8%, as energy-intensive industries relocated abroad to exploit lower regulatory costs, exacerbating global emissions rather than curbing them. This leakage effect was amplified by the protocol's asymmetric design, excluding major emitters like China (responsible for rising shares of global CO2 from fuel combustion post-1990), leading to net trade imbalances in embodied carbon and reduced competitiveness for Annex I exporters in sectors like manufacturing and heavy industry. While clean development mechanism projects in non-Annex I countries generated certified emission reductions (over 1.9 billion CERs issued by 2012), they often subsidized inefficient projects with limited additionality, failing to fully offset leakage-driven output shifts.\n\nCost-benefit evaluations highlighted inefficiencies, with compliance expenditures in Europe (e.g., via the EU Emissions Trading System influenced by Kyoto) yielding marginal global emission cuts at high domestic prices—EUAs averaged €15–20 per ton in the protocol's early years—while non-participation by the U.S. and rapid industrialization in Asia diminished overall efficacy. Studies attributed minimal net economic benefits to the protocol, as avoided damages from reduced emissions (estimated at low social cost of carbon values, e.g., $5–10 per ton in early models) were outweighed by adaptation costs and foregone growth in regulated economies. Production shifts to non-Annex I regions not only undermined environmental goals but also strained trade balances, with Annex I imports of carbon-intensive goods rising disproportionately during 1990–2009.\n\n## Criticisms and Debates\n\n### Ineffectiveness and Global Failures\n\nThe Kyoto Protocol proved ineffective in curbing global greenhouse gas emissions, as worldwide CO2 emissions from fossil fuels increased from 22.7 billion metric tons in 1990 to 33.2 billion metric tons by 2012, a rise of approximately 46%. This growth occurred despite the protocol's aim to reduce Annex I countries' emissions by an average of 5% below 1990 levels during 2008-2012. Non-Annex I countries, unbound by reduction targets under the principle of common but differentiated responsibilities, drove much of the increase; for instance, China's CO2 emissions surged from 2.4 billion metric tons in 1990 to 9.2 billion metric tons in 2012, quadrupling in output as it industrialized rapidly without emission constraints. Emissions leakage exacerbated this, with carbon-intensive manufacturing shifting from regulated Annex I nations to unregulated developing economies, offsetting domestic reductions in places like the European Union.\n\nAnnex I parties as a group achieved emissions levels about 12.5% below 1990 by 2012 among ratifying nations, surpassing the collective target, but this masked varied compliance and underlying causes. Eastern European economies in transition contributed disproportionately to these declines due to post-Soviet industrial collapse rather than protocol-driven policies, while countries like Canada exceeded targets by 27% before withdrawing in 2011, citing economic burdens. The United States, responsible for 36% of Annex I emissions in 1990, never ratified the protocol, avoiding binding cuts and allowing its emissions to peak in 2007 before declining due to unrelated factors like shale gas expansion, thus diminishing the agreement's global leverage. Even optimistic analyses, such as one estimating a 7% reduction below business-as-usual for ratifiers, acknowledge the protocol's limited scope covered only about 15-20% of global emissions, rendering it insufficient for atmospheric stabilization.\n\nFundamentally, the protocol's design flaws—exempting major emerging emitters and relying on flexible mechanisms prone to low-quality offsets—failed to address causal drivers of emissions growth, such as rising global energy demand. Atmospheric CO2 concentrations climbed from 354 ppm in 1990 to 393 ppm by 2012, continuing unchecked and underscoring the absence of verifiable global impact. Critics, including economic analyses, argue that even full compliance by Annex I parties would have yielded negligible climatic benefits given non-participants' trajectories, highlighting the free-rider problem inherent in differentiated commitments. These shortcomings contributed to the protocol's legacy as a symbolic rather than substantive effort, paving the way for broader frameworks like the Paris Agreement.\n\n### Economic Costs and Burdens\n\nThe Kyoto Protocol's binding emission targets for Annex I countries imposed significant economic costs, primarily through higher energy prices, reduced industrial output, and forgone growth opportunities in carbon-intensive sectors. Compliance required substantial investments in abatement technologies, carbon capture, and offsets, with costs concentrated in developed economies while non-Annex I nations faced no such obligations, enabling emissions leakage to lower-cost producers like China and India. Economic models projected welfare losses equivalent to 0.1% to 0.6% of GDP annually for Annex I parties under permit trading scenarios, escalating without international flexibility mechanisms.\n\nIn the United States, which did not ratify the Protocol, prospective analyses estimated that meeting the 7% reduction from 1990 levels by 2008-2012 would have lowered real GDP by 0.5% to 1.2% below baseline in 2010, with real consumption declining 0.4% to 1.0%. Energy prices would have increased sharply: gasoline by 12 to 38 cents per gallon (in 1997 dollars), household natural gas by 13% to 42%, and electricity by 13% to 36%. Permit prices under Annex B trading were forecasted at $56 to $178 per metric ton of carbon equivalent, reflecting the marginal abatement cost for industrialized nations.\n\nEuropean Union member states, adhering via the EU Emissions Trading System linked to Kyoto mechanisms, experienced compliance costs through allowance auctions and penalties of €40 per excess tonne in the initial phase (2005-2007), burdening energy-intensive industries with higher operational expenses and contributing to offshoring in sectors like steel and chemicals. Japan's targets, requiring a 6% reduction, proved particularly onerous given its energy import dependence, with domestic abatement costs estimated 1.5 times higher than global averages due to limited low-cost options and pre-existing high fuel taxes.\n\nCanada's withdrawal on December 13, 2011, highlighted the Protocol's economic disincentives, as government assessments projected penalties up to CAD 14 billion for shortfall and severe constraints on oil sands development, which would have required emission cuts incompatible with resource extraction economics. Economist William Nordhaus calculated the Protocol's global welfare cost at $828 billion (1998 dollars), almost entirely shouldered by Annex I countries, as non-participants benefited from trade shifts without mitigation expenses.\n\nThese burdens exacerbated competitive disadvantages for Annex I economies, with studies indicating that without broad participation, the Protocol's design amplified domestic costs relative to negligible global temperature impacts, prompting debates over its net inefficiency.\n\n### Flaws in Design and Mechanisms\n\nThe Kyoto Protocol's design imposed legally binding emission reduction targets solely on Annex I countries, comprising mostly developed nations responsible for historical emissions, while exempting non-Annex I developing countries from any quantitative limits under the principle of \"common but differentiated responsibilities.\" This differentiation, intended to promote equity, permitted rapid emission growth in major developing economies such as China and India, which by 2012 accounted for over half of global CO2 emissions from fossil fuels, offsetting Annex I reductions and contributing to a 44% rise in worldwide emissions from 1997 levels. Empirical data indicate that non-Annex I emissions from fuel combustion surged from approximately 10 gigatons of CO2 in 1990 to over 20 gigatons by 2009, while Annex I emissions declined modestly, highlighting how the absence of universal coverage enabled carbon leakage and undermined global mitigation efficacy.\n\nFlexibility mechanisms, including emissions trading, Joint Implementation (JI), and the Clean Development Mechanism (CDM), were incorporated to lower compliance costs but introduced vulnerabilities to exploitation and ineffective reductions. Emissions trading allowed Annex I parties to purchase Assigned Amount Units (AAUs), including surplus \"hot air\" from post-Soviet economic collapses in Russia and Ukraine—estimated at over 5 billion tons of CO2-equivalent—enabling credits without corresponding atmospheric benefits. The CDM, facilitating offset projects in non-Annex I countries, faced persistent issues with verifying additionality, where projects might have proceeded absent credits, leading to over-issuance of Certified Emission Reductions (CERs); a 2014 analysis revealed that up to 85% of CDM projects in some sectors lacked genuine incremental abatement. JI similarly suffered from baseline manipulation and weak monitoring, exacerbating doubts about the mechanisms' integrity despite their role in achieving apparent compliance for several parties.\n\nEnforcement provisions under the Marrakesh Accords established a compliance committee with facilitative and enforcement branches, but lacked coercive penalties, relying instead on non-binding recommendations and a requirement for non-compliant parties to restore excess emissions plus a 30% penalty in the subsequent period—measures that proved unenforceable without trade suspensions or financial sanctions. This deficiency manifested when Canada withdrew from the Protocol in 2011 to evade accountability for exceeding its target by 43 million tons of CO2-equivalent in 2009, illustrating the protocol's inability to deter defection amid weak sovereign commitment. The enforcement branch's decisions, while innovative in international law, hinged on voluntary cooperation, rendering the system susceptible to strategic non-compliance by states prioritizing economic interests over treaty obligations.\n\nAdditional design shortcomings included narrow temporal scope—binding only for 2008–2012—and permissive accounting rules for land-use, land-use change, and forestry (LULUCF) activities, which allowed parties like Australia and Japan to offset up to 20–30% of targets through forestry credits of debatable permanence and verifiability. These elements collectively diluted the protocol's environmental stringency, as evidenced by Annex I parties meeting targets largely through mechanisms rather than domestic cuts, with genuine reductions averaging under 1% annually against a 5.2% aggregate goal.\n\n## Legacy and Post-Kyoto Developments\n\n### Doha Amendment and Second Period\n\nThe Doha Amendment to the Kyoto Protocol was adopted on 8 December 2012 at the eighteenth Conference of the Parties (COP 18) in Doha, Qatar, establishing a second commitment period under the protocol from 1 January 2013 to 31 December 2020. This extension aimed to strengthen quantified emission limitation and reduction commitments for Annex I Parties that accepted them, with a collective target to reduce greenhouse gas emissions by at least 18 percent below 1990 levels during this period. The amendment included provisions for carryover of unused units from the first period, new flexibility mechanisms like a revised clean development mechanism, and rules on surplus emission allowances to prevent flooding the market.\n\nOnly a subset of Annex I Parties committed to binding targets under the second period, primarily European Union member states, along with nations such as Australia, Belarus, Kazakhstan, Norway, Switzerland, and Ukraine—totaling about 37 countries. Major emitters including Japan, Russia, and New Zealand declined new targets, citing insufficient global participation, while Canada had withdrawn from the protocol entirely in December 2011. These commitments covered roughly 15 percent of global emissions, excluding large developing economies like China and India, which faced no binding obligations.\n\nRatification proceeded slowly; the amendment required acceptance by at least 144 parties to the Kyoto Protocol to enter into force, a threshold met on 1 October 2020 with the 144th acceptance, leading to its effective date of 31 December 2020. By October 2020, 147 states had accepted it, though the delayed entry meant the second period concluded before full legal binding for all participants.\n\nDuring the 2013–2020 period, participating parties collectively overachieved their targets, achieving emission reductions exceeding the pledged 18 percent below 1990 levels, attributed to factors including economic downturns in Europe, renewable energy expansions, and efficiency improvements. However, global emissions continued to rise, driven by non-participating nations, underscoring the amendment's limited scope and inability to enforce reductions from major emitters outside Annex I. The Doha Amendment's framework informed subsequent negotiations but highlighted design flaws, such as reliance on voluntary commitments and exclusion of developing economies, paving the way for the broader, nationally determined contributions under the 2015 Paris Agreement.\n\n### Transition to Paris Agreement\n\nThe Kyoto Protocol's first commitment period concluded on December 31, 2012, after which its effectiveness waned due to limited participation in the subsequent Doha Amendment, ratified by only a subset of parties and facing non-participation from major economies like Japan, Russia, and Canada, alongside the United States' longstanding refusal to ratify the original protocol. This shortfall highlighted the protocol's structural constraints, including binding emission targets confined to Annex I developed countries, which exempted rapidly industrializing nations such as China and India—responsible for surging global emissions during the 2000s—prompting UNFCCC negotiations to seek a more inclusive framework.\n\nPost-2012 discussions under the UNFCCC intensified after the 2009 Copenhagen Accord's failure to establish new binding targets, leading to incremental progress at subsequent COP meetings: the 2010 Cancun Agreements formalized voluntary pledges, while the 2011 Durban Platform (COP17) launched the Ad Hoc Working Group for the Durban Platform for Enhanced Action (ADP), mandating a protocol or legal instrument applicable to all parties by 2015. These steps addressed Kyoto's dichotomous developed-developing divide, shifting toward differentiated responsibilities with universal engagement to reflect evolving emission profiles, where non-Annex I countries overtook Annex I in total output by the early 2000s.\n\nThe Paris Agreement emerged from this trajectory, adopted on December 12, 2015, at COP21 in Paris by 196 parties, and entering into force on November 4, 2016, after ratification by sufficient parties including China and the United States. Unlike Kyoto's top-down, legally binding reduction targets for developed nations, Paris introduced a bottom-up approach requiring all parties to submit nationally determined contributions (NDCs) every five years, with provisions for ratcheting up ambition, transparency mechanisms, and a collective goal to limit warming to well below 2°C above pre-industrial levels while pursuing 1.5°C. This transition effectively superseded Kyoto in practice, retaining elements like flexible mechanisms (e.g., emissions trading) while broadening participation to cover over 190 countries, though critics note the voluntary nature reduced enforceability compared to Kyoto's penalties for Annex I noncompliance.\n\nThe shift reflected causal recognition that Kyoto's exemptions failed to curb global emissions, which rose 60% from 1990 to 2012 despite protocol efforts, necessitating a regime accommodating economic realities in emerging markets while pressuring all major emitters. Ongoing UNFCCC processes under Paris, including global stocktakes starting in 2023, continue to build on this evolution, with the protocol's legacy influencing adaptation and finance provisions but yielding to Paris's emphasis on iterative, nationally driven action.",
  "external_references": [
    {
      "text": "The Kyoto Protocol",
      "url": "https://unfccc.int/process-and-meetings/the-kyoto-protocol",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Kpeng.pdf",
      "url": "https://unfccc.int/resource/docs/convkp/kpeng.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Status Of Ratification",
      "url": "https://unfccc.int/process/the-kyoto-protocol/status-of-ratification",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Kyoto Protocol Targets For The First Commitment Period",
      "url": "https://unfccc.int/process-and-meetings/the-kyoto-protocol/what-is-the-kyoto-protocol/kyoto-protocol-targets-for-the-first-commitment-period",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "The Clean Development Mechanism",
      "url": "https://unfccc.int/process-and-meetings/the-kyoto-protocol/mechanisms-under-the-kyoto-protocol/the-clean-development-mechanism",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Pmc7373286",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7373286/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "273916274 Did The Kyoto Protocol Fail An Evaluation Of The Effect Of The Kyoto Protocol On Co2 Emissions",
      "url": "https://www.researchgate.net/publication/273916274_Did_the_Kyoto_Protocol_fail_An_evaluation_of_the_effect_of_the_Kyoto_Protocol_on_CO2_emissions",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Polp.12105",
      "url": "https://onlinelibrary.wiley.com/doi/pdf/10.1111/polp.12105",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "History Of The Convention",
      "url": "https://unfccc.int/process/the-convention/history-of-the-convention",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Guideconvkp P.pdf",
      "url": "https://unfccc.int/sites/default/files/guideconvkp-p.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Cop 3",
      "url": "https://unfccc.int/event/cop-3",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Viewdetails.aspx",
      "url": "https://treaties.un.org/pages/viewdetails.aspx?src=treaty\\u0026mtdsg_no=xxvii-7-a\\u0026chapter=27\\u0026clang=_en",
      "domain": "treaties.un.org",
      "type": "citation"
    },
    {
      "text": "Tp0200.htm",
      "url": "https://unfccc.int/resource/docs/tp/tp0200.htm",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Rl30692.html",
      "url": "https://www.everycrsreport.com/reports/RL30692.html",
      "domain": "everycrsreport.com",
      "type": "citation"
    },
    {
      "text": "Dn3188 Canada Ratifies Kyoto Protocol",
      "url": "https://www.newscientist.com/article/dn3188-canada-ratifies-kyoto-protocol/",
      "domain": "newscientist.com",
      "type": "citation"
    },
    {
      "text": "Kyoto Protocol Enters Force",
      "url": "https://www.asil.org/insights/volume/9/issue/8/kyoto-protocol-enters-force",
      "domain": "asil.org",
      "type": "citation"
    },
    {
      "text": "R46204",
      "url": "https://www.congress.gov/crs-product/R46204",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Fs Us Sign Kyoto 981112.html",
      "url": "https://1997-2001.state.gov/global/global_issues/climate/fs-us_sign_kyoto_981112.html",
      "domain": "1997-2001.state.gov",
      "type": "citation"
    },
    {
      "text": "Hovi.2012.whytheunitedstatesdidnotbecomeapartytothekyotoprotocol.ejir.pdf",
      "url": "https://www.pik-potsdam.de/members/dsprinz/publications/Hovi.2012.WhytheUnitedStatesDidNotBecomeaPartytotheKyotoProtocol.EJIR.pdf",
      "domain": "pik-potsdam.de",
      "type": "citation"
    },
    {
      "text": "Cc Eb 25 2014 2 Canada Withdrawal From Kp.pdf",
      "url": "https://unfccc.int/files/kyoto_protocol/compliance/enforcement_branch/application/pdf/cc-eb-25-2014-2_canada_withdrawal_from_kp.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "World Us Canada 16151310",
      "url": "https://www.bbc.com/news/world-us-canada-16151310",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Canada Pulls Out Of Kyoto Protocol 1.999072",
      "url": "https://www.cbc.ca/news/politics/canada-pulls-out-of-kyoto-protocol-1.999072",
      "domain": "cbc.ca",
      "type": "citation"
    },
    {
      "text": "Canada Pulls Out Kyoto Protocol",
      "url": "https://www.theguardian.com/environment/2011/dec/13/canada-pulls-out-kyoto-protocol",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Canada Withdraws From Kyoto Protocol",
      "url": "https://sdg.iisd.org/news/canada-withdraws-from-kyoto-protocol/",
      "domain": "sdg.iisd.org",
      "type": "citation"
    },
    {
      "text": "Success Or Failure The Kyoto Protocols Troubled Legacy",
      "url": "https://www.climateforesight.eu/articles/success-or-failure-the-kyoto-protocols-troubled-legacy/",
      "domain": "climateforesight.eu",
      "type": "citation"
    },
    {
      "text": "03 Unfccc.pdf",
      "url": "https://unfccc.int/files/adaptation/napas/application/pdf/03_unfccc.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Common Differentiated Responsibilities Cbdr",
      "url": "https://dgap.org/en/research/glossary/climate-foreign-policy/common-differentiated-responsibilities-cbdr",
      "domain": "dgap.org",
      "type": "citation"
    },
    {
      "text": "200",
      "url": "https://www.e-education.psu.edu/geog30/node/200",
      "domain": "e-education.psu.edu",
      "type": "citation"
    },
    {
      "text": "S0308597x20309647",
      "url": "https://www.sciencedirect.com/science/article/pii/S0308597X20309647",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.law.uw.edu/cgi/viewcontent.cgi?article=1135\\u0026context=wjelp",
      "domain": "digitalcommons.law.uw.edu",
      "type": "citation"
    },
    {
      "text": "162",
      "url": "https://international.appihi.or.id/index.php/IJSL/article/download/51/162",
      "domain": "international.appihi.or.id",
      "type": "citation"
    },
    {
      "text": "Common But Differentiated Responsibilities Inequitable And Ineffective",
      "url": "https://blog.lselawreview.com/2021/10/07/common-but-differentiated-responsibilities-inequitable-and-ineffective/",
      "domain": "blog.lselawreview.com",
      "type": "citation"
    },
    {
      "text": "7 1 49 840.pdf",
      "url": "https://journalofpoliticalscience.com/uploads/archives/7-1-49-840.pdf",
      "domain": "journalofpoliticalscience.com",
      "type": "citation"
    },
    {
      "text": "Cbdr Principle Climate Negotiations Deadend Or New Start",
      "url": "https://www.iddri.org/en/publications-and-events/blog-post/cbdr-principle-climate-negotiations-deadend-or-new-start",
      "domain": "iddri.org",
      "type": "citation"
    },
    {
      "text": "Reassessing Common But Differentiated Responsibilities And Respective Capabilities",
      "url": "https://voelkerrechtsblog.org/reassessing-common-but-differentiated-responsibilities-and-respective-capabilities/",
      "domain": "voelkerrechtsblog.org",
      "type": "citation"
    },
    {
      "text": "Attachment Sg Letter Doha Amendment.pdf",
      "url": "https://unfccc.int/files/kyoto_protocol/doha_amendment/application/pdf/attachment_sg_letter_doha_amendment.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Viewdetails.aspx",
      "url": "https://treaties.un.org/pages/viewdetails.aspx?src=treaty\\u0026mtdsg_no=xxvii-7-c\\u0026chapter=27\\u0026clang=_en",
      "domain": "treaties.un.org",
      "type": "citation"
    },
    {
      "text": "Doha Amendment Enters Into Force",
      "url": "https://sdg.iisd.org/news/doha-amendment-enters-into-force/",
      "domain": "sdg.iisd.org",
      "type": "citation"
    },
    {
      "text": "Kyoto Protocol Commitments And Units Post 2020",
      "url": "https://legalresponse.org/legaladvice/kyoto-protocol-commitments-and-units-post-2020/",
      "domain": "legalresponse.org",
      "type": "citation"
    },
    {
      "text": "Mechanisms",
      "url": "https://unfccc.int/process/the-kyoto-protocol/mechanisms",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Cdm Kpm.pdf",
      "url": "https://cdm.unfccc.int/about/cdm_kpm.pdf",
      "domain": "cdm.unfccc.int",
      "type": "citation"
    },
    {
      "text": "Mechanisms.pdf",
      "url": "https://unfccc.int/resource/docs/publications/mechanisms.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Kyoto Protocol",
      "url": "https://www.emissionsauthority.nl/topics/climate-policy/kyoto-protocol",
      "domain": "emissionsauthority.nl",
      "type": "citation"
    },
    {
      "text": "Jicdm Final Conclusions En.pdf",
      "url": "https://climate.ec.europa.eu/system/files/2016-11/jicdm_final_conclusions_en.pdf",
      "domain": "climate.ec.europa.eu",
      "type": "citation"
    },
    {
      "text": "Kyoto Mechanisms.pdf",
      "url": "https://www.c2es.org/wp-content/uploads/2000/09/kyoto_mechanisms.pdf",
      "domain": "c2es.org",
      "type": "citation"
    },
    {
      "text": "S0301421599000944",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0301421599000944",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "332338158 The Kyoto Protocol Empirical Evidence Of A Hidden Success",
      "url": "https://www.researchgate.net/publication/332338158_The_Kyoto_protocol_Empirical_evidence_of_a_hidden_success",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "S030142150000077x",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S030142150000077X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Compliance Committee Cc",
      "url": "https://unfccc.int/Compliance-Committee-CC",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "B 9781783477616 I 20.pdf",
      "url": "https://www.elgaronline.com/display/book/9781785369520/b-9781783477616-I_20.pdf",
      "domain": "elgaronline.com",
      "type": "citation"
    },
    {
      "text": "Non Compliance Procedure Of Kazakhstan Under The Kyoto Protocol 165c",
      "url": "https://www.climatecasechart.com/document/non-compliance-procedure-of-kazakhstan-under-the-kyoto-protocol_165c",
      "domain": "climatecasechart.com",
      "type": "citation"
    },
    {
      "text": "Non Compliance Procedure Of Ukraine Under The Kyoto Protocol Ii 9b9d",
      "url": "https://www.climatecasechart.com/document/non-compliance-procedure-of-ukraine-under-the-kyoto-protocol-ii_9b9d",
      "domain": "climatecasechart.com",
      "type": "citation"
    },
    {
      "text": "The Treaty Compliance Challenge Enforcement Under The Kyoto Protocol",
      "url": "https://ghginstitute.org/2010/02/10/the-treaty-compliance-challenge-enforcement-under-the-kyoto-protocol/",
      "domain": "ghginstitute.org",
      "type": "citation"
    },
    {
      "text": "14693062.2012.692206",
      "url": "https://www.tandfonline.com/doi/abs/10.1080/14693062.2012.692206",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "S030142150300154x",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S030142150300154X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Parties Observers",
      "url": "https://unfccc.int/parties-observers",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Eesis United Nations Framework Convention On Climate Change Glossary Of Terms",
      "url": "https://www.eesi.org/articles/view/eesis-united-nations-framework-convention-on-climate-change-glossary-of-terms",
      "domain": "eesi.org",
      "type": "citation"
    },
    {
      "text": "Annex12",
      "url": "https://www.environbusiness.com/cchangemain/annex12",
      "domain": "environbusiness.com",
      "type": "citation"
    },
    {
      "text": "Ttrep10.pdf",
      "url": "https://cdm.unfccc.int/Reference/Reports/TTreport/TTrep10.pdf",
      "domain": "cdm.unfccc.int",
      "type": "citation"
    },
    {
      "text": "Ghg Booklet 06.pdf",
      "url": "https://unfccc.int/files/essential_background/background_publications_htmlpdf/application/pdf/ghg_booklet_06.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Get Attachment",
      "url": "https://seors.unfccc.int/applications/seors/attachments/get_attachment?code=KPE7FAH5YPDAXMDD7FBCCUMLCBASK2P2",
      "domain": "seors.unfccc.int",
      "type": "citation"
    },
    {
      "text": "The Kyoto Protocol Climate Change Success Or Global Warming Failure",
      "url": "https://circularecology.com/news/the-kyoto-protocol-climate-change-success-or-global-warming-failure",
      "domain": "circularecology.com",
      "type": "citation"
    },
    {
      "text": "Climate Change Mitigation",
      "url": "https://www.eea.europa.eu/soer/2015/countries-comparison/climate-change-mitigation",
      "domain": "eea.europa.eu",
      "type": "citation"
    },
    {
      "text": "S0095069618300391",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0095069618300391",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Co2 Emissions In 2022",
      "url": "https://www.iea.org/reports/co2-emissions-in-2022",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "Report 2024",
      "url": "https://edgar.jrc.ec.europa.eu/report_2024",
      "domain": "edgar.jrc.ec.europa.eu",
      "type": "citation"
    },
    {
      "text": "Global Greenhouse Gas Emissions 1990 2022 And Preliminary 2023 Estimates",
      "url": "https://rhg.com/research/global-greenhouse-gas-emissions-1990-2022-and-preliminary-2023-estimates/",
      "domain": "rhg.com",
      "type": "citation"
    },
    {
      "text": "Emission Reductions Under The Kyoto Protocol Pave The Way For Increased Ambition",
      "url": "https://unfccc.int/news/emission-reductions-under-the-kyoto-protocol-pave-the-way-for-increased-ambition",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Pmc3102371",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3102371/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1062",
      "url": "https://frankel.scholars.harvard.edu/file_url/1062",
      "domain": "frankel.scholars.harvard.edu",
      "type": "citation"
    },
    {
      "text": "6703.pdf",
      "url": "https://www.almendron.com/tribuna/wp-content/uploads/2017/07/6703.pdf",
      "domain": "almendron.com",
      "type": "citation"
    },
    {
      "text": "S10290 019 00350 5",
      "url": "https://link.springer.com/article/10.1007/s10290-019-00350-5",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "S0095069625001044",
      "url": "https://www.sciencedirect.com/science/article/pii/S0095069625001044",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Res Display.asp",
      "url": "https://www.gtap.agecon.purdue.edu/resources/res_display.asp?RecordID=605",
      "domain": "gtap.agecon.purdue.edu",
      "type": "citation"
    },
    {
      "text": "46e8fdbb F46c 5b5e A8fd 5fa9915b0755",
      "url": "https://openknowledge.worldbank.org/entities/publication/46e8fdbb-f46c-5b5e-a8fd-5fa9915b0755",
      "domain": "openknowledge.worldbank.org",
      "type": "citation"
    },
    {
      "text": "Benefits And Costs Of The Kyoto Protocol 144120135347.pdf",
      "url": "https://www.aei.org/wp-content/uploads/2014/06/-benefits-and-costs-of-the-kyoto-protocol_144120135347.pdf",
      "domain": "aei.org",
      "type": "citation"
    },
    {
      "text": "43554982",
      "url": "https://www.jstor.org/stable/43554982",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Co2 And Greenhouse Gas Emissions",
      "url": "https://ourworldindata.org/co2-and-greenhouse-gas-emissions",
      "domain": "ourworldindata.org",
      "type": "citation"
    },
    {
      "text": "Greenhouse Gas Emissions From Energy Data Explorer",
      "url": "https://www.iea.org/data-and-statistics/data-tools/greenhouse-gas-emissions-from-energy-data-explorer",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "Polp.12105",
      "url": "https://onlinelibrary.wiley.com/doi/10.1111/polp.12105",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "2003 3.pdf",
      "url": "https://www.cbo.gov/sites/default/files/cbofiles/ftpdocs/41xx/doc4198/2003-3.pdf",
      "domain": "cbo.gov",
      "type": "citation"
    },
    {
      "text": "14414",
      "url": "https://www.cbo.gov/publication/14414",
      "domain": "cbo.gov",
      "type": "citation"
    },
    {
      "text": "Development Eu Ets 2005 2020 En",
      "url": "https://climate.ec.europa.eu/eu-action/carbon-markets/eu-emissions-trading-system-eu-ets/development-eu-ets-2005-2020_en",
      "domain": "climate.ec.europa.eu",
      "type": "citation"
    },
    {
      "text": "14489",
      "url": "https://cs3.mit.edu/publication/14489",
      "domain": "cs3.mit.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.iwu.edu/cgi/viewcontent.cgi?article=1177\\u0026context=parkplace",
      "domain": "digitalcommons.iwu.edu",
      "type": "citation"
    },
    {
      "text": "Failures Of Kyoto Will Repeat With The Paris Climate Agreement",
      "url": "https://www.epw.senate.gov/public/index.cfm/2016/4/failures-of-kyoto-will-repeat-with-the-paris-climate-agreement",
      "domain": "epw.senate.gov",
      "type": "citation"
    },
    {
      "text": "27000907",
      "url": "https://www.jstor.org/stable/27000907",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Cmt.10.13",
      "url": "https://www.tandfonline.com/doi/full/10.4155/cmt.10.13",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Informal Info Note By The Sec On The Compliance Procedure With Respect To Greece Rev 2.pdf",
      "url": "https://unfccc.int/files/kyoto_protocol/compliance/application/pdf/informal_info_note_by_the_sec_on_the_compliance_procedure_with_respect_to_greece-rev-2.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Rising Tides Rising Obligations The Icjs Role In Climate Governance",
      "url": "https://www.culawreview.org/current-events-2/rising-tides-rising-obligations-the-icjs-role-in-climate-governance",
      "domain": "culawreview.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://repository.law.miami.edu/cgi/viewcontent.cgi?article=1079\\u0026context=umiclr",
      "domain": "repository.law.miami.edu",
      "type": "citation"
    },
    {
      "text": "Kyotoandflex.pdf",
      "url": "https://www.isecoeco.org/pdf/kyotoandflex.pdf",
      "domain": "isecoeco.org",
      "type": "citation"
    },
    {
      "text": "Kyoto S Second Phase Emission Reductions Achievable But Greater Ambition Needed",
      "url": "https://unfccc.int/news/kyoto-s-second-phase-emission-reductions-achievable-but-greater-ambition-needed",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "257548325 Impact Of The Doha Outcome On Surplus Emission Allowances And Their Effect On Developed Country Emissions",
      "url": "https://www.researchgate.net/publication/257548325_Impact_of_the_Doha_outcome_on_surplus_emission_allowances_and_their_effect_on_developed_country_emissions",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Kyoto Protocol Was Not Failure",
      "url": "https://www.airclim.org/acidnews/kyoto-protocol-was-not-failure",
      "domain": "airclim.org",
      "type": "citation"
    },
    {
      "text": "Paris Global Climate Change Agreements",
      "url": "https://www.cfr.org/backgrounder/paris-global-climate-change-agreements",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Pmc10354701",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10354701/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Un Climate Talks",
      "url": "https://www.cfr.org/timeline/un-climate-talks",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "History Of Un Climate Talks",
      "url": "https://www.c2es.org/content/history-of-un-climate-talks/",
      "domain": "c2es.org",
      "type": "citation"
    },
    {
      "text": "Key Aspects Of The Paris Agreement",
      "url": "https://unfccc.int/most-requested/key-aspects-of-the-paris-agreement",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Paris Climate Agreement Everything You Need Know",
      "url": "https://www.nrdc.org/stories/paris-climate-agreement-everything-you-need-know",
      "domain": "nrdc.org",
      "type": "citation"
    },
    {
      "text": "Pa.html",
      "url": "https://legal.un.org/avl/ha/pa/pa.html",
      "domain": "legal.un.org",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "United Nations",
      "page": "United_Nations"
    },
    {
      "text": "Climate Change",
      "page": "Climate_change"
    },
    {
      "text": "Kyoto",
      "page": "Kyoto"
    },
    {
      "text": "Japan",
      "page": "Japan"
    },
    {
      "text": "ratification",
      "page": "Ratification"
    },
    {
      "text": "Russia",
      "page": "Russia"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "Canada",
      "page": "Canada"
    },
    {
      "text": "European Union",
      "page": "European_Union"
    },
    {
      "text": "emissions trading",
      "page": "Emissions_trading"
    },
    {
      "text": "Clean",
      "page": "The_Clean"
    },
    {
      "text": "Eastern Europe",
      "page": "Eastern_Europe"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "common but differentiated responsibilities",
      "page": "Common_But_Differentiated_Responsibilities"
    },
    {
      "text": "Conference of the Parties",
      "page": "Conference_of_the_parties"
    },
    {
      "text": "Berlin",
      "page": "Berlin"
    },
    {
      "text": "greenhouse gas emissions",
      "page": "Greenhouse_gas_emissions"
    },
    {
      "text": "Geneva",
      "page": "Geneva"
    },
    {
      "text": "binding",
      "page": "Binding"
    },
    {
      "text": "targets",
      "page": "Targets"
    },
    {
      "text": "COP",
      "page": "Cop"
    },
    {
      "text": "Kyoto International Conference Center",
      "page": "Kyoto_International_Conference_Center"
    },
    {
      "text": "Kyoto Protocol",
      "page": "Kyoto_Protocol"
    },
    {
      "text": "treaty",
      "page": "Treaty"
    },
    {
      "text": "emission",
      "page": "Emission"
    },
    {
      "text": "reduction",
      "page": "Reduction"
    },
    {
      "text": "Development",
      "page": "Development"
    },
    {
      "text": "New York",
      "page": "New_York"
    },
    {
      "text": "Bill Clinton",
      "page": "Bill_Clinton"
    },
    {
      "text": "acceptance",
      "page": "Acceptance"
    },
    {
      "text": "carbon dioxide",
      "page": "Carbon_dioxide"
    },
    {
      "text": "State Duma",
      "page": "State_Duma"
    },
    {
      "text": "Protocol",
      "page": "Protocol"
    },
    {
      "text": "Australia",
      "page": "Australia"
    },
    {
      "text": "December",
      "page": "December"
    },
    {
      "text": "Stephen Harper",
      "page": "Stephen_Harper"
    },
    {
      "text": "enforcement",
      "page": "Enforcement"
    },
    {
      "text": "criticism",
      "page": "Criticism"
    },
    {
      "text": "government",
      "page": "Government"
    },
    {
      "text": "New Zealand",
      "page": "New_Zealand"
    },
    {
      "text": "Andorra",
      "page": "Andorra"
    },
    {
      "text": "Monaco",
      "page": "Monaco"
    },
    {
      "text": "Annex",
      "page": "The_Annex"
    },
    {
      "text": "period",
      "page": "First_Period"
    },
    {
      "text": "methane",
      "page": "Methane"
    },
    {
      "text": "nitrous oxide",
      "page": "Nitrous_oxide"
    },
    {
      "text": "Iceland",
      "page": "Iceland"
    },
    {
      "text": "Bulgaria",
      "page": "Bulgaria"
    },
    {
      "text": "Czech Republic",
      "page": "Czech_Republic"
    },
    {
      "text": "Estonia",
      "page": "Estonia"
    },
    {
      "text": "Latvia",
      "page": "Latvia"
    },
    {
      "text": "Liechtenstein",
      "page": "Liechtenstein"
    },
    {
      "text": "Lithuania",
      "page": "Lithuania"
    },
    {
      "text": "Romania",
      "page": "Romania"
    },
    {
      "text": "Slovakia",
      "page": "Slovakia"
    },
    {
      "text": "Slovenia",
      "page": "Slovenia"
    },
    {
      "text": "Switzerland",
      "page": "Switzerland"
    },
    {
      "text": "Hungary",
      "page": "Hungary"
    },
    {
      "text": "Poland",
      "page": "Poland"
    },
    {
      "text": "Croatia",
      "page": "Croatia"
    },
    {
      "text": "Ukraine",
      "page": "Ukraine"
    },
    {
      "text": "Norway",
      "page": "Norway"
    },
    {
      "text": "European",
      "page": "European"
    },
    {
      "text": "Belarus",
      "page": "Belarus"
    },
    {
      "text": "sustainable development",
      "page": "Sustainable_development"
    },
    {
      "text": "India",
      "page": "India"
    },
    {
      "text": "per capita",
      "page": "Per_capita"
    },
    {
      "text": "Global Environment Facility",
      "page": "Global_Environment_Facility"
    },
    {
      "text": "adaptation",
      "page": "Adaptation"
    },
    {
      "text": "mitigation",
      "page": "Mitigation"
    },
    {
      "text": "EU",
      "page": ".eu"
    },
    {
      "text": "ppm",
      "page": "PPM"
    },
    {
      "text": "equity",
      "page": "Equity"
    },
    {
      "text": "renewable energy",
      "page": "Renewable_energy"
    },
    {
      "text": "Western Europe",
      "page": "Western_Europe"
    },
    {
      "text": "Paris",
      "page": "Paris"
    },
    {
      "text": "JI",
      "page": "Ji"
    },
    {
      "text": "market",
      "page": "Market"
    },
    {
      "text": "infrastructure",
      "page": "Infrastructure"
    },
    {
      "text": "verification",
      "page": "Verification"
    },
    {
      "text": "energy efficiency",
      "page": "Energy_efficiency"
    },
    {
      "text": "technology transfer",
      "page": "Technology_transfer"
    },
    {
      "text": "governance",
      "page": "Governance"
    },
    {
      "text": "2012",
      "page": "2012"
    },
    {
      "text": "baseline",
      "page": "Baseline"
    },
    {
      "text": "mechanisms",
      "page": "Crank"
    },
    {
      "text": "restructuring",
      "page": "Restructuring"
    },
    {
      "text": "Kazakhstan",
      "page": "Kazakhstan"
    },
    {
      "text": "determination",
      "page": "Determination"
    },
    {
      "text": "Organisation for Economic Co-operation and Development",
      "page": "OECD"
    },
    {
      "text": "Central and Eastern Europe",
      "page": "Central_and_Eastern_Europe"
    },
    {
      "text": "Soviet Union",
      "page": "Soviet_Union"
    },
    {
      "text": "Earth Summit",
      "page": "Earth_Summit"
    },
    {
      "text": "Rio de Janeiro",
      "page": "Rio_de_Janeiro"
    },
    {
      "text": "Austria",
      "page": "Austria"
    },
    {
      "text": "Belgium",
      "page": "Belgium"
    },
    {
      "text": "anthropogenic",
      "page": "Anthropogenic"
    },
    {
      "text": "sulfur hexafluoride",
      "page": "Sulfur_hexafluoride"
    },
    {
      "text": "compliance",
      "page": "Compliance"
    },
    {
      "text": "capacity building",
      "page": "Capacity_building"
    },
    {
      "text": "Brazil",
      "page": "Brazil"
    },
    {
      "text": "entry into force",
      "page": "Effective_date"
    },
    {
      "text": "1990",
      "page": "1990"
    },
    {
      "text": "2022",
      "page": "2022"
    },
    {
      "text": "2023",
      "page": "2023"
    },
    {
      "text": "economic collapse",
      "page": "Economic_collapse"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "international trade",
      "page": "International_trade"
    },
    {
      "text": "manufacturing",
      "page": "Manufacturing"
    },
    {
      "text": "economic growth",
      "page": "Economic_growth"
    },
    {
      "text": "combustion",
      "page": "Combustion"
    },
    {
      "text": "heavy industry",
      "page": "Heavy_industry"
    },
    {
      "text": "clean development mechanism",
      "page": "Clean_Development_Mechanism"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "efficacy",
      "page": "Efficacy"
    },
    {
      "text": "growth",
      "page": "Growth"
    },
    {
      "text": "fossil",
      "page": "Fossil"
    },
    {
      "text": "shale gas",
      "page": "Shale_gas"
    },
    {
      "text": "free-rider problem",
      "page": "Free-rider_problem"
    },
    {
      "text": "Paris Agreement",
      "page": "Paris_Agreement"
    },
    {
      "text": "2010",
      "page": "2010"
    },
    {
      "text": "Energy",
      "page": "Energy"
    },
    {
      "text": "gasoline",
      "page": "Gasoline"
    },
    {
      "text": "gallon",
      "page": "Gallon"
    },
    {
      "text": "natural gas",
      "page": "Natural_gas"
    },
    {
      "text": "electricity",
      "page": "Electricity"
    },
    {
      "text": "carbon equivalent",
      "page": "Equivalent_carbon_content"
    },
    {
      "text": "marginal abatement cost",
      "page": "Marginal_abatement_cost"
    },
    {
      "text": "offshoring",
      "page": "Offshoring"
    },
    {
      "text": "steel",
      "page": "Steel"
    },
    {
      "text": "oil sands",
      "page": "Oil_sands"
    },
    {
      "text": "William Nordhaus",
      "page": "William_Nordhaus"
    },
    {
      "text": "design",
      "page": "Design"
    },
    {
      "text": "monitoring",
      "page": "Monitoring"
    },
    {
      "text": "committee",
      "page": "Committee"
    },
    {
      "text": "accountability",
      "page": "Accountability"
    },
    {
      "text": "target",
      "page": "Target"
    },
    {
      "text": "2009",
      "page": "2009"
    },
    {
      "text": "international law",
      "page": "International_law"
    },
    {
      "text": "cooperation",
      "page": "Cooperation"
    },
    {
      "text": "threshold",
      "page": "Threshold"
    },
    {
      "text": "2000s",
      "page": "2000s"
    },
    {
      "text": "Ad Hoc",
      "page": "Ad_hoc"
    },
    {
      "text": "ADP",
      "page": "ADP"
    },
    {
      "text": "legal instrument",
      "page": "Legal_instrument"
    },
    {
      "text": "finance",
      "page": "Finance"
    }
  ],
  "fetched_at": "2025-12-07T07:29:27.991718",
  "elapsed_ms": 920928
}