{
  "topic": "Lionel Messi",
  "title": "Lionel Messi",
  "slug": "lionel-messi",
  "grokipedia_slug": "Lionel_Messi",
  "grokipedia_url": "https://grokipedia.com/page/Lionel_Messi",
  "source": "grokipedia",
  "content": "# Lionel Messi\n\nLionel Andrés Messi (born 24 June 1987) is an Argentine professional footballer who plays as a forward for Major League Soccer club Inter Miami CF and captains the Argentina national team. Widely regarded as one of the greatest players of all time, he holds the record for the most Ballon d'Or awards with eight and led Argentina to victory in the 2022 FIFA World Cup, earning the Golden Ball as the tournament's best player.\n\nBorn in Rosario, Argentina, Messi was diagnosed with growth hormone deficiency as a child, requiring expensive treatment that his family could not afford. At age 13, he moved to Spain, where FC Barcelona agreed to fund the therapy in exchange for signing him to their youth academy, La Masia. He made his senior debut for Barcelona in a friendly match against Porto on 16 November 2003 at age 16, followed by his La Liga debut on 16 October 2004 against Espanyol at age 17. Over 17 seasons with Barcelona, Messi became the club's all-time leading scorer with 672 goals and helped win 10 La Liga titles, four UEFA Champions League trophies, and seven Copa del Rey cups, among 35 total club honors. He also set La Liga records with 474 goals and 192 assists.\n\nAfter leaving Barcelona in 2021 due to financial issues, Messi joined Paris Saint-Germain, where he won two Ligue 1 titles before moving to Inter Miami in 2023, leading them to the Leagues Cup and contributing to the 2024 Supporters' Shield. In 2025, at age 38, he continues to excel, scoring 29 MLS goals to win the Golden Boot and lead the league while earning Man of the Match awards in 22 of 44 games played. Internationally, beyond the World Cup triumph, Messi won the 2021 Copa América, the 2008 Olympic gold medal, and the 2022 Finalissima, amassing 115 goals for Argentina and becoming its all-time leading scorer. His career totals exceed 890 goals and 400 assists, underscoring his prolific scoring and playmaking abilities.\n\n## Early years\n\n### Childhood and family background\n\nLionel Andrés Messi was born on 24 June 1987 in Rosario, Santa Fe Province, Argentina, into a working-class family. He was the third of four children born to Jorge Messi and Celia Cuccittini, with two older brothers, Rodrigo and Matías, and a younger sister, María Sol. Jorge worked in a steel factory and also coached youth football teams, including at the local club Abanderado Grandoli, while Celia worked part-time as a cleaner.\n\nMessi's early childhood in the modest La Bajada neighborhood of Rosario was marked by a strong family bond and an emerging passion for football, nurtured without intense pressure. From age four, he began kicking a ball around, often tagging along with his brothers to local matches and imitating their play. His maternal grandmother, Celia Olivera Cuccittini, played a key role in encouraging his interest, taking him to train at Grandoli where Jorge coached. The family emphasized enjoyment over professional ambitions in these formative years, with Jorge noting that Messi played purely for fun until around age 11.\n\nThe Messis' close-knit dynamic provided emotional support amid financial constraints, as the household relied on Jorge's factory income to sustain their modest lifestyle in Rosario. This background instilled resilience in Messi, who later credited his parents' sacrifices for shaping his grounded character despite early hardships.\n### Early football development and medical challenges\n\nLionel Messi's introduction to organized football began at the age of five in 1992, when he joined the local club Grandoli in Rosario, Argentina, where his father, Jorge Messi, served as his coach alongside a family friend. There, the young Messi quickly displayed natural talent, dribbling past older opponents and showing an intuitive understanding of the game despite his small stature. He remained with Grandoli for three years, honing basic skills in informal neighborhood matches that emphasized enjoyment and family involvement.\n\nAt age six in 1994, Messi transitioned to the more structured youth system of Newell's Old Boys, Rosario's prominent club, where he spent the next six years developing his abilities. He became a key member of the under-11 team known as \"La Máquina del '87\" (The Machine of '87), a squad born in 1987 that achieved an unbeaten streak over three years in seven-a-side \"baby football\" tournaments, winning multiple regional titles. During this period, Messi scored nearly 500 goals, often playing multiple positions but excelling as a forward with exceptional ball control, vision, and finishing, which set him apart from peers and drew early scouting interest.\n\nMessi's progress was interrupted by a medical diagnosis at age 11 in 1998, when he was identified as having growth hormone deficiency (GHD), a condition that stunted his physical development and left him significantly shorter than his teammates, measuring just 4 feet 4 inches tall. That year, his grandmother Celia Olivera Cuccittini also passed away, adding emotional strain during this challenging period. Treatment required daily subcutaneous injections of synthetic human growth hormone (hGH) into his legs, a regimen he self-administered each night, but the costs—approximately $900 to $1,000 per month—proved burdensome for his working-class family. Initially, Newell's Old Boys provided partial funding, but as expenses mounted, other Argentine clubs like River Plate declined to cover the full treatment, prompting Messi's family to seek opportunities abroad.\n\nIn 2000, at age 13, FC Barcelona offered Messi a youth contract contingent on the club assuming responsibility for his ongoing hGH therapy, which they agreed to fund entirely, enabling his relocation to Spain with his father while the rest of the family followed later. This intervention not only addressed the medical challenge but also accelerated his growth to his adult height of 5 feet 7 inches, allowing him to continue his football development without interruption. The daily injections, which Messi later described as painful but necessary, became a pivotal part of his early resilience, transforming a potential career-ending obstacle into a foundation for his professional success.\n\n## Youth career\n\n### Newell's Old Boys\n\nMessi joined the youth setup of Newell's Old Boys, his boyhood club in Rosario, Argentina, at the age of six in 1994, after spending his early years playing informally and with local team Grandoli. There, he quickly stood out for his exceptional dribbling and vision, earning a spot on the renowned under-12 team known as \"La Máquina del '87\" (The Machine of '87), comprising players born in 1987. Under coach Ernesto Vecchio, the team dominated youth competitions, winning six consecutive tournaments from the under-8 to under-12 levels between 1995 and 2000, suffering just one defeat across four years of play.\n\nAs the team's star forward, Messi was instrumental in their success, often playing up an age group due to his skill level and scoring prolifically from a young age. In his debut match for Newell's, he netted four goals in a 6-0 victory, setting the tone for his time there. Over six years, spanning various youth categories, he amassed 234 goals in 176 appearances, a remarkable tally that highlighted his natural finishing ability and game intelligence. Teammates and coaches recalled his humility and team-oriented play, noting how he elevated those around him even as a child, with Vecchio describing him as a \"little magician\" who could dismantle defenses single-handedly.\n\nMessi's tenure at Newell's ended in 2000 at age 13, when financial constraints prevented the club from covering his growth hormone treatment costs amid his diagnosis of growth hormone deficiency. This led to trials with European clubs, culminating in his move to FC Barcelona's La Masia academy, where Newell's granted permission for the transfer after Barcelona agreed to assume medical expenses. Despite the brevity of his time, Messi's exploits at Newell's laid the foundation for his professional career and cemented his status as a lifelong supporter of the club.\n\n### Barcelona's La Masia academy\n\nLionel Messi joined FC Barcelona's renowned La Masia youth academy in 2000 at the age of 13, following a trial organized by agent Horacio Gaggioli and scout Josep Maria Minguella. His arrival was facilitated by a pivotal agreement on December 14, 2000, when director of football Carles Rexach committed to signing him, scribbling the terms on a napkin to assure Messi's father, Jorge, amid competition from other clubs. Diagnosed with growth hormone deficiency (GHD) in Argentina at age 11, Messi required costly daily injections of somatotropin, estimated at around €1,000 per month, which his family could not fully afford; Barcelona agreed to cover the treatment expenses, a decision that proved instrumental in securing his commitment and enabling his physical development. This support allowed Messi to complete the therapy by age 14, integrating him fully into the academy's rigorous training environment focused on technical skill, possession-based play, and holistic player development.\n\nMessi's progression through La Masia's ranks was remarkably swift, debuting officially for the U14B team on April 7, 2001, in a 3-0 win over Amposta, where he scored once, before a fractured fibula sidelined him briefly. He advanced to the U14A squad for the 2001-02 season, playing 31 matches and scoring 38 goals, including four hat-tricks, one four-goal performance, and nine braces, helping the team secure the league title and the Catalunya Cup. By 2002, at age 15, he moved to U16B under coach Tito Vilanova, contributing 9 goals in 10 matches. In the 2003-04 campaign, Messi debuted for U19B as part of a league-winning side, then joined U19A, where he scored against Nàstic in a 7-0 victory and notched a hat-trick in an 8-1 win over Granollers; he also featured for Barça C (11 matches, including a hat-trick against Gramanet B) and made his initial appearances for Barça B (6 matches).\n\nOver his youth tenure from 2001 to 2005, Messi amassed 89 goals in 97 official matches across La Masia's teams, showcasing exceptional dribbling, vision, and finishing that aligned with the academy's philosophy of nurturing creative, ball-dominant talents. In the 2004-05 season with Barça B in the Tercera División, he added 6 goals in 17 matches while balancing first-team training. Unlike many peers, Messi lived with his family in an apartment rather than at the La Masia residence, an exception granted by Rexach to accommodate his needs during treatment. His time at the academy culminated in a first-team friendly debut against Porto on November 16, 2003, at age 16, marking the seamless transition from youth prospect to senior star under La Masia's proven pathway.\n\n## Club career\n\n### Barcelona (2004–2021)\n\nLionel Messi made his professional debut for Barcelona on 16 October 2004, at the age of 17 years, 3 months, and 22 days, substituting for Deco in the 83rd minute of a La Liga match against Espanyol, which Barcelona won 1–0. Under manager Frank Rijkaard, who had promoted him from the youth ranks, Messi appeared in nine competitive matches that season, scoring his first senior goal on 1 May 2005 in a 2–0 win over Albacete. His early promise was evident in a pre-season friendly against Juventus in August 2005, where he dazzled with skill and earned player-of-the-tournament honors at the Joan Gamper Trophy.\n\nIn the 2005–06 season, Messi contributed eight goals and five assists in 25 appearances, helping Barcelona secure La Liga and the UEFA Champions League titles, though he missed the final due to a hamstring injury sustained against Chelsea. Injuries hampered his 2006–07 campaign, limiting him to 26 matches and five goals, but he marked his breakthrough with his first hat-trick on 10 March 2007 in a 3–3 draw against Real Madrid, becoming the first Barcelona player to score a hat-trick at the Bernabéu since 1943. By the end of the 2007–08 season, Messi had scored 16 goals in 40 appearances, establishing himself as a key winger despite ongoing muscle issues.\n\nThe arrival of Pep Guardiola as manager in 2008 transformed Messi's role and Barcelona's dominance. Inheriting the iconic No. 10 shirt, Messi shifted to a more central false nine position, scoring 38 goals and providing 19 assists in 51 matches during the 2008–09 season, including the winning goal in a 2–0 UEFA Champions League final victory over Manchester United on 27 May 2009. This treble-winning campaign—comprising La Liga, Copa del Rey, and Champions League—highlighted Barcelona's tiki-taka style, with Messi as its creative fulcrum. He repeated this success in 2010–11, scoring the decisive goal in a 3–1 Champions League final win over Manchester United, while amassing 53 goals across all competitions. Between 2009 and 2012, Messi won four consecutive Ballon d'Or awards, recognizing his pivotal role in Barcelona's 14 trophies during Guardiola's tenure.\n\nPost-Guardiola, from 2012 to 2015 under Tito Vilanova and Luis Enrique, Messi sustained elite performance amid occasional injuries. In 2011–12, he set a European record with 73 goals in a single season, including 50 in La Liga, earning his fourth European Golden Shoe. On 20 March 2012, he became Barcelona's all-time leading scorer with his 232nd goal, surpassing César. The 2014–15 season brought another treble, with Messi scoring 58 goals, including 10 in the Champions League en route to a 3–1 final win over Juventus. He overtook Telmo Zarra as La Liga's all-time top scorer on 22 November 2014 with his 252nd league goal.\n\nIn the later years (2015–2021), Messi adapted to varying managerial styles while facing club financial strains. Appointed captain in 2018, he led Barcelona to two more La Liga titles (2017–18, 2018–19), winning the Pichichi Trophy eight times overall as La Liga's top scorer. His 2018–19 season included 51 goals and a sixth Ballon d'Or. On 23 December 2020, he surpassed Pelé's record of 643 goals for a single club. Despite a painful 8–2 Champions League quarter-final loss to Bayern Munich in 2020, Messi scored twice in the 2021 Copa del Rey final, securing his 35th club trophy.\n\nOver 17 seasons, Messi played 778 official matches for Barcelona, scoring 672 goals and providing 303 assists, making him the club's all-time leader in both categories. He won 35 trophies, including 10 La Liga titles, 7 Copa del Reys, 4 UEFA Champions Leagues, 8 Spanish Super Cups, 3 UEFA Super Cups, and 3 FIFA Club World Cups. Financial issues forced his departure as a free agent in August 2021, after rejecting a pay cut to stay, ending a tenure that redefined club success.\n\n### Paris Saint-Germain (2021–2023)\n\nFollowing his emotional departure from Barcelona in August 2021, Lionel Messi signed a two-year contract with Paris Saint-Germain (PSG), with an option to extend for a third year, on August 10, 2021. The move reunited him with former Barcelona teammate Neymar and allowed him to join forces with Kylian Mbappé, forming a high-profile attacking trio backed by the club's Qatari ownership. Messi's arrival generated immense excitement, with over 150,000 PSG shirts bearing his name sold out within seven minutes of the announcement. He made his debut as a substitute in a 2-0 Ligue 1 away win against Reims on August 29, 2021, receiving a standing ovation from fans.\n\nIn his debut 2021–22 season, Messi faced adaptation challenges, including a slow start marked by a knee injury that sidelined him briefly after a 2-1 Ligue 1 win over Lyon in September 2021. He scored his first goal for PSG—a curling left-footed strike—in a 2-0 UEFA Champions League group stage victory against Manchester City on September 28, 2021, helping the team secure a crucial win despite playing a more defensive role than usual. Overall, Messi recorded 11 goals and 15 assists across 34 appearances in all competitions, contributing to PSG's Ligue 1 title win—their 10th in the competition—but the team exited the Champions League in the round of 16, losing 3-2 on aggregate to Real Madrid, where Messi scored once in the second leg. His performances drew mixed reactions, with critics noting a dip from his Barcelona peaks, though he provided creative spark in domestic play.\n\nMessi's form improved markedly in the 2022–23 season, where he started with a goal in the Trophée des Champions 4-0 win over Nantes on 31 July 2022, securing PSG's first trophy of his tenure. He excelled in Ligue 1, tallying 16 goals and 16 assists in 32 matches, leading the league in assists and earning the Best Foreign Player award for the season. Across all competitions, he contributed 21 goals and 20 assists in 41 appearances, playing a pivotal role in PSG's second consecutive Ligue 1 title, clinched with a 1-0 win over Strasbourg on May 27, 2023, where his free-kick assist proved decisive. However, European success eluded the club again, as they were eliminated in the Champions League round of 16 by Bayern Munich with a 2-0 aggregate defeat, despite Messi's five goals in the group stage.\n\nMessi's PSG spell ended on June 3, 2023, when the club announced his departure upon the expiration of his contract, amid reports of internal tensions and his desire for a new challenge. Over two seasons, he amassed 32 goals and 34 assists in 75 appearances, helping secure two Ligue 1 titles and one Trophée des Champions, though the lack of Champions League progress highlighted broader team shortcomings.\n\n### Inter Miami (2023–present)\n\nLionel Messi joined Inter Miami CF on July 15, 2023, signing a contract through the end of the 2025 Major League Soccer season as a free agent following his departure from Paris Saint-Germain. The deal, reportedly worth around $60 million annually including salary and equity in the club, marked his entry into Major League Soccer and was announced amid global anticipation. His arrival, alongside former Barcelona teammates Sergio Busquets, Jordi Alba, and later Luis Suárez, aimed to elevate the expansion franchise's profile and competitiveness.\n\nMessi made his debut on July 21, 2023, in the Leagues Cup group stage against Cruz Azul, entering as a substitute and scoring the winning free-kick goal in a 2-1 victory, marking his first competitive contribution for the club. Despite an injury sidelining him briefly, he returned for the knockout stages, scoring 10 goals and providing 3 assists across seven appearances as Inter Miami advanced to the final. In the August 19 final against Nashville SC, Messi scored the decisive long-range goal in a 1-0 victory, securing the club's first trophy and qualifying them for the 2024 CONCACAF Champions Cup. His seven goals earned him the Leagues Cup Golden Ball award, transforming Inter Miami from a bottom-table team to tournament champions in his debut competition.\n\nIn the remainder of the 2023 MLS regular season, Messi featured in seven matches, scoring one goal and providing one assist, helping Inter Miami climb from relegation danger to a mid-table finish and end a nine-game losing streak. Injuries limited his play to 14 total appearances that year, but his presence boosted attendance and merchandise sales, drawing record crowds to DRV PNK Stadium. The 2024 season saw Messi fully integrate, playing 19 MLS regular-season games with 11 goals and 5 assists before a Copa América injury, then returning to score 20 goals overall in league play. His contributions propelled Inter Miami to the Supporters' Shield with a league-record 74 points from 34 matches, earning him the 2024 MLS Most Valuable Player award. The team also reached the U.S. Open Cup final, where Messi scored a brace in a 3-2 semifinal win over Philadelphia Union, though they lost the final 2-1 to LAFC.\n\nThe 2025 campaign further solidified Messi's dominance, as he scored 29 goals in 28 MLS regular-season appearances to claim the Golden Boot as the league's top scorer, his first such individual honor in MLS. Including cups and playoffs, he recorded 40 goals and 21 assists across 45 matches, highlighted by a hat-trick in a 5-2 win over Nashville SC and a playoff brace that advanced Inter Miami. Despite reaching the MLS Cup playoffs, the team fell short of the title, with Messi noting the Supporters' Shield as a key achievement but expressing ambition for the championship. On October 23, 2025, Inter Miami announced a three-year contract extension for Messi through the 2028 season, potentially his final club deal at age 41.\n\nMessi's tenure has revolutionized Inter Miami, setting club records for goals (over 70 in 80+ appearances) and elevating MLS visibility, with average attendance surpassing 60,000 per home game by 2025. His playmaking and finishing have complemented a star-studded midfield, fostering a possession-based style reminiscent of his Barcelona days, while off-field initiatives like community engagements in South Florida have enhanced the club's global brand.\n## International career\n\n### Youth and early senior appearances\n\nMessi's international breakthrough came with Argentina's under-20 team in early 2005 at the South American U-20 Championship in Colombia, marking his debut for any Argentine national side. There, the 17-year-old forward scored six goals across the tournament, contributing to Argentina's third-place finish and qualification for the subsequent FIFA U-20 World Cup.\n\nBuilding on that momentum, Messi starred at the 2005 FIFA U-20 World Cup in the Netherlands, where he propelled Argentina to the title with a tournament-high six goals. His standout performances included a brace in the 2-1 final victory over Nigeria, earning him both the Golden Boot as top scorer and the Golden Ball as the best player. This triumph highlighted his emerging dribbling prowess and vision, drawing global attention to the Rosario native as a future star.\n\nIn 2008, Messi transitioned to the under-23 squad for the Beijing Olympics, where Argentina defended their 2004 gold medal. Operating primarily as a forward, he featured in all seven matches, scoring two goals and providing key assists, including the decisive one for Ángel Di María's extra-time winner in the 1-0 final against Nigeria. This Olympic success, under coach Sergio Batista, solidified Messi's reputation in youth international football before his full senior integration.\n\nMessi's senior debut arrived shortly after the U-20 World Cup, on August 17, 2005, in a friendly against Hungary in Budapest. Substituted on in the 64th minute, the 18-year-old was controversially sent off just 47 seconds later for elbowing defender Péter Bozsik amid a physical challenge, though Argentina secured a 2-1 victory. Despite the inauspicious start, he earned his first start the following month in a 2006 FIFA World Cup qualifier against Paraguay, where he assisted Javier Saviola's goal in a 1-1 draw.\n\nAt the 2006 FIFA World Cup in Germany, Messi became the youngest Argentine to feature in the tournament at 18 years and 358 days, appearing as a substitute in the final group match—a 6-0 rout of Serbia and Montenegro—where he scored his maiden senior international goal with a composed finish, also assisting Hernán Crespo. Argentina topped their group and reached the quarter-finals, only to fall to the hosts on penalties after a 1-1 draw; Messi's brief but impactful cameos underscored his rapid ascent.\n\nThrough 2007, Messi's early senior appearances grew amid Argentina's preparations for the Copa América. He scored twice in friendlies, including a curling effort in a 4-1 win over Algeria in March, and featured prominently in qualifiers, amassing five caps that year while adapting to the demands of playing alongside veterans like Juan Román Riquelme. His versatility shone in the 2007 Copa América, where he netted two goals in five matches, though Argentina lost the final 3-0 to Brazil. These outings, totaling 14 senior appearances by mid-2007 with four goals, marked Messi's establishment as a key figure in the Albiceleste.\n\n### Major tournaments and World Cup triumph\n\nAt the 2007 Copa América in Venezuela, Messi scored twice as Argentina advanced to the final but lost 3-0 to Brazil, marking their first runner-up finish in the competition during his tenure. He followed this with a standout performance at the 2010 FIFA World Cup in South Africa, starting all four matches but failing to score as Argentina exited in the quarter-finals following a 4-0 defeat to Germany. In the 2011 Copa América hosted by Argentina, Messi contributed one goal and four assists, helping the team to a third-place finish, though they were eliminated in the quarter-finals by Uruguay.\n\nThe 2014 FIFA World Cup in Brazil saw Messi emerge as a central figure, scoring four goals—including decisive strikes against Bosnia and Herzegovina, Iran, and Nigeria—and earning the Golden Ball as the tournament's best player despite Argentina's 1-0 extra-time loss to Germany in the final. This near-miss was echoed in the 2015 Copa América in Chile, where Messi scored once and provided three assists, leading Argentina to the final but falling to the hosts on penalties after a 0-0 draw. The heartbreak repeated in the 2016 Copa América Centenario in the United States, with Messi netting five goals—including two in the semi-final against the United States—but missing a penalty in the shootout loss to Chile in the final, prompting a brief international retirement announcement.\n\nMessi returned for the 2018 FIFA World Cup in Russia, where he scored once in a 2-1 group-stage win over Nigeria, but Argentina managed only a round-of-16 exit after a 4-3 defeat to France. At the 2019 Copa América in Brazil, he recorded one goal and two assists amid a quarter-final elimination by Brazil, followed by a public dispute with CONMEBOL over officiating. These setbacks underscored a prolonged quest for major silverware, with Messi having scored 69 international goals to that point but no senior titles.\n\nThe turning point arrived at the 2021 Copa América, delayed to 2021 due to the COVID-19 pandemic and hosted by Brazil, where Messi captained Argentina to their first continental title in 28 years. He scored four goals and provided five assists across seven matches, including key contributions in the 3-0 semi-final win over Colombia, earning the tournament's best player award as Argentina defeated Brazil 1-0 in the final at the Maracanã Stadium. This victory, Argentina's 15th Copa América title, set the stage for further success, including a 3-0 win over Italy in the 2022 Finalissima.\n\nMessi's international redemption culminated at the 2022 FIFA World Cup in Qatar, where he led Argentina to their third world title and first since 1986. Over seven matches, he scored seven goals—including one each against Mexico and Australia, and two in the final—and added three assists, becoming the first player to achieve 10 goal involvements in a single World Cup excluding shootouts. Argentina topped their group, advanced past Australia (2-1), the Netherlands (on penalties), and Croatia (3-0) in the knockouts, before drawing 3-3 with France in the final and winning 4-2 on penalties, with Messi converting his spot-kick. He claimed the Golden Ball for the second time, solidifying his status as one of the tournament's all-time greats with 13 World Cup goals overall.\n### Post-World Cup era and contract extension\n\nFollowing Argentina's historic victory at the 2022 FIFA World Cup in Qatar, where Lionel Messi captained the team to their third global title and earned the Golden Ball as the tournament's best player, he reaffirmed his commitment to the national team. The triumph marked the culmination of a decade-long quest, but Messi, at age 35, chose to extend his international career, leading Argentina into a dominant post-World Cup phase. Under his leadership, the team pursued further success in continental and qualifying competitions, solidifying their status as a powerhouse.\n\nIn 2024, Messi guided Argentina to a record-extending 16th Copa América title, defeating Colombia 1-0 in the final held in Miami on July 14. This victory completed a remarkable treble of major trophies for Argentina—the 2021 Copa América, the 2022 World Cup, and now the 2024 edition—making them the first South American nation to achieve three consecutive major international wins. Messi featured in five matches, scoring once against Canada in the opener and providing an assist in the semifinal against Ecuador, though he was forced off in the 64th minute of the final due to a right ankle ligament injury sustained earlier in the game. Despite his limited involvement in the decisive moments, his presence inspired the squad, with Lautaro Martínez scoring the extra-time winner; Messi was named to the tournament's Team of the Tournament for his overall influence, including seven chances created—the highest in the competition.\n\nThe 2024 Copa América success propelled Argentina into the 2026 FIFA World Cup qualifiers with momentum, as they topped the CONMEBOL standings. Messi contributed key goals and assists in several qualifiers, including a brace in a 3-0 win over Venezuela on September 5, 2025—his final home qualifier, marked by an emotional farewell to playing on Argentine soil. Argentina secured a 4-1 victory over Brazil on March 25, 2025, clinching early qualification for the tournament hosted in North America, though Messi missed that match due to fitness concerns. In October 2025, during the international friendly window, Messi provided two assists in a 6-0 win over Puerto Rico on October 15, prioritizing recovery while managing his club schedule with Inter Miami. On November 14, 2025, he scored in a 2-0 friendly win over Angola, adding to his international tally.\n\nMessi's post-World Cup international tenure reflects a deliberate extension of his career with Argentina, driven by his desire to defend the World Cup title in 2026. In October 2025, he stated, \"I would like to be there\" for the tournament, emphasizing that his participation would depend on being \"100% fit\" amid ongoing physical challenges. This commitment aligns with his recent club contract extension with Inter Miami through 2028, which provides flexibility for national team duties without immediate retirement pressure. Teammates and coach Lionel Scaloni have echoed support for his involvement, viewing the 2026 edition—expanded to 48 teams—as an \"extraordinary\" opportunity for Messi to cap his legacy, potentially in familiar U.S. venues near his MLS base.\n\n## Playing style\n\n### Technical attributes and skills\n\nLionel Messi's technical prowess is characterized by exceptional ball control and close-quarters manipulation, allowing him to maintain possession under intense pressure. His low center of gravity and quick changes of direction enable him to evade defenders with minimal space, often using feints and body swerves to create openings. This agility was evident in his solo run during the 2010/11 UEFA Champions League semi-final against Real Madrid, where he zigzagged past multiple opponents before scoring.\n\nMessi's dribbling stands out for its efficiency and creativity, frequently described as \"unique\" due to his ability to accelerate rapidly while shielding the ball. In the 2012/13 Champions League, he demonstrated this by dribbling past five AC Milan defenders in a single move to score. His technique relies on soft touches and precise footwork, often playing within the width of the penalty area with rapid changes of direction, as observed in Barcelona's 2018/19 campaign. This skill has allowed him to complete high volumes of successful dribbles, contributing to his reputation as one of the most effective one-on-one operators in football history.\n\nHis vision and passing accuracy form a cornerstone of his playmaking, with an innate ability to anticipate movements and deliver precise through balls. UEFA analysis highlights his \"slide-rule passes\" through narrow spaces at acute angles, supported by acute peripheral vision that seems to give him \"eyes in the back of his head.\" In the 2010/11 final against Manchester United, he executed a decoy pass using the outside of his right foot to set up Pedro's goal, showcasing 92% passing success in that match. Messi's decision-making is enhanced by expert intuition and longer visual fixation durations, enabling efficient information processing and problem-solving on the pitch.\n\nFinishing represents another hallmark, with a preference for left-footed strikes from various ranges, including long-distance efforts and free-kicks. He scored 12 goals in the 2010/11 Champions League, including a 54th-minute volley in the final, and repeated the feat in 2018/19 with nine left-footed goals and a 30-meter free-kick against Liverpool. His composure in one-on-one situations with goalkeepers, combined with clinical placement, has resulted in a high conversion rate, often from diagonal runs that exploit defensive gaps.\n\nMessi's movement off the ball further amplifies his technical gifts, involving constant positional shifts and intelligent drops into deeper areas to orchestrate attacks. In the 2018/19 quarter-final against Manchester United, a diagonal run from right to left created space for his goal. This fluidity, paired with speed off the mark, disrupts marking schemes, as seen in high-speed combinations during the 2012/13 season. Overall, these attributes—rooted in anticipation and neuromuscular coordination—enable Messi to solve complex tactical problems intuitively.\n\n### Positional versatility and evolution\n\nLionel Messi's early playing positions reflected his natural creativity and dribbling prowess. In his youth at Newell's Old Boys, he operated as a second striker behind the playmaker during his brief experience in 11-a-side football. Upon joining Barcelona's La Masia academy, he featured as a playmaker in the upper part of a 3-4-3 diamond formation, often with freedom to roam or drift to the wing. His senior debut under Frank Rijkaard in 2004 saw him converted to a right winger, a novel role for him that capitalized on his left-footed ability to cut inside and create chances. This adaptation proved immediate and effective, as Messi quickly became integral to Barcelona's attack alongside players like Ludovic Giuly, Samuel Eto'o, and Ronaldinho.\n\nThe most transformative shift occurred under Pep Guardiola in 2008, when Messi was repositioned as a false nine—a central forward who drops deep into midfield to disrupt defenses and link play. Guardiola introduced this tactic ahead of a pivotal El Clásico against Real Madrid on May 2, 2009, instructing Messi to start centrally but retreat to join the midfield, thereby pulling center-backs out of position and creating space for wingers like Thierry Henry and Eto'o. Messi recalled the surprise of the change: \"I remember that it was a surprise for me... I wasn’t going to stay there, but rather come out and join up with the central midfield.\" The strategy yielded a 6–2 victory, with Barcelona dominating possession and gaining an extra man in midfield, exemplified by one of Henry's goals stemming directly from the tactic. This role revolutionized Messi's game, blending goal-scoring threat with playmaking; in the 2011–12 season alone, he scored a European record 73 goals while facilitating tiki-taka fluidity alongside Xavi and Andrés Iniesta.\n\nAs Barcelona's midfield evolved in the mid-2010s, particularly after the departures of Xavi and Iniesta, Messi adapted to a deeper, more orchestrating role, often as an advanced playmaker or hybrid No. 10, picking up the ball in midfield to initiate attacks and maintain possession. This shift allowed him to dictate tempo while still contributing offensively, compensating for reduced pace with superior vision and passing. By the 2018–19 season, his heat maps showed increased activity in central midfield zones, underscoring his growing involvement in build-up play.\n\nAt Paris Saint-Germain from 2021 to 2023, Messi reverted to a right-winger role in a fluid front three with Kylian Mbappé and Neymar, though he frequently drifted centrally as a No. 10 to leverage his creativity amid a possession-heavy system. His through balls led Europe's top leagues in volume during this period, with 0.48 goals per 90 minutes and 1.02 goal contributions per 90 in Ligue 1, despite tactical imbalances in the team's structure that limited overall cohesion. This phase highlighted his versatility but also the challenges of integrating into a less synchronized attack compared to Barcelona.\n\nSince joining Inter Miami in 2023, Messi has primarily operated as a classic No. 10 behind a target forward like Luis Suárez, a position suited to his maturing game where intelligence and passing eclipse physical demands. Coach Gerardo \"Tata\" Martino has emphasized this hybrid role, allowing Messi to roam freely, create overloads, and deliver key passes—his dribble success rate has remained around 50-56% despite fewer attempts. At the 2022 World Cup with Argentina, he exemplified this evolution as a free-roaming playmaker, assisting in the semifinal against Croatia en route to victory. However, like at PSG, Inter Miami's defensive frailties have occasionally exposed his limited pressing, mirroring structural issues in both clubs. This adaptation has sustained his influence, as seen in Miami's 2024 Supporters' Shield win, where his positioning elevated teammates through heightened tactical awareness.\n\nIn 2025, as of November, Messi has further reinvented his style to adapt to age and MLS demands, relying more on cerebral playmaking and vision while maintaining elite scoring (26 MLS goals, leading the league). He extended his contract with Inter Miami until 2028, continuing in the No. 10 role amid the team's ongoing success.\n\n## Reception and legacy\n\n### Comparisons to contemporaries and predecessors\n\nLionel Messi is frequently compared to Diego Maradona, particularly for their shared role in leading Argentina to World Cup glory, with Messi's 2022 triumph often drawing parallels to Maradona's 1986 heroics. In World Cup matches, Messi has scored 13 goals and provided 8 assists across 26 appearances, surpassing Maradona's 8 goals and 8 assists in 21 games, while contributing to 19 total goal involvements compared to Maradona's 16. Both players created similar numbers of chances per 90 minutes (3.0 for Messi, 3.1 for Maradona) and completed comparable dribbles, with Messi recording 125 across tournaments against Maradona's 105 in 1986 alone. In their respective winning tournaments, Maradona was involved in 9 of Argentina's 11 goals through the semifinals in 1986, while Messi contributed to 8 of 12 in 2022; notably, Messi and Maradona are the only players since 1966 to score at least 5 goals and create 20 or more chances in a single World Cup.\n\nComparisons to Pelé highlight Messi's edge in versatility and longevity, though Pelé's three World Cup wins (1958, 1962, 1970) remain unmatched. Messi has amassed 112 international goals in 184 appearances as of November 2025, exceeding Pelé's 77 in 92, and over 740 club goals in 850+ appearances against Pelé's 643 in 660+. In World Cup knockout stages since 1966, Messi holds the record for most assists with 5, passing Pelé, and has tied Maradona with 6 total goal contributions for Argentina. Overall, Messi's 8 Ballon d'Or awards outnumber the retroactive equivalents awarded to Pelé (7) and Maradona (none officially, though often considered), underscoring his sustained excellence in the modern era.\n\nAmong contemporaries, Messi's rivalry with Cristiano Ronaldo has defined an era, with Messi's 2022 World Cup victory tipping the scales in many analyses. In World Cup play, Messi has 13 goals and 8 assists in 26 matches, compared to Ronaldo's 8 goals and 2 assists in 22. Messi's international hardware includes 1 World Cup, 2 Copa Américas, and the 2022 Finalissima, surpassing Ronaldo's 1 European Championship and 1 UEFA Nations League but lacking a World Cup. Post-2022, Messi's 21 World Cup goal contributions (goals plus assists) rank among the highest since 1966, exceeding those of Ronaldo in recorded data. Gary Lineker has noted the similarity between Messi's genius and Maradona's, positioning Messi as a bridge between predecessors and peers in Argentine football lore.\n\n### Accolades, records, and influence on the sport\n\nLionel Messi has amassed an unparalleled collection of individual accolades throughout his career. He has won the Ballon d'Or a record eight times (2009, 2010, 2011, 2012, 2015, 2019, 2021, 2023), more than any other player in history. Additionally, Messi has received The Best FIFA Men's Player award three times (2019, 2022, 2023) and the FIFA World Cup Golden Ball twice (2014, 2022), recognizing him as the tournament's best player on both occasions. He has also been named UEFA Best Player in Europe three times (2011, 2015, 2019) and holds the record for the most appearances in the FIFA FIFPro World XI, with 16 selections from 2007 to 2023.\n\nAt the club level, Messi's honors include 10 La Liga titles, 7 Copa del Rey trophies, and 4 UEFA Champions League titles with Barcelona, where he contributed to a treble in 2009 and 2015. With Paris Saint-Germain, he secured two Ligue 1 titles (2022, 2023), and at Inter Miami, he led the team to the Leagues Cup in 2023—the club's first major trophy—and the MLS Supporters' Shield in 2024. Internationally, Messi's crowning achievements came with Argentina, including the 2022 FIFA World Cup, the 2021 and 2024 Copa América titles, and the 2022 Finalissima. In 2025, he earned the MLS Most Valuable Player award for the second consecutive year and the MLS Golden Boot with 26 goals in the regular season.\n\nMessi holds numerous records that underscore his dominance. He is the all-time leading scorer in La Liga with 474 goals and for a single club in UEFA competitions with 129 goals for Barcelona. His 91 goals in the 2012 calendar year set a Guinness World Record for the most official goals by a player in a single year. In international football, Messi has the most appearances (184 as of November 2025) and goals (112) for Argentina, along with the most assists in World Cup history (8 as of 2022). He also leads in La Liga assists (192) and hat-tricks (36).\n\nMessi's influence on football extends beyond statistics, redefining the role of the modern forward through his vision, dribbling, and playmaking, which have inspired a generation of players to prioritize technical skill and creativity. His arrival in Major League Soccer in 2023 sparked the \"Messi effect,\" boosting attendance by over 80% for Inter Miami games, increasing global viewership, and accelerating youth academy development across the United States, with FIFA noting a surge in young players emulating his style; this impact continued into 2025 with strong playoff performances. As a UNICEF Goodwill Ambassador since 2010, Messi's philanthropy has raised millions for children's health and education, further amplifying football's role in social impact worldwide. His career has elevated the sport's global popularity, particularly in non-traditional markets, solidifying his status as one of football's most transformative figures.\n\n## Personal life\n\n### Family, relationships, and religion\n\nLionel Messi was born on June 24, 1987, in Rosario, Argentina, to parents Jorge Horacio Messi, a steel factory worker, and Celia María Cuccittini, a part-time cleaner, both of whom supported his early football ambitions despite financial hardships. He grew up in a close-knit family with two older brothers, Rodrigo and Matías, and a younger sister, María Sol; Rodrigo has managed aspects of Messi's career, while Matías works with the Leo Messi Foundation on logistical matters.\n\nMessi has been married to Antonela Roccuzzo since June 30, 2017, in a ceremony held in their hometown of Rosario, attended by over 250 guests including family and teammates. The couple first met as children around age five in Rosario, when Messi befriended Roccuzzo's cousin, Lucas Scaglia; they reconnected and began dating in 2008 after Messi returned from Barcelona for a visit, maintaining a long-distance relationship until her relocation to Spain in 2009. They have three sons: Thiago, born on November 2, 2012; Mateo, born on September 11, 2015; and Ciro, born on March 10, 2018, all in Barcelona.\n\nMessi was raised in a devout Roman Catholic family and identifies as Catholic, often expressing gratitude to God for his talents, as in a 2019 interview where he stated, \"I was born this way because of God.\" He has a tattoo of Jesus Christ wearing a crown of thorns on his left shoulder, symbolizing his faith, inked in 2009 as a gesture of thanks following a career milestone. While Messi keeps his religious practices private, he has participated in Catholic rituals.\n\n### Legal issues and controversies\n\nIn 2016, Lionel Messi and his father, Jorge Messi, were convicted by a Spanish court of tax fraud for evading €4.1 million in taxes on income from Messi's image rights between 2007 and 2009. The charges stemmed from their use of offshore companies in Belize and Uruguay to conceal earnings, which the court determined was an intentional effort to avoid declaration to Spanish tax authorities. During the trial, Messi testified that he had no knowledge of the financial arrangements, claiming he trusted his father and advisors to handle such matters, while Jorge argued that their legal counsel had assured them the structures were compliant.\n\nMessi was sentenced to 21 months in prison, and Jorge to 15 months, but under Spanish law for first-time offenders with sentences under two years, neither served time; instead, they paid fines totaling €3.5 million, including €2 million for Messi and €1.5 million for Jorge, on top of the €5 million in back taxes and interest already settled in 2013. The Barcelona Provincial Court upheld the conviction, emphasizing Messi's personal responsibility despite his claims of ignorance, as he signed the relevant documents and benefited directly from the undeclared funds. Messi's appeal to Spain's Supreme Court was rejected in 2017, solidifying the ruling and distinguishing his case from others, such as Xabi Alonso's acquittal, due to the opaque network of entities used, which demonstrated clear intent to defraud rather than mere non-declaration.\n\nIn January 2021, details of Messi's 2017 Barcelona contract were leaked to the Spanish newspaper *El Mundo*, revealing potential earnings of up to €555 million over four years, including base salary, bonuses, and add-ons, which intensified scrutiny over Barcelona's finances amid the club's economic crisis. Barcelona and Messi announced plans to pursue legal action against the newspaper for breaching confidentiality, with the club stating the leak was part of a malicious effort to damage its reputation and confirming only four copies of the contract existed. Messi, who departed Barcelona later that year, joined the lawsuit, targeting both *El Mundo* and any internal parties responsible, though no public resolution or further developments on the case have been reported.\n\nIn October 2025, authorities in Spain launched an investigation into Messi's €11 million villa in Ibiza, accusing it of violating urban planning laws through unauthorized construction in a protected natural area. The probe, which could result in the demolition of parts such as the garage and basement, classified the property as a \"toxic asset\" that cannot be sold or rented pending resolution.\n\nAlso in October 2025, Prime Hydration, co-founded by Logan Paul and KSI, filed a lawsuit against Messi and his Más+ by Messi hydration drink brand in the United States, alleging false advertising. The suit claims that marketing materials misleadingly portrayed Messi as the creator and founder of the product, despite evidence suggesting limited involvement, and seeks damages for deceptive practices.\n\n## Off-field activities\n\n### Philanthropy and humanitarian efforts\n\nLionel Messi established the Leo Messi Foundation in 2007 as a non-profit organization dedicated to supporting children and adolescents in vulnerable situations through initiatives in health, education, and sport. The foundation aims to strengthen healthcare systems, promote access to education, and foster social inclusion via physical activities, addressing global challenges such as the preventable deaths of over 8 million children annually from malnutrition and infectious diseases.\n\nIn 2010, Messi was appointed a UNICEF Goodwill Ambassador, focusing his efforts on campaigns for HIV prevention, children's education, and the social inclusion of children with disabilities. Shortly after, he traveled to Haiti in July 2010 to support post-earthquake recovery, where he collaborated with UNICEF to build water pumps and distribute nutritional supplements to nearly 4,000 displaced children in camps. His ambassadorship has since extended to multiple countries, emphasizing aid for conflict-affected and impoverished youth.\n\nIn health initiatives, the Leo Messi Foundation has prioritized pediatric cancer care and research. In 2018, it donated €2.6 million toward the construction of the SJD Pediatric Cancer Center Barcelona, Europe's largest facility for childhood cancer treatment, enabling international cooperation to cover costs for patients from resource-limited countries. The foundation also partnered with the Josep Carreras Leukaemia Research Institute in 2019 to fund research on childhood leukemia and, as of 2024, supported the salary of a data manager for the Translational Research in Childhood and Adolescent Cancer group at Vall d'Hebron Barcelona Hospital. Additionally, in 2017, it collaborated with UNICEF Nepal to build 14 health posts in earthquake-affected districts, improving access to medical services for remote communities.\n\nFor education, the foundation has funded infrastructure to reintegrate children into schooling amid crises. In 2017, a donation enabled UNICEF to install 20 prefabricated classrooms in Tartus and rural Damascus, Syria, allowing over 1,600 displaced children to resume education and regain a sense of normalcy in a conflict zone where 1.75 million children were out of school. In 2019, it contributed $218,000 to UNICEF projects in Kenya, supporting educational access for vulnerable children in underserved regions.\n\nIn sport and inclusion efforts, the Leo Messi Foundation has partnered with Special Olympics Catalunya since 2014 to promote physical activity among children with intellectual disabilities, including funding dog-assisted therapy programs and athletic events to enhance social integration. This collaboration was renewed in 2020, underscoring Messi's commitment to using sports as a tool for empowerment and equality. Through these multifaceted endeavors, Messi's philanthropy has reached thousands globally, blending his personal resources with strategic partnerships to drive lasting social impact.\n\n### Business ventures, sponsorships, and wealth\n\nLionel Messi's wealth stems primarily from his football salary, endorsement deals, and diversified investments, with Forbes estimating his total earnings at $130 million for 2025, comprising $60 million from salary and winnings and $70 million from endorsements. Over his career, he has accumulated approximately $1.6 billion in earnings from salaries and endorsements combined. His total guaranteed compensation with Inter Miami CF stands at $20.5 million annually, with a base salary of $12 million, part of a broader package valued at $150 million over the initial 2.5-year term, which was extended in October 2025 to keep him with the club through the end of the 2028 MLS season. Additionally, the contract includes an option for Messi to acquire ownership equity in Inter Miami upon completion of his tenure, without requiring an upfront buy-in.\n\nMessi's sponsorship portfolio is one of the most lucrative in sports, anchored by a lifetime agreement with Adidas signed in 2006 and reportedly worth over $1 billion in total value, generating around $20 million annually. Other key partnerships include PepsiCo for promotional campaigns, Anheuser-Busch InBev (Budweiser), Mastercard, Gatorade, and Lay’s, alongside deals with Apple, Beats by Dre, Epic Games, Hard Rock Cafe, Konami, Lowe’s, and Panini. These endorsements collectively contribute $60-70 million per year, leveraging his global image to drive brand visibility in apparel, beverages, technology, and entertainment sectors.\n\nBeyond endorsements, Messi has expanded into various business ventures to build long-term wealth. In hospitality, he co-owns the MiM Hotels chain through the Majestic Hotel Group, featuring boutique properties in Ibiza, Mallorca, and Andorra, managed by his brother Rodrigo. His lifestyle brand, The Messi Store, launched in 2019 with an outlet in Barcelona, offers apparel, accessories, and sportswear. In 2024, he introduced Más+ by Messi, a sports and energy drink line available in South Florida. More recently, in July 2025, Messi became a global partner and shareholder in the Argentine restaurant chain El Club de la Milanesa, specializing in Milanese sandwiches, with plans for four new Miami locations by December 2025 and further U.S. and European expansion. He also owns luxury real estate, including properties in Barcelona, Rosario, Miami, and Mallorca, and in early 2025 acquired four units in a Miami building as part of his U.S. investments. Additionally, through 525 Rosario, a media company he founded, Messi produces sports and family-oriented entertainment content. These ventures, combined with his on-field earnings, position his net worth at an estimated $850 million as of 2025.\n\n## Career statistics\n\n### Club statistics\n\nLionel Messi's club career spans over two decades, beginning with FC Barcelona in 2004, followed by stints at Paris Saint-Germain from 2021 to 2023, and currently with Inter Miami CF since 2023. Across these clubs, he has amassed 938 appearances, 780 goals, and 376 assists in all competitions, establishing him as one of the most productive players in football history. His goal-scoring prowess is particularly evident at Barcelona, where he holds the all-time record for most goals by a player for a single club.\n\nThe following table summarizes Messi's key statistics by club, encompassing all official competitions (league, domestic cups, continental tournaments, and others). These figures highlight his consistent impact as both a scorer and creator.\n\n| Club              | Years     | Appearances | Goals | Assists |\n|-------------------|-----------|-------------|-------|---------|\n| FC Barcelona      | 2004–2021 | 778        | 672   | 303     |\n| Paris Saint-Germain | 2021–2023 | 75         | 32    | 35      |\n| Inter Miami CF    | 2023–present | 85       | 76    | 38      |\n| **Total**         |           | **938**    | **780**| **376** |\n\n*Source: Transfermarkt, as of November 2025.*\n\nMessi's contributions extend beyond raw numbers; for instance, at Barcelona, 129 of his goals came in the UEFA Champions League across 163 appearances, making him the competition's all-time leading scorer until surpassed. In Major League Soccer with Inter Miami, his 76 goals in 85 games include a league-record 50 in the regular season alone, underscoring his adaptation to a new environment while maintaining elite output. These statistics reflect not only volume but also efficiency, with Messi averaging over 0.8 goals per game across his club career.\n\n### International statistics\n\nLionel Messi holds the record as Argentina's all-time leading goalscorer and assist provider in international football, with 115 goals and 61 assists across 196 appearances as of November 14, 2025. His contributions have been pivotal in major tournaments, including leading Argentina to victory in the 2021 and 2024 Copa América titles, as well as the 2022 FIFA World Cup, where he scored 13 goals overall in the competition, the most by any player in a single edition. Messi's goal-scoring rate stands at approximately 0.59 goals per game internationally, with notable efficiency in qualifiers and friendlies.\n\nThe following table summarizes Messi's international statistics by major competition:\n\n| Competition                  | Appearances | Goals | Assists |\n|------------------------------|-------------|-------|---------|\n| FIFA World Cup               | 26         | 13    | 8       |\n| Copa América                 | 39         | 14    | 18      |\n| World Cup Qualification      | 72         | 36    | 14      |\n| International Friendlies     | 58         | 52    | 21      |\n| CONMEBOL–UEFA Cup of Champions | 1       | 0     | 2       |\n| **Total**                    | **196**    | **115**| **63**  |\n\nThese figures highlight Messi's dominance in non-competitive matches, where he has scored over 45% of his international goals, often using friendlies to refine Argentina's tactics under coaches like Lionel Scaloni. In competitive fixtures, his 50 goals across World Cup and Copa América games underscore his clutch performance in high-stakes scenarios. In 2025, Messi featured in six international matches for Argentina during World Cup qualifiers and friendlies, contributing 4 goals and 4 assists, including a brace in a 3–0 win over Venezuela on September 5 and a goal plus assist in a 2–0 win over Angola on November 14.\n\n## Honours\n\n### Club honours\n\nLionel Messi's club career spans FC Barcelona, Paris Saint-Germain (PSG), and Inter Miami CF, during which he has amassed a total of 40 major team trophies, establishing him as one of the most decorated players in football history. His honours reflect dominance in domestic and international competitions, particularly during his 17-year tenure at Barcelona, where he contributed to a club-record number of titles.\n\n### With FC Barcelona (2004–2021)\nMessi's time at Barcelona yielded 35 major trophies, including multiple domestic and European successes that solidified the club's golden era under managers like Frank Rijkaard, Pep Guardiola, and Luis Enrique. He won 10 La Liga titles in seasons 2004–05, 2005–06, 2008–09, 2009–10, 2010–11, 2012–13, 2014–15, 2015–16, 2017–18, and 2018–19, often leading the league in goals and assists. In the Copa del Rey, he secured seven victories: 2008–09, 2011–12, 2014–15, 2015–16, 2016–17, 2017–18, and 2020–21, with notable performances in finals against rivals like Athletic Bilbao and Sevilla.\n\nOn the European stage, Messi lifted the UEFA Champions League four times: 2005–06, 2008–09, 2010–11, and 2014–15, including iconic goals in the 2009 final against Manchester United and the 2011 triumph over the same opponent. He also won three FIFA Club World Cups in 2009, 2011, and 2015, three UEFA Super Cups in 2009, 2011, and 2015, and eight Supercopa de España titles in 2005–06, 2006–07, 2009–10, 2010–11, 2011–12, 2013–14, 2016–17, and 2018–19. These achievements include the 2009 sextuple (La Liga, Copa del Rey, Supercopa de España, UEFA Champions League, UEFA Super Cup, and FIFA Club World Cup) and the 2015 treble (La Liga, Copa del Rey, UEFA Champions League), underscoring his pivotal role in Barcelona's historic successes.\n\n### With Paris Saint-Germain (2021–2023)\nMessi's two seasons at PSG added three trophies to his collection, focusing on domestic dominance in Ligue 1. He won back-to-back Ligue 1 titles in 2021–22 and 2022–23, contributing 32 goals and 35 assists across all competitions despite initial adaptation challenges. Additionally, he captured the Trophée des Champions in 2022, defeating Nantes 4–0 in the season-opening super cup, where he scored once. No further club silverware was added during his stint.\n\n### With Inter Miami CF (2023–present)\nSince joining Inter Miami in July 2023, Messi has led the club to two trophies, transforming its standing in Major League Soccer (MLS). He guided the team to victory in the 2023 Leagues Cup, scoring 10 goals—including a brace in the final against Nashville SC—to secure Miami's first-ever trophy and end a 23-year winless streak in major competitions. In 2024, Inter Miami clinched the Supporters' Shield for the best regular-season record, amassing a league-record 74 points, with Messi contributing 20 goals and 16 assists in limited appearances due to injuries. As of November 2025, no additional trophies have been won, including the MLS Cup, though Messi's influence has elevated the club's profile and performance.\n\n### International honours\n\nLionel Messi's international career with Argentina began yielding major honours in his youth, marking the start of a journey that culminated in senior triumphs after years of near-misses. His first significant achievement came at the 2005 FIFA U-20 World Cup in the Netherlands, where he led Argentina to victory, scoring six goals—including a brace in the final against Nigeria—and earning the Golden Ball as the tournament's best player, as well as the Golden Shoe for top scorer. This success foreshadowed his pivotal role in Argentina's 2008 Olympic gold medal win at the Beijing Games, where the under-23 team defeated Nigeria 1-0 in the final; Messi provided the assist for Ángel Di María's winning goal and was instrumental in the tournament despite scoring only twice overall.\n\nAfter a prolonged wait for senior international silverware, Messi captained Argentina to their first major trophy in 28 years by winning the 2021 Copa América in Brazil. In the final against hosts Brazil, Argentina secured a 1-0 victory with a goal from Ángel Di María, while Messi contributed four goals and five assists throughout the tournament to claim the top scorer and player awards. The following year, Messi lifted the inaugural CONMEBOL–UEFA Cup of Champions (Finalissima) in June 2022, as Argentina beat Italy 3-0 at Wembley Stadium; he recorded one assist and was named Player of the Match for his commanding performance.\n\nMessi's crowning achievement arrived at the 2022 FIFA World Cup in Qatar, where he captained Argentina to their third world title, defeating France 4-3 on penalties after a 3-3 draw in the final. Messi scored seven goals, including two in the final, provided three assists, and won the Golden Ball as the tournament's best player, becoming the first to achieve this honour twice across World Cups. Argentina's dominance continued into 2024 with a second consecutive Copa América title in the United States, overcoming Colombia 1-0 in the final despite Messi's early injury; he still contributed one goal and five assists, helping Argentina become the competition's most successful nation with 16 wins.\n\nThese six international honours underscore Messi's transformation from a prodigious talent to Argentina's talismanic leader, amassing 115 goals in 196 caps as of November 2025 and ending a long drought for the national team.\n\n### Individual awards and records\n\nLionel Messi is widely regarded as one of the greatest footballers of all time, evidenced by his extensive collection of individual awards that highlight his dominance in both club and international competitions. He has won the Ballon d'Or, awarded by France Football, a record eight times, in 2009, 2010, 2011, 2012, 2015, 2019, 2021, and 2023, surpassing all other players in the award's history. Additionally, Messi has claimed The Best FIFA Men's Player award three times (2019, 2022, 2023), tying him for the most wins in that category. He has also received the European Golden Shoe six times (2009–10, 2011–12, 2012–13, 2016–17, 2017–18, 2018–19), recognizing him as Europe's top scorer in those seasons.\n\nMessi's accolades extend to other prestigious honors, including two Laureus World Sports Awards (2019, 2022) for his outstanding athletic achievements. In La Liga, he has been named the league's MVP nine times (2008–09, 2009–10, 2010–11, 2011–12, 2012–13, 2014–15, 2016–17, 2017–18, 2018–19) and top scorer (Pichichi Trophy) eight times (2009–10, 2011–12, 2012–13, 2016–17, 2017–18, 2018–19, 2019–20, 2020–21). For the UEFA Champions League, he holds the record as top scorer six times (2008–09, 2009–10, 2010–11, 2011–12, 2014–15, 2018–19). Internationally, Messi earned the Copa América MVP twice (2015, 2021) and the FIFA World Cup Golden Ball twice (2014, 2022), making him the only player to win this award multiple times. In Major League Soccer with Inter Miami, he was named the 2023 Leagues Cup MVP and top scorer, the 2024 MLS Most Valuable Player while leading the league in goals, and the 2025 MLS Golden Boot winner with 29 goals.\n\nIn 2025, Messi was crowned the IFFHS All-Time Men's World Best Player, solidifying his legacy as the most decorated individual in football history with over 60 major personal honors. Other notable awards include the Golden Boy in 2005, four Onze d'Or awards (2009, 2011, 2012, 2018), and inclusion in the FIFA FIFPro World XI 17 times from 2007 to 2023.\n\nMessi holds numerous records that underscore his scoring prowess and longevity. He is La Liga's all-time leading goalscorer with 474 goals and Barcelona's record scorer with 672 goals across all competitions. In the UEFA Champions League, he has the most goals for a single club (120 for Barcelona) and the most group stage goals (80). His 91 goals in the calendar year 2012 earned him a Guinness World Record for the most official goals in a single year. Internationally, Messi is Argentina's all-time top scorer with 115 goals in 196 appearances as of November 2025, the most caps for the national team, and the leading goalscorer among South American nations.\n\nAt the FIFA World Cup, Messi owns several milestones, including the most appearances (26), most minutes played (2,314), most assists in knockout stages (tied at 6), and Argentina's national record of 13 goals; he is the only player to score in the group stage, round of 16, quarter-finals, semi-finals, and final across multiple tournaments. He also holds the record for the most Player of the Match awards at World Cups (11). In MLS, as of 2025, Messi is the fastest to 50 goals (all competitions) in league history and led Inter Miami to the 2024 Supporters' Shield with a record points total influenced by his contributions.",
  "external_references": [
    {
      "text": "28003",
      "url": "https://www.transfermarkt.us/lionel-messi/profil/spieler/28003",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Honours And Achievements",
      "url": "https://messi.com/en/honours-and-achievements/",
      "domain": "messi.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi",
      "url": "https://www.olympics.com/en/athletes/lionel-messi",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Childhood Barcelona Medicine Lionel Messi",
      "url": "https://www.theguardian.com/football/2010/apr/20/childhood-barcelona-medicine-lionel-messi",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "21 Years Since Leo Messi Debuted For Fc Barcelona",
      "url": "https://www.fcbarcelona.com/en/news/4169478/21-years-since-leo-messi-debuted-for-fc-barcelona",
      "domain": "fcbarcelona.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Soccer Career Stats Accolades Honors",
      "url": "https://www.espn.com/soccer/story/_/id/40624256/lionel-messi-soccer-career-stats-accolades-honors",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Stats",
      "url": "https://www.mlssoccer.com/players/lionel-messi/stats/",
      "domain": "mlssoccer.com",
      "type": "citation"
    },
    {
      "text": "Inter Miami Cf Forward Lionel Messi Wins 2025 Mls Golden Boot Presented By Audi",
      "url": "https://www.mlssoccer.com/news/inter-miami-cf-forward-lionel-messi-wins-2025-mls-golden-boot-presented-by-audi",
      "domain": "mlssoccer.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi 2025 Tracker Inter Miami Games Goals Assists Stats",
      "url": "https://www.espn.com/soccer/story/_/id/43935337/lionel-messi-2025-tracker-inter-miami-games-goals-assists-stats",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi",
      "url": "https://www.biography.com/athletes/lionel-messi",
      "domain": "biography.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi The Little Boy Who Became The Greatest In History N 2",
      "url": "https://en.as.com/soccer/lionel-messi-the-little-boy-who-became-the-greatest-in-history-n-2/",
      "domain": "en.as.com",
      "type": "citation"
    },
    {
      "text": "All About Lionel Messi Parents 8567819",
      "url": "https://people.com/all-about-lionel-messi-parents-8567819",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "Messis Dad Lionel Always Played For Fun",
      "url": "https://www.socceramerica.com/messis-dad-lionel-always-played-for-fun/",
      "domain": "socceramerica.com",
      "type": "citation"
    },
    {
      "text": "406607 Celia Maria Cuccittini Facts About.html",
      "url": "https://news.amomama.com/406607-celia-maria-cuccittini-facts-about.html",
      "domain": "news.amomama.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messis Mother Worked As A Cleaner To Provide For Her Kid Now He Gives Back With Gratitude 815907",
      "url": "https://brightside.me/articles/lionel-messis-mother-worked-as-a-cleaner-to-provide-for-her-kid-now-he-gives-back-with-gratitude-815907/",
      "domain": "brightside.me",
      "type": "citation"
    },
    {
      "text": "Messi And The History Of Celebrating His Goals%252c The Argentinian Dedicates All His Goals To His Grandmother Celia%252c Who Gave Him The Chance To Become A Footballer",
      "url": "https://telegrafi.com/en/messi-and-the-history-of-celebrating-his-goals%252C-the-argentinian-dedicates-all-his-goals-to-his-grandmother-Celia%252C-who-gave-him-the-chance-to-become-a-footballer/",
      "domain": "telegrafi.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Teams Football Club Country",
      "url": "https://www.olympics.com/en/news/lionel-messi-teams-football-club-country",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "When Did Lionel Messi Start Playing Soccer",
      "url": "https://www.si.com/soccer/when-did-lionel-messi-start-playing-soccer",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Oral History Transfer Arranged 20 Years Ago",
      "url": "https://www.espn.com/soccer/story/_/id/37609629/oral-history-transfer-arranged-20-years-ago",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Height Feet Why",
      "url": "https://www.nytimes.com/athletic/4000883/2022/12/14/lionel-messi-height-feet-why/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "World Latin America 40454654",
      "url": "https://www.bbc.com/news/world-latin-america-40454654",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Blte9cb3b048ace46cc",
      "url": "https://www.goal.com/en-us/news/newells-old-boys-facts/blte9cb3b048ace46cc",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "http://www.espn.com/espn/eticket/story?page=Lionel-Messi",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Blt230e8a99e5c9810b",
      "url": "https://www.goal.com/en-us/lists/lionel-messi-inter-miami-newells-old-boys-return-argentina-retire/blt230e8a99e5c9810b",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Meet Other Messi Plays Lionel Boyhood Club Newell Old Boys Even Wears No 10 Jersey",
      "url": "https://www.espn.com/soccer/story/_/id/37625336/meet-other-messi-plays-lionel-boyhood-club-newell-old-boys-even-wears-no-10-jersey",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2717227 The Machine Of 87 Messis Boyhood Teammates Recall Early Signs Of Greatness",
      "url": "https://bleacherreport.com/articles/2717227-the-machine-of-87-messis-boyhood-teammates-recall-early-signs-of-greatness",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "548 Messi Lionel Andres Messi Cuccitini",
      "url": "https://players.fcbarcelona.com/en/player/548-messi-lionel-andres-messi-cuccitini",
      "domain": "players.fcbarcelona.com",
      "type": "citation"
    },
    {
      "text": "All Time Stats For Messi In The Barca Youth Teams",
      "url": "https://www.fcbarcelona.com/en/news/1692969/all-time-stats-for-messi-in-the-barca-youth-teams",
      "domain": "fcbarcelona.com",
      "type": "citation"
    },
    {
      "text": "Oral History Saw First 15 Years Ago Vs Espanyol",
      "url": "https://www.espn.com/soccer/story/_/id/37577728/oral-history-saw-first-15-years-ago-vs-espanyol",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Barcelona 20 Years",
      "url": "https://www.nytimes.com/athletic/4665938/2023/07/18/lionel-messi-barcelona-20-years/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "465366",
      "url": "https://kslsports.com/soccer/a-timeline-of-lionel-messis-career-at-barcelona/465366",
      "domain": "kslsports.com",
      "type": "citation"
    },
    {
      "text": "Messi Data Biography Analysis Young Messi 2004 05 To 2007 08",
      "url": "https://blogarchive.statsbomb.com/articles/soccer/messi-data-biography-analysis-young-messi-2004-05-to-2007-08/",
      "domain": "blogarchive.statsbomb.com",
      "type": "citation"
    },
    {
      "text": "0253 0d7ff5460779 90f1672a7e36 1000 The Greatest Teams Of All Time Barcelona 2008 12",
      "url": "https://www.uefa.com/uefachampionsleague/news/0253-0d7ff5460779-90f1672a7e36-1000--the-greatest-teams-of-all-time-barcelona-2008-12/",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi 97",
      "url": "https://www.aljazeera.com/gallery/2021/8/8/lionel-messi-97",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "1425196979408281604",
      "url": "https://x.com/PSG_English/status/1425196979408281604",
      "domain": "x.com",
      "type": "citation"
    },
    {
      "text": "58809309",
      "url": "https://www.bbc.com/sport/football/58809309",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Manchester City Paris Saint Germain",
      "url": "https://www.espn.com/soccer/match/_/gameId/618772/manchester-city-paris-saint-germain",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Glydngd6tckmxxrmfpnvbjiu",
      "url": "https://www.sportingnews.com/us/soccer/news/lionel-messi-stats-2022-2023-psg-goals-assists/glydngd6tckmxxrmfpnvbjiu",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "The World Cup The Best And All Of Lionel Messis Trophy Wins",
      "url": "https://www.fifa.com/en/the-best-fifa-football-awards/articles/the-world-cup-the-best-and-all-of-lionel-messis-trophy-wins",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Claims Ligue 1 S Best Foreign Player Of The Season Award 2023 06 26",
      "url": "https://www.beinsports.com/en-us/soccer/ligue-1/articles-video/lionel-messi-claims-ligue-1-s-best-foreign-player-of-the-season-award-2023-06-26",
      "domain": "beinsports.com",
      "type": "citation"
    },
    {
      "text": "639978",
      "url": "https://www.espn.com/soccer/report/_/gameId/639978",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Paris Saint Germain Announce Lionel Messi Will Leave Club",
      "url": "https://www.forbes.com/sites/tomsanderson/2023/06/03/paris-saint-germain-announce-lionel-messi-will-leave-club/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Inter Miami Cf Signs Seven Time Ballon D Or Winner World Cup Champion Lionel Mes",
      "url": "https://www.intermiamicf.com/news/inter-miami-cf-signs-seven-time-ballon-d-or-winner-world-cup-champion-lionel-mes",
      "domain": "intermiamicf.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Inter Miami Mls.html",
      "url": "https://www.nytimes.com/2023/07/15/sports/soccer/lionel-messi-inter-miami-mls.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Match Recap Lionel Messi Scores Late Free Kick Winner In Inter Miami Cf Debut",
      "url": "https://www.intermiamicf.com/news/match-recap-lionel-messi-scores-late-free-kick-winner-in-inter-miami-cf-debut",
      "domain": "intermiamicf.com",
      "type": "citation"
    },
    {
      "text": "The Calm Before Messi S Fantastic Goal In The Leagues Cup Final",
      "url": "https://www.leaguescup.com/news/the-calm-before-messi-s-fantastic-goal-in-the-leagues-cup-final",
      "domain": "leaguescup.com",
      "type": "citation"
    },
    {
      "text": "28003",
      "url": "https://www.transfermarkt.us/lionel-messi/leistungsdaten/spieler/28003",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Lionel Messi",
      "url": "https://www.espn.com/soccer/player/_/id/45843/lionel-messi",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Inter Miami Lionel Messi Awarded Key City",
      "url": "https://www.espn.com/soccer/story/_/id/46863635/inter-miami-lionel-messi-awarded-key-city",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Extends Inter Miami Contract Argentina Barcelona",
      "url": "https://www.espn.com/soccer/story/_/id/45570212/lionel-messi-extends-inter-miami-contract-argentina-barcelona",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "messistats.com",
      "url": "https://www.messistats.com/",
      "domain": "messistats.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Extends Inter Miami Contract Through 2028",
      "url": "https://www.mlssoccer.com/news/lionel-messi-extends-inter-miami-contract-through-2028",
      "domain": "mlssoccer.com",
      "type": "citation"
    },
    {
      "text": "Los 30 Anos De Uno De Los Mejores Jugadores Del Planeta",
      "url": "https://www.conmebol.com/noticias/los-30-anos-de-uno-de-los-mejores-jugadores-del-planeta/",
      "domain": "conmebol.com",
      "type": "citation"
    },
    {
      "text": "After Two Decades Feels Right Argentina Messi",
      "url": "https://www.espn.com/soccer/story/_/id/37634895/after-two-decades-feels-right-argentina-messi",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi U20 World Cup",
      "url": "https://www.fifa.com/en/tournaments/mens/u20worldcup/chile-2025/articles/lionel-messi-u20-world-cup",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Olympic Gold Medal Beijing 2008 Final Football Barcelona",
      "url": "https://www.olympics.com/en/news/lionel-messi-olympic-gold-medal-beijing-2008-final-football-barcelona",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Angel Di Maria Argentina Beijing 2008",
      "url": "https://www.fifa.com/en/tournaments/olympicgames/paris2024/articles/lionel-messi-angel-di-maria-argentina-beijing-2008",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi International Debut Anniversary",
      "url": "https://www.fifa.com/en/articles/lionel-messi-international-debut-anniversary",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Appearances Record",
      "url": "https://www.fifa.com/en/tournaments/mens/worldcup/articles/lionel-messi-appearances-record",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Argentina Team Profile History",
      "url": "https://www.fifa.com/en/tournaments/mens/worldcup/canadamexicousa2026/articles/argentina-team-profile-history",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Diego Maradona Says Argentina Not Coddle Lionel Messi",
      "url": "https://www.espn.com/soccer/story/_/id/37424534/diego-maradona-says-argentina-not-coddle-lionel-messi",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Argentina Career Numbers",
      "url": "https://www.espn.com/soccer/story/_/id/37451310/lionel-messi-argentina-career-numbers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "48600098",
      "url": "https://www.bbc.com/sport/football/48600098",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "57776158",
      "url": "https://www.bbc.com/sport/football/57776158",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Copa America World Cup Final Argentina Messi Scaloni",
      "url": "https://www.fifa.com/en/articles/copa-america-world-cup-final-argentina-messi-scaloni",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Classic World Cup Final Crowns Messis Glorious Career",
      "url": "https://www.espn.com/soccer/story/_/id/37634916/classic-world-cup-final-crowns-messis-glorious-career",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Messi Eyes World Cup Defence For Argentina Despite Age Fitness Concerns",
      "url": "https://www.aljazeera.com/sports/2025/10/28/messi-eyes-world-cup-defence-for-argentina-despite-age-fitness-concerns",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Argentina Celebrate Copa America Win Lionel Messi",
      "url": "https://www.espn.com/soccer/story/_/id/40573183/argentina-celebrate-copa-america-win-lionel-messi",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Copa America Argentina Colombia Score Messi 6753475603a48683a3c4971e451e8263",
      "url": "https://apnews.com/article/copa-america-argentina-colombia-score-messi-6753475603a48683a3c4971e451e8263",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Messi Copa America 2024 Tracker Records Argentina Goals Assists Stats Milestones",
      "url": "https://www.espn.com/soccer/story/_/id/40380615/messi-copa-america-2024-tracker-records-argentina-goals-assists-stats-milestones",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Argentina Vs Venezuela Live 2026 World Cup Qualifiers",
      "url": "https://bolavip.com/en/soccer/argentina-vs-venezuela-live-2026-world-cup-qualifiers",
      "domain": "bolavip.com",
      "type": "citation"
    },
    {
      "text": "Brazil Argentina",
      "url": "https://www.espn.com/soccer/match/_/gameId/684643/brazil-argentina",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Argentina Thrash Puerto Rico 6 0 With Two Assists From Messi 2025 10 15",
      "url": "https://www.beinsports.com/en-us/soccer/articles/argentina-thrash-puerto-rico-6-0-with-two-assists-from-messi-2025-10-15",
      "domain": "beinsports.com",
      "type": "citation"
    },
    {
      "text": "1241058 Angola Vs Argentina Live Score Friendly.html",
      "url": "https://www.vavel.com/en-us/soccer/2025/11/14/1241058-angola-vs-argentina-live-score-friendly.html",
      "domain": "vavel.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Goodbye Argentina World Cup",
      "url": "https://www.espn.com/soccer/story/_/id/46160774/lionel-messi-goodbye-argentina-world-cup",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Defend World Cup Title 100 Percent Fit",
      "url": "https://www.espn.com/soccer/story/_/id/46750285/lionel-messi-defend-world-cup-title-100-percent-fit",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Wants Play 2026 Fifa World Cup",
      "url": "https://www.olympics.com/en/news/lionel-messi-wants-play-2026-fifa-world-cup",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Bold 2026 World Cup Prediction",
      "url": "https://www.si.com/soccer/lionel-messi-bold-2026-world-cup-prediction",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "01fa 0e7ba79e0275 8acda08ad811 1000 Messi S Sixth Sense Explained",
      "url": "https://www.uefa.com/uefachampionsleague/news/01fa-0e7ba79e0275-8acda08ad811-1000--messi-s-sixth-sense-explained/",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "1683473 Download.pdf",
      "url": "https://www.uefa.com/multimediafiles/download/technicalreport/competitions/ucl/01/68/34/73/1683473_download.pdf",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "1991079 Download.pdf",
      "url": "https://www.uefa.com/MultimediaFiles/Download/TechnicalReport/competitions/UCL/01/99/10/79/1991079_DOWNLOAD.pdf",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "2619622 Download.pdf",
      "url": "https://www.uefa.com/MultimediaFiles/Download/Publications/uefaorg/General/02/61/96/22/2619622_DOWNLOAD.pdf",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "1cugrw5m59fuyzaditfgta2ml",
      "url": "https://www.goal.com/en-us/news/i-remember-when-guardiola-explained-the-false-nine---messi-talks-through-positional-evolution-at-barca/1cugrw5m59fuyzaditfgta2ml",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "The False Nine Revolutionary Lionel Messi 2",
      "url": "https://www.sofascore.com/news/the-false-nine-revolutionary-lionel-messi-2/",
      "domain": "sofascore.com",
      "type": "citation"
    },
    {
      "text": "Messi Inter Miami Mls Argentina",
      "url": "https://www.nytimes.com/athletic/4673003/2023/07/21/messi-inter-miami-mls-argentina/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Inter Miami Mls Psg",
      "url": "https://www.theguardian.com/football/2025/may/14/lionel-messi-inter-miami-mls-psg",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Reinvent Style Age Mls Inter Miami",
      "url": "https://www.espn.com/soccer/story/_/id/42113863/lionel-messi-reinvent-style-age-mls-inter-miami",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Inter Miami Maestro Messi Defies Age With Jaw Dropping Numbers",
      "url": "https://www.dailysabah.com/sports/football/inter-miami-maestro-messi-defies-age-with-jaw-dropping-numbers",
      "domain": "dailysabah.com",
      "type": "citation"
    },
    {
      "text": "Dqkdlpsdayt",
      "url": "https://www.instagram.com/p/DQKdLPsDayt/",
      "domain": "instagram.com",
      "type": "citation"
    },
    {
      "text": "63978361",
      "url": "https://www.bbc.com/sport/football/63978361",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "2022 World Cup Final Stats Messi Mbappe Argentina France",
      "url": "https://www.espn.com/soccer/story/_/id/37634932/2022-world-cup-final-stats-messi-mbappe-argentina-france",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "How Messis Stats Compare To Pele And Maradona 20230716 Wst 437729.html",
      "url": "https://worldsoccertalk.com/news/how-messis-stats-compare-to-pele-and-maradona-20230716-WST-437729.html",
      "domain": "worldsoccertalk.com",
      "type": "citation"
    },
    {
      "text": "2022 World Cup Stats Fifa Lionel Messi Ties Diego Maradona Pele Croatia Extra Heroics",
      "url": "https://www.espn.com/soccer/story/_/id/37634742/2022-world-cup-stats-fifa-lionel-messi-ties-diego-maradona-pele-croatia-extra-heroics",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Messi Ronaldo Greatest Of All Time Stats Comparison",
      "url": "https://time.com/6240741/messi-ronaldo-greatest-of-all-time-stats-comparison/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "28003",
      "url": "https://www.transfermarkt.us/lionel-messi/erfolge/spieler/28003",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Inter Miami S Lionel Messi Wins 2025 Mls Golden Boot Presented By Audi",
      "url": "https://www.mlssoccer.com/news/inter-miami-s-lionel-messi-wins-2025-mls-golden-boot-presented-by-audi",
      "domain": "mlssoccer.com",
      "type": "citation"
    },
    {
      "text": "0242 0e97e0ac1cb3 Eef786ff788c 1000 Lionel Messi What Records Does He Hold",
      "url": "https://www.uefa.com/uefachampionsleague/news/0242-0e97e0ac1cb3-eef786ff788c-1000--lionel-messi-what-records-does-he-hold/",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Fifa World Cup Records Milestones Argentina Appearances Assists Goals",
      "url": "https://www.fifa.com/en/tournaments/mens/worldcup/canadamexicousa2026/articles/lionel-messi-fifa-world-cup-records-milestones-argentina-appearances-assists-goals",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Inter Miami Mls Legacy",
      "url": "https://www.fifa.com/en/articles/lionel-messi-inter-miami-mls-legacy",
      "domain": "fifa.com",
      "type": "citation"
    },
    {
      "text": "Leo Messi",
      "url": "https://www.unicef.org/goodwill-ambassadors/leo-messi",
      "domain": "unicef.org",
      "type": "citation"
    },
    {
      "text": "All About Lionel Messi Siblings 8718189",
      "url": "https://people.com/all-about-lionel-messi-siblings-8718189",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Family",
      "url": "https://www.sportskeeda.com/football/lionel-messi-family",
      "domain": "sportskeeda.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Wife Antonela Roccuzzo Rcna117230",
      "url": "https://www.today.com/popculture/lionel-messi-wife-antonela-roccuzzo-rcna117230",
      "domain": "today.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Antonela Roccuzzo Wedding Rosario",
      "url": "https://www.cnn.com/2017/06/30/football/lionel-messi-antonela-roccuzzo-wedding-rosario",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "All About Lionel Messi Kids",
      "url": "https://people.com/parents/all-about-lionel-messi-kids/",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "Is Lionel Messi A Christian",
      "url": "https://www.christiandaily.com/news/is-lionel-messi-a-christian",
      "domain": "christiandaily.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Tattoos Meanings Designs Stories",
      "url": "https://www.si.com/soccer/lionel-messi-tattoos-meanings-designs-stories",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "14570.article",
      "url": "https://www.premierchristianity.com/opinion/it-was-god-who-made-me-play-like-this-the-christian-faith-of-lionel-messi/14570.article",
      "domain": "premierchristianity.com",
      "type": "citation"
    },
    {
      "text": "World Europe 40534761",
      "url": "https://www.bbc.com/news/world-europe-40534761",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Barcelona Prison 21 Months Tax Fraud",
      "url": "https://www.theguardian.com/football/2016/jul/06/lionel-messi-barcelona-prison-21-months-tax-fraud",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Tells Tax Trial I Didnt Know Anything",
      "url": "https://www.theguardian.com/football/2016/jun/02/lionel-messi-tells-tax-trial-i-didnt-know-anything",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Barcelona Lionel Messi Pay Fine Avoid 21 Month Prison Sentence Tax Fraud",
      "url": "https://www.espn.com/soccer/story/_/id/37525178/barcelona-lionel-messi-pay-fine-avoid-21-month-prison-sentence-tax-fraud",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Why Spanish Courts Convicted Leo Messi And Acquitted Xabi Alonso Of Tax Fraud.html",
      "url": "https://english.elpais.com/sports/2023-11-01/why-spanish-courts-convicted-leo-messi-and-acquitted-xabi-alonso-of-tax-fraud.html",
      "domain": "english.elpais.com",
      "type": "citation"
    },
    {
      "text": "Barcelona Messi Take Legal Action 555m Contract Leak",
      "url": "https://www.espn.com/soccer/story/_/id/37613516/barcelona-messi-take-legal-action-555m-contract-leak",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi 10m Ibiza Mega Villa Faces Demolished Illegal Construction Work.html",
      "url": "https://www.dailymail.co.uk/sport/football/article-15189897/Lionel-Messi-10m-Ibiza-mega-villa-faces-DEMOLISHED-illegal-construction-work.html",
      "domain": "dailymail.co.uk",
      "type": "citation"
    },
    {
      "text": "Messi Sued By Prime Over Ads With Rival Mas Hydration 1234873608",
      "url": "https://www.sportico.com/law/analysis/2025/messi-sued-by-prime-over-ads-with-rival-mas-hydration-1234873608/",
      "domain": "sportico.com",
      "type": "citation"
    },
    {
      "text": "Leo Messi Foundation",
      "url": "https://www.vallhebron.com/en/collaborate/collaborating-entities/leo-messi-foundation",
      "domain": "vallhebron.com",
      "type": "citation"
    },
    {
      "text": "Fundacion Leo Messi",
      "url": "https://messi.com/en/fundacion-leo-messi/",
      "domain": "messi.com",
      "type": "citation"
    },
    {
      "text": "Leo Messi Foundation",
      "url": "https://www.borgenmagazine.com/leo-messi-foundation/",
      "domain": "borgenmagazine.com",
      "type": "citation"
    },
    {
      "text": "Jordi Cardoner And Leo Messi Attend Groundbreaking Of Sjd Pediatric Cancer Center In Barcelona",
      "url": "https://www.fcbarcelona.com/en/news/886906/jordi-cardoner-and-leo-messi-attend-groundbreaking-of-sjd-pediatric-cancer-center-in-barcelona",
      "domain": "fcbarcelona.com",
      "type": "citation"
    },
    {
      "text": "Fjc Fmessi",
      "url": "https://fcarreras.org/en/news/fjc-fmessi/",
      "domain": "fcarreras.org",
      "type": "citation"
    },
    {
      "text": "114473",
      "url": "https://oncodaily.com/insight/114473",
      "domain": "oncodaily.com",
      "type": "citation"
    },
    {
      "text": "Messi Foundation Supports Building 14 Health Posts In Nepal",
      "url": "https://myrepublica.nagariknetwork.com/news/messi-foundation-supports-building-14-health-posts-in-nepal",
      "domain": "myrepublica.nagariknetwork.com",
      "type": "citation"
    },
    {
      "text": "Leo Messi Foundation Helps Unicef Get Syrian Children Back Classroom",
      "url": "https://www.unicef.org/press-releases/leo-messi-foundation-helps-unicef-get-syrian-children-back-classroom",
      "domain": "unicef.org",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Isnt Just A Good Player Hes Also A Good Human",
      "url": "https://themedialine.org/mideast-mindset/lionel-messi-isnt-just-a-good-player-hes-also-a-good-human/",
      "domain": "themedialine.org",
      "type": "citation"
    },
    {
      "text": "Oh7oasuijk8814mjcfrpa9v74",
      "url": "https://www.goal.com/en-us/news/lionel-messi-philanthropy-charities-barcelona-giving-money/oh7oasuijk8814mjcfrpa9v74",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "5ea9bcd846163fd83b8b45c0.html",
      "url": "https://www.marca.com/en/football/barcelona/2020/04/29/5ea9bcd846163fd83b8b45c0.html",
      "domain": "marca.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi",
      "url": "https://www.forbes.com/profile/lionel-messi/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Inter Miami Contract Extension 1234874614",
      "url": "https://www.sportico.com/personalities/athletes/2025/lionel-messi-inter-miami-contract-extension-1234874614/",
      "domain": "sportico.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Earns 205m Best Paid Mls Second Year",
      "url": "https://www.espn.com/soccer/story/_/id/45580966/lionel-messi-earns-205m-best-paid-mls-second-year",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi S Business Ventures Net Worth And Close Bond With His Wife Antonela Roccuzzo",
      "url": "https://www.bbntimes.com/financial/lionel-messi-s-business-ventures-net-worth-and-close-bond-with-his-wife-antonela-roccuzzo",
      "domain": "bbntimes.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Net Worth In 2025updated Salary Endorsements Business Ventures More",
      "url": "https://tradebrains.in/lionel-messi-net-worth-in-2025updated-salary-endorsements-business-ventures-more/",
      "domain": "tradebrains.in",
      "type": "citation"
    },
    {
      "text": "Pitch Plate World Cup Winner 230115982.html",
      "url": "https://finance.yahoo.com/news/pitch-plate-world-cup-winner-230115982.html",
      "domain": "finance.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Net Worth",
      "url": "https://www.celebritynetworth.com/richest-athletes/richest-soccer/lionel-messi-net-worth/",
      "domain": "celebritynetworth.com",
      "type": "citation"
    },
    {
      "text": "28003",
      "url": "https://www.transfermarkt.com/lionel-messi/leistungsdaten/spieler/28003",
      "domain": "transfermarkt.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi",
      "url": "https://www.espn.com/soccer/player/stats/_/id/45843/lionel-messi",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi",
      "url": "https://en.wikipedia.org/wiki/Lionel_Messi",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "List Of International Goals Scored By Lionel Messi",
      "url": "https://en.wikipedia.org/wiki/List_of_international_goals_scored_by_Lionel_Messi",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Angola Vs Argentina Live 2025 International Friendly",
      "url": "https://bolavip.com/en/soccer/angola-vs-argentina-live-2025-international-friendly",
      "domain": "bolavip.com",
      "type": "citation"
    },
    {
      "text": "How Many Trophies Does Lionel Messi Have Breakdown Career Titles",
      "url": "https://www.si.com/soccer/how-many-trophies-does-lionel-messi-have-breakdown-career-titles",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Get Ca 2021 Eng.pdf",
      "url": "https://cdn.conmebol.com/wp-content/uploads/2025/02/GET_CA_2021_ENG.pdf",
      "domain": "cdn.conmebol.com",
      "type": "citation"
    },
    {
      "text": "0276 1549531afce1 16d40688390d 1000 Argentina S Lionel Messi Named Official Finalissima Play",
      "url": "https://www.uefa.com/finalissima/news/0276-1549531afce1-16d40688390d-1000--argentina-s-lionel-messi-named-official-finalissima-play/",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "Argentina Es Bicampeon De La Conmebol Copa America",
      "url": "https://www.conmebol.com/noticias/argentina-es-bicampeon-de-la-conmebol-copa-america/",
      "domain": "conmebol.com",
      "type": "citation"
    },
    {
      "text": "Lionel Messi Argentina",
      "url": "https://www.fifa.com/en/tournaments/mens/worldcup/articles/lionel-messi-argentina",
      "domain": "fifa.com",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:14:12.657147",
  "elapsed_ms": 5596
}