{
  "topic": "Liverpool FC",
  "title": "Liverpool F.C.",
  "slug": "liverpool-fc",
  "grokipedia_slug": "Liverpool_F.C.",
  "grokipedia_url": "https://grokipedia.com/page/Liverpool_F.C.",
  "source": "grokipedia",
  "content": "# Liverpool F.C.\n\nLiverpool Football Club is a professional association football club based in Liverpool, England, that competes in the Premier League, the top tier of the English football league system, and plays home matches at Anfield stadium. Founded in 1892 after a split from Everton over control of Anfield, the club has established itself as one of the most successful in football history through sustained competitive excellence driven by effective management, tactical innovation, and player development. With 20 top-flight league titles, including the most recent under manager Arne Slot in the 2024–25 season, and a record six UEFA Champions League triumphs for an English club, Liverpool's achievements reflect a pattern of dominance in both domestic and European competitions.\nThe club's identity is inseparable from its fervent supporter base, encapsulated in the anthem \"You'll Never Walk Alone,\" which originated from the 1945 musical Carousel and has fostered a unique communal resilience amid triumphs and setbacks. Liverpool's legacy includes transformative eras under managers like Bill Shankly, who revolutionized the club's approach in the 1960s, and Bob Paisley, overseeing four league titles and three European Cups in the 1970s and 1980s. Defining tragedies, such as the 1985 Heysel Stadium disaster leading to a five-year European ban and the 1989 Hillsborough disaster where 97 fans died due to police and stadium failures later confirmed by independent inquiries, have shaped the club's advocacy for justice and safety reforms, underscoring causal links between institutional negligence and fan tragedies rather than inherent fan culpability as initially portrayed by some media. Recent resurgence under Jürgen Klopp from 2015 to 2024 added a Premier League title, another Champions League, and multiple domestic cups, emphasizing high-pressing tactics and squad depth before transitioning to Slot's tenure.\n## History\n\n### Founding and early years (1892–1959)\n\nLiverpool Football Club was established in March 1892 by local businessman and brewer John Houlding after a acrimonious split from Everton F.C., which stemmed from disagreements over rent payments and governance at Anfield, the stadium Houlding owned. Everton, seeking independence, relocated to Goodison Park later that year, leaving Anfield vacant and prompting Houlding to form a new professional team to occupy the ground and generate revenue. The club initially competed in the Lancashire League, winning the title in their debut 1892–93 season with 22 wins from 22 matches.\n\nElected to the Football League Second Division for the 1893–94 campaign, Liverpool finished top and earned promotion to the First Division via a 2–0 test match victory over Newton Heath (later Manchester United). Relegation followed swiftly in 1894–95 after a 0–1 test match loss to Bury, returning the club to the Second Division. Scottish manager Tom Watson, previously successful at Sunderland, took charge in August 1896 and rebuilt the squad, leading to sustained competitiveness.\n\nUnder Watson, Liverpool secured their first Football League First Division title in 1900–01, finishing two points ahead of Sunderland, before adding a second in 1905–06 after promotion from the Second Division. Watson's tenure, lasting until 1915, established Anfield as a formidable venue, with attendances growing significantly; the club drew over 40,000 for key matches by the early 1900s.\n\nThe inter-war period brought mixed fortunes. After mid-table consistency, Liverpool won consecutive First Division championships in 1921–22 and 1922–23 under managers David Ashworth and Matt McQueen, respectively. However, defensive frailties led to relegation in 1923–24, with the team finishing second-bottom. Promotion returned in 1930 as Second Division runners-up, but the club languished in lower mid-table thereafter, appointing George Kay as manager in 1936 to stabilize operations.\n\nKay guided Liverpool to the 1946–47 First Division title in the first full post-Second World War season, edging Manchester United by two points amid regional league disruptions during the conflict. Yet, form declined sharply in the early 1950s due to aging squads and tactical stagnation, culminating in bottom-place finish and relegation in 1953–54. In the Second Division from 1954–55, the club hovered around promotion spots but endured inconsistent results under managers Don Welsh and Phil Taylor, missing out in 1959 amid boardroom interference and failure to modernize scouting.\n\n### Bill Shankly era (1960–1974)\n\nBill Shankly assumed management of Liverpool F.C. on 1 December 1959, inheriting a Second Division side that had languished outside the top flight since 1954. He immediately implemented rigorous training regimens emphasizing fitness and tactical discipline, while fostering a strong club culture through direct engagement with supporters and staff. Shankly demanded unwavering commitment from his players, famously stating: \"For a player to be good enough to play for Liverpool, he must be prepared to run through a brick wall for me then come out fighting on the other side.\" Key early signings included forward Ian St John from Motherwell in 1961 for £37,500 and centre-back Ron Yeats from Dundee United for £30,000, bolstering the squad alongside promoted youth talents like Roger Hunt and Ian Callaghan.\n\nUnder Shankly, Liverpool secured promotion as Second Division champions in the 1961–62 season, amassing 63 points from 42 matches. Returning to the First Division in 1962–63, they finished seventh, marking a transitional year. The following season, 1963–64, brought their first league title in 17 years with 61 points and a goal difference of +51, edging out Manchester United by four points. Shankly's high-pressing style and emphasis on collective play transformed the team into title contenders.\n\n| Season    | Division      | Position | W-D-L      | Points |\n|-----------|---------------|----------|------------|--------|\n| 1960–61  | Second       | 3rd     | 23-11-10  | 57    |\n| 1961–62  | Second       | 1st     | 25-13-4   | 63    |\n| 1962–63  | First        | 7th     | 18-10-14  | 46    |\n| 1963–64  | First        | 1st     | 25-11-6   | 61    |\n| 1964–65  | First        | 7th     | 19-9-14   | 47    |\n| 1965–66  | First        | 1st     | 24-9-9    | 57    |\n| 1966–67  | First        | 5th     | 21-11-10  | 53    |\n| 1967–68  | First        | 6th     | 19-10-13  | 48    |\n| 1968–69  | First        | 2nd     | 24-9-9    | 57    |\n| 1969–70  | First        | 5th     | 19-13-10  | 51    |\n| 1970–71  | First        | 5th     | 16-15-11  | 47    |\n| 1971–72  | First        | 5th     | 18-12-12  | 48    |\n| 1972–73  | First        | 1st     | 25-10-7   | 60    |\n| 1973–74  | First        | 2nd     | 24-9-9    | 57    |\n\n| Competition       | Seasons Won                          | Number |\n|-------------------|--------------------------------------|--------|\n| Second Division   | 1961–62                              | 1      |\n| First Division    | 1963–64, 1965–66, 1972–73            | 3      |\n| FA Cup            | 1964–65, 1973–74                     | 2      |\n| UEFA Cup          | 1972–73                              | 1      |\n\nLiverpool claimed their second First Division title in 1965–66, finishing two points ahead of Leeds United with 57 points. That year also saw their first FA Cup victory, defeating Leeds United 2–1 in the final on 1 May 1965 after extra time, ending a 73-year wait for major domestic cup success. Shankly supplemented the squad with astute acquisitions like Emlyn Hughes from Blackpool in 1971 and Kevin Keegan from Scunthorpe United in 1971 for £35,000, enhancing midfield dynamism and scoring prowess.\n\nIn Europe, Liverpool qualified for the Inter-Cities Fairs Cup in 1964–65 but were eliminated early; sustained progress came later. The 1972–73 season yielded a third league championship with 60 points and Liverpool's inaugural European trophy, the UEFA Cup, won 3–2 on aggregate against Borussia Mönchengladbach—3–0 at Anfield on 23 May 1973 followed by a 0–2 away loss. Shankly's \"boot room\" coaching staff, including Bob Paisley, honed a passing-based system rooted in physical conditioning, laying the groundwork for prolonged dominance.\n\nShankly retired unexpectedly on 12 July 1974, shortly after securing the FA Cup with a 3–2 victory over Newcastle United on 4 May 1974, Liverpool's second such triumph under his tenure. Over 783 matches, his record stood at 407 wins, 147 draws, and 229 losses, with a win percentage of 52%. His era elevated Liverpool from mediocrity to a powerhouse, instilling a philosophy that football's simplicity demanded total commitment, as he famously stated: \"The socialism I believe in is not the beginning of a destructive rampage and the seizing of private property; but the socialism I believe in is the socialism of the boot room.\"\n### Bob Paisley era (1974–1983)\n\nBob Paisley succeeded Bill Shankly as Liverpool manager on 26 July 1974, initially as a reluctant replacement but quickly establishing continuity in the club's playing style and Boot Room philosophy.  His tenure saw Liverpool secure 20 major trophies across nine seasons, including six First Division titles in 1975–76, 1976–77, 1978–79, 1979–80, 1981–82, and 1982–83. \n\n| Season   | Division        | Position | W-D-L   | Points |\n|----------|-----------------|----------|---------|--------|\n| 1974–75  | First Division  | 2nd      | 20-14-8 | 54     |\n| 1975–76  | First Division  | 1st      | 25-12-5 | 62     |\n| 1976–77  | First Division  | 1st      | 20-16-6 | 56     |\n| 1977–78  | First Division  | 2nd      | 21-14-7 | 56     |\n| 1978–79  | First Division  | 1st      | 24-12-6 | 60     |\n| 1979–80  | First Division  | 1st      | 25-10-7 | 60     |\n| 1980–81  | First Division  | 8th      | 17-11-14| 45     |\n| 1981–82  | First Division  | 1st      | 23-10-9 | 79     |\n| 1982–83  | First Division  | 1st      | 24-10-8 | 82     |\n\n| Competition          | Seasons Won                                                                 | Number |\n|----------------------|-----------------------------------------------------------------------------|--------|\n| First Division       | 1975–76, 1976–77, 1978–79, 1979–80, 1981–82, 1982–83                       | 6      |\n| European Cup         | 1976–77, 1977–78, 1980–81                                                  | 3      |\n| UEFA Cup             | 1975–76                                                                    | 1      |\n| Football League Cup  | 1980–81, 1981–82, 1982–83                                                  | 3      |\n| UEFA Super Cup       | 1977                                                                       | 1      |\n| FA Charity Shield    | 1976, 1977, 1979, 1980, 1982, 1983                                        | 6      |\n| **Total**            |                                                                            | **20** |\n\nThe team emphasized a fluid pass-and-move system within a 4–4–2 formation, prioritizing quick transitions, high pressing, and collective defending over rigid tactics.\n\nPaisley's first major honor came in the 1975–76 season with victory in the UEFA Cup, defeating Club Brugge 4–3 on aggregate in the final after extra time in the second leg on 21 April 1976. Domestic dominance followed, with back-to-back league titles in 1976 and 1977, the latter accompanied by the FA Charity Shield after a 7–0 win over Manchester United on 8 August 1977. Key to this success was the signing of Kenny Dalglish from Celtic on 10 August 1977 for a British transfer record £440,000, who integrated seamlessly into the forward line alongside Kevin Keegan before the latter's departure to Hamburg in 1977.\n\nEuropean triumphs defined the era's peak, beginning with the 1977 European Cup final on 25 May in Rome, where Liverpool beat Borussia Mönchengladbach 3–1 with goals from McDermott, Smith, and Neal. The following year, on 10 May 1978 at Wembley, a 1–0 victory over Club Brugge via a Kenny Dalglish header secured retention of the trophy. Liverpool added the European Super Cup in 1977 and reached a third final in 1981, defeating Real Madrid 1–0 on 27 May in Paris through an Alan Kennedy goal, marking Paisley's third European Cup win and equaling the feats of only a few managers historically. \n\nFurther domestic silverware included three consecutive League Cup victories: 1981 against West Ham United (2–1 on 24 March), 1982 over Manchester City (3–1 aggregate), and 1983 versus Manchester United (2–1 on 26 March), the last of which was Paisley's final Wembley appearance.  The 1978–79 and 1979–80 league titles featured notable points tallies of 60 each under the two-points-for-a-win system, while the 1981–82 and 1982–83 successes involved intense title races against Ipswich Town and Watford. Core players like Ray Clemence, Phil Neal, Emlyn Hughes, Graeme Souness (signed 1978), and Alan Hansen formed a robust squad blending Shankly-era veterans with strategic acquisitions.\n\nPaisley announced his retirement on 6 January 1983, citing health concerns and a desire for more family time at age 64, after guiding Liverpool to the league title in his final season on 3 May 1983 with a 4–1 win over Tottenham Hotspur.  He handed over to assistant Joe Fagan, maintaining the Boot Room succession and leaving the club at its zenith with an unbeaten league run of 44 matches from November 1978 to April 1980. Paisley's win ratio of 61% across 535 matches underscored his tactical acumen and man-management, transforming Liverpool into Europe's preeminent force through pragmatic evolution rather than revolution.\n### Joe Fagan era (1983–1985)\n\nJoe Fagan succeeded Bob Paisley as manager in May 1983, stepping up from his role as long-serving assistant coach and Boot Room member to preserve the club's established pass-and-move tactics and squad cohesion without major disruptions. \n\nFagan's inaugural 1983–84 season delivered Liverpool's first-ever treble of major trophies: the First Division title with 80 points, the League Cup via a 1–0 win over Everton in the final on 28 March 1984, and the European Cup after defeating Roma 4–2 on penalties following a 1–1 draw in the final on 29 May 1984 in Rome. \n\n| Season   | Division        | Position | W-D-L   | Points |\n|----------|-----------------|----------|---------|--------|\n| 1983–84  | First Division  | 1st      | 22-14-6 | 80     |\n| 1984–85  | First Division  | 1st      | 22-11-9 | 77     |\n\n| Competition       | Seasons Won          | Number |\n|-------------------|----------------------|--------|\n| First Division    | 1983–84, 1984–85    | 2      |\n| League Cup        | 1983–84             | 1      |\n| European Cup      | 1983–84             | 1      |\n| **Total**         |                     | **4** |\n\nThe subsequent 1984–85 campaign saw early promise with strong league form, but it was marred by the Heysel Stadium disaster during the European Cup final loss to Juventus on 29 May 1985, prompting Fagan's retirement announcement shortly thereafter at age 64, citing personal toll and desire to step aside amid the tragedy's aftermath. His tenure maintained Liverpool's dominance with a high win ratio, leveraging the core squad including Dalglish, Souness, and Hansen, and solidified the Boot Room's legacy of internal progression.\n### 1980s: European dominance and disasters\n\nLiverpool's European campaign in the 1980–81 season culminated in a 1–0 victory over Real Madrid in the European Cup final on 27 May 1981 at the Parc des Princes stadium in Paris, with Alan Kennedy scoring the decisive goal in the 82nd minute. This triumph marked the club's third European Cup win and extended their dominance in the competition during the early 1980s.\n\nBob Paisley retired as manager in June 1983 after securing six league titles and three European Cups during his tenure. Joe Fagan, a long-serving coach at the club, succeeded him and guided Liverpool to an unprecedented treble in the 1983–84 season: the First Division title with 82 points, the Football League Cup via a 1–0 win over Everton in the final on 28 March 1984, and the European Cup after defeating Roma 4–2 in a penalty shootout following a 1–1 draw in the final on 29 May 1984 at the Stadio Olimpico in Rome.  These achievements underscored Liverpool's peak in European and domestic competitions, with the club amassing 16 major trophies under Paisley and Fagan combined by mid-decade.\n\nThe 1984–85 European Cup final against Juventus on 29 May 1985 at Heysel Stadium in Brussels descended into tragedy before kick-off, when a surge by Liverpool supporters into an adjacent section occupied mainly by Juventus fans caused a perimeter wall to collapse, killing 39 people—predominantly Juventus supporters—and injuring hundreds more.  The match proceeded amid the chaos, ending in a 1–0 Liverpool win via a 10th-minute penalty by Phil Neal, but UEFA responded by banning all English clubs from European competitions for five years, extending Liverpool's exclusion to six years. Fagan retired days later, and Kenny Dalglish assumed the role of player-manager on 29 May 1985.\n\nThe ban curtailed Liverpool's European participation until 1991, shifting focus to domestic competitions under Dalglish. A second catastrophe struck on 15 April 1989 at the FA Cup semi-final against Nottingham Forest at Hillsborough Stadium in Sheffield, where 97 Liverpool fans died in a crush at the Leppings Lane end due to severe overcrowding in the central pens, triggered by police opening an exit gate to alleviate congestion outside without redirecting flows adequately.  Official inquiries, including the 1990 Taylor Report and a 2016 inquest, attributed the unlawful killings to gross negligence by South Yorkshire Police and ambulance services, rejecting initial claims of fan misconduct as the primary cause.  The match was abandoned, replayed on 7 May 1989 at Old Trafford (Liverpool winning 3–2 in extra time), and the club proceeded to defeat Everton 3–2 in the final on 20 May 1989 to claim the FA Cup.\n\n### Kenny Dalglish era (1985–1991)\n\nKenny Dalglish was appointed Liverpool's first player-manager on 29 May 1985 following Joe Fagan's retirement in the wake of the Heysel disaster. Over his tenure until 22 February 1991, he guided the club to three First Division titles (1985–86, 1987–88, 1989–90) and two FA Cups (1986, 1989) amid the ongoing European ban, achieving the highest managerial winning percentage in club history at 60.91%.\n\n| Season   | Division       | Position | W-D-L   | Points |\n|----------|----------------|----------|---------|--------|\n| 1985–86 | First Division | 1st      | 26-10-6 | 88     |\n| 1986–87 | First Division | 2nd      | 22-11-9 | 77     |\n| 1987–88 | First Division | 1st      | 26-12-2 | 90     |\n| 1988–89 | First Division | 2nd      | 22-10-6 | 76     |\n| 1989–90 | First Division | 1st      | 23-10-5 | 79     |\n| 1990–91 | First Division | 2nd      | 22-11-5 | 77     |\n\n| Season   | Competition     | Result    |\n|----------|-----------------|-----------|\n| 1985–86  | First Division  | Champions |\n| 1985–86  | FA Cup          | Winners   |\n| 1987–88  | First Division  | Champions |\n| 1988–89  | FA Cup          | Winners   |\n| 1989–90  | First Division  | Champions |\n\nDalglish made key signings to sustain competitiveness and provided crucial leadership in the recovery following the Hillsborough disaster, supporting bereaved families and the wider community despite the profound emotional strain. He resigned abruptly in 1991, later attributing the decision primarily to the cumulative stress from Hillsborough.\n### Decline and partial revivals (1990–2014)\n\nFollowing Kenny Dalglish's resignation as manager in February 1991, amid personal stress exacerbated by the aftermath of the Hillsborough disaster, Graeme Souness assumed the role of player-manager. Souness inherited an aging squad that had secured Liverpool's last league title in 1989–90 but struggled to regenerate effectively; his recruitment focused on experienced players like Ronny Rosenthal and Mark Walters, yet yielded inconsistent results. The team won the FA Cup in 1992, defeating Sunderland 2–0 in the final on May 9 at Wembley Stadium, but league performances faltered, with sixth-place finishes in both the 1991–92 First Division and the inaugural 1992–93 Premier League seasons, accumulating 57 and 62 points respectively. Souness resigned in January 1994 following heart surgery and a run of poor form, including a 15th-place standing midway through the 1992–93 campaign, marking the onset of a prolonged decline characterized by inadequate squad rejuvenation and failure to match rivals' investments in the emerging Premier League era.\n\nRoy Evans succeeded Souness as manager from January 1994 to November 1998, overseeing 226 matches with a 54% win rate but only one major trophy: the League Cup in 1995, won 2–1 against Bolton Wanderers on April 2. Under Evans, Liverpool achieved sporadic top-four finishes, such as fourth in 1994–95 (73 points) and 1996–97 (70 points), but languished outside title contention, ending seventh in 1995–96 and 1997–98, as the club adhered to conservative financial policies while competitors like Manchester United capitalized on Sky TV revenues for aggressive signings.  Evans' pass-and-move style produced entertaining football but exposed defensive frailties and recruitment shortcomings, such as over-reliance on players like Robbie Fowler and Jamie Redknapp without sufficient depth.\n\nIn July 1998, Gérard Houllier was appointed as joint manager with Evans, assuming sole control by November after Evans' departure; Houllier modernized training facilities, nutrition, and scouting, drawing on continental methods. His tenure yielded a treble in 2000–01: the League Cup (2–1 vs. Chelsea on February 25), FA Cup (2–1 vs. Arsenal after extra time on May 12), and UEFA Cup (5–4 aggregate vs. Alavés, including a 5–1 second-leg thriller on May 16). Liverpool finished third in the 2000–01 Premier League with 80 points and second the following season with 83 points, but subsequent inconsistency—fifth in 2002–03 and fourth in 2003–04—stemmed from injuries and failure to secure a consistent goalscorer beyond Michael Owen, who departed for Real Madrid in 2004. Houllier departed in 2004 after heart issues, having won five trophies but unable to end the league drought amid rising competition.\n\nRafael Benítez replaced Houllier in June 2004, prioritizing defensive organization and European competition; despite inheriting a squad ill-suited to his tactics, he guided Liverpool to the 2005 UEFA Champions League title, overcoming AC Milan 3–3 (4–2 on penalties) in the Istanbul final on May 25 after trailing 3–0 at halftime, with goals from Steven Gerrard, Vladimír Šmicer, and Xabi Alonso. Additional honors included the FA Cup in 2006 (3–1 vs. West Ham United on May 13) and UEFA Super Cups in 2001 and 2005, alongside a runner-up Premier League finish in 2008–09 (86 points). However, domestic inconsistencies persisted, with seventh in 2009–10, exacerbated by ownership turmoil: the 2007 leveraged buyout by Americans Tom Hicks and George Gillett saddled the club with £350 million in debt by 2010, limiting transfer activity and fueling boardroom conflicts that undermined Benítez's position. Benítez left in June 2010 after 350 matches.\n\nSubsequent instability defined the early 2010s: Roy Hodgson managed only six months in 2010, resigning after a 6th-place finish amid fan unrest. Kenny Dalglish returned as interim manager in January 2011, securing the League Cup in 2012 (2–1 vs. Cardiff City on February 26, with a 3–2 extra-time semifinal win over Manchester City) but recording an eighth-place league finish, leading to his full-time dismissal. Brendan Rodgers took charge in June 2012, implementing high-pressing tactics that propelled Liverpool to second in 2013–14 with 84 points—edging Manchester City on goal difference until a late-season slip—but no trophies, as Gerrard's infamous slip against Chelsea on April 27 proved pivotal. Fenway Sports Group's acquisition in October 2010 stabilized finances, yet the era underscored persistent challenges in converting European pedigree and near-misses into sustained domestic dominance, rooted in earlier recruitment failures and structural inertia.\n\n| Competition              | Season    | Manager             |\n|--------------------------|-----------|---------------------|\n| FA Cup                   | 1991–92  | Graeme Souness     |\n| League Cup               | 1994–95  | Roy Evans          |\n| League Cup               | 2000–01  | Gérard Houllier    |\n| FA Cup                   | 2000–01  | Gérard Houllier    |\n| UEFA Cup                 | 2000–01  | Gérard Houllier    |\n| UEFA Champions League    | 2004–05  | Rafael Benítez     |\n| FA Cup                   | 2005–06  | Rafael Benítez     |\n| League Cup               | 2011–12  | Kenny Dalglish     |\n### Jürgen Klopp era (2015–2024)\n\nJürgen Klopp was appointed Liverpool manager on 8 October 2015, signing a three-year contract worth approximately £15 million to replace Brendan Rodgers, who had been dismissed after a poor start to the season.  Klopp introduced a high-intensity gegenpressing tactical system, emphasizing rapid ball recovery and counter-pressing, which transformed the team's defensive structure and attacking transitions over time. In his first partial season (2015–16), Liverpool finished eighth in the Premier League with 60 points, reaching the League Cup final but losing on penalties to Manchester City.\n\n| Season   | Division        | Position | W-D-L   | Points |\n|----------|-----------------|----------|---------|--------|\n| 2015–16  | Premier League  | 8th      | 16-12-10| 60     |\n| 2016–17  | Premier League  | 4th      | 22-10-6 | 76     |\n| 2017–18  | Premier League  | 4th      | 21-12-5 | 75     |\n| 2018–19  | Premier League  | 2nd      | 30-7-1  | 97     |\n| 2019–20  | Premier League  | 1st      | 32-3-3  | 99     |\n| 2020–21  | Premier League  | 3rd      | 20-9-9  | 69     |\n| 2021–22  | Premier League  | 2nd      | 28-8-2  | 92     |\n| 2022–23  | Premier League  | 5th      | 19-10-9 | 67     |\n| 2023–24  | Premier League  | 3rd      | 24-10-4 | 82     |\n\nKlopp oversaw significant squad rebuilding, with key signings including Sadio Mané from Southampton for £30 million in June 2016, Mohamed Salah from Roma for £36.9 million in June 2017, Virgil van Dijk from Southampton for a then-world record £75 million for a defender in January 2018, and goalkeeper Alisson from Roma for £66.8 million in July 2018. These additions formed the core of a potent front three with Roberto Firmino and later helped stabilize the defense, contributing to improved league positions: fourth in 2016–17 (76 points) and 2017–18 (75 points). In 2017–18, Liverpool qualified for the Champions League and reached the final, defeating Roma 7–6 on aggregate in the semi-finals but losing 3–1 to Real Madrid in Kyiv amid concerns over Loris Karius's errors in goal.\n\nThe 2018–19 season marked a breakthrough, as Liverpool won the UEFA Champions League, beating Tottenham Hotspur 2–0 in the Madrid final on 1 June 2019, with goals from Mohamed Salah and Divock Origi; this was the club's sixth European Cup and first major trophy under Klopp. They also finished second in the Premier League with 97 points, one behind Manchester City. The following year, 2019–20, Liverpool ended a 30-year wait for the English top-flight title, clinching it on 25 June 2020 with seven games remaining, amassing 99 points and a 18-point lead over Manchester City. Additional honors included the UEFA Super Cup (5–4 on penalties vs. Chelsea, August 2019), FIFA Club World Cup (1–0 vs. Flamengo, December 2019), and Community Shield (via penalties vs. Manchester City, August 2019).\n\n| Competition              | Year(s)     |\n|--------------------------|-------------|\n| UEFA Champions League    | 2018–19    |\n| Premier League           | 2019–20    |\n| UEFA Super Cup           | 2019       |\n| FIFA Club World Cup      | 2019       |\n| Community Shield         | 2019       |\n| FA Cup                   | 2021–22    |\n| EFL Cup                  | 2021–22, 2023–24 |\n\nSubsequent seasons saw mixed results amid fixture congestion and injuries. Liverpool finished third in 2020–21 (69 points) but suffered a Champions League round-of-16 exit to Real Madrid. In 2021–22, they secured a domestic cup double with the FA Cup (victory over Chelsea on penalties, May 2022) and League Cup (0–0 vs. Chelsea, winning on penalties after extra time), while finishing second in the Premier League (92 points) and reaching the Champions League final, losing 1–0 to Real Madrid. The 2022–23 campaign yielded fifth place (67 points), missing Champions League qualification due to Manchester City's dominance and Liverpool's defensive vulnerabilities, exacerbated by midfield transitions. Recovery in 2023–24 brought third place (82 points) and a second League Cup win (1–0 vs. Chelsea, February 2024), but Klopp announced his departure on 26 January 2024, citing energy depletion after nine years, with his final match a 2–0 win over Wolverhampton Wanderers on 19 May 2024.  Overall, Klopp's tenure delivered 331 wins from 491 matches (67.4% win rate), one Premier League title, one Champions League, one FA Cup, two League Cups, and international cups, revitalizing the club commercially and competitively while investing over £800 million in transfers balanced by sales.\n### Arne Slot era (2024–present)\n\nArne Slot was appointed Liverpool's head coach on 1 June 2024, succeeding Jürgen Klopp following the conclusion of the 2023–24 season, under a three-year contract. Slot, previously manager of Feyenoord, where he secured the Eredivisie title in 2022–23, inherited a squad that had finished third in the Premier League the prior year but showed signs of fatigue after nearly a decade under Klopp. His arrival marked a shift toward a more possession-dominant style emphasizing structured build-up play, while retaining elements of high pressing.\n\n| Season   | Competition    | Result     |\n|----------|----------------|------------|\n| 2024–25  | Premier League | Champions |\n\n| Season   | Competition    | Position                  | Wins | Draws | Losses | Points |\n|----------|----------------|---------------------------|------|-------|--------|--------|\n| 2024–25 | Premier League | 1st | 25 | 9 | 4 | 84 |\n| 2025–26 | Premier League | 4th (as of 25 October 2025, ongoing) |      |       |        |        |\n\nIn the 2024–25 Premier League season, Slot guided Liverpool to the title, their second in the competition's history and 20th overall English top-flight championship, clinched on 27 April 2025 via a 5–1 home win against Tottenham Hotspur. The team recorded 25 wins, 9 draws, and 4 losses, totaling 84 points and finishing first, with notable contributions from forwards Mohamed Salah and Darwin Núñez, alongside defensive solidity from Virgil van Dijk. Key early results included a 2–0 away victory over Ipswich Town on 17 August 2024 and consistent performances that propelled them ahead of rivals like Manchester City. This success validated Slot's tactical adjustments, including improved midfield control through players like Alexis Mac Allister, despite minimal major incoming transfers beyond squad depth additions.\n\nThe 2025–26 season, as defending champions, opened strongly with multiple narrow victories, including late winners in the initial competitive fixtures such as a 4–2 home win over Bournemouth featuring a goal from Federico Chiesa. However, by mid-October 2025, Liverpool encountered a downturn, enduring four consecutive defeats across competitions, which intensified scrutiny on Slot's management and prompted demands for greater personal accountability from the coach. Slot's public comments criticizing opponents like Manchester United for defensive tactics drew rebuttals and further highlighted tensions amid the slump. As of 25 October 2025, the team occupied fourth place in the Premier League table, with ongoing challenges in adapting to varied defensive strategies employed by rivals, including long-ball approaches.\n## Club identity\n\n### Colours, kits, and sponsors\n\nLiverpool F.C.'s traditional home kit colour is red, which has defined the club's identity since the adoption of red shirts in 1894, aligning with Liverpool city's historic colour two years after the club's founding. The inaugural 1892 kit featured blue and white quartered shirts, reflecting the influence of the split from Everton F.C., but the switch to red solidified the all-red home strip—jersey, shorts, and socks—earning the team the nickname \"The Reds\". Away kits have historically favoured white to avoid clashes, though variations include green with navy and white sash in 1999–2000 and off-white stone with teal in 2021–22.\n\nThe club has partnered with multiple kit manufacturers over its history, prioritizing design consistency with the red palette while incorporating modern materials and branding. Umbro supplied kits from the 1970s until 1985, followed by Adidas from 1985 to 1996, Reebok from 1996 to 2006, and Adidas again from 2006 to 2012. Warrior held the contract from 2012 to 2015, New Balance from 2015 to 2020, and Nike from 2020 to 2025. Adidas resumed as supplier starting August 1, 2025, for the 2025–26 season, producing the home kit in a lighter \"Strawberry Red\" with white accents and the away kit in a contrasting design.\n\nShirt sponsorship commenced in 1979 with Hitachi until 1982, coinciding with the club's European successes and marking one of English football's early commercial deals. Crown Paints followed from 1982 to 1988, Candy from 1988 to 1992, and Carlsberg from 1992 to 2010, the latter spanning 18 years and associating with multiple trophy wins. Standard Chartered has served as principal sponsor since 2010, with the agreement extended to 2027, appearing centrally on kits alongside sleeve sponsor Expedia. These partnerships have generated significant revenue, supporting club operations without prior shirt logos before 1979 due to Football League restrictions.\n\n| Period       | Shirt Sponsor      | Kit Manufacturer |\n|--------------|--------------------|------------------|\n| 1979–1982   | Hitachi           | Umbro           |\n| 1982–1988   | Crown Paints      | Umbro/Adidas    |\n| 1988–1992   | Candy             | Adidas          |\n| 1992–2010   | Carlsberg         | Adidas/Reebok   |\n| 2010–2027   | Standard Chartered| Reebok/Adidas/Nike/Adidas |\n\n### Badge, crest, and symbols\n\nThe primary symbol of Liverpool F.C. is the Liver Bird, a mythical representation of a cormorant derived from the city's coat of arms, which was granted by the College of Arms on 22 March 1797 and features the bird holding a sprig of broom or seaweed. The club adopted the Liver Bird as its emblem around 1901, though it was not initially incorporated into match kits.\n\nThe first official club crest appeared in 1950, commissioned to mark Liverpool's participation in the FA Cup Final that year; it consisted of the Liver Bird encased in a red shield on the white away kit. Subsequent designs evolved, with a standalone Liver Bird used from 1968 to 1987. The modern crest was introduced in 1992 to commemorate the club's centenary, featuring the Liver Bird atop a red shield, the motto \"You'll Never Walk Alone\" in a green banner above—originating from the 1945 Rodgers and Hammerstein musical *Carousel* and embraced as the club's anthem following Gerry and the Pacemakers' 1963 hit recording—and \"EST 1892\" denoting the founding year below.\n\nEternal flames were incorporated into the crest in 1993, positioned on either side of the shield to honor the 96 supporters who perished in the Hillsborough disaster on 15 April 1989; this element was retained and symbolically updated to reflect 97 victims after the 2021 inquest confirmed the death of Andrew Devine as the 97th attributable to the tragedy. The crest's design elements, including the motto, echo the inscription on the Shankly Gates unveiled at Anfield on 2 August 1982.\n\nFor match kits, Liverpool has occasionally employed simplified variants, such as a monogrammed Liver Bird without the full crest, particularly following a 2024 update to facilitate embroidery while preserving the emblem's core identity. The full crest remains the official symbol used in club branding, merchandise, and stadium iconography.\n\n## Facilities\n\n### Anfield Stadium\n\nAnfield Stadium, located in the Anfield district of Liverpool, England, has been the home ground of Liverpool F.C. since the club's formation in 1892. The site was originally developed for Everton F.C., with the first match hosted on 27 September 1884, when Everton defeated Earlestown 5-0.   Everton vacated the ground in 1892 following a dispute over rent with landlord John Houlding, who then founded Liverpool F.C. to ensure continued use of the stadium. \n\nThe stadium's capacity has undergone significant expansions to accommodate growing attendances. The redevelopment of the Main Stand, announced in December 2014 and completed in September 2016 at a total cost of approximately £114 million, added approximately 8,500 seats, increasing overall capacity to 54,074.   The subsequent Anfield Road Stand project, which began in September 2021 and finished in 2024 at a cost of circa £100 million, incorporated 7,000 additional seats, elevating the total to 61,276 for the 2024-25 season.    As of 2025, no further expansions are planned, though revenue-enhancing modifications remain under consideration. \n\nKey historical capacity milestones are summarized below:\n\n| Year/Period | Capacity    | Notes                                      |\n|-------------|-------------|--------------------------------------------|\n| 1892        | 20,000     | Initial capacity upon Liverpool's founding  |\n| 1920s       | ~50,000    | Expansion with new stands  |\n| 1952        | \\u003e61,000    | Record attendance of 61,905  |\n| Post-1994   | ~45,000    | After conversion to all-seater following Taylor Report  |\n| 2016        | 54,074     | Main Stand redevelopment                   |\n| 2024        | 61,276     | Anfield Road Stand completion              |\n\nAnfield features four principal stands: the Kop, known for its fervent atmosphere and historical standing terraces; the Sir Kenny Dalglish Stand, the expanded western structure renamed in 2017 to honor the former player and manager; the Anfield Road Stand at the southern end; and the Main Stand.  The Kop, redeveloped as an all-seater in 1994 following the Taylor Report, remains central to the stadium's renowned matchday intensity, often resounding with the anthem \"You'll Never Walk Alone.\" A prominent tradition involves the \"This Is Anfield\" sign positioned above the players' tunnel, which Liverpool players touch as a ritual to acknowledge the venue's legacy and pressure, a practice emphasized by managers like Bill Shankly and Jürgen Klopp to instill respect and motivation. \n### Training grounds and academy facilities\n\nThe AXA Training Centre in Kirkby functions as Liverpool F.C.'s central hub for first-team and academy training operations, integrating senior and youth development activities on a single 85-acre site. The facility's academy component originated from land acquired by the club in 1998 for youth purposes, with the first-team squad relocating there from Melwood in November 2020 to consolidate resources and enhance pathway progression. Key amenities encompass three full-size outdoor pitches, specialized goalkeeping and warm-up zones, dual gyms tailored for first-team and under-21 use, a full-size indoor sports hall, a swimming pool, hydrotherapy pools, and courts for paddle tennis, beach volleyball, and beach football, all supported by expanded medical and sports science areas spanning twice the prior capacity.\n\nIn September 2025, Liverpool unveiled a £20 million redevelopment plan for the Kirkby academy site, introducing the club's inaugural full-size indoor pitch via a dome enclosure over the existing main grass surface, alongside a new external grass pitch equipped with a 500-seat spectator stand, upgraded player welfare zones, and further enhancements to medical and performance facilities to mitigate weather disruptions and elevate training consistency.\n\nMelwood, the club's historic first-team base in West Derby since its purchase and initial development in 1959, was sold in August 2019 to housing developer Torus for approximately £10 million to fund the Kirkby transition, with proceeds earmarked for youth infrastructure. Liverpool repurchased the 12-acre site in June 2023 for a reported £13 million, repurposing it as an elite facility for the women's first team and girls' academy under the AXA Melwood Training Centre branding, complete with modernized pitches, gyms, and recovery amenities to support professional standards.\n\n## Governance and finances\n\n### Ownership history and Fenway Sports Group\n\nLiverpool Football Club's ownership transitioned to American investors in the mid-2000s amid growing financial pressures in English football. Prior to 2007, the club had been majority-owned by the Moores family for over 50 years, with David Moores serving as chairman from 1991 until the sale and holding a significant stake; this period saw relative stability but increasing calls for investment to compete with rivals like Manchester United.\n\nIn February 2007, U.S. businessmen Tom Hicks and George Gillett acquired Liverpool for £218.9 million through a leveraged buyout, assuming £44.5 million in existing debt while adding substantial new borrowings secured against the club's assets. Their tenure was marked by unfulfilled promises of a £500 million-plus investment, including a new stadium, leading to club debt ballooning to around £350 million by 2010 and culminating in legal battles, fan protests, and a near-administration in the High Court.\n\nOn 15 October 2010, Fenway Sports Group (FSG)—then operating as New England Sports Ventures—completed the acquisition for £300 million, taking on the Hicks-Gillett debt and averting financial collapse. FSG, a Boston-based sports investment firm founded in 2001 by principal owner John W. Henry, was best known for its 2002 purchase and subsequent turnaround of the Boston Red Sox, ending an 86-year championship drought through analytics-driven operations. Under FSG's leadership, with Tom Werner as chairman and Mike Gordon as president overseeing Liverpool operations, the club adopted a similar model emphasizing data analytics, youth development, and selective high-value signings over indiscriminate spending.\n\nFSG's strategy prioritized financial sustainability, reducing net debt from over £200 million in 2010 to under £100 million by the mid-2010s through revenue growth and prudent management, while investing over £1 billion in player acquisitions and infrastructure like the phased Anfield Road Stand expansion, increasing capacity from 45,000 to 61,000 by 2023. This approach yielded on-pitch success, including the 2019 UEFA Champions League and 2020 Premier League titles, but drew criticism from supporters for perceived underinvestment relative to rivals and delays in stadium development, sparking protests like the 2021 \"FSG Out\" campaign.\n\nIn November 2022, FSG announced it was open to selling a full or partial stake, citing a club valuation exceeding £4 billion amid surging Premier League media rights and global interest, which provoked widespread fan backlash and bids from groups like the Saudi Public Investment Fund. By early 2023, FSG reversed course, committing to long-term ownership while selling a minority stake (up to 10%) to private equity firm Dynasty Equity for approximately $200 million (£164 million), proceeds earmarked for debt reduction and further enhancements to Anfield and the AXA Training Centre. As of October 2025, FSG retains majority control, with ongoing explorations into multi-club ownership models but no divestment from Liverpool.\n### Executive structure and key decisions\n\nFenway Sports Group (FSG) has owned Liverpool F.C. since October 15, 2010, with John W. Henry as principal owner, Tom Werner as chairman, and Mike Gordon as president overseeing club operations. The statutory board of directors includes Mike Egan as a director, alongside recent additions in September 2025 of Jenny Beacham and Jonathan Bamber, who joined to enhance internal governance.\n\nOn the executive level, Billy Hogan serves as chief executive officer since September 2020, managing commercial operations, media, and overall business strategy while also holding the role of CEO of FSG International since March 2024. Football operations fall under Michael Edwards as CEO of Football and Richard Hughes as sporting director, appointed in June 2024, focusing on recruitment, analytics-driven transfers, and squad planning in a restructured hierarchy emphasizing data and long-term sustainability.\n\nKey executive decisions under FSG have prioritized infrastructure and fiscal prudence over relocation, including the choice in the 2010s to expand Anfield Stadium rather than build anew, adding 8,500 seats via the Anfield Road Stand completion in 2023 at a cost exceeding £80 million, boosting capacity to 61,000. This data-informed approach extended to recruitment, with Edwards' earlier tenure (2016–2022) establishing an analytics model that facilitated high-return investments, such as the 2017 sale of Philippe Coutinho for £142 million to fund acquisitions like Virgil van Dijk and Alisson Becker, yielding Champions League and Premier League titles. In 2025, Hogan and the football leadership oversaw a record £446 million summer transfer spend, including over £100 million on Florian Wirtz, framed as aligned with the club's self-sustaining model built over years rather than impulsive outlay. Succession planning post-Jürgen Klopp's 2024 departure involved rapid appointment of Arne Slot and internal promotions, such as Ben Latty to chief commercial officer, to maintain continuity amid FSG's reaffirmed long-term commitment.\n\n### Financial performance and debt management\n\nLiverpool Football Club has demonstrated robust revenue growth under Fenway Sports Group (FSG) ownership since 2010, driven primarily by commercial expansion and matchday income, though profitability has fluctuated due to investment in infrastructure and squad costs. Key historical metrics illustrate this progression:\n\n| Year | Revenue (£ million) | Pre-tax Profit/Loss (£ million) | Debt (£ million) |\n|------|----------------------|---------------------------------|------------------|\n| 2010 | 184                 | -49                            | 378             |\n| 2018 | 456                 | 125                            | -               |\n| 2023 | 594                 | -9                             | -               |\n| 2024 | 614                 | -57                            | 116             |\n\nFor the year ending 31 May 2024, the club reported record revenues of £614 million, an increase of £20 million from the prior year, with commercial income reaching £308 million (up £36 million) and matchday revenue at £102 million (up £22 million), offset by a £38 million drop in media revenue to £204 million following exclusion from the UEFA Champions League. Despite this revenue milestone, the club recorded a pre-tax loss of £57 million, exacerbated by £9.6 million in compensation payments to outgoing manager Jürgen Klopp and staff, alongside elevated administration costs tied to stadium redevelopment.\n\nDebt management has prioritized sustainability, with FSG reducing leverage from the 2010 acquisition—initially financed through high-interest loans—and limiting interest expenses to £50 million over 14 years, compared to £65 million in the preceding two years under prior ownership. Bank debt stood at £116 million as of May 2024, down £10 million year-over-year, largely reflecting repayments linked to the Anfield Road Stand expansion completed in 2023. The club refinanced its credit facility on 24 September 2024, extending maturity beyond the original July 2025 deadline, while FSG provided a £127.3 million shareholder loan to support operations amid profit and sustainability rules (PSR) compliance.\n\n| Financial Metric (Year Ending 31 May 2024) | Amount (£ million) | Change from Prior Year |\n|--------------------------------------------|--------------------|------------------------|\n| Total Revenue                              | 614               | +20                    |\n| Commercial Income                          | 308               | +36                    |\n| Matchday Revenue                           | 102               | +22                    |\n| Media Revenue                              | 204               | -38                    |\n| Pre-Tax Loss                               | -57               | -48                    |\n| Bank Debt                                  | 116               | -10                    |\n\nThis approach has enabled significant transfer activity, including a £283 million net spend in summer 2025, funded through player sales and high revenues exceeding £700 million annually in equivalent terms, positioning Liverpool favorably under PSR constraints relative to peers with higher debt burdens like Everton (£1.0 billion) or Tottenham (£851 million). Estimates for net football debt as of May 2025 place it at £293.8 million, excluding £95.1 million in owner-related obligations, reflecting prudent leverage at approximately 3% of the club's $5.4 billion valuation.\n## Personnel\n\n### Current first-team squad\n\nThe first-team squad for the 2025–26 season is led by head coach Arne Slot. As of October 2025, it comprises 26 players across positions, reflecting summer transfers that added seven new arrivals including Florian Wirtz, Jeremie Frimpong, Milos Kerkez, Giorgi Mamardashvili, Hugo Ekitiké, Alexander Isak, and Giovanni Leoni, while departures included Luis Díaz. In July 2025, the club retired the number 20 shirt across all levels in honour and memory of Diogo Jota, the first such retirement in club history.\n### Goalkeepers\n| No. | Player            | Nationality |\n|-----|-------------------|-------------|\n| 1   | Alisson           | Brazil      |\n| 25  | Giorgi Mamardashvili | Georgia   |\n| 28  | Freddie Woodman   | England     |\n\n### Defenders\n| No. | Player            | Nationality       |\n|-----|-------------------|-------------------|\n| 2   | Joe Gomez         | England           |\n| 4   | Virgil van Dijk   | Netherlands       |\n| 5   | Ibrahima Konaté   | France            |\n| 6   | Milos Kerkez      | Hungary           |\n| 12  | Conor Bradley     | Northern Ireland  |\n| 15  | Giovanni Leoni    | Italy             |\n| 26  | Andrew Robertson  | Scotland          |\n| 30  | Jeremie Frimpong  | Netherlands       |\n| 46  | Rhys Williams     | England           |\n\n### Midfielders\n| No. | Player            | Nationality |\n|-----|-------------------|-------------|\n| 3   | Wataru Endo       | Japan       |\n| 7   | Florian Wirtz     | Germany     |\n| 8   | Dominik Szoboszlai| Hungary     |\n| 10  | Alexis Mac Allister | Argentina |\n| 17  | Curtis Jones      | England     |\n| 38  | Ryan Gravenberch  | Netherlands |\n| 42  | Trey Nyoni        | England     |\n| 43  | Stefan Bajčetić   | Spain       |\n\n### Forwards\n| No. | Player            | Nationality |\n|-----|-------------------|-------------|\n| 9   | Alexander Isak    | Sweden      |\n| 11  | Mohamed Salah     | Egypt       |\n| 14  | Federico Chiesa   | Italy       |\n| 18  | Cody Gakpo        | Netherlands |\n| 22  | Hugo Ekitiké      | France      |\n| 73  | Rio Ngumoha       | England     |\n\n### Reserves, academy, and youth development\n\nLiverpool F.C.'s reserve team, designated as the Under-21s, functions as the highest tier of the club's youth setup, competing in Premier League 2 Division One to bridge the gap between academy prospects and senior football. This structure emphasizes technical proficiency, mental resilience, physical conditioning, and tactical awareness, mirroring first-team methodologies to facilitate seamless progression. The reserves have secured regional titles in the FA Premier Reserve League in 2000 and 2008, demonstrating competitive efficacy in developmental competitions.\n\nThe academy, integral to Liverpool's youth development since the club's early years, has yielded over 40 first-team debuts under Jürgen Klopp's tenure from 2015 to 2024, generating nearly £100 million in transfer revenue from nine academy products who amassed just 58 senior appearances. Historical standouts include Ian Callaghan, who debuted in 1960 and holds the record for most appearances at 857; Robbie Fowler, scoring 183 goals from 1992 onward; and Steven Gerrard, captaining the side with 710 outings and pivotal roles in major trophies. Other luminaries encompass Michael Owen (158 goals, Ballon d'Or winner in 2001), Jamie Carragher (737 appearances), Steve McManaman (four major trophies), and Phil Thompson (multiple titles in the 1970s-1980s). \n\nContemporary successes highlight sustained output, with Trent Alexander-Arnold emerging in 2016 to claim Champions League and Premier League honors; Curtis Jones, debutant in 2019 with over 100 appearances; and prospects like Harvey Elliott, Conor Bradley, Stefan Bajčetić, and Caoimhin Kelleher contributing meaningfully post-2020. Since 2000, eight academy graduates have exceeded 50 first-team games, including Jon Flanagan, Jay Spearing, and Martin Kelly, underscoring a pathway yielding durable squad depth amid financial prudence. Youth integration has intensified recently, with teenagers like Conor Bradley, James McConnell, and Tyler Morton featuring in 2023-2024 cup ties, reflecting data-driven scouting and coaching that prioritizes homegrown talent over external recruitment where viable. In September 2025, Liverpool announced plans for a £20 million redevelopment of the Kirkby academy site, the largest transformation to date, featuring a full-size indoor pitch under a dome and other facility upgrades, with completion targeted for 2028.\n### Coaching and medical staff\n\n- Arne Slot: Head coach (since 1 June 2024)\n- Sipke Hulshoff: First assistant coach\n- Giovanni van Bronckhorst: Assistant coach (joined July 2025)\n- Xavi Valero: Head of first-team goalkeeping coaching\n- Ruben Peeters: Lead physical performance coach\n- Luiz Fernando Iubel: Individual development lead coach (appointed August 2025)\n- Jonathan Power: Director of medicine and performance\n- Amit Pannu: First-team doctor (joined July 2024)\n- Lee Nobes: Head of physiotherapy and rehabilitation\n\nArne Slot serves as head coach, having taken the position on 1 June 2024 following Jürgen Klopp's departure. Slot's core coaching team includes Sipke Hulshoff as first assistant coach, a long-time collaborator from their time at Feyenoord, and Giovanni van Bronckhorst as assistant coach, who joined in July 2025 to replace John Heitinga. Xavi Valero continues as head of first-team goalkeeping coaching, providing continuity from the prior regime.\n\nAdditional performance and development roles support the first team, with Ruben Peeters acting as lead physical performance coach, emphasizing data-driven conditioning protocols, and Luiz Fernando Iubel appointed in August 2025 as individual development lead coach to focus on player-specific tactical growth. These appointments reflect Slot's preference for a compact, integrated staff prioritizing high-pressing systems and physical resilience, as evidenced by Liverpool's adaptation to his tactics during the 2024-25 season.\n\nThe medical staff operates under director of medicine and performance Jonathan Power, who oversees injury prevention, rehabilitation, and matchday protocols with an emphasis on evidence-based interventions. Amit Pannu joined as first-team doctor in July 2024, bringing expertise in sports trauma management from prior roles. Lee Nobes heads physiotherapy and rehabilitation efforts, managing a team that has reduced average injury downtime through targeted load monitoring, as seen in the club's relatively low absence rates in the 2024-25 Premier League season. Recent departmental restructuring under Power in 2025 has integrated advanced analytics for predictive health modeling, aiming to sustain player availability amid fixture congestion.\n### Notable former players and records\n\nIan Rush is Liverpool's all-time leading goalscorer with 346 goals in 660 appearances across two spells from 1980–1987 and 1988–1996, including 39 in the FA Cup and key contributions to five league titles and two European Cups.  Kenny Dalglish, acquired from Celtic in 1977 for a then-club record £440,000, recorded 172 goals in 515 appearances as a forward known for his tactical acumen and passing, forming a prolific partnership with Rush and aiding three European Cup triumphs before transitioning to player-manager in 1985.  Steven Gerrard, emerging from the academy in 1998 and departing in 2015, amassed 710 appearances and 186 goals as club captain from 2003, most notably scoring in the 2005 UEFA Champions League final comeback against AC Milan and securing the 2006 FA Cup with a long-range strike in the Wembley final. \n\nIan Callaghan holds the record for most appearances with 857 from 1960 to 1978, primarily as a midfielder who featured in 640 league matches and contributed to two league titles.  Jamie Carragher, a defender from the youth system, follows with 737 appearances between 1996 and 2013, anchoring the backline during the 2005 Champions League win and five other major trophies.\n\n| Rank | Player            | Appearances |\n|------|-------------------|-------------|\n| 1    | Ian Callaghan     | 857        |\n| 2    | Jamie Carragher   | 737        |\n| 3    | Steven Gerrard    | 710        |\n| 4    | Ian Rush          | 660        |\n| 5    | Phil Neal         | 650        |\n\n| Rank | Player          | Assists |\n|------|-----------------|---------|\n| 1    | Kenny Dalglish  | 172     |\n| 2    | Steven Gerrard  | 145     |\n| 3    | Billy Liddell   | 132     |\n| 4    | Ian Callaghan   | 126     |\n| 5    | Roger Hunt      | 120     |\n\n| Player         | Period      |\n|----------------|-------------|\n| Andrew Hannah  | 1892–1895   |\n| Ron Yeats      | 1961–1971   |\n| Emlyn Hughes   | 1973–1979   |\n| Graeme Souness | 1981–1985   |\n| Alan Hansen    | 1985–1990   |\n| Steven Gerrard | 2003–2015   |\n\n**Top former players' goals in European competitions**\n\n| Rank | Player             | Goals |\n|------|--------------------|-------|\n| 1    | Steven Gerrard     | 41    |\n| 2    | Sadio Mané         | 26    |\n| 3    | Roberto Firmino    | 24    |\n| 4    | Ian Rush           | 22    |\n| 5    | Kenny Dalglish     | 18    |\n\nOther records include Phil Neal's 417 consecutive appearances from 1976 to 1983 and Rush's 47 goals in the 1983–84 season across all competitions.\n## Supporters and culture\n\n### Fan demographics and global support\n\nLiverpool F.C. maintains a core fanbase rooted in Merseyside, where approximately 47% of supporters self-identify as originating from the Liverpool area, reflecting the club's historical ties to the local working-class community. This regional loyalty is bolstered by generational transmission, with many fans inheriting allegiance through family, though intra-city divisions exist, particularly with Everton supporters. Beyond the UK, the club's global reach expanded significantly during its European successes in the 1970s and 1980s, and further under Jürgen Klopp from 2015 to 2024, attracting followers in regions with limited local football options.\n\nThe club's international fanbase is estimated at around 200 million across social media platforms, positioning Liverpool fourth globally among football clubs in follower count as of 2025, with rapid growth including three million new followers in December 2024 alone. Asia constitutes the largest overseas contingent, particularly in China and Southeast Asia, driven by commercial tours, broadcasting deals, and the appeal of players like Mohamed Salah. In the 2023-24 season, Liverpool recorded a cumulative global television audience of 415 million for its matches, the highest among Premier League clubs for home fixtures, underscoring broad viewership appeal.\n\nDemographically, Liverpool's online audience skews male at 72% versus 28% female, with the 25-34 age group comprising the largest segment among website visitors, indicative of a youthful, digitally engaged supporter profile. The club amassed 186 million social media followers and over 1.5 billion fan engagements in 2023-24, leading the Premier League in interaction metrics and reflecting sustained global enthusiasm despite varying match-day attendance influenced by geography and economics. These figures, derived from platform analytics and third-party audits, highlight Liverpool's transition from a regionally dominant club to a commercial powerhouse with diversified, non-local support.\n\n### Traditions, chants, and \"You'll Never Walk Alone\"\n\n\"You'll Never Walk Alone,\" a show tune from the 1945 Rodgers and Hammerstein musical *Carousel*, became Liverpool F.C.'s official anthem in the early 1960s. Gerry and the Pacemakers, a band from Liverpool, recorded a version in 1963 that topped the UK charts for four weeks, accelerating its adoption among supporters. The song's lyrics of resilience and solidarity resonated with the city's working-class ethos during a period of post-war recovery and cultural revival.\n\nSupporters sing \"You'll Never Walk Alone\" before every home match at Anfield, often holding scarves aloft in the Kop stand, creating a unified atmosphere that manager Bill Shankly described as integral to the club's identity. The phrase was inscribed on the Shankly Gates, unveiled on December 2, 1982, at Anfield's entrance, and later incorporated into the club's crest, symbolizing enduring fan loyalty. This ritual has persisted through triumphs and tragedies, including post-Hillsborough vigils, reinforcing communal bonds without reliance on transient victories.\n\nLiverpool's chanting tradition extends beyond the anthem, with the Kop stand serving as a vocal epicenter since its expansion in 1906. Popular chants include \"Fields of Anfield Road,\" adapted from a 1980s folk tune to celebrate the stadium and history; \"Allez Allez Allez,\" a rhythmic call popularized during Jürgen Klopp's tenure from 2015 onward; and \"We Love You Liverpool,\" expressing unwavering support. These songs often reference managers like Shankly and Paisley, or players such as Steven Gerrard, evolving organically among fans to mark eras of success, including the 2019 Champions League win.\n\nOther traditions include pre-match gatherings at local pubs and the symbolic walk to Anfield, fostering a sense of pilgrimage among diverse supporter groups. Chants like \"We've Won It Six Times\" assert the club's European Cup triumphs, countering rival narratives with historical fact—Liverpool secured its sixth in 2019. This vocal culture, rooted in Merseyside's musical heritage, distinguishes Liverpool's fandom by prioritizing collective expression over scripted displays.\n\n### Rivalries and matches\n\nLiverpool's primary rivalry is with Manchester United, known as the Northwest Derby, rooted in the historical industrial competition between Liverpool and Manchester as major port cities, intensified by the clubs' dominance in English football. The fixture is widely regarded as the most significant in English football, surpassing even local derbies in intensity among players and supporters due to the contrasting success eras—Liverpool's dominance from the 1970s to 1980s and Manchester United's from the 1990s to 2010s—and mutual claims to being England's most successful club. In 244 competitive meetings since 1894, Manchester United hold a slight edge with 92 victories to Liverpool's 82 and 71 draws, though Liverpool won five consecutive matches between 2000 and 2002. Notable encounters include Liverpool's 7–0 victory on 6 May 2021 at Anfield, one of the largest margins in the fixture's history, and Manchester United's 4–3 win on 13 March 2024, marked by late drama.\n\nThe Merseyside Derby against Everton, stemming from the clubs' shared origins—Liverpool formed in 1892 after a split from Everton—represents the oldest top-flight rivalry in England, driven by local geography and contrasting fanbases within the city. First contested on 13 October 1894 at Goodison Park (Everton winning 3–0), the fixture has seen 246 meetings across all competitions, with Liverpool leading 99–68 and 78 draws. Liverpool hold the record for 23 consecutive unbeaten games against Everton from 1997 to 2005, reflecting their historical superiority in the derby during periods of greater overall success. Recent matches include Liverpool's 2–1 victory on 20 September 2025, extending their strong form in the fixture under manager Arne Slot. Tensions occasionally flare due to proximity, but the rivalry is characterized more by familial divides than outright hatred compared to the Manchester United clash.\n\nOther notable rivalries include those with Manchester City, fueled by recent Premier League title contests (e.g., Liverpool's 97-point season in 2018–19 narrowly behind City's 98, and the 2019–20 race ending with City's 100 points to Liverpool's 99), and Chelsea, highlighted by European semi-final clashes like the 2005 Champions League encounter where Liverpool advanced on away goals after a 1–0 aggregate deficit was overturned. In Europe, recurring high-stakes matches against AC Milan—such as the 2005 Champions League Final (Liverpool's 3–3 draw and penalty shootout win after trailing 3–0) and the 2007 semi-final (Milan's 2–1 aggregate victory)—have built mutual respect amid competitive tension, though not a traditional domestic-style derby. These fixtures underscore Liverpool's pattern of dramatic comebacks in elimination games, contributing to their six European Cup triumphs.\n\n## Achievements and records\n\n### Domestic competitions\n\nLiverpool have secured 20 English top-flight league titles, equalling Manchester United's record, with the most recent victory in the 2024–25 Premier League season under manager Arne Slot. The club's first title arrived in the 1900–01 season, followed by sporadic successes before a dominant era from the 1960s to 1980s, during which they claimed 18 of their titles. This includes six titles in nine years under Bob Paisley from 1974 to 1983, establishing Liverpool as the preeminent force in English football amid consistent qualification for European competitions.\n\nIn the FA Cup, Liverpool hold eight triumphs, the joint-third highest tally in English football history, with victories spanning from Bill Shankly's 1964–65 win over Leeds United to Jürgen Klopp's 2021–22 penalty shootout defeat of Chelsea.  Key successes include the 1985–86 final, where they overcame Everton 3–1 despite the Heysel Stadium disaster's aftermath, and the 2005–06 replay win against West Ham United.\n\nLiverpool possess a record 10 EFL Cups (formerly Football League Cup), underscoring their cup prowess with four consecutive wins from 1981 to 1984 under Paisley and Bob Paisley, and a recent 2023–24 extra-time 1–0 victory over Chelsea.  The competition's format, emphasizing domestic knockout resilience, saw Liverpool's 2000–01 double with the FA Cup that season.\n\nThe club has claimed the FA Community Shield 16 times, the most of any English side, often as league champions facing FA Cup winners in season openers; shared honours occurred in 1964, 1965, 1977, 1986, and 1990 due to drawn matches.  Notable recent additions include the 2022 win over Manchester City.\n\n| Competition | Titles | Years Won |\n|-------------|--------|-----------|\n| First Division/Premier League | 20 | 1900–01, 1905–06, 1921–22, 1922–23, 1946–47, 1963–64, 1965–66, 1972–73, 1975–76, 1976–77, 1978–79, 1979–80, 1981–82, 1982–83, 1983–84, 1985–86, 1987–88, 1989–90, 2019–20, 2024–25 |\n| FA Cup | 8 | 1964–65, 1973–74, 1985–86, 1988–89, 1991–92, 2000–01, 2005–06, 2021–22 |\n| EFL Cup | 10 | 1980–81, 1981–82, 1982–83, 1983–84, 1994–95, 2000–01, 2002–03, 2011–12, 2021–22, 2023–24 |\n| FA Community Shield | 16 | 1964*, 1965*, 1966, 1974, 1976, 1977*, 1979, 1980, 1982, 1986*, 1988, 1989, 1990*, 2001, 2006, 2022 (*shared) |\n\nLiverpool's domestic record reflects sustained excellence, particularly in the post-World War II era, though periods of drought—such as from 1991 to 2019—highlighted challenges in maintaining dominance amid evolving league structures and financial dynamics in English football.\n\n### Doubles and trebles\n\nLiverpool has achieved doubles and trebles in multiple seasons. The club secured a treble in 1983–84 under Joe Fagan, winning the First Division, EFL Cup, and European Cup. Another treble followed in 2000–01 under Gérard Houllier, comprising the FA Cup, EFL Cup, and UEFA Cup.\n\nDoubles include the 1972–73 season, when Bill Shankly's team won the First Division and UEFA Cup. Liverpool also achieved successive domestic doubles in 1981–82 and 1982–83 under Bob Paisley, each consisting of the First Division and EFL Cup.\n\n### European and worldwide honours\n\nLiverpool Football Club holds the record for the most European Cup and UEFA Champions League titles won by an English club, with six victories establishing it as one of the continent's most decorated teams. The club has also secured three UEFA Cup titles, four UEFA Super Cups, and one FIFA Club World Cup, contributing to a total of 14 major European and worldwide honours. These achievements span from the 1970s under Bill Shankly and Bob Paisley to the modern era under Jürgen Klopp, reflecting sustained excellence in continental competitions despite periods of domestic dominance without corresponding European success.\n\nIn the European Cup and its successor, the UEFA Champions League, Liverpool triumphed in 1976–77 (3–1 vs. Borussia Mönchengladbach in Rome), 1977–78 (1–0 vs. Club Brugge in London), 1980–81 (1–0 vs. Real Madrid in Paris), 1983–84 (1–1 vs. Roma, 4–2 on penalties in Rome), 2004–05 (3–3 vs. AC Milan, 3–2 on penalties in Istanbul), and 2018–19 (2–0 vs. Tottenham Hotspur in Madrid). These wins include three under Paisley, marking a dominant era, and the 2005 \"Miracle of Istanbul\" comeback from 3–0 down, as well as the 2019 final completing Klopp's tenure with a comprehensive victory. The club reached seven finals overall, losing in 1985 (vs. Juventus) and 2018 (vs. Real Madrid).\n\nLiverpool claimed the UEFA Cup—now UEFA Europa League—three times: in 1972–73 (aggregate 3–2 vs. Borussia Mönchengladbach), 1975–76 (aggregate 4–3 vs. Club Brugge), and 2000–01 (5–4 vs. Deportivo Alavés in Dortmund). The inaugural win under Shankly initiated the club's European ascent, while the 2001 triumph under Gérard Houllier featured a dramatic golden goal in extra time.\n\nThe UEFA Super Cup, contested between Champions League and Europa League winners, was won by Liverpool on four occasions following European triumphs: 1977 (7–1 aggregate vs. Borussia Mönchengladbach), 2001 (3–2 vs. Bayern Munich), 2005 (3–1 after extra time vs. CSKA Moscow), and 2019 (2–2 vs. Chelsea, 5–4 on penalties). These victories underscore the club's ability to capitalize on prior continental success in season-opening fixtures.\n\nOn the global stage, Liverpool secured its sole FIFA Club World Cup in 2019, defeating Flamengo 1–0 in Doha with a goal from Roberto Firmino, capping a treble that included the Champions League and UEFA Super Cup. Prior attempts, such as in 1981 and 1984 after European Cup wins, did not yield the Intercontinental Cup due to non-participation or fixture conflicts.\n\n| Competition | Titles | Years Won |\n|-------------|--------|-----------|\n| European Cup/UEFA Champions League | 6 | 1977, 1978, 1981, 1984, 2005, 2019 |\n| UEFA Cup | 3 | 1973, 1976, 2001 |\n| UEFA Super Cup | 4 | 1977, 2001, 2005, 2019 |\n| FIFA Club World Cup | 1 | 2019 |\n\n### Individual and team records\n\nIan Rush holds the record for the most goals scored for Liverpool, with 346 in all competitions between 1980 and 1996. Roger Hunt ranks second with 285 goals from 1961 to 1969, followed by Mohamed Salah with 248 as of October 2025. Gordon Hodgson scored 241 goals between 1930 and 1936.\n\n| Rank | Player | Goals |\n|------|--------|-------|\n| 1    | Ian Rush | 346  |\n| 2    | Roger Hunt | 285 |\n| 3    | Mohamed Salah | 248 |\n| 4    | Gordon Hodgson | 241 |\n\nIan Callaghan made the most appearances for the club, totaling 857 matches from 1958 to 1978. Jamie Carragher follows with 737 appearances between 1996 and 2013, and Steven Gerrard recorded 710 from 1998 to 2015.\n\n| Rank | Player | Appearances |\n|------|--------|-------------|\n| 1    | Ian Callaghan | 857 |\n| 2    | Jamie Carragher | 737 |\n| 3    | Steven Gerrard | 710 |\n\nMohamed Salah has won the PFA Players' Player of the Year award a record three times (2018, 2022, 2025), surpassing previous holders with two wins each. No Liverpool player has won the Ballon d'Or, though Salah finished fourth in 2025.\n\nLiverpool's longest unbeaten run in the top flight stands at 43 consecutive games, achieved under Bill Shankly from 1970 to 1971. The club completed an unbeaten league season in 1893–94, their inaugural First Division campaign. In the Premier League era, Liverpool set a 44-game unbeaten streak across the 2019–20 and 2020–21 seasons, though it included cup matches. The team scored a club-record 101 league goals in the 2022–23 season. Liverpool's largest victory margin is 9–0, achieved twice: against Crystal Palace in 1892 and Barnsley in 2022.\n## Incidents, controversies, and criticisms\n\n### Stadium tragedies: Heysel and Hillsborough\n\nThe Heysel Stadium disaster occurred on 29 May 1985 prior to the European Cup final between Liverpool F.C. and Juventus at Heysel Stadium in Brussels, Belgium. Liverpool supporters in Block Z charged across a dividing wall towards Juventus fans, provoking a panic that caused the wall to collapse and spectators to be crushed against fencing. This resulted in 39 deaths—32 Italian Juventus supporters, four Belgians, two French fans, and one from each of the Netherlands, Ireland, and England—and injuries to approximately 600 others.\n\nThe tragedy stemmed from hooliganism by a subset of Liverpool fans, compounded by the stadium's dilapidated state, including crumbling concrete walls unfit for large crowds, inadequate segregation between rival supporters, and insufficient policing despite prior intelligence on English fan violence. Belgian authorities and UEFA investigations attributed primary causation to the fan incursion, leading to manslaughter charges against 27 individuals, mostly Liverpool supporters, with 14 convicted but sentences limited to three years or less. UEFA responded by banning all English clubs from European competitions for five years, extending Liverpool's exclusion to six years until 1991.\n\nThe Hillsborough disaster unfolded on 15 April 1989 during the FA Cup semi-final between Liverpool and Nottingham Forest at Hillsborough Stadium in Sheffield, England. South Yorkshire Police match commander David Duckenfield ordered the opening of Gate C to relieve pressure outside the stadium, directing approximately 2,000 Liverpool fans into already overcrowded central pens 3 and 4 of the Leppings Lane terrace without halting inflow at turnstiles or coordinating with stewards, causing a fatal crush. Ninety-seven Liverpool supporters died from compressive asphyxia, with 766 injured, marking the deadliest incident in British sporting history.\n\nThe 2016 Hillsborough inquests, following the 1989 Taylor Interim Report's identification of police control failures as the primary cause, concluded the 97 victims were unlawfully killed due to grossly negligent omissions by police and ambulance services in fulfilling their duty of care, with no evidence of fan misbehavior contributing to the deaths. Initial police statements were altered to fabricate blame on Liverpool fans—alleging drunkenness, theft from the dead, and obstruction of rescuers—a narrative amplified by certain media outlets despite CCTV and forensic evidence exonerating supporters and revealing police errors like delayed perimeter control and perimeter fence design flaws. These findings prompted the Independent Police Complaints Commission to refer Duckenfield for potential manslaughter charges, though prosecutions largely failed due to evidentiary issues, highlighting institutional resistance to accountability.\n\n### Hooliganism, fan conduct, and policing issues\n\nDuring the 1970s and 1980s, Liverpool F.C. was linked to several organized hooligan firms, including the Annie Road Crew, the Urchins, and the Breck Road Firm, which participated in coordinated violence targeting rival supporters and contributing to widespread disorder around Anfield and away fixtures.   These groups operated amid England's peak era of football hooliganism, often clashing in city streets and exacerbating Liverpool's socioeconomic tensions through match-day riots and territorial disputes. \n\nRegulatory responses, including the 1990 Taylor Report's mandate for all-seater stadiums, identity checks, and expanded use of banning orders, substantially reduced organized hooliganism across English football, with Liverpool fans transitioning from a reputation for aggression to one of intense but largely non-violent passion.  By the early 2000s, incidents of large-scale firm activity had largely ceased, though sporadic violence persisted in some European away games.\n\nContemporary fan conduct issues are fewer and typically involve individual offenses rather than mob actions. In the 2024-25 Premier League season, Liverpool recorded dozens of supporter arrests, primarily for public disorder, violent disorder, and pyrotechnics possession—infractions that, while declining overall in English football, remain monitored due to the club's large attendance figures.  Earlier data highlighted Liverpool leading Premier League clubs in pyrotechnics-related arrests during the 2015-16 season, with nine of 39 total cases. Offensive chanting referencing tragedies, such as during derbies against Manchester United, has prompted arrests and police statements condemning such behavior as witnessed by stewards and officers. \n\nPolicing challenges have included heavy-handed tactics and logistical failures at major events. The 2022 UEFA Champions League final in Paris saw approximately 2,000 Liverpool fans delayed outside the Stade de France, subjected to indiscriminate tear gas and pepper spray—including on families and children—while French police and UEFA initially attributed chaos to ticketless or counterfeit-ticket holders among supporters.  Independent inquiries, including UEFA's own review and a panel report, rejected fan culpability as primary, citing \"egregious failures\" by organizers, inadequate perimeter security, and police actions amounting to \"criminal assault\" that risked catastrophe; fans' restraint was credited with averting worse outcomes.   Subsequent fan dialogues with authorities have yielded commitments to improved protocols for European travels, such as enhanced transport and stewarding for the 2025 return to Paris.\n\n### Ownership, financial, and ethical criticisms\n\nFenway Sports Group (FSG) acquired Liverpool F.C. in October 2010 for £300 million when the club faced imminent financial collapse and potential liquidation under previous owners Tom Hicks and George Gillett, whose leveraged buyout had accumulated £350 million in debt. Despite stabilizing the club's finances and overseeing on-pitch successes including the 2019 Champions League and 2020 Premier League titles, FSG has faced persistent criticism from a portion of supporters for prioritizing a self-sustaining business model over direct equity injections, which limits transfer spending compared to state-backed rivals. This approach, while enabling profitability—Liverpool reported £62 million pre-tax profit in 2023—has fueled accusations of underinvestment, particularly after high-profile sales like Philippe Coutinho to Barcelona in 2018 for £142 million, which funded squad building but highlighted reliance on player trading.\n\nTicket pricing has been a flashpoint, with fans protesting perceived profiteering amid rising costs that exclude working-class supporters; the cheapest Kop ticket stands at £59 as of 2025, following freezes in eight of the prior ten seasons, yet groups like Spirit of Shankly argue even stagnant high prices erode matchday atmosphere and accessibility. A 2016 proposal to introduce £77 top-price tickets—the highest in the Premier League—sparked mass walkouts and boycotts, forcing FSG principal owner John Henry to apologize and scrap the plan, reducing increases to 3% across categories. Renewed outcry in 2023 over potential Anfield expansions stalled by fan opposition underscored tensions, with Henry acknowledging protests could hinder further development.\n\nEthically, FSG's 2025 partnership with the Maldives Tourism Ministry drew backlash from LGBTQ+ fan group Kop Outs for promoting a nation where same-sex relations remain criminalized under Islamic law, with calls to terminate the deal citing misalignment with the club's inclusive values. The 2021 European Super League fiasco, where Liverpool joined 11 other clubs in a breakaway proposal guaranteeing annual revenues of €350 million per team, provoked fierce fan protests at Anfield branding owners \"greedy\" and Henry personally accountable; the venture collapsed within 48 hours, prompting Henry's public apology admitting he had \"let down\" supporters. Additionally, a 2020 decision to furlough non-playing staff during COVID-19 lockdowns—later reversed after public criticism—was labeled \"morally wrong\" by former players, contrasting with rival clubs' full wage coverage and highlighting perceived prioritization of finances over employee welfare.\n\n### On-field scandals and recent disputes\n\nIn December 1915, amid World War I disruptions to the English football calendar, Liverpool players captain Tom Miller, Tom Fairfoul, and Bob Purcell were implicated in a match-fixing scandal involving a 2-0 defeat to Manchester United on 2 April 1915. The arrangement aimed to manipulate the Second Division relegation battle by ensuring both clubs avoided defeat in their final matches, with Liverpool players receiving payments estimated at £180 total. The Football Association's investigation, prompted by whistleblower Arthur Whalley, resulted in lifetime bans for the three Liverpool players, alongside five Manchester United counterparts, though Miller's ban was later reduced to 18 months and Fairfoul's to six months after appeals.\n\nDuring the 1994-95 season, Liverpool goalkeeper Bruce Grobbelaar faced allegations of accepting bribes totaling around £40,000 from Malaysian bookmaker Tony Teh to underperform in specific matches, including Liverpool's 6 April 1994 fixture against Newcastle United and others during his subsequent stint at Southampton. Undercover recordings published by The Sun newspaper captured Grobbelaar discussing potential fixes, leading to a 1997 criminal trial for conspiracy to defraud where he was acquitted after key accuser Lim Tee Hian was discredited for perjury. However, Grobbelaar lost a subsequent libel suit against The Sun in 1999, with courts ruling the publications substantially true, and the FA imposed a £10,000 fine for breaching betting rules by providing inside information. Grobbelaar maintained he sought to expose a conman rather than fix outcomes.\n\nOn 15 October 2011, Liverpool forward Luis Suárez racially abused Manchester United defender Patrice Evra during a Premier League match at Anfield, using the term \"negro\" or its variants up to seven times according to the FA's independent commission, which found Suárez guilty of misconduct following a three-day hearing relying primarily on Evra's testimony and contextual evidence. Suárez, who denied racist intent and claimed the word was not derogatory in his cultural context, received an eight-match ban and £40,000 fine; Liverpool initially contested the ruling and had players wear supportive T-shirts pre-match against United, drawing criticism for appearing to undermine the verdict.\n\nSuárez committed further on-field violence on 21 April 2013, biting Chelsea defender Branislav Ivanović on the arm during a 2-2 Premier League draw at Anfield, an act the FA deemed violent conduct warranting a 10-match suspension despite Suárez's claim of accidental contact amid a tussle. This followed Suárez assisting Liverpool's opener in the same game, after which he conceded a penalty; the incident echoed prior biting episodes but occurred under Liverpool's employment.\n\nIn August 2022, Liverpool striker Darwin Núñez was sent off with a straight red card on his home debut against Crystal Palace for headbutting defender Joachim Andersen in retaliation to a shove during a 1-1 Premier League draw at Anfield on 15 August. Núñez, who had already been booked earlier, received a three-match ban after admitting violent conduct but no further FA sanction; he publicly apologized, describing it as an \"ugly attitude\" needing correction, while Andersen reported receiving death threats from some Liverpool supporters post-incident.\n\n## Media and societal impact\n\n### Representation in film, music, and literature\n\nLiverpool F.C. has been prominently featured in music, particularly through its adoption of \"You'll Never Walk Alone\" as the club's anthem. Originally from the 1945 Rodgers and Hammerstein musical *Carousel*, the song was recorded by Gerry and the Pacemakers in 1963, reaching number one on the UK Singles Chart and becoming synonymous with the club after being played at Anfield matches. Supporters sing it before kickoffs, and it has been performed by various artists, including official club playlists featuring covers by the Pacemakers alongside fan chants like \"Fields of Anfield Road\" and \"Allez Allez Allez.\" Local musicians such as Jamie Webster have gained prominence for LFC-themed folk-punk tracks, including those referencing the 2005 Champions League victory, reflecting the club's integration into Merseyside's musical culture. \n\nIn film and television, Liverpool F.C. has inspired numerous documentaries chronicling its history and culture rather than fictional narratives. The 2012 series *Being: Liverpool*, a fly-on-the-wall production aired on Fox Soccer and later Netflix, provided unprecedented access to the club's operations during a transitional period under managers Brendan Rodgers and later Jürgen Klopp. More recent works include the 2025 Prime Video series *Doubters to Believers: Liverpool FC - Klopp's Era*, which details Klopp's nine-year tenure from 2015 to 2024, highlighting tactical evolutions and triumphs like the 2019 Champions League win. Other documentaries, such as *Istanbul: 20 Years* (2025) marking the 2005 European final comeback and *Liverpool FC: The 30 Year Wait* on the Premier League drought, emphasize fan resilience and pivotal matches produced by the club or broadcasters like LFCTV. \n\nLiterature on Liverpool F.C. encompasses autobiographies, histories, and novelized accounts, often drawing from player and manager experiences. Steven Gerrard's *My Story* (2015) and Jamie Carragher's *Carra: My Autobiography* (2008) offer firsthand insights into club dynamics during the 2000s. David Peace's *Red or Dead* (2013), a fictionalized biography of Bill Shankly's era from 1949 to 1974, stylistically recreates Liverpool's rise through repetitive prose mimicking match reports and training regimens. Analytical works like Jonathan Wilson's *The Anatomy of Liverpool* (2019) examine tactical philosophies under managers like Shankly, Paisley, and Klopp, while Ian Herbert's *Quiet Genius* (2017) profiles Bob Paisley's understated leadership across 20 major trophies from 1974 to 1983. These texts, alongside club-published season reviews, underscore the club's cultural significance beyond sport.\n\n### Commercialization and branding evolution\n\nLiverpool F.C. initiated commercialization efforts in English football by securing the league's first front-of-shirt sponsorship deal with Hitachi in 1979, valued at £50,000 annually, marking a shift from traditional revenue models reliant on gate receipts to corporate partnerships. This was followed by agreements with Crown Paints from 1982 to 1988, Candy from 1988 to 1992, and Carlsberg from 1992 to 2010, each contributing to growing off-field income amid expanding broadcast and merchandise markets. Kit manufacturing partnerships evolved similarly, starting with Umbro from 1973 to 1985, then Adidas from 1985 to 1996, Reebok from 1996 to 2006, and subsequent returns to Adidas, alongside stints with Warrior, New Balance, and Nike from 2020 to 2025, before reverting to Adidas in 2025.\n\nThe club's branding, centered on the Liverbird emblem derived from Liverpool's coat of arms, underwent refinements reflecting historical milestones and aesthetic modernization. Initially featuring the city's full heraldic shield from 1892, the crest simplified to a standalone Liverbird by the 1950s, adopted an oval shield in 1955, and incorporated \"L.F.C.\" lettering in 1968. A 1992 centenary design added \"You'll Never Walk Alone\" and establishment date, made permanent in 1993 with eternal flames honoring victims of the Heysel Stadium disaster in 1985 and Hillsborough disaster in 1989; further updates in 1999 enhanced color and detail for global merchandise applicability. These elements, combined with the anthem \"You'll Never Walk Alone,\" fostered a distinctive identity that supported international fan engagement and licensing.\n\nUnder Fenway Sports Group ownership since October 2010, Liverpool accelerated commercialization, leveraging on-field success to drive revenue diversification. Commercial income rose to £272 million in the 2022-23 season and reached a record £308.4 million in 2023-24, fueled by sponsorships like the extended Standard Chartered deal through 2027 and retail expansions, contributing to total revenues of £614 million in 2023-24.  This growth, including a club valuation increase from approximately $500 million to $6 billion, stemmed from strategic U.S.-focused marketing, blue-chip partnerships, and digital merchandising, transforming Liverpool into a global brand while maintaining core identity elements. \n\n### Social initiatives versus criticisms\n\nThe LFC Foundation, the official charity of Liverpool Football Club established over two decades ago, focuses on community programs emphasizing health, education, and employability, particularly for disadvantaged youth in Merseyside and beyond. In the 2023-24 season, it supported over 145,000 individuals through initiatives including physical activity sessions that generated £25 million in health benefits via 348,000 hours of engagement, alongside educational and job-training schemes aimed at reducing inequality. The foundation partners with organizations like Right to Play to deliver play-based programs in deprived global areas, such as Thailand, targeting child development in insecure environments. Domestically, it runs community outreach like donated match tickets for underprivileged children, support for ill fans, and collaborations such as SMF Kicks, which uses football to inspire at-risk youth. The club has set a goal to reach 500,000 young people by 2030 through expanded non-football interventions addressing broader social determinants like poverty and access to opportunities.\n\nLiverpool has publicly aligned with anti-discrimination efforts, including support for the Premier League's No Room For Racism campaign, where players took the knee before matches in October 2025 to symbolize opposition to prejudice. Former manager Jürgen Klopp articulated a left-leaning personal ethos, stating in 2017 he would \"never vote for the right\" and linking club values to historical working-class solidarity, influencing perceptions of the institution's social orientation. These positions draw from the city's labor heritage, with initiatives often framed as extensions of communal resilience post-industrial decline.\n\nCriticisms of these efforts highlight perceived inconsistencies and selective application. In March 2025, the club's tourism partnership with the Maldives—a nation criminalizing homosexuality with imprisonment—drew backlash from LGBTQ+ supporters' group Kop Outs, who accused Liverpool of hypocrisy given its inclusivity rhetoric and anti-discrimination stances, demanding termination of the deal. Historically, in 2012, the club faced accusations of undermining anti-racism campaigns by defending Luis Suárez amid his eight-match ban for racially abusing an opponent, including wearing solidarity T-shirts that critics viewed as performative rather than substantive. More recently, in September 2025, the Football Association investigated Liverpool's women's team goalkeeper Rafaela Borggräfe for alleged discriminatory language, raising questions about internal adherence to the club's promoted values. Detractors, including some fans, argue that symbolic gestures like knee-taking overshadow tangible local impacts, while global commercial ties prioritize revenue over ethical consistency, potentially eroding credibility amid the foundation's measurable but localized successes. Such critiques often stem from observer skepticism toward institutional motives, contrasting empirical program outcomes with broader geopolitical engagements.",
  "external_references": [
    {
      "text": "Liverpool Fc",
      "url": "https://sportsteamhistory.com/liverpool-fc/",
      "domain": "sportsteamhistory.com",
      "type": "citation"
    },
    {
      "text": "League Titles",
      "url": "https://www.liverpoolfc.com/info/league-titles",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "European Cup Champions League",
      "url": "https://www.liverpoolfc.com/info/european-cup-champions-league",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool.html",
      "url": "https://www.shareliverpoolfc.co.uk/liverpool.html",
      "domain": "shareliverpoolfc.co.uk",
      "type": "citation"
    },
    {
      "text": "1945 Original Broadway",
      "url": "https://rodgersandhammerstein.com/production/carousel/1945-original-broadway/",
      "domain": "rodgersandhammerstein.com",
      "type": "citation"
    },
    {
      "text": "Honours",
      "url": "https://www.liverpoolfc.com/history/honours",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "John Houlding Founding Father Liverpool Football Club",
      "url": "https://playupliverpool.com/1902/03/17/john-houlding-founding-father-liverpool-football-club/",
      "domain": "playupliverpool.com",
      "type": "citation"
    },
    {
      "text": "2",
      "url": "https://www.lfchistory.net/articles/article/2022/2",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "38871",
      "url": "https://voi.id/en/memori/38871",
      "domain": "voi.id",
      "type": "citation"
    },
    {
      "text": "96",
      "url": "https://www.lfchistory.net/seasonarchive/leaguetable/96",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Alltimeleaguepositions.htm",
      "url": "http://www.anfield-online.co.uk/stats/alltimeleaguepositions.htm",
      "domain": "anfield-online.co.uk",
      "type": "citation"
    },
    {
      "text": "2472",
      "url": "https://www.lfchistory.net/articles/article/2472",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "The Great Managers Tom Watson The First Of His Kind",
      "url": "https://gameofthepeople.com/2024/05/06/the-great-managers-tom-watson-the-first-of-his-kind/",
      "domain": "gameofthepeople.com",
      "type": "citation"
    },
    {
      "text": "History And Evolution Of Liverpool Fc",
      "url": "https://theredmentv.com/history-and-evolution-of-liverpool-fc/",
      "domain": "theredmentv.com",
      "type": "citation"
    },
    {
      "text": "Liverpool.html",
      "url": "https://www.footballhistory.org/club/liverpool.html",
      "domain": "footballhistory.org",
      "type": "citation"
    },
    {
      "text": "1265",
      "url": "https://www.lfchistory.net/articles/article/1265",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "The Impossible Job Managing Lfc In The 1950s",
      "url": "https://tomkinstimes.com/2014/07/the-impossible-job-managing-lfc-in-the-1950s/",
      "domain": "tomkinstimes.com",
      "type": "citation"
    },
    {
      "text": "9",
      "url": "https://www.lfchistory.net/managers/manager/profile/9",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Bill Shanklys Best Quotes",
      "url": "https://shanklyhotel.com/bill-shanklys-best-quotes/",
      "domain": "shanklyhotel.com",
      "type": "citation"
    },
    {
      "text": "3",
      "url": "https://www.lfchistory.net/articles/article/2835/3",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Leagueoverall",
      "url": "https://www.lfchistory.net/stats/leagueoverall",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "31",
      "url": "https://www.transfermarkt.us/fc-liverpool/platzierungen/verein/31",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Bill Shankly Liverpool Fc History",
      "url": "https://shanklyhotel.com/bill-shankly-liverpool-fc-history/",
      "domain": "shanklyhotel.com",
      "type": "citation"
    },
    {
      "text": "144273 How Bill Shankly Changed The Team",
      "url": "https://www.liverpoolfc.com/news/first-team/144273-how-bill-shankly-changed-the-team",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "7273 6.html",
      "url": "https://www.lfcineurope.com/7273-6.html",
      "domain": "lfcineurope.com",
      "type": "citation"
    },
    {
      "text": "Bill Shankly",
      "url": "https://nationalfootballmuseum.com/halloffame/bill-shankly/",
      "domain": "nationalfootballmuseum.com",
      "type": "citation"
    },
    {
      "text": "Ruthless To Resilient 50 Years Since Liverpools 1st European Trophy",
      "url": "https://www.thisisanfield.com/2023/05/ruthless-to-resilient-50-years-since-liverpools-1st-european-trophy/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "17744",
      "url": "https://www.transfermarkt.us/bob-paisley/profil/trainer/17744",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Bootroom Boys",
      "url": "https://www.liverpoolfc.com/walk-of-champions/bootroom-boys",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "334243 In Numbers The Great Bob Paisley",
      "url": "https://www.liverpoolfc.com/news/features/334243-in-numbers-the-great-bob-paisley",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "10",
      "url": "https://www.lfchistory.net/managers/manager/profile/10",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "17744",
      "url": "https://www.transfermarkt.us/bob-paisley/erfolge/trainer/17744",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "582819 How Liverpools Passmove 4 4 2 Conquered Europe Bob Paisleys Non Tactical Way Of Football",
      "url": "https://community.sports-interactive.com/forums/topic/582819-how-liverpools-passmove-4-4-2-conquered-europe-bob-paisleys-non-tactical-way-of-football/",
      "domain": "community.sports-interactive.com",
      "type": "citation"
    },
    {
      "text": "4794",
      "url": "https://www.lfchistory.net/Articles/Article/4794",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "League Cup",
      "url": "https://www.liverpoolfc.com/info/league-cup",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc In 1982 83",
      "url": "https://www.thisisanfield.com/2020/05/liverpool-fc-in-1982-83/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Bob Paisley Extract 5082453 Apr2020",
      "url": "https://www.the42.ie/bob-paisley-extract-5082453-Apr2020/",
      "domain": "the42.ie",
      "type": "citation"
    },
    {
      "text": "Joe Fagan",
      "url": "https://www.liverpoolfc.com/info/joe-fagan",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "11",
      "url": "https://www.lfchistory.net/managers/manager/profile/11",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "428057 In Numbers Joe Fagan S 27 Years At Liverpool Fc",
      "url": "https://www.liverpoolfc.com/news/features/428057-in-numbers-joe-fagan-s-27-years-at-liverpool-fc",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc In 1984 85 Fagans Farewell Domestic Woes And Darkness In Europe",
      "url": "https://www.thisisanfield.com/2020/05/liverpool-fc-in-1984-85-fagans-farewell-domestic-woes-and-darkness-in-europe/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "63741 Liverpool Vs Real Madrid",
      "url": "https://www.uefa.com/uefachampionsleague/match/63741--liverpool-vs-real-madrid/",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "Heysel",
      "url": "https://www.liverpoolfc.com/heysel",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "English Football Clubs Banned From Europe",
      "url": "https://www.history.com/this-day-in-history/june-2/english-football-clubs-banned-from-europe",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "Hillsborough",
      "url": "https://www.liverpoolfc.com/hillsborough",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Police Chiefs Apologise For Hillsborough Failures",
      "url": "https://www.theguardian.com/football/2023/jan/31/police-chiefs-apologise-for-hillsborough-failures",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "National Police Response To The Hillsborough Families Report",
      "url": "https://news.npcc.police.uk/releases/national-police-response-to-the-hillsborough-families-report",
      "domain": "news.npcc.police.uk",
      "type": "citation"
    },
    {
      "text": "Kenny Dalglish First Spell",
      "url": "https://www.liverpoolfc.com/info/kenny-dalglish-first-spell",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "3161",
      "url": "https://www.lfchistory.net/articles/article/3161",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "33648 I Cried My Eyes Out After Hillsborough",
      "url": "https://www.liverpoolfc.com/news/first-team/33648-i-cried-my-eyes-out-after-hillsborough",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "287",
      "url": "https://www.lfchistory.net/articles/article/287",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "What Really Knocked Liverpool Fc Off Their Perch",
      "url": "https://tomkinstimes.com/2017/02/what-really-knocked-liverpool-fc-off-their-perch/",
      "domain": "tomkinstimes.com",
      "type": "citation"
    },
    {
      "text": "13",
      "url": "https://www.lfchistory.net/managers/manager/profile/13",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Liverpools Champagne Charlie The Case Of Graeme Souness",
      "url": "https://www.theanfieldwrap.com/2015/03/liverpools-champagne-charlie-the-case-of-graeme-souness/",
      "domain": "theanfieldwrap.com",
      "type": "citation"
    },
    {
      "text": "14",
      "url": "https://www.lfchistory.net/managers/manager/profile/14",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "433760 Treble Memories Gerard Houllier S Lfc Legacy",
      "url": "https://www.liverpoolfc.com/news/features/433760-treble-memories-gerard-houllier-s-lfc-legacy",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "16",
      "url": "https://www.lfchistory.net/managers/manager/profile/16",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Rafael Benitez",
      "url": "https://www.liverpoolfc.com/info/rafael-benitez",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Story Klopp Fsg Salah Co Becoming Premier League Champions",
      "url": "https://www.espn.com/soccer/story/_/id/37584514/story-klopp-fsg-salah-co-becoming-premier-league-champions",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "34469429",
      "url": "https://www.bbc.com/sport/football/34469429",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Timeline And Inside Story Jurgen Klopps Arrival Liverpool",
      "url": "https://www.liverpoolfc.com/news/timeline-and-inside-story-jurgen-klopps-arrival-liverpool",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Jurgen Klopp Confirmed Liverpool Manager",
      "url": "https://www.theguardian.com/football/2015/oct/08/jurgen-klopp-confirmed-liverpool-manager",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Cglvlr5vvr8o",
      "url": "https://www.bbc.com/sport/football/articles/cglvlr5vvr8o",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "1",
      "url": "https://www.lfchistory.net/transfers/bymanager/28/1",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Jurgen Klopp Announces Decision Step Down Liverpool Manager End Season",
      "url": "https://www.liverpoolfc.com/news/jurgen-klopp-announces-decision-step-down-liverpool-manager-end-season",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "68104699",
      "url": "https://www.bbc.com/sport/football/68104699",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Arne Slot Become Liverpool Fcs New Head Coach",
      "url": "https://www.liverpoolfc.com/news/arne-slot-become-liverpool-fcs-new-head-coach",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "4024518",
      "url": "https://www.premierleague.com/en/news/4024518",
      "domain": "premierleague.com",
      "type": "citation"
    },
    {
      "text": "How Arne Slot Liverpool Won Premier League Title 2024 25",
      "url": "https://www.espn.com/soccer/story/_/id/44886521/how-arne-slot-liverpool-won-premier-league-title-2024-25",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Cvg1dlx2pyvo",
      "url": "https://www.bbc.com/sport/football/articles/cvg1dlx2pyvo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Scores And Fixtures Premier League",
      "url": "https://fbref.com/en/squads/822bd0ba/2024-2025/matchlogs/c9/schedule/Liverpool-Scores-and-Fixtures-Premier-League",
      "domain": "fbref.com",
      "type": "citation"
    },
    {
      "text": "Table",
      "url": "https://www.bbc.com/sport/football/teams/liverpool/table",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "134",
      "url": "https://www.lfchistory.net/SeasonArchive/Games/134",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Ce80zmpd2mpo",
      "url": "https://www.bbc.com/sport/football/articles/ce80zmpd2mpo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Defeats Tactics Guide",
      "url": "https://www.nytimes.com/athletic/6740397/2025/10/25/liverpool-defeats-tactics-guide/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Blt950bd613614cf415",
      "url": "https://www.goal.com/en-us/lists/sore-loser-arne-slot-accountability-liverpool-rut-man-utd-barbs-scrutiny-wretched-reds/blt950bd613614cf415",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Man United Liverpool Ruben Amorim Arne Slot",
      "url": "https://www.espn.com/soccer/story/_/id/46713175/man-united-liverpool-ruben-amorim-arne-slot",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Blt0e3e02322eb21d96",
      "url": "https://www.goal.com/en-us/lists/arne-slot-liverpool-must-adapt-to-defending-long-balls-reds-bid-to-end-premier-league-slump/blt0e3e02322eb21d96",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Football Shirt Archive",
      "url": "https://www.subsidesports.com/uk/archive/club-team/liverpool-football-shirt-archive/",
      "domain": "subsidesports.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Kits",
      "url": "https://www.footballkitarchive.com/liverpool-fc-kits/",
      "domain": "footballkitarchive.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Shirt History",
      "url": "https://casualfootballshirts.co.uk/pages/liverpool-shirt-history",
      "domain": "casualfootballshirts.co.uk",
      "type": "citation"
    },
    {
      "text": "Looking Back On 5 Years Of Nike X Liverpool Kits",
      "url": "https://www.soccerbible.com/performance/football-apparel/2025/03/looking-back-on-5-years-of-nike-x-liverpool-kits/",
      "domain": "soccerbible.com",
      "type": "citation"
    },
    {
      "text": "Liverpool 25 26 Kits.html",
      "url": "https://www.footyheadlines.com/2024/09/liverpool-25-26-kits.html",
      "domain": "footyheadlines.com",
      "type": "citation"
    },
    {
      "text": "0b9b8bc0 4612 43d1 A9bf 06c874de3b40",
      "url": "https://news.adidas.com/football/adidas-and-liverpool-fc-launch-new-home-and-away-jerseys-for-the-2025-26-season/s/0b9b8bc0-4612-43d1-a9bf-06c874de3b40",
      "domain": "news.adidas.com",
      "type": "citation"
    },
    {
      "text": "History Liverpools Shirt Sponsors",
      "url": "https://www.liverpoolfc.com/news/history-liverpools-shirt-sponsors",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Sponsor History",
      "url": "https://www.footballkitarchive.com/liverpool-fc-sponsor-history/",
      "domain": "footballkitarchive.com",
      "type": "citation"
    },
    {
      "text": "904378 Liverpool Fcs Kit Manufacturers And Shirts Sponsorship History",
      "url": "https://bleacherreport.com/articles/904378-liverpool-fcs-kit-manufacturers-and-shirts-sponsorship-history",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "3188",
      "url": "https://www.lfchistory.net/articles/article/3188",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "The Complete History Of The Liverpool Logo",
      "url": "https://www.hatchwise.com/resources/the-complete-history-of-the-liverpool-logo",
      "domain": "hatchwise.com",
      "type": "citation"
    },
    {
      "text": "How Lfcs Liver Bird Emblem Originally Looked 75 Years Ago",
      "url": "https://www.liverpoolfc.com/news/how-lfcs-liver-bird-emblem-originally-looked-75-years-ago",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "The History Of Liverpool Fcs Club Crests",
      "url": "https://www.thisisanfield.com/2022/11/the-history-of-liverpool-fcs-club-crests/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Selbcrlre9lz1n9dat1b1e60q",
      "url": "https://www.goal.com/en-us/news/ynwa-how-youll-never-walk-alone-became-a-liverpool-fc-anthem/selbcrlre9lz1n9dat1b1e60q",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Lfc Badge",
      "url": "https://anfield-edition.uk/lfc-badge/",
      "domain": "anfield-edition.uk",
      "type": "citation"
    },
    {
      "text": "Why Liverpool Badge Changed",
      "url": "https://www.givemesport.com/why-liverpool-badge-changed/",
      "domain": "givemesport.com",
      "type": "citation"
    },
    {
      "text": "The Evolution Of The Liverpool Fc Crest",
      "url": "https://www.premierleaguenow.co.uk/2025/07/22/the-evolution-of-the-liverpool-fc-crest/",
      "domain": "premierleaguenow.co.uk",
      "type": "citation"
    },
    {
      "text": "12 Anfield Pt1.html",
      "url": "https://membership-magazine.liverpoolfc.com/issue8/12_anfield_pt1.html",
      "domain": "membership-magazine.liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Our Former Homes",
      "url": "https://www.evertonfc.com/club/history/our-former-homes",
      "domain": "evertonfc.com",
      "type": "citation"
    },
    {
      "text": "Why Was Liverpool Fc Founded",
      "url": "https://www.britannica.com/question/Why-was-Liverpool-FC-founded",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "262242 A Short History Of The New Kenny Dalglish Stand",
      "url": "https://www.liverpoolfc.com/news/announcements/262242-a-short-history-of-the-new-kenny-dalglish-stand",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Anfield",
      "url": "https://stadiumdb.com/constructions/eng/anfield",
      "domain": "stadiumdb.com",
      "type": "citation"
    },
    {
      "text": "New Anfield Capacity Confirmed Ahead 2024 25",
      "url": "https://www.liverpoolfc.com/news/new-anfield-capacity-confirmed-ahead-2024-25",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "462118 Anfield Road Stand Update",
      "url": "https://www.liverpoolfc.com/news/announcements/462118-anfield-road-stand-update",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Cost Of Anfield Road Expansion Revealed Latest Liverpool Fc News",
      "url": "https://www.thisisanfield.com/2024/11/cost-of-anfield-road-expansion-revealed-latest-liverpool-fc-news/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "No Further Anfield Expansion But Liverpool Not Shy About Boosting Revenue",
      "url": "https://www.thisisanfield.com/2025/06/no-further-anfield-expansion-but-liverpool-not-shy-about-boosting-revenue/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "47",
      "url": "https://www.lfchistory.net/articles/article/47",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Anfield Capacity And How It Has Changed Over The Years",
      "url": "https://www.friendsofliverpool.com/2024/11/anfield-capacity-and-how-it-has-changed-over-the-years/",
      "domain": "friendsofliverpool.com",
      "type": "citation"
    },
    {
      "text": "Stands",
      "url": "https://www.thisisanfield.com/clubinfo/anfield/stands/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "This Is Anfield The Story Of Liverpools Famous Sign",
      "url": "https://www.thisisanfield.com/2023/03/this-is-anfield-the-story-of-liverpools-famous-sign/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Axa Liverpool Fc Partnership",
      "url": "https://www.axa.com/en/page/axa-liverpool-fc-partnership",
      "domain": "axa.com",
      "type": "citation"
    },
    {
      "text": "Training Ground",
      "url": "https://www.rousingthekop.com/club/training-ground/",
      "domain": "rousingthekop.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Football Club Axa Training Centre",
      "url": "https://www.mclh.co.uk/project/liverpool-football-club-axa-training-centre/",
      "domain": "mclh.co.uk",
      "type": "citation"
    },
    {
      "text": "Axa Training Centre Liverpool Fc Training Ground Kirkby",
      "url": "https://www.thisisanfield.com/clubinfo/axa-training-centre-liverpool-fc-training-ground-kirkby/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Lfc Plans Undertake Major Redevelopment Academy Site",
      "url": "https://www.liverpoolfc.com/news/lfc-plans-undertake-major-redevelopment-academy-site",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Academy Revamp",
      "url": "https://www.nytimes.com/athletic/6569609/2025/09/04/liverpool-academy-revamp/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Sell Melwood Training Ground Site Estimated Ps10m Ahead Move Kirkby",
      "url": "https://www.si.com/soccer/2019/08/01/liverpool-sell-melwood-training-ground-site-estimated-ps10m-ahead-move-kirkby",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Buy Back Melwood Womens Team Elite Training Centre",
      "url": "https://www.theguardian.com/football/2023/jun/08/liverpool-buy-back-melwood-womens-team-elite-training-centre",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Axa Melwood Training Centre Officially Opened Ahead Season Kick",
      "url": "https://www.liverpoolfc.com/news/axa-melwood-training-centre-officially-opened-ahead-season-kick",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Owners",
      "url": "https://www.rousingthekop.com/club/owners/",
      "domain": "rousingthekop.com",
      "type": "citation"
    },
    {
      "text": "David Moores Former Liverpool Chairman And Owner Dies Aged 76",
      "url": "https://www.theguardian.com/football/2022/jul/22/david-moores-former-liverpool-chairman-and-owner-dies-aged-76",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Who Owns Liverpool",
      "url": "https://www.hotbot.com/answers/who-owns-liverpool",
      "domain": "hotbot.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Takeover Hicks Gillett",
      "url": "https://www.theguardian.com/football/2010/oct/06/liverpool-takeover-hicks-gillett",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Liverpools Takeover By Fsg Inside The Deal 10 Years On",
      "url": "https://www.skysports.com/football/news/11669/12104163/liverpools-takeover-by-fsg-inside-the-deal-10-years-on",
      "domain": "skysports.com",
      "type": "citation"
    },
    {
      "text": "Fsg Liverpool Administration What Comes Next",
      "url": "https://www.givemesport.com/fsg-liverpool-administration-what-comes-next/",
      "domain": "givemesport.com",
      "type": "citation"
    },
    {
      "text": "Evolution Of Fsg",
      "url": "https://fenwaysportsgroup.com/evolution-of-fsg/",
      "domain": "fenwaysportsgroup.com",
      "type": "citation"
    },
    {
      "text": "Who Owns Liverpool Now How Much Did John Henry And Fenway Sports Group Pay Tom Hicks And George Gillett In 2010",
      "url": "https://www.cityam.com/who-owns-liverpool-now-how-much-did-john-henry-and-fenway-sports-group-pay-tom-hicks-and-george-gillett-in-2010/",
      "domain": "cityam.com",
      "type": "citation"
    },
    {
      "text": "Quite Journey And Tremendous Drive Keep Going Billy Hogan Fsgs 15 Years Lfc",
      "url": "https://www.liverpoolfc.com/news/quite-journey-and-tremendous-drive-keep-going-billy-hogan-fsgs-15-years-lfc",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Fsg",
      "url": "https://www.liverpoolecho.co.uk/all-about/fsg",
      "domain": "liverpoolecho.co.uk",
      "type": "citation"
    },
    {
      "text": "Fenway Sports Group Puts Liverpool Sale 12 Years Ownership.html",
      "url": "https://www.dailymail.co.uk/sport/football/article-11398733/Fenway-Sports-Group-puts-Liverpool-SALE-12-years-ownership.html",
      "domain": "dailymail.co.uk",
      "type": "citation"
    },
    {
      "text": "Liverpool Fenway Sports Group Sells Minority Stake To Us Private Equity Firm Dynasty Equity",
      "url": "https://www.skysports.com/football/news/11095/12971898/liverpool-fenway-sports-group-sells-minority-stake-to-us-private-equity-firm-dynasty-equity",
      "domain": "skysports.com",
      "type": "citation"
    },
    {
      "text": "Fsg Liverpool Transfers Spend",
      "url": "https://www.nytimes.com/athletic/6713201/2025/10/15/fsg-liverpool-transfers-spend/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Adds To Board Of Directors",
      "url": "https://www.insidermedia.com/news/north-west/liverpool-fc-adds-to-board-of-directors",
      "domain": "insidermedia.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Adds Club Executives Its Board Directors",
      "url": "https://www.liverpoolfc.com/news/liverpool-fc-adds-club-executives-its-board-directors",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "111827",
      "url": "https://www.transfermarkt.us/billy-hogan/profil/trainer/111827",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Liverpool Ceo Takes Up New Role With Fsg Hints At New Club Appointment",
      "url": "https://www.thisisanfield.com/2024/03/liverpool-ceo-takes-up-new-role-with-fsg-hints-at-new-club-appointment/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fsg Explained Hierarchy",
      "url": "https://www.nytimes.com/athletic/5545133/2024/06/10/liverpool-fsg-explained-hierarchy/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "123861",
      "url": "https://www.transfermarkt.us/richard-hughes/profil/trainer/123861",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Liverpool Fsg Edwards Hughes",
      "url": "https://www.nytimes.com/athletic/6191595/2025/03/11/liverpool-fsg-edwards-hughes/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "1186250126651563",
      "url": "https://www.facebook.com/ptgorst/posts/-more-than-any-one-single-transfer-or-managerial-appointment-fenway-sports-group/1186250126651563/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "Richard Hughes How Liverpool Sporting Director Plotted Life After Jurgen Klopp And Record Breaking Summer Spend",
      "url": "https://www.skysports.com/football/news/11669/13423796/richard-hughes-how-liverpool-sporting-director-plotted-life-after-jurgen-klopp-and-record-breaking-summer-spend",
      "domain": "skysports.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Billy Hogan Interview Transfers",
      "url": "https://www.nytimes.com/athletic/6510037/2025/07/24/liverpool-billy-hogan-interview-transfers/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "1265640785257548",
      "url": "https://www.facebook.com/EntrepriseCEO/videos/we-dont-just-plan-for-the-next-win-we-plan-for-the-next-decade-at-liverpool-bill/1265640785257548/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Make Changes With Three Key Leadership Promotions",
      "url": "https://fcbusiness.co.uk/news/liverpool-make-changes-with-three-key-leadership-promotions/",
      "domain": "fcbusiness.co.uk",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Ceo Says Player Spree Should Quell Ownership Gossip",
      "url": "https://www.bloomberg.com/news/articles/2025-07-24/liverpool-fc-ceo-says-player-spree-should-quell-ownership-gossip",
      "domain": "bloomberg.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Report 9m Pre Tax Loss Debt Increase Amid New Stand Development",
      "url": "https://www.theguardian.com/football/2024/feb/29/liverpool-report-9m-pre-tax-loss-debt-increase-amid-new-stand-development",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Crewwx4rjvjo",
      "url": "https://www.bbc.com/sport/football/articles/crewwx4rjvjo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "The Bookkeeper Liverpool Finances Transfers",
      "url": "https://www.nytimes.com/athletic/6131040/2025/03/21/the-bookkeeper-liverpool-finances-transfers/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Lfc Announces Financial Results 2023 24 Season",
      "url": "https://www.liverpoolfc.com/news/lfc-announces-financial-results-2023-24-season",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Accounts Finances Klopp",
      "url": "https://www.nytimes.com/athletic/6165312/2025/02/28/liverpool-accounts-finances-klopp/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Liverpool F C Bruised Financial Health",
      "url": "https://www.coliseum-online.com/liverpool-f-c-bruised-financial-health/",
      "domain": "coliseum-online.com",
      "type": "citation"
    },
    {
      "text": "Lfc%25202024%2520accounts Cfe7ab9eff08842d2ad2649fc078efce.pdf",
      "url": "https://backend.liverpoolfc.com/sites/default/files/2025-03/LFC%25202024%2520Accounts_cfe7ab9eff08842d2ad2649fc078efce.pdf",
      "domain": "backend.liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Afford 283m Summer Spending 105500635.html",
      "url": "https://sports.yahoo.com/article/liverpool-afford-283m-summer-spending-105500635.html",
      "domain": "sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Premier League Debt 2024",
      "url": "https://swissramble.substack.com/p/premier-league-debt-2024",
      "domain": "swissramble.substack.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc 202425 Financial Estimates",
      "url": "https://gregcordell.substack.com/p/liverpool-fc-202425-financial-estimates",
      "domain": "gregcordell.substack.com",
      "type": "citation"
    },
    {
      "text": "Global Soccer Valuations 2025 Liverpool.html",
      "url": "https://www.cnbc.com/2025/05/05/global-soccer-valuations-2025-liverpool.html",
      "domain": "cnbc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Squad",
      "url": "https://www.thisisanfield.com/liverpool-fc-squad/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Liverpools Squad Numbers Confirmed 2025 26",
      "url": "https://www.liverpoolfc.com/news/liverpools-squad-numbers-confirmed-2025-26",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "2025",
      "url": "https://www.transfermarkt.us/fc-liverpool/startseite/verein/31/saison_id/2025",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Diogo Jota Forever Our Number 20",
      "url": "https://www.liverpoolfc.com/news/diogo-jota-forever-our-number-20",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "2025",
      "url": "https://www.transfermarkt.us/fc-liverpool/kader/verein/31/saison_id/2025",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "The Liverpool Fc Academy Way",
      "url": "https://thesefootballtimes.co/2015/02/03/the-liverpool-fc-academy-way/",
      "domain": "thesefootballtimes.co",
      "type": "citation"
    },
    {
      "text": "685c78e0fb91e75b44be4e80 99189562382.pdf",
      "url": "https://uploads-ssl.webflow.com/6723b91139bc661c0d8867f0/685c78e0fb91e75b44be4e80_99189562382.pdf",
      "domain": "uploads-ssl.webflow.com",
      "type": "citation"
    },
    {
      "text": "Full List Every Liverpool Academy Graduate Klopp Kids Debut",
      "url": "https://www.football365.com/news/full-list-every-liverpool-academy-graduate-klopp-kids-debut",
      "domain": "football365.com",
      "type": "citation"
    },
    {
      "text": "Blt6b3d7fef3d31ff00",
      "url": "https://www.goal.com/en-us/lists/liverpool-best-academy-graduates-fowler-gerrard-carragher-alexander-arnold/blt6b3d7fef3d31ff00",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Ranking The Most Successful Players To Come Through The Lfc Academy 01hsf702k342",
      "url": "https://rushthekop.com/posts/ranking-the-most-successful-players-to-come-through-the-lfc-academy-01hsf702k342",
      "domain": "rushthekop.com",
      "type": "citation"
    },
    {
      "text": "4749",
      "url": "https://www.lfchistory.net/Articles/Article/4749",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "The 8 Liverpool Academy Players With 50 First Team Appearances Since 2000",
      "url": "https://www.thisisanfield.com/2023/03/the-8-liverpool-academy-players-with-50-first-team-appearances-since-2000/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Youngsters Jurgen Klopps Kids Spt Intl",
      "url": "https://www.cnn.com/2024/02/29/sport/liverpool-youngsters-jurgen-klopps-kids-spt-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Arne Slot",
      "url": "https://www.liverpoolfc.com/team/mens/staff/arne-slot",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Who Are Arne Slots New Backroom Staff At Liverpool Fc",
      "url": "https://www.thisisanfield.com/2025/09/who-are-arne-slots-new-backroom-staff-at-liverpool-fc/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Arne Slot Backroom Staff Appointments 31980480",
      "url": "https://www.liverpool.com/liverpool-fc-news/features/arne-slot-backroom-staff-appointments-31980480",
      "domain": "liverpool.com",
      "type": "citation"
    },
    {
      "text": "Coaching Staff",
      "url": "https://www.rousingthekop.com/club/coaching-staff/",
      "domain": "rousingthekop.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Coaches Arne Slot Iubel",
      "url": "https://www.nytimes.com/athletic/6579566/2025/08/27/liverpool-coaches-arne-slot-iubel/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Confirm New Coaching Staff Arrivals And Departures",
      "url": "https://www.liverpoolfc.com/news/liverpool-confirm-new-coaching-staff-arrivals-and-departures",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Amit Pannu",
      "url": "https://www.liverpoolfc.com/team/mens/staff/amit-pannu",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Mens",
      "url": "https://www.liverpoolfc.com/team/mens",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Add Another Coach To Revamped Set Piece Staff",
      "url": "https://www.thisisanfield.com/2025/09/liverpool-add-another-coach-to-revamped-set-piece-staff/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Playergoalscorers",
      "url": "https://www.lfchistory.net/stats/playergoalscorers",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Blt214ffd127045d333",
      "url": "https://www.goal.com/en-us/news/liverpool-all-time-top-scorers/blt214ffd127045d333",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Kenny Dalglish",
      "url": "https://www.liverpoolfc.com/info/kenny-dalglish",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "135269",
      "url": "https://www.transfermarkt.us/kenny-dalglish/leistungsdaten/spieler/135269",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "3109",
      "url": "https://www.transfermarkt.us/steven-gerrard/leistungsdaten/spieler/3109",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Playerappearances",
      "url": "https://www.lfchistory.net/stats/playerappearances",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Its Fact.html",
      "url": "http://www.liverpoolfcstats.co.uk/p/liverpool-fc-its-fact.html",
      "domain": "liverpoolfcstats.co.uk",
      "type": "citation"
    },
    {
      "text": "395743 Kop 10 Liverpool S All Time Top Appearance Makers",
      "url": "https://www.liverpoolfc.com/news/features/395743-kop-10-liverpool-s-all-time-top-appearance-makers",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Playersassists",
      "url": "https://www.lfchistory.net/Stats/PlayersAssists",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "24",
      "url": "https://www.lfchistory.net/articles/article/24",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "4",
      "url": "https://www.lfchistory.net/stats/playergoalscorers/4",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Records",
      "url": "https://www.thisisanfield.com/clubinfo/records/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Understanding The Global Lfc Fan Base Insights Into Popularity And Support",
      "url": "https://theanfieldtalk.com/understanding-the-global-lfc-fan-base-insights-into-popularity-and-support/",
      "domain": "theanfieldtalk.com",
      "type": "citation"
    },
    {
      "text": "How Many Fans Do Liverpool Have Global Audit 2025",
      "url": "https://www.footballgroundmap.com/articles/how-many-fans-do-liverpool-have-global-audit-2025",
      "domain": "footballgroundmap.com",
      "type": "citation"
    },
    {
      "text": "2291778324619195",
      "url": "https://www.facebook.com/groups/1545395859257449/posts/2291778324619195/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "How Many Fans Do Liverpool Have",
      "url": "https://www.empireofthekop.com/2025/03/25/how-many-fans-do-liverpool-have/",
      "domain": "empireofthekop.com",
      "type": "citation"
    },
    {
      "text": "Liverpoolfc.com",
      "url": "https://www.similarweb.com/website/liverpoolfc.com/",
      "domain": "similarweb.com",
      "type": "citation"
    },
    {
      "text": "Lfc Most Engaged Club Premier League 15 Billion Social Media Fan Engagements 2023 24",
      "url": "https://www.liverpoolfc.com/news/lfc-most-engaged-club-premier-league-15-billion-social-media-fan-engagements-2023-24",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "How Youll Never Walk Alone Came To Define Liverpool Fc Spirit Gerry Marsden",
      "url": "https://www.theguardian.com/music/2021/jan/04/how-youll-never-walk-alone-came-to-define-liverpool-fc-spirit-gerry-marsden",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Youll Never Walk Alone Liverpool Fc",
      "url": "https://www.classicfm.com/discover-music/youll-never-walk-alone-liverpool-fc/",
      "domain": "classicfm.com",
      "type": "citation"
    },
    {
      "text": "History Of Youll Never Walk Alone",
      "url": "https://www.empireofthekop.com/2025/03/31/history-of-youll-never-walk-alone/",
      "domain": "empireofthekop.com",
      "type": "citation"
    },
    {
      "text": "Youll Never Walk Alone Became Liverpool Iconic Club Anthem",
      "url": "https://www.nbcsports.com/soccer/news/youll-never-walk-alone-became-liverpool-iconic-club-anthem",
      "domain": "nbcsports.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Football Chants",
      "url": "https://www.friendsofliverpool.com/2023/08/liverpool-football-chants/",
      "domain": "friendsofliverpool.com",
      "type": "citation"
    },
    {
      "text": "Blt03df1709e8981a3b",
      "url": "https://www.goal.com/en-us/news/liverpool-chants-lyrics--videos-to-the-most-popular-anfield-songs/blt03df1709e8981a3b",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Songs.html",
      "url": "https://membership-magazine.liverpoolfc.com/issue27/juniors/songs.html",
      "domain": "membership-magazine.liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "E8c316f3faac36037443e31e",
      "url": "https://www.sportingnews.com/us/soccer/news/liverpool-vs-man-united-history-record-trophies-results-won/e8c316f3faac36037443e31e",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "Manchester United Liverpool Plenty Grudge Matches",
      "url": "https://www.espn.com/soccer/story/_/id/37504826/manchester-united-liverpool-plenty-grudge-matches",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Fd0b86cac39b8f3e6c47635e",
      "url": "https://www.sportingnews.com/us/soccer/news/liverpool-vs-everton-head-head-all-time-results-merseyside/fd0b86cac39b8f3e6c47635e",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "The History Of The Merseyside Derby",
      "url": "https://www.visitliverpool.com/blog/post/the-history-of-the-merseyside-derby/",
      "domain": "visitliverpool.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Vs Everton",
      "url": "https://www.premierleague.com/en/match/2561940/liverpool-vs-everton",
      "domain": "premierleague.com",
      "type": "citation"
    },
    {
      "text": "Wayne Rooney Shares The Big Difference Between Liverpools Rivalries With Everton And Man Utd",
      "url": "https://www.rousingthekop.com/2025/10/17/wayne-rooney-shares-the-big-difference-between-liverpools-rivalries-with-everton-and-man-utd/",
      "domain": "rousingthekop.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fcs Top 5 Rivals Which Rivalries Mean More",
      "url": "https://www.seatloader.com/blog/liverpool-fcs-top-5-rivals-which-rivalries-mean-more",
      "domain": "seatloader.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Greatest European Comebacks Barcelona Champions League Istanbul St Etienne Dortmund",
      "url": "https://liverpooloffside.sbnation.com/liverpool-fc-tactics-longform/2019/5/8/18536737/liverpool-greatest-european-comebacks-barcelona-champions-league-istanbul-st-etienne-dortmund",
      "domain": "liverpooloffside.sbnation.com",
      "type": "citation"
    },
    {
      "text": "Fa Cup",
      "url": "https://www.liverpoolfc.com/info/fa-cup",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Charity Community Shield",
      "url": "https://www.liverpoolfc.com/info/charity-community-shield",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "7889 Liverpool",
      "url": "https://www.uefa.com/uefachampionsleague/history/clubs/7889--liverpool/",
      "domain": "uefa.com",
      "type": "citation"
    },
    {
      "text": "4739",
      "url": "https://www.lfchistory.net/Articles/Article/4739",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Uefa Cup",
      "url": "https://www.liverpoolfc.com/info/uefa-cup",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Uefa Super Cup",
      "url": "https://www.liverpoolfc.com/info/uefa-super-cup",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "31",
      "url": "https://www.transfermarkt.com/liverpool-fc/erfolge/verein/31",
      "domain": "transfermarkt.com",
      "type": "citation"
    },
    {
      "text": "Fifa Club World Cup",
      "url": "https://www.liverpoolfc.com/info/fifa-club-world-cup",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "31",
      "url": "https://www.transfermarkt.us/fc-liverpool/rekordspieler/verein/31",
      "domain": "transfermarkt.us",
      "type": "citation"
    },
    {
      "text": "Mohamed Salah Wins Record Third Pfa Player Year Award",
      "url": "https://www.espn.com/soccer/story/_/id/46014549/mohamed-salah-wins-record-third-pfa-player-year-award",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Mohamed Salah Placed Fourth 2025 Ballon Dor Ranking",
      "url": "https://www.liverpoolfc.com/news/mohamed-salah-placed-fourth-2025-ballon-dor-ranking",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Records.html",
      "url": "https://membership-magazine.liverpoolfc.com/issue28/juniors/records.html",
      "domain": "membership-magazine.liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "What Is Liverpools Longest Unbeaten Run",
      "url": "https://www.quora.com/What-is-Liverpools-longest-unbeaten-run",
      "domain": "quora.com",
      "type": "citation"
    },
    {
      "text": "403883 2019 20 In Numbers How The Champions Broke Records And Made History",
      "url": "https://www.liverpoolfc.com/news/first-team/403883-2019-20-in-numbers-how-the-champions-broke-records-and-made-history",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Heysel Stadium Disaster",
      "url": "https://www.britannica.com/event/Heysel-Stadium-Disaster",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Uk England Merseyside 32898612",
      "url": "https://www.bbc.com/news/uk-england-merseyside-32898612",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Heysel Stadium Disaster",
      "url": "https://www.rbfa.be/en/national-teams/red-devils/king-baudouin-stadium/heysel-stadium-disaster",
      "domain": "rbfa.be",
      "type": "citation"
    },
    {
      "text": "How Heysel Tragedy Changed English Football Clubs Banned Europe",
      "url": "https://www.theguardian.com/football/2020/jun/02/how-heysel-tragedy-changed-english-football-clubs-banned-europe",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "40 Years Since The Heysel Tragedy",
      "url": "https://www.juventus.com/en/news/articles/40-years-since-the-heysel-tragedy",
      "domain": "juventus.com",
      "type": "citation"
    },
    {
      "text": "Determinations And Findings Of The Hillsborough Inquests",
      "url": "https://www.gov.uk/government/speeches/determinations-and-findings-of-the-hillsborough-inquests",
      "domain": "gov.uk",
      "type": "citation"
    },
    {
      "text": "Uk England 36138337",
      "url": "https://www.bbc.com/news/uk-england-36138337",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Hillsborough Disaster Deadly Mistakes And Lies That Lasted Decades",
      "url": "https://www.theguardian.com/football/2016/apr/26/hillsborough-disaster-deadly-mistakes-and-lies-that-lasted-decades",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Hillsborough",
      "url": "https://www.policeconduct.gov.uk/our-work/investigations/hillsborough",
      "domain": "policeconduct.gov.uk",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=xhOdGTkV-N0",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "16dewe1zjd5cs1wwaky23qv9zk",
      "url": "https://www.goal.com/en-us/news/football-hooligans-firms-films--violence-culture-among-supporters/16dewe1zjd5cs1wwaky23qv9zk",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=t_nqSUPQgZs",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "787a4a40a34556bab279bb0b318f1341",
      "url": "https://www.cambridge.org/core/journals/urban-history/article/when-saturday-comes-football-public-disorder-and-liverpools-urban-crisis-c-19651985/787A4A40A34556BAB279BB0B318F1341",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=TbU5JvH0wW4",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "4475",
      "url": "https://www.lfchistory.net/articles/article/4475",
      "domain": "lfchistory.net",
      "type": "citation"
    },
    {
      "text": "Premier League Hooligans Liverpool Heysel Stadium Hillsborough Disaster European Cup%2c1090",
      "url": "https://www.sportshistoryweekly.com/stories/premier-league-hooligans-liverpool-heysel-stadium-hillsborough-disaster-european-cup%2C1090",
      "domain": "sportshistoryweekly.com",
      "type": "citation"
    },
    {
      "text": "Football2.html",
      "url": "https://www.rickresource.com/liverpool/football2.html",
      "domain": "rickresource.com",
      "type": "citation"
    },
    {
      "text": "Ar Aa1j4qlq",
      "url": "https://www.msn.com/en-gb/news/other/dozens-of-liverpool-fans-arrested-last-season/ar-AA1J4QlQ",
      "domain": "msn.com",
      "type": "citation"
    },
    {
      "text": "Premier League Arrests Banning Orders 35571934",
      "url": "https://www.mirror.co.uk/sport/football/news/premier-league-arrests-banning-orders-35571934",
      "domain": "mirror.co.uk",
      "type": "citation"
    },
    {
      "text": "Uk England 38090956",
      "url": "https://www.bbc.com/news/uk-england-38090956",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Mersyeside Police Working With Both Clubs Ahead Of Liverpool V Manchester United Match",
      "url": "https://www.merseyside.police.uk/news/merseyside/news/2025/october-2025/mersyeside-police-working-with-both-clubs-ahead-of-liverpool-v-manchester-united-match/",
      "domain": "merseyside.police.uk",
      "type": "citation"
    },
    {
      "text": "Champions League Final Liverpool Real Madrid Fans Spt Intl",
      "url": "https://www.cnn.com/2022/06/04/football/champions-league-final-liverpool-real-madrid-fans-spt-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Police Treatment Fans Paris Final Champions League Liverpool Real Madrid Criminal Assault Report",
      "url": "https://www.theguardian.com/football/2022/oct/17/police-treatment-fans-paris-final-champions-league-liverpool-real-madrid-criminal-assault-report",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Filetoupload%2c1530449%2cen.pdf",
      "url": "https://law.qub.ac.uk/schools/SchoolofLaw/filestore/Filetoupload%2C1530449%2Cen.pdf",
      "domain": "law.qub.ac.uk",
      "type": "citation"
    },
    {
      "text": "Uclf22 Independent Review Report.pdf",
      "url": "https://editorial.uefa.com/resources/027e-174e17fd7030-a45785447d2f-1000/uclf22_independent_review_report.pdf",
      "domain": "editorial.uefa.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Paris Champions League",
      "url": "https://www.nytimes.com/athletic/6174885/2025/03/04/liverpool-paris-champions-league/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Why Fsg Arent Bad Owners Some Liverpool Fans Think Are",
      "url": "https://www.espn.com/soccer/story/_/id/37636989/why-fsg-arent-bad-owners-some-liverpool-fans-think-are",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fsg Slot Sale Plan",
      "url": "https://www.nytimes.com/athletic/5986837/2024/12/18/liverpool-fsg-slot-sale-plan/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Assessing 15 Years Of Fsg And Liverpool Fc After Owners Message",
      "url": "https://www.forbes.com/sites/jamesnalton/2025/10/15/assessing-15-years-of-fsg-and-liverpool-fc-after-owners-message/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "C367yl32xedo",
      "url": "https://www.bbc.com/news/articles/c367yl32xedo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Back Down Ticket Prices 77",
      "url": "https://www.theguardian.com/football/2016/feb/10/liverpool-back-down-ticket-prices-77",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Liverpool John Henry Fan Protest Affect Further Anfield Expansion Plans",
      "url": "https://www.espn.com/soccer/story/_/id/37491865/liverpool-john-henry-fan-protest-affect-further-anfield-expansion-plans",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Premier League Soccer Visit Maldives Partnership Lgbtq Criticism",
      "url": "https://www.outsports.com/2025/3/14/24108916/liverpool-premier-league-soccer-visit-maldives-partnership-lgbtq-criticism/",
      "domain": "outsports.com",
      "type": "citation"
    },
    {
      "text": "Alone Responsible",
      "url": "https://www.espn.com/soccer/story/_/id/37616379/alone-responsible",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Premier League Coronavirus Pay Cut Liverpool Spt Intl",
      "url": "https://www.cnn.com/2020/04/08/football/premier-league-coronavirus-pay-cut-liverpool-spt-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "The Story Of Liverpools 1915 Match Fixing Scandal With Man United",
      "url": "https://www.thisisanfield.com/2023/06/the-story-of-liverpools-1915-match-fixing-scandal-with-man-united/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "Players Fix Liverpool Manchester United Soccer Match",
      "url": "https://www.ebsco.com/research-starters/sports-and-leisure/players-fix-liverpool-manchester-united-soccer-match",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "The Full Story Of Bruce Grobbelaar Match Fixing Betting Scandal 2393400",
      "url": "https://www.gambling.com/uk/news/the-full-story-of-bruce-grobbelaar-match-fixing-betting-scandal-2393400",
      "domain": "gambling.com",
      "type": "citation"
    },
    {
      "text": "Bruce Grobbelaar Match Fixing",
      "url": "https://www.casino.org/blog/bruce-grobbelaar-match-fixing/",
      "domain": "casino.org",
      "type": "citation"
    },
    {
      "text": "I Trying Catch Conman Not Fix Matches Grobbelaar Story Tainted Life.html",
      "url": "https://www.dailymail.co.uk/sport/article-6172077/I-trying-catch-conman-not-fix-matches-Grobbelaar-story-tainted-life.html",
      "domain": "dailymail.co.uk",
      "type": "citation"
    },
    {
      "text": "Luis Suarez Biting Controversy Timeline",
      "url": "https://www.theguardian.com/football/2013/apr/21/luis-suarez-biting-controversy-timeline",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "English Football Luis Suarez Vs Patrice Evra When",
      "url": "https://www.reddit.com/r/HobbyDrama/comments/t941yg/english_football_luis_suarez_vs_patrice_evra_when/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "Luis Surez Bites Branislav Ivanovic Video",
      "url": "https://www.theguardian.com/football/video/2013/apr/22/luis-surez-bites-branislav-ivanovic-video",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "62557484",
      "url": "https://www.bbc.com/sport/football/62557484",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Blt7f3e884b05426ff1",
      "url": "https://www.goal.com/en-us/news/liverpool-striker-nunez-apologises-headbutt-incident/blt7f3e884b05426ff1",
      "domain": "goal.com",
      "type": "citation"
    },
    {
      "text": "78lxjrcd1yi1kntcx4zy9d",
      "url": "https://open.spotify.com/playlist/78lxjrcD1yI1KnTcx4zY9d",
      "domain": "open.spotify.com",
      "type": "citation"
    },
    {
      "text": "Jamie Webster Liverpools Chart Topping Hero",
      "url": "https://www.theguardian.com/music/2020/oct/29/jamie-webster-liverpools-chart-topping-hero",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Liverpool The Musical Mecca With A Football Fetish",
      "url": "https://theredmentv.com/liverpool-the-musical-mecca-with-a-football-fetish/",
      "domain": "theredmentv.com",
      "type": "citation"
    },
    {
      "text": "70261399",
      "url": "https://www.netflix.com/title/70261399",
      "domain": "netflix.com",
      "type": "citation"
    },
    {
      "text": "0lvl6j4tj1p8qj9pjkslvjapqw",
      "url": "https://www.primevideo.com/detail/Doubters-to-Believers-Liverpool-FC-Klopps-Era/0LVL6J4TJ1P8QJ9PJKSLVJAPQW",
      "domain": "primevideo.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=zPAMEyyDggY",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Fc Documentaries",
      "url": "https://www.friendsofliverpool.com/2023/07/liverpool-fc-documentaries/",
      "domain": "friendsofliverpool.com",
      "type": "citation"
    },
    {
      "text": "89756.best Liverpool Fc Books",
      "url": "https://www.goodreads.com/list/show/89756.Best_Liverpool_FC_Books",
      "domain": "goodreads.com",
      "type": "citation"
    },
    {
      "text": "Best Liverpool Fc Books Recommendations",
      "url": "https://www.thisisanfield.com/2023/11/best-liverpool-fc-books-recommendations/",
      "domain": "thisisanfield.com",
      "type": "citation"
    },
    {
      "text": "S",
      "url": "https://www.amazon.com/Books-Liverpool-Football-Club/s?rh=n%253A283155%252Cp_27%253ALiverpool%252BFootball%252BClub",
      "domain": "amazon.com",
      "type": "citation"
    },
    {
      "text": "How Liverpool Fc Became A 6 Billion Powerhouse And What That Means For Sports Investors",
      "url": "https://gostryde.com/sty/blog/how-liverpool-fc-became-a-6-billion-powerhouse-and-what-that-means-for-sports-investors",
      "domain": "gostryde.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Commercial Strategy",
      "url": "https://www.nytimes.com/athletic/5318342/2024/03/06/liverpool-commercial-strategy/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Foundation",
      "url": "https://www.liverpoolfc.com/foundation",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Foundation 20 Years",
      "url": "https://www.nytimes.com/athletic/4133622/2023/01/29/liverpool-foundation-20-years/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Lfcfoundation",
      "url": "https://x.com/lfcfoundation",
      "domain": "x.com",
      "type": "citation"
    },
    {
      "text": "Right To Play And Liverpool Fc Foundation",
      "url": "https://righttoplay.ca/en/news/right-to-play-and-liverpool-fc-foundation/",
      "domain": "righttoplay.ca",
      "type": "citation"
    },
    {
      "text": "Community Engagement",
      "url": "https://www.liverpoolfc.com/foundation/community-engagement",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Lfc Foundation",
      "url": "https://stevemorganfoundation.org.uk/casestudypartner/lfc-foundation/",
      "domain": "stevemorganfoundation.org.uk",
      "type": "citation"
    },
    {
      "text": "Liverpool Fcs The Red Way Leading The Charge For A Sustainable Future",
      "url": "https://busenq.com/liverpool-fcs-the-red-way-leading-the-charge-for-a-sustainable-future/",
      "domain": "busenq.com",
      "type": "citation"
    },
    {
      "text": "Lfc Supports Premier Leagues No Room Racism Initiative 0",
      "url": "https://www.liverpoolfc.com/news/lfc-supports-premier-leagues-no-room-racism-initiative-0",
      "domain": "liverpoolfc.com",
      "type": "citation"
    },
    {
      "text": "Jurgen Klopp Politics Left Wing Shankly Socialism Never Vote For Right",
      "url": "https://liverpooloffside.sbnation.com/liverpool-fc-news-coverage/2017/11/23/16694130/jurgen-klopp-politics-left-wing-shankly-socialism-never-vote-for-right",
      "domain": "liverpooloffside.sbnation.com",
      "type": "citation"
    },
    {
      "text": "Luis Suarez Liverpool",
      "url": "https://www.theguardian.com/football/2012/jan/05/luis-suarez-liverpool",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Liverpool Borggrafe Being Probed Discriminatory Language",
      "url": "https://www.espn.com/soccer/story/_/id/46311949/liverpool-borggrafe-being-probed-discriminatory-language",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Rafaela Borggrafe Liverpool Investigation",
      "url": "https://www.nytimes.com/athletic/6644491/2025/09/19/rafaela-borggrafe-liverpool-investigation/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Football And Politics An Uncomfortable Truth",
      "url": "https://jeffgoulding.com/liverpool-fc/football-and-politics-an-uncomfortable-truth/",
      "domain": "jeffgoulding.com",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:25:37.005606",
  "elapsed_ms": 689943
}