{
  "topic": "Los Angeles Lakers",
  "title": "Los Angeles Lakers",
  "slug": "los-angeles-lakers",
  "grokipedia_slug": "Los_Angeles_Lakers",
  "grokipedia_url": "https://grokipedia.com/page/Los_Angeles_Lakers",
  "source": "grokipedia",
  "content": "# Los Angeles Lakers\n\nThe Los Angeles Lakers are an American professional basketball team competing in the National Basketball Association (NBA) as a member of the league's Western Conference Pacific Division. Founded in 1947 as the Minneapolis Lakers in the National Basketball League (NBL), the franchise joined the NBA in 1949 after the league's merger with the Basketball Association of America (BAA) and relocated to Los Angeles in 1960, where it has played ever since. With **17 NBA championships**—the second-most in league history behind the Boston Celtics—the Lakers are one of the most storied franchises in professional sports, known for their global fanbase, iconic purple-and-gold uniforms, and home games at Crypto.com Arena.\n\nThe team's early success came in Minneapolis, where it captured five championships in the late 1940s and early 1950s, led by Hall of Famer **George Mikan**, the NBA's first superstar who revolutionized the game as a dominant center. After struggling post-relocation due to frequent finals losses to the Celtics, the Lakers entered their **Showtime era** in the 1980s under coach Pat Riley, featuring Magic Johnson and Kareem Abdul-Jabbar, resulting in five titles (1980, 1982, 1985, 1987, 1988) through fast-paced, entertaining play that defined the franchise's Hollywood image. The 2000s brought another dominant run with the trio of Kobe Bryant, Shaquille O'Neal, and coach Phil Jackson, securing three consecutive championships (2000–2002) and two more in 2009–2010, followed by a 2020 title led by LeBron James and Anthony Davis amid the COVID-19 pandemic.\n\nBeyond on-court achievements, the Lakers boast an all-time record of 3,608 wins and 2,490 losses as of November 2025 (regular season only), with 65 playoff appearances and numerous Hall of Famers including Elgin Baylor, Jerry West, Wilt Chamberlain, and more recent stars like Bryant and James. Ownership transitioned in October 2025 when the Buss family sold a majority stake to Guggenheim Partners CEO Mark Walter for a $10 billion valuation, approved by the NBA Board of Governors, ensuring continued emphasis on excellence and community impact. The franchise's cultural significance extends to retired jerseys for 13 legends and a legacy of innovation, from pioneering television broadcasts to fostering rivalries that have shaped the NBA.\n\n## History\n\n### Minneapolis era (1946–1960)\n\nThe franchise originated as the Detroit Gems in the National Basketball League (NBL) in 1946, owned by C. King Boring and coached by Joel Mason, but the team struggled with a dismal 4-40 record in its only season, drawing poor attendance in Detroit. In February 1947, local businessmen Ben Berger and Morris Chalfen purchased the franchise for $15,000 and relocated it to Minneapolis, renaming it the Lakers to honor Minnesota's \"Land of 10,000 Lakes.\" The team drafted DePaul University star George Mikan second overall in the inaugural BAA dispersal draft and hired John Kundla as coach, setting the stage for immediate success in the 1947-48 NBL season, where they finished 43-17 and won the league championship.\n\nGeorge Mikan, a 6-foot-10 center known for his hook shot and rebounding prowess, became the cornerstone of the Lakers, leading them to five championships and revolutionizing professional basketball by forcing rule changes like the widening of the free-throw lane from 6 to 12 feet in 1951 to limit his dominance under the basket. Mikan won three scoring titles from 1949 to 1951, averaging over 23 points per game in those seasons, and earned four All-Star selections while serving as player-coach in his final years. Supported by Hall of Famers like forward Vern Mikkelsen and Jim Pollard, the Lakers captured NBL titles in 1948 and 1949 before the league merged with the Basketball Association of America to form the NBA in 1949-50. In the NBA, they defeated the Washington Capitols in the 1949 Finals (swept 2-0) and the Syracuse Nationals 4-2 in the 1950 Finals, where low-scoring games highlighted stalling tactics employed against Mikan's interior presence. The dynasty peaked with three-peat championships in 1952 (4-3 over New York Knicks), 1953 (4-1 over Nationals), and 1954 (4-3 over Nationals), compiling a 243-114 regular-season record from 1948-1954 and establishing the Lakers as the NBA's premier team.\n\nA pivotal event underscoring the era's pacing issues occurred in the 1954 Finals, when the Nationals used deliberate stalling to secure a 71-65 victory in Game 7, the lowest-scoring NBA Finals game ever at the time, which contributed to the league's adoption of the 24-second shot clock for the 1954-55 season to combat such tactics and boost excitement. Mikan's retirement in 1956 after a knee-injured 1955-56 season (33-38 record, first playoff miss since 1948) marked the beginning of decline, as the team integrated rookies like Clyde Lovellette but struggled with attendance drops and roster instability. From 1954-1960, the Lakers posted a 185-243 regular-season record, making just one playoff appearance in 1959 (lost 0-2 to Boston Celtics), reflecting the challenges of transitioning without their star amid growing competition from eastern teams.\n\n### Move to Los Angeles and rivalry with Celtics (1960–1973)\n\nIn 1960, the Lakers relocated from Minneapolis to Los Angeles under owner Bob Short, who had acquired the franchise in 1957 amid declining attendance and financial difficulties in their previous market. The move marked the NBA's first expansion to the West Coast, aiming to tap into the growing entertainment hub of Southern California, though initial fan turnout was modest as the team adapted to a new audience. The Lakers played their early home games at the Los Angeles Memorial Sports Arena, a newly opened venue in 1959 that hosted the team until 1967, but logistical challenges like shared scheduling with other events and the arena's modest capacity of around 16,000 limited early momentum. Short sold the team in 1965 to Jack Kent Cooke for $5 million, who oversaw the transition to the more luxurious Forum in Inglewood starting in the 1967-68 season.\n\nThe Lakers built their foundation around star forwards Elgin Baylor and Jerry West, forming one of the league's most dynamic duos. Baylor, selected first overall in the 1958 NBA Draft by the Minneapolis Lakers, transitioned seamlessly to the West Coast and earned the 1959 Rookie of the Year award after averaging 24.9 points and 15.0 rebounds per game in his debut season. West joined as the second overall pick in the 1960 Draft, quickly emerging as a scoring sensation and winning NBA scoring titles in 1965-66 (31.0 points per game) and 1969-70 (31.2 points per game), while earning 10 All-NBA First Team selections during the era. Together, Baylor and West led the Lakers to seven NBA Finals appearances between 1962 and 1970, though the team fell short of a championship in each, posting records of 4-3 losses to the Boston Celtics in 1962, 1963, 1965, 1966, 1968, and 1969, and a 4-3 defeat to the New York Knicks in 1970.\n\nThe Lakers' acquisition of center Wilt Chamberlain via trade from the Philadelphia 76ers in July 1968—for Darrall Imhoff, Archie Clark, and Jerry Chambers—added unparalleled size and rebounding to the roster, boosting their regular-season dominance with a 55-27 record in Chamberlain's debut year. However, injuries hampered the trio's synergy, as seen in the 1969 Finals where West's 42.8 points per game earned him the inaugural Finals MVP despite the 4-3 loss to Boston, and in the 1970 Finals where Chamberlain's knee injury limited him during the Knicks defeat. Chamberlain's defensive presence proved pivotal in the 1971-72 season, where he averaged 14.8 rebounds and focused on playmaking en route to the Lakers' first Los Angeles-era title, though a 4-1 Finals rematch loss to the Knicks in 1973 underscored ongoing postseason vulnerabilities.\n\nThe relocation amplified the Lakers' storied rivalry with the Boston Celtics, rooted in the Minneapolis era but exploding in Los Angeles through repeated Finals clashes dominated by Boston's Bill Russell. From 1962 to 1969, the Celtics won all seven series against the Lakers, with Russell's revolutionary shot-blocking—averaging 22.5 rebounds per game in those Finals—repeatedly thwarting Baylor's acrobatic drives and West's mid-range mastery, including a iconic block on West's layup in the final seconds of the 1969 Game 7. By 1973, the franchises had met in 12 NBA Finals overall, establishing the league's premier rivalry and symbolizing East Coast grit versus West Coast glamour, though Boston's defensive edge under Russell prevented Lakers success until his retirement.\n\n### Showtime era (1973–1991)\n\nThe Showtime era of the Los Angeles Lakers began with the acquisition of Kareem Abdul-Jabbar via trade from the Milwaukee Bucks on June 16, 1975, in exchange for Elmore Smith, Brian Winters, Junior Bridgeman, and Dave Meyers. Abdul-Jabbar, already a six-time NBA MVP, anchored the Lakers' frontcourt and earned his third MVP award in the 1975-76 season, averaging 27.7 points and 16.9 rebounds per game while leading Los Angeles to a 53-29 record. His skyhook shot and defensive prowess formed the foundation for the team's transition to a high-octane, fast-break style known as Showtime, which emphasized transition scoring and no-look passes over traditional half-court sets.\n\nThe arrival of Earvin \"Magic\" Johnson as the first overall pick in the 1979 NBA Draft revolutionized the Lakers' offense, pairing his visionary passing and athleticism with Abdul-Jabbar's scoring efficiency. Johnson, selected after the Lakers acquired the pick from the New Orleans Jazz, averaged 18.0 points and 7.7 assists as a rookie, propelling Los Angeles to the 1980 NBA Finals against the Philadelphia 76ers. In Game 6 with Abdul-Jabbar sidelined by injury, the 20-year-old Johnson volunteered to play center, delivering a Finals MVP performance of 42 points, 15 rebounds, and 7 assists in a 123-107 clincher, securing the Lakers' first championship since 1972.\n\nUnder coach Pat Riley, who took over in 1981 after Paul Westhead's midseason dismissal, the Lakers refined their Showtime system into a dynasty, winning four more championships in the 1980s. Riley's tenure from 1981 to 1990 produced a 533-194 regular-season record and nine Finals appearances, including victories over Philadelphia in 1982 (4-2), Boston in 1985 (4-2), and Detroit in 1987 (4-2) and 1988 (4-3). The nickname \"Showtime\" originated from Lakers broadcaster Chick Hearn, who first used it during a 1979-80 game to describe the team's exhilarating, entertainment-focused play. Riley's emphasis on conditioning and pressure defense complemented the offense, resulting in the Lakers earning first-round byes in the playoffs as Pacific Division champions each year from 1980 to 1989, often dispatching opponents in decisive \"bye-bye\" fashion during subsequent rounds.\n\nRoster evolution bolstered the core duo, with the 1982 draft selection of forward James Worthy first overall adding a dynamic finisher who averaged 13.4 points as a rookie and contributed to three championships. Worthy's fast-break dunks and clutch playoff scoring—highlighted by his 1988 Finals MVP award with 36 points in Game 7—exemplified Showtime's flair, while role players like Michael Cooper provided elite perimeter defense. This blend of star power and system play delivered five titles overall, cementing the era as a pinnacle of NBA entertainment and success.\n\n### Post-Showtime struggles (1991–1996)\n\nThe retirement of Magic Johnson on November 7, 1991, following his announcement that he had tested positive for HIV, marked the symbolic end of the Lakers' dominant Showtime era and delivered a profound emotional blow to the franchise, its players, and fans. Johnson, the architect of five NBA championships and the heart of the team's high-flying style, held a press conference where he stated, \"Because of the HIV virus that I have obtained, I will have to retire today from the Lakers,\" leaving the organization reeling from the loss of its iconic leader. The announcement not only stunned the basketball world but also prompted widespread grief among Lakers supporters, who viewed Johnson as synonymous with the team's identity, exacerbating the sense of uncertainty as the franchise transitioned without its cornerstone player.\n\nIn the immediate aftermath, the Lakers struggled to maintain competitiveness, posting mediocre records amid frequent coaching instability and ineffective roster moves. Under head coach Mike Dunleavy, who had led the team since 1990, the 1991–92 season ended with a 46–36 record and a first-round playoff loss to the Portland Trail Blazers in five games, signaling early decline without Johnson's presence. Dunleavy departed after the season, replaced by assistant Randy Pfund in 1992, but the team's fortunes worsened dramatically; the 1992–93 campaign yielded a league-worst 27–55 record, followed by an identical 27–55 mark in 1993–94, resulting in back-to-back missed playoffs and the franchise's worst two-year stretch since the early 1950s. Pfund was fired midway through the 1993–94 season, giving way to Del Harris, yet the persistent underperformance highlighted deeper organizational challenges in adapting post-Showtime.\n\nRebuilding efforts faltered through misguided draft selections and acquisitions that failed to restore contention, prolonging the playoff drought that spanned from 1994 to 1995 before a brief resurgence. The Lakers selected point guard Nick Van Exel 37th overall in the 1993 NBA Draft, a second-round pick who showed promise with his scoring and playmaking but could not elevate the team amid inconsistent supporting talent. Similarly, forward Cedric Ceballos was acquired from the Phoenix Suns in August 1994 in exchange for a future first-round pick (later used to select Michael Finley); while Ceballos averaged 21.1 points per game in his first Lakers season, injuries and team dysfunction limited his impact, contributing to another first-round exit in 1994–95 despite a 45–37 record. These moves exemplified the front office's struggles to identify and develop foundational pieces, as high draft assets yielded short-term contributors rather than long-term solutions, culminating in a six-year span of irrelevance by mid-decade.\n\nThe period's turnaround began in the 1996 offseason, as general manager Jerry West orchestrated pivotal acquisitions to inject star power and end the malaise. On June 26, 1996, the Lakers traded center Vlade Divac to the Charlotte Hornets for the 13th overall draft pick, high school phenom Kobe Bryant, whose raw potential West coveted despite Divac's established role as a reliable starter. Just weeks later, on July 18, 1996, free-agent center Shaquille O'Neal signed a groundbreaking seven-year, $120 million contract with Los Angeles, leaving the Orlando Magic and bringing dominant interior presence to pair with emerging talent. These moves, executed amid the 1995–96 season's relative improvement to 53–29 and a Western Conference Semifinals appearance, positioned the franchise for revival after years of stagnation.\n\n### Shaquille O'Neal and Kobe Bryant dynasty (1996–2004)\n\nThe Los Angeles Lakers initiated a transformative era in 1996 by securing two cornerstone players who would define the franchise's success for the next decade. On July 18, 1996, the Lakers signed free agent center Shaquille O'Neal to a seven-year, $120 million contract after he declined to re-sign with the Orlando Magic, bringing unparalleled dominance to the paint with his size, power, and scoring ability. Just weeks earlier, on June 26, 1996, the Charlotte Hornets selected 17-year-old guard Kobe Bryant 13th overall in the NBA Draft before trading his rights to the Lakers on draft night in exchange for center Vlade Divac, a move orchestrated by general manager Jerry West to pair the young phenom with O'Neal. Initially, the duo's partnership was marked by tension and unrefined chemistry; O'Neal, the established superstar, viewed the precocious Bryant as overly eager and undisciplined, leading to public spats, on-court disagreements over shot selection, and even physical altercations during practices under coaches Del Harris and Kurt Rambis from 1996 to 1999. Despite reaching the Western Conference Finals in 1998 and 1999, these internal conflicts contributed to playoff shortcomings, including losses to the Utah Jazz and San Antonio Spurs.\n\nThe arrival of Phil Jackson as head coach in the summer of 1999 marked a pivotal shift, introducing discipline and a sophisticated system that harnessed the Shaq-Kobe tandem. Hired on a five-year, $30 million deal after leading the Chicago Bulls to six championships, Jackson implemented the triangle offense—a fluid, read-and-react scheme emphasizing ball movement, spacing, and post play that he had perfected with Michael Jordan and Scottie Pippen. Though Bryant initially resisted the system's emphasis on collective decision-making, viewing it as a constraint on his improvisational style, Jackson's psychological approach and mediation helped forge synergy, allowing O'Neal to dominate inside while Bryant thrived on the perimeter. This tactical evolution, supported by key role players like guard Derek Fisher, whose steady shooting and clutch play stabilized the backcourt, and forward Rick Fox, who provided versatile defense and timely scoring, propelled the Lakers to unparalleled success.\n\nUnder Jackson's guidance, the Lakers embarked on a three-year championship dynasty from 2000 to 2002, becoming the first team since the Bulls to achieve a three-peat. In the 2000 NBA Finals, they defeated the Indiana Pacers 4-2, with O'Neal earning Finals MVP honors after averaging 38 points and 16.7 rebounds per game, including a 40-point, 24-rebound performance in Game 1; he also captured the regular-season MVP award that year. The 2001 Finals saw the Lakers sweep the Philadelphia 76ers 4-0, as O'Neal again claimed Finals MVP with averages of 33 points and 15.8 rebounds, highlighted by a 40-point, 20-rebound effort in Game 2 despite a toe injury. The dynasty culminated in 2002 with a 4-0 sweep of the New Jersey Nets, where O'Neal secured his third consecutive Finals MVP, posting 36.3 points and 12.3 rebounds per game, while Bryant's perimeter scoring complemented the interior assault. These victories, fueled by the triangle's efficiency and the stars' growing rapport, established the Lakers as the NBA's preeminent power.\n\nThe dynasty unraveled in the 2004 NBA Finals, where the Lakers fell 4-1 to the Detroit Pistons in a stunning upset that exposed vulnerabilities in aging stars and internal discord. Despite adding veterans Karl Malone and Gary Payton, the physical, team-oriented Pistons neutralized O'Neal's dominance through collective defense led by Ben Wallace and Rasheed Wallace, limiting the Lakers' offense to stagnant play. The loss exacerbated fractures between O'Neal and Bryant, culminating in O'Neal's trade to the Miami Heat on July 14, 2004, for Lamar Odom, Caron Butler, Brian Grant, and a future first-round pick, effectively ending the partnership that had delivered three titles in four years.\n\n### Kobe Bryant solo era (2004–2016)\n\nThe departure of Shaquille O'Neal to the Miami Heat on July 14, 2004, in exchange for Lamar Odom, Caron Butler, Brian Grant, and a future first-round draft pick, signaled the end of the Lakers' dynasty with the center and ushered in Kobe Bryant's era as the franchise's primary leader. Under new head coach Rudy Tomjanovich, who resigned after 41 games due to health issues, and interim coach Frank Hamblen, the Lakers struggled with a 34-48 record in the 2004-05 season, missing the playoffs for the first time since 1993. Phil Jackson returned as head coach on June 15, 2005, on a one-year contract, bringing stability and guiding the team to incremental improvements, though they still fell short of the postseason in 2005-06 with a 45-37 record.\n\nBryant's individual brilliance defined the early years of this period, culminating in his iconic 81-point performance against the Toronto Raptors on January 22, 2006, the highest scoring output in NBA history since Wilt Chamberlain's 100 points in 1962, leading the Lakers to a 122-104 victory. He captured the NBA scoring title in the 2005-06 season with a league-leading 35.4 points per game and repeated the feat in 2006-07, averaging 31.6 points per game amid ongoing team challenges, including a first-round playoff sweep by the Phoenix Suns in 2006. These seasons highlighted Bryant's scoring prowess and resilience, as he carried a rebuilding roster featuring emerging talents like Lamar Odom and a young Andrew Bynum, though the Lakers managed only one playoff appearance in 2007, losing again to the Suns in the first round.\n\nA pivotal shift occurred on February 1, 2008, when the Lakers acquired Pau Gasol from the Memphis Grizzlies in exchange for Kwame Brown, Javaris Crittenton, Aaron McKie, the draft rights to Marc Gasol, and two future first-round picks, forming a dynamic duo with Bryant that revitalized the franchise. Under Jackson's leadership, the bolstered lineup achieved a 57-25 record in 2007-08, reaching the NBA Finals but falling to the Boston Celtics in six games. The partnership proved championship-caliber in 2009, as the Lakers defeated the Orlando Magic 4-1 in the Finals, with Bryant earning Finals MVP honors after averaging 32.4 points, 5.6 rebounds, and 7.4 assists per game. Jackson secured his 10th title as a coach, and the Lakers repeated in 2010, overcoming the Celtics in a seven-game series for a 4-3 victory, where Bryant again claimed Finals MVP with 28.6 points and 8.0 rebounds per game, marking the franchise's 16th championship.\n\nJackson retired after the 2011 Finals loss to the Dallas Mavericks, ending his second stint with five more championships and a 336-124 regular-season record from 2005-11. The Lakers hired Mike Brown as head coach on June 20, 2011, on a four-year deal, but his tenure lasted only five games into the lockout-shortened 2011-12 season, as the team fired him after a 41-25 start amid defensive inconsistencies and a second-round playoff exit. Mike D'Antoni succeeded him on November 12, 2012, on a three-year contract with a team option, emphasizing an up-tempo offense that suited Bryant's style but yielded mixed results, including a Western Conference semifinals loss to the San Antonio Spurs in 2013 before D'Antoni resigned on April 30, 2014. Byron Scott was appointed head coach on July 28, 2014, on a four-year, $17 million deal, aiming to rebuild around an aging Bryant while integrating younger players like Jordan Clarkson and D'Angelo Russell.\n\nPost-2010, the Lakers endured a sharp decline due to injuries, particularly to Bryant, who missed significant time in 2013-14 and played only 35 games in 2014-15 because of a torn Achilles and fractured knee. The team posted losing records in four consecutive seasons from 2011-12 to 2014-15, failing to advance past the first round after 2013. Bryant's legacy concluded on April 13, 2016, when he scored 60 points in his final game, a 101-96 win over the Utah Jazz, retiring with five NBA championships, 18 All-Star selections, and status as the Lakers' all-time leading scorer. The 2015-16 season encapsulated the era's struggles, finishing with a franchise-worst 17-65 record under Scott, the lowest winning percentage (.207) in Lakers history and marking their third straight season without playoffs.\n\n### Post-Kobe transition (2016–2018)\n\nFollowing Kobe Bryant's retirement after the 2015–16 season, the Los Angeles Lakers shifted focus to a youth-driven rebuild, prioritizing draft selections and player development over immediate contention. In April 2016, the team hired Luke Walton, a former Golden State Warriors assistant coach and Lakers player from 2003 to 2012, as their new head coach on a multi-year deal. Walton, who had helped lead the Warriors to a 39–4 interim record earlier that year, emphasized a fast-paced, space-oriented offensive system inspired by his time under Steve Kerr, aiming to foster creativity and ball movement among emerging talents.\n\nThe Lakers' rebuilding efforts gained momentum through the draft, selecting Duke forward Brandon Ingram with the second overall pick in 2016, a versatile scorer with exceptional length at 6-foot-9. Ingram quickly became a cornerstone, averaging 9.4 points as a rookie while showcasing his perimeter shooting and defensive potential. In 2017, under new president of basketball operations Magic Johnson—hired in February after the dismissal of general manager Mitch Kupchak—the team added UCLA point guard Lonzo Ball at No. 2 overall and Utah forward Kyle Kuzma at No. 27, forming a promising young core alongside holdover forward Julius Randle. Johnson, a Hall of Famer and five-time Lakers champion, oversaw personnel decisions from 2017 to 2019, emphasizing long-term growth over quick fixes. Randle, entering his fourth season, emerged as a double-double threat with 16.1 points and 8.0 rebounds, while Kuzma impressed as a rookie scorer at 12.7 points per game.\n\nDespite the influx of talent, the Lakers endured challenging seasons, finishing 26–56 in 2016–17 and improving slightly to 35–47 in 2017–18, missing the playoffs both years and prioritizing development over wins. Walton's pace-and-space approach yielded glimpses of potential, with the team ranking 10th in pace during 2017–18, but defensive inconsistencies and injuries hampered progress. The front office's aggressive pursuits in free agency fell short, as targets like DeMarcus Cousins signed elsewhere in 2017 and Paul George re-signed with Oklahoma City in 2018, leaving cap space intact but underscoring the need for a marquee addition. These misses ultimately positioned the Lakers to sign LeBron James in July 2018, marking the end of the transitional phase.\n\n### LeBron James arrival and early years (2018–2020)\n\nIn July 2018, LeBron James, a four-time NBA Most Valuable Player, signed a four-year contract worth $153.3 million with the Los Angeles Lakers as a free agent, marking his return to the franchise where his career had begun in a different capacity and aiming to revitalize the team after several rebuilding years. The signing brought immediate excitement but also pressure, as James averaged 27.4 points, 8.5 rebounds, and 8.3 assists per game in his Lakers debut season. However, the 2018–19 Lakers struggled with cohesion and depth, finishing with a 37–45 record and missing the playoffs for the sixth consecutive year, hampered by a midseason groin injury to James that sidelined him for 17 games and contributed to a late-season collapse.\n\nFollowing the disappointing season, the Lakers front office underwent changes, with Magic Johnson resigning as president of basketball operations in April 2019, paving the way for a more aggressive roster overhaul. In January 2019, Anthony Davis, the New Orleans Pelicans' All-Star center, publicly requested a trade, listing the Lakers among his preferred destinations, which intensified trade rumors and led to a league investigation into potential tampering by Lakers management. On June 15, 2019, the Lakers acquired Davis in a blockbuster deal, sending Lonzo Ball, Brandon Ingram, Josh Hart, and three first-round draft picks (including the Nos. 4 and 17 picks in 2019) to New Orleans, pairing James with a dominant big man to form a potent frontcourt duo. To lead the revamped roster, the Lakers hired Frank Vogel as head coach on May 13, 2019, to a three-year contract; Vogel, known for his defensive expertise from stints with the Indiana Pacers and Orlando Magic, implemented schemes emphasizing rim protection through Davis, disciplined perimeter rotations, and switchable lineups that transformed the Lakers into the NBA's top defensive team, allowing just 104.3 points per 100 possessions during the regular season.\n\nThe 2019–20 season began promisingly for the Lakers, who started 17–4, but was derailed by injuries to key supporting players, including a preseason ACL tear for center DeMarcus Cousins that wiped out his entire debut campaign and multiple absences for point guard Rajon Rondo due to back and hand issues, forcing reliance on a thinned rotation amid the league's suspension in March 2020 due to the COVID-19 pandemic. Despite these setbacks, James and Davis remained largely available, with James playing 67 games and Davis 62, helping the team finish 52–19 (.732 winning percentage) in the shortened 72-game schedule before resuming in the NBA Bubble at Walt Disney World. In the playoffs, the Lakers dominated, defeating the Portland Trail Blazers, Houston Rockets, and Denver Nuggets to reach the Finals, where they overcame the Miami Heat 4–2 to win the championship on October 11, 2020—the franchise's 17th title and first since 2010. James earned Finals MVP honors with averages of 29.8 points, 11.8 rebounds, and 8.5 assists per game, securing his fourth NBA championship ring.\n\nVogel's defensive system proved pivotal in the Bubble, holding opponents to under 100 points in five of six Finals games, while role players like forward Kyle Kuzma and guard Alex Caruso provided crucial energy and versatility; Kuzma contributed 10.8 points per game in the postseason with timely scoring and rebounding, including a 21-point effort in Game 3 of the Western Conference semifinals, and Caruso offered elite perimeter defense and hustle plays, averaging 5.9 points and 2.4 steals per 36 minutes while stepping into the starting lineup during injuries. This championship laid the foundation for the James-Davis partnership's sustained success in subsequent years.\n\n### LeBron James and Anthony Davis championships (2020–2025)\n\nFollowing their 2020 NBA championship victory, the Los Angeles Lakers, led by LeBron James and Anthony Davis, maintained a competitive presence in the Western Conference through a mix of playoff appearances, individual milestones, and roster adjustments amid persistent injury challenges. The duo's core remained the foundation, with James providing veteran leadership and scoring prowess while Davis excelled defensively, but the team navigated significant turnover and coaching changes without securing another title.\n\nIn the 2020-21 season, the defending champions acquired point guard Russell Westbrook via a sign-and-trade deal with the Washington Wizards in August 2021, sending Kyle Kuzma, Kentavious Caldwell-Pope, Montrezl Harrell, and a 2021 first-round pick in return. However, injuries limited the team's cohesion, resulting in a seventh-seed finish and a first-round playoff loss to the Phoenix Suns in six games, 4-2. The Suns outscored the Lakers by an average of 8.5 points per game in the series, highlighting defensive vulnerabilities exposed without a fully healthy roster. Westbrook was later traded in February 2023 to the Utah Jazz as part of a three-team deal that brought back D'Angelo Russell, Malik Beasley, and Jarred Vanderbilt from the Minnesota Timberwolves.\n\nUnder new head coach Darvin Ham, hired in June 2022 after serving as an assistant with the Milwaukee Bucks, the Lakers rebounded in the 2022-23 season, finishing seventh in the West and advancing through the play-in tournament to reach the Western Conference Finals. Ham's tenure emphasized defensive intensity and James-Davis synergy, leading to a 16-7 playoff run before a 4-0 sweep by the Denver Nuggets, where Nikola Jokić averaged 30.0 points and 13.5 rebounds. During this period, James achieved a historic milestone on February 7, 2023, breaking Kareem Abdul-Jabbar's all-time NBA scoring record with 38,390 points in a game against the Oklahoma City Thunder. Davis, meanwhile, peaked defensively, earning All-Defensive First Team honors in 2020 and again in 2024, while leading the league in blocks during the 2023 playoffs with 1.8 per game. Roster changes included the 2023 NBA Draft selection of guard Jalen Hood-Schifino at No. 17 overall from Indiana University, adding young backcourt depth amid ongoing turnover.\n\nHam's coaching stint ended after the 2023-24 season, during which the Lakers won the inaugural NBA In-Season Tournament but exited the playoffs in the first round with a 4-1 loss to the Nuggets, prompting his dismissal in May 2024 after a 90-74 regular-season record over two years. The 2024-25 campaign under new coach JJ Redick saw the Lakers post a 50-32 record, securing the third seed in the Western Conference and demonstrating improved balance around James and Davis, though the season was impacted mid-way by a blockbuster trade in February 2025 that sent Davis, Max Christie, Jalen Hood-Schifino, a 2025 first-round pick, and a 2025 second-round pick to the Dallas Mavericks in exchange for Luka Dončić, Maxi Kleber, and Markieff Morris (with the Utah Jazz facilitating for a protected 2027 second-round pick from Dallas), ending the James-Davis partnership after 76 games together that year. As of November 16, 2025, entering the early stages of the 2025-26 season, the team has started strongly with a 10-4 record, building on the prior contributions of James and Davis—such as Davis's defensive dominance in 2024-25 where he averaged 2.2 blocks per game before the trade—and James's enduring impact at age 40.\n\n### Luka Dončić era begins (2025–present)\n\nIn February 2025, the Los Angeles Lakers executed a blockbuster three-team trade to acquire Luka Dončić from the Dallas Mavericks, marking a pivotal shift toward a new superstar-led era. The Lakers received Dončić, Maxi Kleber, and Markieff Morris, while sending Anthony Davis, Max Christie, Jalen Hood-Schifino, a 2025 first-round draft pick, and a 2025 second-round pick to the Mavericks; the Utah Jazz were involved to facilitate salary matching and received a protected 2027 second-round pick from Dallas. This move paired the 25-year-old Slovenian phenom with LeBron James, aiming to blend Dončić's playmaking prowess with James's veteran leadership for sustained contention.\n\nDončić's integration into the Lakers' system under head coach JJ Redick, who entered his second season after a contract extension in September 2025, has been seamless from the outset of the 2025–26 campaign. In the first five games, Dončić averaged 19.6 points, 6.2 rebounds, and 3.8 assists per game, contributing to key victories, including a 130–120 win over the Miami Heat on November 3 where he tallied 29 points, 11 rebounds, and 10 assists, and a 118–116 triumph against the San Antonio Spurs on November 5. His synergy with James, who returned from an early-season injury, has emphasized pick-and-roll actions and off-ball movement, allowing Dončić to orchestrate the offense while James focuses on finishing and spacing.\n\nThe Lakers' early success, with a 10–4 record as of November 16, 2025, has been bolstered by defensive enhancements from offseason additions DeAndre Ayton and Marcus Smart. Ayton, signed as a free agent, provides rim protection and rebounding, while Smart's perimeter defense has limited opponents' three-point shooting to under 35% in wins against Miami and San Antonio. These moves have elevated the team's defensive rating to 115.9 (18th in the NBA), a modest improvement from the prior season's 113.8, particularly in transition stops and paint protection.\n\nAs of November 16, 2025, the Lakers have adjusted in power rankings, at No. 6 in USA TODAY Sports and No. 8 in NBA.com assessments, positioning them as legitimate Western Conference contenders with Dončić's scoring volume and the supporting cast's depth signaling a promising transition beyond the James-Davis tenure.\n\n## Rivalries\n\n### Boston Celtics\n\nThe rivalry between the Los Angeles Lakers and the Boston Celtics is widely regarded as the most storied and intense in NBA history, defined by their contrasting styles, geographic divide between coasts, and unparalleled success as the league's two most decorated franchises. Originating in the 1950s during the Lakers' Minneapolis era, the competition began with center George Mikan leading the Lakers against a rising Celtics team, but it truly ignited in 1956 when Bill Russell joined Boston, ushering in a dynasty of defensive dominance that clashed with the Lakers' offensive flair. Their first NBA Finals matchup came in 1959, setting the stage for a series of epic confrontations that have shaped the league's narrative.\n\nThe teams have met in the NBA Finals a record 12 times, from 1959 to 2010, with the Celtics holding a decisive 9-3 series advantage. Boston dominated the 1960s with seven victories in eight tries (1959, 1962, 1963, 1965, 1966, 1968, 1969), powered by Russell's rebounding and leadership, while the Lakers, featuring stars like Elgin Baylor and Jerry West, often fell short in heartbreaking fashion. The 1980s revived the intensity with three Finals clashes (1984, 1985, 1987), where the Celtics won in 1984 behind Larry Bird's scoring, but the Lakers prevailed in 1985 and 1987 under Magic Johnson's \"Showtime\" offense. The rivalry peaked again in the late 2000s, with Boston's 2008 triumph featuring Paul Pierce, Kevin Garnett, and Ray Allen edging Kobe Bryant's Lakers, followed by Los Angeles' revenge in 2010.\n\nIconic individual matchups have fueled the drama across eras. In the 1980s, Magic Johnson's fast-break wizardry and trash-talking charisma contrasted sharply with Larry Bird's clutch shooting and blue-collar grit, turning their Finals battles into cultural touchstones of the decade. Later, Kobe Bryant's scoring prowess faced off against Pierce's versatility and Garnett's defensive intensity in the 2008 and 2010 series, with pivotal moments like Bryant's Game 7 heroics in 2010 securing the Lakers' second straight title.\n\nOverall, the Celtics lead the all-time head-to-head record 210-166, including a 167-135 edge in regular-season games and 43-31 in playoffs. This dominance underscores Boston's historical playoff edge, though the Lakers' three recent Finals wins have narrowed the gap in championship lore.\n\nThe Lakers-Celtics feud has transcended basketball, often hailed as the greatest rivalry in American sports due to its longevity, star power, and role in elevating the NBA's global popularity. From the black-and-white intensity of the 1960s to the glitzy 1980s showdowns broadcast nationwide, it embodied East Coast toughness versus West Coast glamour, inspiring generations and cementing both teams' legacies as symbols of excellence. Even in lulls without Finals rematches, regular-season games draw massive viewership, perpetuating the \"best rivalry in sports\" narrative.\n\n### Detroit Pistons\n\nThe Lakers–Pistons rivalry reached its peak during the 1980s and early 2000s, embodying a clash between the glamorous, fast-paced Showtime era of the Lakers and the rugged, defense-oriented \"Bad Boys\" identity of the Pistons, resulting in three NBA Finals confrontations defined by physicality and high stakes. This matchup highlighted contrasting philosophies: the Lakers' reliance on star power and transition offense versus the Pistons' emphasis on gritty team defense, rebounding, and intimidation tactics that often pushed games into tense, bruising affairs. The series of playoff battles not only tested endurance but also fueled a narrative of blue-collar resilience overcoming Hollywood flair, with the Pistons securing two championships at the Lakers' expense.\n\nThe rivalry's intensity first boiled over in the late 1980s, as the Pistons, led by Hall of Famer Isiah Thomas, challenged Magic Johnson's Lakers in back-to-back NBA Finals. In 1988, the Lakers prevailed 4–3 in a grueling seven-game series, overcoming an early 0–1 deficit and a pivotal Game 5 loss in Los Angeles; James Worthy earned Finals MVP honors with a Game 7 triple-double of 36 points, 16 rebounds, and 10 assists, sealing a 108–105 victory that preserved the Lakers' title defense. The Pistons' physical style, epitomized by players like Bill Laimbeer and Dennis Rodman, frustrated the Lakers' rhythm, but Los Angeles' depth and home-court execution proved decisive. The following year, in 1989, Detroit exacted revenge with a dominant 4–0 sweep, holding the Lakers under 110 points in every game and limiting Magic Johnson to inefficient shooting; Joe Dumars was named Finals MVP for his 27.3 points per game average, while Thomas orchestrated the upset that ended the Showtime dynasty's reign and delivered Detroit's first NBA title. These Finals encapsulated the personal duel between Thomas and Johnson, two point guard legends whose on-court battles symbolized the era's blend of skill and tenacity.\n\nThe rivalry reignited in 2004, when a resurgent Pistons team dismantled the Lakers' superteam in a stunning 4–1 Finals upset, effectively ending the Shaquille O'Neal–Kobe Bryant partnership. Despite the Lakers entering as heavy favorites with a 56–26 regular-season record and additions like Karl Malone and Gary Payton, Detroit's collective effort—anchored by Defensive Player of the Year Ben Wallace's rebounding (12.4 per game) and Chauncey Billups' scoring (21.0 points per game)—overwhelmed Los Angeles, who managed just one win in overtime during Game 2. Billups earned Finals MVP for his poise and 5.2 assists per game, as the Pistons' zone defense neutralized O'Neal (26.6 points but 46.4% shooting) and forced 16.8 turnovers per game from the Lakers. This series marked the Pistons' second title in franchise history and underscored their evolution from the Bad Boys era into a disciplined unit capable of toppling dynasties.\n\nBeyond the Finals, regular-season games between the teams often mirrored this ferocity, with physical fouls and verbal exchanges heightening the atmosphere; for instance, the Bad Boys' aggressive tactics in the 1980s led to heated confrontations, including post-whistle shoves and taunts from Thomas toward Johnson that tested the Lakers' composure during road tilts in Detroit. These matchups frequently devolved into low-scoring, grind-it-out battles, reflecting the Pistons' strategy of disrupting flow through contact and psychological pressure, which carried over into the 2000s with Wallace's rim protection provoking responses from Bryant. In the playoffs overall, the teams have met 12 times across multiple rounds, but the Finals encounters dominate the narrative, where the Pistons hold an 11–5 edge in games (from 3–4 in 1988, 4–0 in 1989, and 4–1 in 2004). This lopsided Finals record, combined with the era's emblematic physicality, cements the Lakers–Pistons feud as a defining chapter in NBA lore.\n\n### Golden State Warriors\n\nThe rivalry between the Los Angeles Lakers and Golden State Warriors intensified in the 2010s as the Warriors emerged as a dominant force in the Western Conference, winning NBA championships in 2015, 2017, and 2018 behind Stephen Curry's revolutionary shooting and a motion-based offense, while the Lakers endured a rebuilding period marked by poor records, including 17 wins in the 2015–16 season during Kobe Bryant's final year and 35 wins in 2017–18 before LeBron James's arrival. This era highlighted a shift in NBA power from Los Angeles to the Bay Area, with the Warriors capturing four straight Conference Finals appearances from 2015 to 2018, sidelining the Lakers from contention and fueling regional tension in California basketball.\n\nA core element of the rivalry stems from stark stylistic contrasts: the Warriors popularized a three-point-centric, small-ball approach emphasizing pace, ball movement, and perimeter shooting—led by Curry's record-setting volume from beyond the arc—while the Lakers relied on star-driven isolation plays, interior dominance, and traditional post-up scoring from players like Bryant and later James and Anthony Davis. In regular-season matchups during the Warriors' dynasty, Golden State's league-leading three-point attempts often overwhelmed the Lakers' defense, as seen in a 2016 game where Curry scored 40 points on 8-of-13 threes.\n\nThe teams' first significant playoff clash since 2013 came in the 2021 play-in tournament, where the Lakers defeated the Warriors 103–100 on James's 22 points and 8 assists, securing the seventh seed amid Los Angeles's injury-plagued season. This set the stage for their 2023 Western Conference Semifinals matchup, a six-game series won by the Lakers 4–2, featuring dominant performances from James (averaging 22.2 points, 11.5 rebounds, and 5.8 assists) and Davis (21.8 points and 11.5 rebounds), who neutralized Curry's scoring in key wins like Game 6's 122–101 blowout. The series underscored the rivalry's evolution, with the Lakers' physicality and free-throw edge (126 made vs. Warriors' 88) prevailing over Golden State's 37.5% three-point shooting.\n\nIn the 2024–25 season, the matchup remained heated with split regular-season results, including a 118–108 Lakers victory on January 25 where Davis scored 36 points and Curry was held scoreless in the second half, and a 123–116 Warriors win on April 3 powered by Curry's 37 points. These games continued to highlight the stylistic clash, as the Warriors attempted 45 threes in the April contest compared to the Lakers' 28, reflecting ongoing adaptations in both franchises' approaches.\n\n### Los Angeles Clippers\n\nThe Los Angeles Clippers' relocation from San Diego to Los Angeles in May 1984 marked the origins of the intra-city rivalry with the Lakers, positioning the two teams as direct competitors for supremacy in the nation's second-largest media market. Owned by Donald Sterling, the Clippers moved despite initial NBA opposition and a subsequent lawsuit, beginning play at the Los Angeles Memorial Sports Arena while sharing the broader Los Angeles basketball landscape with the established Lakers franchise. Their first matchup as co-tenants occurred on November 24, 1984, with the Lakers securing a 108-104 victory in a game that drew a then-record 14,991 fans for a Clippers home contest, highlighting early tensions over fan allegiance and market share. This relocation fueled ongoing battles for Los Angeles dominance, as the Lakers, with their storied history and Showtime era success, consistently outpaced the Clippers in attendance, viewership, and overall popularity.\n\nAlthough the teams have never met in the playoffs, key regular-season confrontations in the mid-2000s and mid-2010s underscored the rivalry's intensity, particularly during periods when the Clippers challenged the Lakers' Pacific Division standing. In the 2005-06 season, the Clippers finished with a 47-35 record, two games ahead of the Lakers' 45-37 mark, leading to heated matchups; Kobe Bryant exploded for 50 points on January 7, 2006, in a 112-109 Lakers win, while he added 40 points in the second half alone during an August 1, 2006, preseason game victory. The 2014-15 season saw the Clippers further assert themselves against a rebuilding Lakers squad, winning four of five regular-season games, including a 114-89 rout on January 7, 2015, where Blake Griffin scored 27 points, and a 94-84 Christmas Day triumph later that year. These encounters amplified the competition for local bragging rights, with the Lakers holding a commanding all-time head-to-head edge of 154-87 as of February 2025.\n\nStar matchups have been central to the rivalry's narrative, pitting Lakers icons against Clippers counterparts in high-profile games. During the Clippers' \"Lob City\" era in the early 2010s, Kobe Bryant frequently dueled Blake Griffin and DeAndre Jordan, whose athleticism and alley-oop connection challenged the Lakers; a January 26, 2012, game featured Griffin posterizing Lakers defenders en route to a Clippers win, while Bryant's scoring prowess often prevailed in response. In the late 2010s and beyond, LeBron James faced Kawhi Leonard and Paul George after their 2019 arrivals in Los Angeles, creating blockbuster clashes; James outdueled Leonard with 26 points, 12 assists, and 6 rebounds in a pivotal March 8, 2020, 112-103 Lakers victory that helped secure the top Western Conference seed. These individual battles elevated the stakes, blending personal rivalries with team aspirations.\n\nCulturally, the rivalry embodies the \"Freeway Series,\" named for fans navigating the 110 Freeway between the teams' former shared home at Staples Center (now Crypto.com Arena) and the Clippers' new Intuit Dome, symbolizing the geographic and logistical competition within greater Los Angeles. Dubbed the \"Hallway Series\" due to the mere 70 feet separating their locker room entrances at Staples Center from 1999 to 2023, the matchup fostered on-site animosity, including restricted player interactions ordered by Lakers coach Pat Riley in the 1980s. Fan base competition remains a core element, with the Lakers boasting the NBA's largest following—estimated at three to eight times the Clippers' local support in 2014 data—rooted in their championship pedigree, though the Clippers have cultivated a growing, more optimistic base amid recent successes.\n\n### Phoenix Suns\n\nThe Los Angeles Lakers and Phoenix Suns have maintained a heated divisional rivalry since the Suns' inception in 1968, both competing in the NBA's Pacific Division and frequently clashing in the postseason across decades. Their playoff encounters, totaling 12 series as of 2025, have often featured high-stakes drama, with the Lakers holding a historical edge by winning seven of those matchups. This rivalry underscores the competitive dynamics of the Western Conference, where divisional foes vie for seeding advantages and playoff berths that can define seasons.\n\nEarly playoff clashes in the 1960s and 1970s laid the foundation for the rivalry, highlighted by their first postseason meeting in the 1970 Western Division Semifinals. In that seven-game series, the second-seeded Lakers overcame the third-seeded Suns in a 4-3 victory, propelled by key performances from players like Gail Goodrich, who later became a Suns star. The series, played amid the Lakers' pursuit of their first title in Los Angeles, showcased the Suns' emerging tenacity against the established Lakers franchise, setting a tone of regional competition. By the 1970s, these encounters had evolved into symbolic battles for Western Conference supremacy, though the Lakers dominated the era overall.\n\nThe rivalry intensified in the late 1980s and early 1990s, culminating in the 1990 Western Conference Semifinals, where the Suns achieved a stunning upset over the Lakers. Seeded second in the West, Phoenix defeated the top-seeded, defending conference champion Lakers 4-1, effectively ending the Pat Riley era's \"Showtime\" dominance with a roster led by Kevin Johnson and Tom Chambers. This series represented a near-miss for the Lakers' Finals aspirations, as the Suns advanced to the NBA Finals before falling to the Detroit Pistons; it marked one of only four playoff series wins for Phoenix against Los Angeles at the time. The outcome shifted divisional power dynamics, boosting the Suns' confidence while exposing vulnerabilities in the Lakers' aging core.\n\nIn the 2010s, the rivalry reignited with the 2010 Western Conference Finals, where the Lakers avenged past defeats by defeating the Suns 4-2. Kobe Bryant's dominant performance, averaging 33.7 points, 7.2 rebounds, and 8.3 assists per game, propelled Los Angeles to the NBA Finals, where they secured their second straight championship. This series highlighted the divisional stakes, as both teams entered as top Western seeds, with Phoenix's high-octane offense led by Steve Nash and Amar'e Stoudemire challenging the Lakers' defensive schemes in a back-and-forth battle. The victory reinforced the Lakers' playoff prowess against divisional rivals during Bryant's prime.\n\nThe 2020s brought renewed intensity to the Lakers-Suns matchup, particularly in the 2021 Western Conference First Round, where the Suns upset the defending champion Lakers 4-2. Despite Los Angeles holding the No. 7 seed and Phoenix the No. 2, the series featured star clashes between Devin Booker and LeBron James, with Booker erupting for 47 points in Game 5 to eliminate the Lakers and end their title defense. This defeat marked the first time since 2013 that the Lakers exited in the opening round, amplifying divisional tensions as the Suns advanced to the NBA Finals. The 2020-2021 regular season added fuel, with multiple close games underscoring the personal rivalries, such as James' scoring duels against Booker's rising stardom.\n\nOverall, the Lakers lead the playoff head-to-head record 40-28 through 68 games, reflecting their historical dominance while the Suns' occasional upsets have kept the rivalry alive. In the regular season, Los Angeles holds a 153-119 edge across 272 meetings, often influencing divisional standings and seeding in the Pacific Division. These implications extend to conference positioning, where wins against Phoenix can secure home-court advantages in deeper playoff runs, perpetuating the cycle of intense competition between the two franchises.\n\n### San Antonio Spurs\n\nThe Lakers–Spurs rivalry intensified in the 1990s and 2000s, defined by marquee battles between Tim Duncan and the Los Angeles Lakers' duo of Shaquille O'Neal and Kobe Bryant, as both franchises dominated the Western Conference. The teams clashed in the playoffs seven times from 1999 to 2013, with the Lakers winning five series, including sweeps in 1999 and 2001. A defining moment occurred in the 2003 Western Conference Semifinals, where the Spurs upset the defending champions 4–2, halting the Lakers' pursuit of a three-peat; Duncan averaged 24.1 points and 15.4 rebounds per game, effectively neutralizing O'Neal, who managed 23.8 points on 44.6% shooting. This series highlighted the personal duel between Duncan and O'Neal, with the Spurs advancing to the Finals while the Lakers regrouped for future titles during their Shaq-Kobe dynasty.\n\nThe rivalry evolved in the 2010s with the emergence of Kawhi Leonard on the Spurs, adding a layer of defensive intensity to the matchups. In the 2013 Western Conference First Round—often recalled as a semifinal-caliber clash due to its stakes—the Spurs swept the Lakers 4–0, holding Los Angeles to under 90 points in three games and exposing vulnerabilities in the Lakers' aging roster. Leonard, in his second playoff run, averaged 17.5 points, 10.3 rebounds, and 2.0 steals per game against the Lakers, primarily guarding Bryant and disrupting the offense with his length and anticipation. Leonard's breakout performance foreshadowed his starring role the following year, when he earned 2014 NBA Finals MVP honors for the Spurs' 4–1 victory over the Miami Heat, averaging 17.8 points and 6.4 rebounds while locking down LeBron James; this triumph, built on San Antonio's cohesive play, came shortly after dismantling the Lakers and symbolized the Spurs' ability to elevate young talent through systematic execution.\n\nIn recent years, the rivalry has incorporated international stars, with Victor Wembanyama anchoring the Spurs and Luka Dončić arriving at the Lakers in 2025 to spark a fresh chapter of Western Conference intrigue. On November 5, 2025, Dončić outdueled Wembanyama in a thrilling 118–116 Lakers victory, scoring 35 points, grabbing 9 rebounds, and dishing 13 assists while limiting the Spurs' rookie phenom to 19 points on inefficient shooting amid 66 combined fouls that tested both teams' composure. This matchup evoked the star-driven tension of past eras but introduced a new generational contrast between Dončić's improvisational flair and Wembanyama's raw potential within San Antonio's framework.\n\nAt its core, the Lakers–Spurs rivalry embodies a philosophical divide: the Lakers' glamorous, Hollywood-fueled ethos centered on individual stardom and dramatic narratives, versus the Spurs' disciplined, system-oriented approach emphasizing collective efficiency and humility under Gregg Popovich. This contrast—Los Angeles thriving on spectacle and high-stakes personalities like Bryant, juxtaposed against San Antonio's understated, process-driven success with players like Duncan and Leonard—has fueled consistent postseason battles and cultural resonance across decades.\n\n### Sacramento Kings\n\nThe rivalry between the Los Angeles Lakers and the Sacramento Kings, as Pacific Division opponents since the Kings relocated to Sacramento in 1985, was largely one-sided during the 1990s, with the Lakers holding a dominant edge in regular-season matchups. The Kings endured a 43-game road losing streak against the Lakers that dated back to their Kansas City days and only ended on November 8, 1992, with a 97-89 victory at the Forum. However, tensions began to build in the late 1990s as the Kings assembled a formidable roster led by Chris Webber, Vlade Divac, and Peja Stojaković, setting the stage for more competitive clashes against the Lakers' aging but still potent team anchored by Shaquille O'Neal and Kobe Bryant.\n\nThe rivalry peaked in the early 2000s with back-to-back playoff series that showcased intense battles between Webber and Mike Bibby—acquired by the Kings in 2001—for the Kings against O'Neal and Bryant's dominance for the Lakers. In the 2001 Western Conference Semifinals, the Lakers swept the Kings 4-0, with Bryant erupting for 48 points and 16 rebounds in Game 4 to close out the series 119-113 in Sacramento. The 2002 Western Conference Finals escalated the animosity, as the Lakers overcame a 3-2 deficit to win the series 4-3, highlighted by a controversial Game 6 overtime victory (119-113) where the Kings blew a 20-point lead amid 27 fouls called on Sacramento compared to just 11 on Los Angeles. In Game 7, the Lakers triumphed 112-106 in overtime, advancing to the NBA Finals for their third straight title.\n\nThe 2002 series remains the most infamous chapter of the rivalry due to widespread allegations of officiating bias, fueled by disgraced referee Tim Donaghy's 2008 claims that Games 6 and 7 were manipulated by the league to extend the series for higher television ratings, with referees favoring the star-studded Lakers. Donaghy specifically alleged that officials Dick Bavetta, Joe DeRosa, and Tom Davidson called phantom fouls on Kings players like Bibby and Webber to keep O'Neal and Bryant out of foul trouble, a narrative supported by post-game reviews showing disproportionate free-throw attempts (Lakers 37 to Kings' 27 in Game 6). Fan and media discourse has perpetuated the \"robbed\" storyline, with Kings supporters and analysts like Bill Simmons decrying it as one of the NBA's greatest injustices, while Lakers fans counter that their stars' clutch play, including Bryant's 31 points in Game 7, rightfully prevailed.\n\nSince 2002, the rivalry has lost much of its playoff intensity, with no further postseason meetings as the Kings struggled through a 16-year playoff drought from 2007 to 2023, rendering divisional games more routine despite the Lakers' continued success. All-time, the Lakers lead the regular-season series 286-168 and hold a 25-11 playoff edge as of the 2025-26 season. Recent matchups have been competitive, including a 4-4 split over the last three seasons, but the Kings' 2023 playoff resurgence under De'Aaron Fox has revived some divisional intrigue without recapturing the 2002-era bitterness.\n\n## Ownership and management\n\n### Early ownership (1946–1979)\n\nThe Minneapolis Lakers were founded in 1947 when businessman Ben Berger and ice show promoter Morris Chalfen purchased the struggling Detroit Gems of the National Basketball League for $15,000, relocating the franchise to Minneapolis and renaming it the Lakers to honor the region's \"Land of 10,000 Lakes.\" Under their ownership, the team achieved early success, winning five championships in six years during the late 1940s and early 1950s, largely driven by center George Mikan, but attendance began to wane as the league transitioned to the NBA and competition from other sports grew. Berger and Chalfen managed the franchise through this prosperous yet transitional period until financial pressures mounted in the mid-1950s.\n\nIn 1957, Berger and Chalfen sold the Lakers to a syndicate led by Bob Short, a Minneapolis trucking executive, for $150,000, marking the beginning of significant instability for the franchise. Short, facing declining attendance and mounting losses in Minneapolis—exacerbated by the team's lack of a permanent home arena and competition from hockey—relocated the Lakers to Los Angeles in 1960, making it the first major professional basketball team on the West Coast. The move initially boosted visibility and revenue, with stars like Elgin Baylor drawing crowds at temporary venues like the Los Angeles Memorial Sports Arena, but Short's ownership was plagued by ongoing financial difficulties, including high travel costs and uneven performance, leading to near-bankruptcy threats by the mid-1960s.\n\nShort sold the Lakers in September 1965 to Canadian-American entrepreneur Jack Kent Cooke for a then-record $5.175 million, providing the franchise with needed stability amid its West Coast transition. Cooke, already a prominent sports investor with stakes in hockey and football, invested heavily in infrastructure, constructing The Forum in Inglewood as the team's dedicated arena, which opened in December 1967 and became a symbol of the Lakers' growing prominence in Los Angeles. Despite on-court success under Cooke—including multiple Finals appearances—the era remained volatile due to coaching changes, player contract disputes, and the competitive pressures of the expanding NBA, setting the stage for further ownership evolution by the late 1970s.\n\n### Buss family era (1979–2025)\n\nIn 1979, Jerry Buss, a successful real estate investor, purchased the Los Angeles Lakers, the Great Western Forum arena, and the Los Angeles Kings NHL team from Jack Kent Cooke for $67.5 million. This acquisition marked the beginning of the Buss family's transformative influence on the franchise, shifting its focus from mere competitiveness to a blend of athletic excellence and entertainment spectacle. Buss's vision emphasized making Lakers games a glamorous event, aligning with Los Angeles's cultural ethos, which he achieved by investing in high-profile talent and innovative marketing strategies.\n\nUnder Buss's ownership, the Lakers entered the \"Showtime\" era, characterized by fast-paced, entertaining basketball led by stars like Magic Johnson and Kareem Abdul-Jabbar, whom Buss aggressively pursued to embody his philosophy of spectacle-driven success. This approach yielded five NBA championships in the 1980s (1980, 1982, 1985, 1987, and 1988), establishing the Lakers as a global brand and elevating the NBA's popularity. Buss further expanded the team's business model by pioneering regional sports broadcasting; he co-founded Prime Ticket in 1985, transitioning Lakers games to basic cable to broaden accessibility and revenue streams, a move that foreshadowed modern sports media empires. The franchise added another five titles in the 2000s (2000, 2001, 2002, 2009, and 2010) under Buss's continued stewardship, with investments in players like Kobe Bryant and Shaquille O'Neal reinforcing the winning culture.\n\nJerry Buss passed away on February 18, 2013, from complications related to leukemia, leaving a family trust that distributed his 66% stake equally among his six children: Jeanie, Jim, Johnny, Janie, Jesse, and Joey. His succession plan positioned daughter Jeanie Buss as the team's governor and representative to the NBA Board of Governors, while son Jim Buss served as executive vice president of basketball operations, aiming to maintain family oversight amid the franchise's growing commercial value. However, family dynamics soon strained, particularly between Jeanie and Jim, leading to internal conflicts over decision-making authority; in 2017, Jeanie exercised her governing power to sideline Jim from basketball operations, solidifying her role as the primary decision-maker and navigating legal challenges from siblings to preserve unified control. The Buss family's leadership continued through expansions like the 2011 Time Warner Cable deal, which launched Spectrum SportsNet and generated hundreds of millions in annual media rights, underscoring the enduring emphasis on innovation and profitability until the majority sale in 2025.\n\n### Mark Walter majority ownership (2025–present)\n\nIn June 2021, Mark Walter, CEO of Guggenheim Partners, and business partner Todd Boehly acquired a 27% minority stake in the Los Angeles Lakers from AEG principal owner Philip Anschutz, valuing the franchise at approximately $5.5 billion at the time. This investment marked the beginning of Walter's deeper involvement in the team's ownership structure, providing early financial infusion amid the NBA's post-pandemic recovery.\n\nThe ownership landscape shifted dramatically in June 2025 when the Buss family agreed in principle to sell a majority stake to Walter, a deal unanimously approved by the NBA Board of Governors on October 30, 2025, at a record $10 billion franchise valuation. Walter, already holding the minority interest, paid an additional $6 billion for control, while the Buss family retained about a 15% stake. Under the agreement, Jeanie Buss continues as the team's governor for at least five years, maintaining oversight of day-to-day operations and ensuring continuity in leadership. This corporate-led structure emphasizes Walter's financial expertise from managing Guggenheim Partners and ownership of the Los Angeles Dodgers, aiming to bolster long-term stability in a volatile sports market.\n\nWalter's influence has contributed to enhanced financial resources, exemplified by AEG's negotiation of a landmark $700 million, 20-year naming rights deal with Crypto.com in November 2021, rebranding the Lakers' home arena as Crypto.com Arena effective December 25, 2021. The agreement also positioned Crypto.com as the official cryptocurrency partner for the Lakers, generating additional revenue streams and underscoring a focus on innovative partnerships to support operational sustainability.\n\nDuring Walter's minority ownership period from 2021 to 2025, the Lakers, led by LeBron James and Anthony Davis, achieved consistent playoff appearances, including a Western Conference Finals run in 2023, a first-round loss to the Denver Nuggets in 2024, and a first-round loss to the Minnesota Timberwolves in 2025, though they have not secured a championship since 2020. With majority control now in place as of October 2025, Walter has committed to advancing the franchise's legacy through innovation and community engagement, leveraging increased financial flexibility for roster enhancements and infrastructure investments.\n\n## Popularity and branding\n\n### Fanbase and cultural impact\n\nThe Los Angeles Lakers possess one of the largest and most dedicated fanbases in the NBA, consistently ranking at the top in popularity metrics across surveys and social media engagement. Their global reach is underscored by approximately 60.3 million social media followers across platforms, surpassing the league average and reflecting a fanbase that extends far beyond Los Angeles. This widespread support traces back to the \"Showtime\" era of the 1980s, when the fast-paced style led by Magic Johnson and Kareem Abdul-Jabbar captivated audiences and drew Hollywood celebrities to games, with actor Jack Nicholson becoming an iconic courtside fixture for over five decades. Nicholson's visible passion, including his 2024 recognition by the Naismith Memorial Basketball Hall of Fame as a superfan, exemplified the Lakers' allure to entertainment elites during that championship dynasty.\n\nThe franchise's international appeal has been amplified by superstars like Kobe Bryant and LeBron James, who elevated the team's profile on a worldwide stage. Bryant's five championships and global marketing efforts, including his role in NBA outreach in Asia and Europe, helped solidify the Lakers as a cultural export, while James's 2018 signing further boosted overseas interest by uniting two of basketball's biggest icons. This is evident in the team's robust social media presence, with over 25 million Instagram followers as of November 2025, second only to the Warriors among NBA franchises and driving viral content that resonates globally. Bryant's \"Mamba Mentality\"—a philosophy of relentless work ethic and mental toughness—has permeated pop culture, inspiring athletes, business leaders, and fans beyond basketball, as detailed in his 2018 book and echoed in tributes following his 2020 passing.\n\nKey cultural moments have further cemented the Lakers' influence, particularly their 2020 NBA Championship won in the league's COVID-19 \"bubble\" at Walt Disney World, which symbolized resilience amid the pandemic. The title, secured without a single reported coronavirus case in the isolated environment, provided a beacon of normalcy and unity during global lockdowns, with LeBron James and Anthony Davis leading the charge in a season disrupted by social justice protests and health crises. The fanbase's diversity, spanning ethnicities, ages, and geographies, has shown unwavering loyalty through multiple rebuild periods, such as the post-Shaquille O'Neal and post-Kobe eras marked by losing seasons. Studies highlight Lakers supporters as the NBA's most engaged, maintaining high attendance and online interaction even during non-contending years, a testament to the franchise's enduring emotional pull. The arrival of Luka Dončić in 2025 has further energized the fanbase, contributing to early-season social media spikes and renewed global interest as of November 2025.\n\n### Sponsors and partnerships\n\nThe Los Angeles Lakers maintain extensive corporate sponsorships that enhance their branding and generate substantial revenue through jersey patches, arena naming rights, and marketing activations. Nike has served as the official jersey sponsor for the Lakers since 2017, providing apparel for players and fans while integrating team-specific designs that align with the franchise's iconic purple and gold aesthetic.\n\nA pivotal partnership is the naming rights agreement for Crypto.com Arena, the team's home venue, which Crypto.com secured in a reported $700 million, 20-year deal beginning December 2021 and extending through 2041. This arrangement replaced the previous Staples Center branding and includes promotional integrations across Lakers games, events, and digital platforms, solidifying Crypto.com's visibility in the sports entertainment sector.\n\nHistorically, the Lakers partnered with brands like Coca-Cola, which sponsored the team from the early 1990s until 1996, when the deal ended amid conflicts involving player endorsements such as Shaquille O'Neal's preference for competitors. In recent years, activations have included the Bibigo jersey patch sponsorship, initiated in 2021 as a $100 million multiyear agreement with the Korean food brand, marking the first global marketing partnership of its kind for the franchise and featuring on-court promotions and fan experiences.\n\nThese sponsorships play a critical role in the Lakers' financial ecosystem, contributing to the team's overall annual revenue exceeding $550 million as of the 2024-25 season, with corporate deals forming a significant portion alongside ticket sales and media rights. The 2021 arena renaming sparked controversy among fans, who viewed the shift from the longstanding Staples Center name—associated with six Lakers championships—as a commercialization that diminished the venue's historical legacy. The October 2025 ownership transition to majority stakeholder Mark Walter has emphasized continuity in sponsorship strategies, focusing on innovative partnerships to sustain the franchise's brand prestige.\n\n### Name origin and evolution\n\nThe franchise traces its origins to the Detroit Gems, established in 1946 as an expansion team in the National Basketball League (NBL).\n\nFollowing a dismal inaugural season with a 4–40 record, the team was purchased by a group led by Ben Berger and Morris Chalfen, who relocated it to Minneapolis, Minnesota, and renamed it the Minneapolis Lakers ahead of the 1947–48 season.\n\nThe \"Lakers\" moniker was selected to honor Minnesota's state nickname, \"The Land of 10,000 Lakes,\" reflecting the region's abundant waterways and lumber industry history.\n\nIn 1960, amid declining attendance and arena issues, the team relocated to Los Angeles under new ownership by Jack Kent Cooke, becoming the Los Angeles Lakers while preserving the original name despite the coastal city's minimal connection to lakes.\n\nThis retention has persisted through the franchise's history, with no significant rebrands or name changes since 1947, underscoring the enduring legacy of its Midwestern roots.\n\nThe team's color scheme, initially royal blue and white in Minneapolis, shifted to royal blue, white, and gold upon the move to Los Angeles, before adopting the iconic purple and gold in 1969 to align with the Los Angeles Kings hockey team; this palette inspired the longstanding nickname \"Purple and Gold.\"\n\n### Logo and uniform history\n\nThe visual identity of the Los Angeles Lakers traces its roots to the team's inception as the Minneapolis Lakers in 1947, when the primary logo featured a silhouette of the state of Minnesota overlaid on a brown and black basketball outline, accented by a yellow star and gold stars representing the \"Land of 10,000 Lakes,\" with the franchise colors being royal blue and gold. Upon relocating to Los Angeles in 1960, the team updated its logo to a stylized royal blue basketball within a white circle and outer blue ring, symbolizing a fresh start on the West Coast while retaining the blue and white uniform palette. In 1961, the Lakers introduced a prominent wordmark logo featuring the script word \"Lakers\" in royal blue, which appeared on uniforms and became a staple of their early Los Angeles era branding.\n\nThe franchise's logo underwent further refinement in 1965, adopting a full \"Los Angeles Lakers\" wordmark in purple script arched over a gold basketball with black outlines, aligning with the introduction of the team's enduring purple and gold color scheme in 1969 under owner Jack Kent Cooke, who selected the hues to evoke royalty, excellence, and the glamour of Los Angeles. This design, with minor tweaks such as enhanced outlines in 1976 and bolder colors in 2001, has served as the primary logo ever since, appearing on jerseys, merchandise, and official materials. The 1991 version solidified its iconic status with a cleaner purple script and gold basketball, remaining unchanged through the present day to maintain brand continuity.\n\nThe Lakers' uniforms evolved alongside their logos, starting with royal blue home jerseys and white road sets from 1960 to 1968, which complemented the early Los Angeles wordmark and emphasized a clean, professional look. The 1969 shift to purple home uniforms with gold road alternates, featuring the new wordmark across the chest, marked a pivotal change that coincided with the team's move to The Forum and set the foundation for their glamorous \"Showtime\" identity in the 1980s, where gold jerseys often included white numbers with purple trim. By the 1990s, uniforms retained the classic purple and gold scheme with subtle updates like arched player names and improved fabric, though full black alternates did not debut until the 2013 \"Hollywood Nights\" edition, a black jersey with purple and gold accents designed to capture the city's entertainment vibe and worn for select games.\n\nThe Nike partnership starting in 2017 introduced greater customization, including distinct editions: Icon (purple), Association (white), Statement (black with purple/gold details), and Classic throwbacks, allowing for dynamic rotations while preserving core elements like the script wordmark. In the 2020s, City Edition jerseys have prominently honored Kobe Bryant, such as the 2019-20 black \"Mamba Edition\" with a snake motif and triangular wordmark throwback, and the 2020 playoff white uniform featuring black mamba embroidery as a tribute following his death. These designs, along with retired throwbacks like the 1960s royal blue and 1980s purple Showtime jerseys, rank among fan favorites for their nostalgic appeal and are periodically revived for special occasions to celebrate the franchise's legacy.\n\n## Facilities and operations\n\n### Home arenas\n\nThe Minneapolis Lakers, as the franchise was originally known, played their home games primarily at the Minneapolis Auditorium from 1947 to 1960. This venue, opened in 1927, had a capacity of approximately 10,000 for basketball games and served as the team's primary home during their dominant early years, including five NBA championships. The Auditorium hosted the Lakers' inaugural season in the National Basketball League before their transition to the Basketball Association of America and eventual NBA, fostering a strong local fanbase in a city known for its basketball tradition.\n\nUpon relocating to Los Angeles in 1960, the Lakers made the Los Angeles Memorial Sports Arena their first home until 1967. Built in 1959 as part of the Exposition Park complex, the arena had a capacity of 15,000 for basketball and marked the team's integration into the Southern California sports scene, though attendance was modest in the early years as the franchise adjusted to its new market. The venue also hosted other events, but for the Lakers, it represented a transitional period before their rise to prominence.\n\nIn 1967, the Lakers moved to The Forum in Inglewood, California, which remained their home until 1999. Designed by architect Charles Luckman and inspired by the Roman Colosseum, the circular arena seated 17,505 for basketball games and became synonymous with the team's \"Showtime\" era under coach Pat Riley, featuring stars like Magic Johnson and Kareem Abdul-Jabbar. Attendance soared during this period, with the Lakers achieving near-constant sellouts; for instance, in the 1992–93 season, they drew 633,655 fans across home games, representing approximately 88% capacity. The Forum also set NBA playoff attendance marks, including a record 17,568 for Game 7 of the 1969 NBA Finals against the Boston Celtics.\n\nThe Lakers shifted to the newly constructed Staples Center in downtown Los Angeles in 1999, sharing the venue with the Los Angeles Clippers and the NHL's Los Angeles Kings. With a basketball capacity of 18,997, the arena hosted seven Lakers championships during its tenure, including the three-peat from 2000 to 2002, and consistently ranked among the NBA's top in attendance due to the team's popularity. The shared arrangement with the Clippers lasted until the 2023–24 season, when the Clippers relocated to the Intuit Dome, ending 25 years of co-tenancy.\n\nIn November 2021, the arena was renamed Crypto.com Arena following a naming rights deal, and it has served as the Lakers' exclusive home since the Clippers' departure. The venue maintains a capacity of 18,910 for Lakers games, accommodating the team's continued status as one of the league's most attended franchises. Capacity adjustments over time, such as minor expansions and configurations for different events, have ensured the arena remains a modern hub for NBA basketball in Los Angeles.\n\n### Practice and training facilities\n\nThe Los Angeles Lakers have utilized various practice and training facilities throughout their history, initially relying on university campuses for workouts and training camps. In the early years after relocating to Los Angeles in 1960, the team held practices and camps at Pepperdine University in Malibu from 1960 and 1962, and at Loyola Marymount University in Los Angeles from 1963 to 1976, where the Gersten Pavilion served as an official practice site shared with other local NBA teams like the Clippers.\n\nFrom 2000 to 2017, the Lakers' primary practice facility was the Toyota Sports Performance Center in El Segundo, California, a 135,000-square-foot complex that opened in March 2000 and included two basketball courts alongside ice rinks shared with the Los Angeles Kings and Sparks. The facility supported daily practices, conditioning, and rehabilitation, though its shared nature and limited amenities, such as single-person metal tubs for hydrotherapy, prompted the search for a dedicated space.\n\nIn 2017, the Lakers relocated their basketball operations to the UCLA Health Training Center, also in El Segundo, a 120,000-square-foot state-of-the-art facility that serves as both headquarters and practice site for the team and its G League affiliate, the South Bay Lakers. The center features two full-size basketball courts replicating game conditions at Crypto.com Arena, dedicated medical and treatment suites, a full-service weight training area, hydrotherapy pools accommodating up to 15 players, high-definition video and analytics rooms, and player amenities including a lounge, spa, and commercial kitchen to enhance recovery and performance.\n\nThese advanced facilities have significantly contributed to player development and injury management, providing comprehensive resources for rehabilitation following high-intensity periods like the 2020 NBA bubble playoffs, where the Lakers won the championship amid a compressed schedule that led to subsequent injury challenges in the 2020-21 season. The integration of medical suites and analytics labs allows for personalized recovery protocols, reducing downtime and supporting long-term athlete health.\n\n## Records and statistics\n\n### Season-by-season records\n\nThe Los Angeles Lakers franchise, originally founded as the Detroit Gems in 1946 before relocating to Minneapolis in 1947 and then to Los Angeles in 1960, holds the distinction of winning 17 NBA championships—the second-most in league history—and making 32 appearances in the NBA Finals. These accomplishments span 78 seasons through the 2025-26 campaign, with an all-time regular-season record of 3,618 wins and 2,494 losses for a .592 winning percentage. The team has qualified for the playoffs in 65 of those seasons, compiling a 468-322 postseason record.\n\nThe table below details the franchise's performance year by year, listing the regular-season record, winning percentage, playoff outcome, head coach(es), and any NBA Most Valuable Player awards won by Lakers players (noting that MVPs are awarded annually since 1955-56, with Lakers winners including George Mikan, Elgin Baylor, Wilt Chamberlain, Kareem Abdul-Jabbar, Magic Johnson, Shaquille O'Neal, Kobe Bryant, and LeBron James). Data encompasses the Minneapolis Lakers era (1948-60) and the Los Angeles era (1960-present), with the 2025-26 season record current as of November 16, 2025. Note: The 1947-48 season was in the NBL; 1948-49 in the BAA (pre-NBA merger). The 1946-47 season as Detroit Gems is not included in franchise totals.\n\n| Season   | Regular Season (W-L) | Win % | Playoff Outcome                  | Head Coach(es)              | MVP(s)                  |\n|----------|----------------------|-------|----------------------------------|-----------------------------|-------------------------|\n| 2025-26 | 9-4                 | .692 | Ongoing                         | JJ Redick                   | None                    |\n| 2024-25 | 50-32               | .610 | Lost Western Conf. First Round (1-4 vs. Denver) | JJ Redick               | None                    |\n| 2023-24 | 47-35               | .573 | Lost Western Conf. First Round (0-4 vs. Denver) | Darvin Ham             | None                    |\n| 2022-23 | 43-39               | .524 | Lost Western Conf. Finals (0-4 vs. Denver) | Darvin Ham            | None                    |\n| 2021-22 | 33-49               | .402 | Did not qualify                 | Frank Vogel                | None                    |\n| 2020-21 | 42-30               | .583 | Lost Western Conf. First Round (2-4 vs. Phoenix) | Frank Vogel         | None                    |\n| 2019-20 | 52-19               | .732 | Won NBA Finals (4-2 vs. Miami)  | Frank Vogel                | None                    |\n| 2018-19 | 37-45               | .451 | Did not qualify                 | Luke Walton                | None                    |\n| 2017-18 | 35-47               | .427 | Did not qualify                 | Luke Walton                | None                    |\n| 2016-17 | 53-29               | .646 | Lost Western Conf. First Round (2-4 vs. Golden State) | Luke Walton     | None                    |\n| 2015-16 | 17-65               | .207 | Did not qualify                 | Byron Scott                | None                    |\n| 2014-15 | 21-61               | .256 | Did not qualify                 | Byron Scott                | None                    |\n| 2013-14 | 27-55               | .329 | Did not qualify                 | Mike D'Antoni, Mike Brown | None                    |\n| 2012-13 | 45-37               | .549 | Lost Western Conf. Semifinals (1-4 vs. San Antonio) | Mike Brown, Mike D'Antoni | None                |\n| 2011-12 | 41-25               | .621 | Lost Western Conf. Semifinals (3-4 vs. Oklahoma City) | Mike Brown      | None                    |\n| 2010-11 | 57-25               | .695 | Lost Western Conf. Finals (0-4 vs. Dallas) | Phil Jackson         | None                    |\n| 2009-10 | 57-25               | .695 | Won NBA Finals (4-3 vs. Boston) | Phil Jackson               | None                    |\n| 2008-09 | 65-17               | .793 | Won NBA Finals (4-1 vs. Orlando)| Phil Jackson               | None                    |\n| 2007-08 | 57-25               | .695 | Lost NBA Finals (2-4 vs. Boston)| Phil Jackson               | None                    |\n| 2006-07 | 42-40               | .512 | Lost Western Conf. First Round (1-4 vs. Phoenix) | Phil Jackson      | None                    |\n| 2005-06 | 45-37               | .549 | Lost Western Conf. First Round (3-4 vs. Phoenix) | Phil Jackson      | None                    |\n| 2004-05 | 34-48               | .415 | Did not qualify                 | Rudy Tomjanovich, Frank Hamblen | None               |\n| 2003-04 | 56-26               | .683 | Lost NBA Finals (1-4 vs. Detroit)| Phil Jackson              | None                    |\n| 2002-03 | 50-32               | .610 | Lost Western Conf. Finals (2-4 vs. San Antonio) | Phil Jackson     | None                    |\n| 2001-02 | 58-24               | .707 | Won NBA Finals (4-2 vs. New Jersey) | Phil Jackson        | None                    |\n| 2000-01 | 56-26               | .683 | Won NBA Finals (4-1 vs. Philadelphia) | Phil Jackson       | None                    |\n| 1999-00 | 67-15               | .817 | Won NBA Finals (4-2 vs. Indiana)| Phil Jackson                | Shaquille O'Neal        |\n| 1998-99 | 31-19               | .620 | Lost NBA Finals (0-4 vs. San Antonio) | Kurt Rambis       | None                    |\n| 1997-98 | 61-21               | .744 | Lost Western Conf. Finals (3-4 vs. Utah) | Del Harris          | None                    |\n| 1996-97 | 61-21               | .744 | Lost Western Conf. Semifinals (1-4 vs. Utah) | Del Harris        | None                    |\n| 1995-96 | 53-29               | .646 | Lost Western Conf. Finals (1-4 vs. Seattle) | Del Harris         | None                    |\n| 1994-95 | 48-34               | .585 | Lost Western Conf. Semifinals (2-4 vs. San Antonio) | Del Harris     | None                    |\n| 1993-94 | 58-24               | .707 | Lost Western Conf. Semifinals (2-4 vs. Houston) | Randy Pfund, Del Harris | None                 |\n| 1992-93 | 52-30               | .634 | Lost Western Conf. Finals (0-4 vs. Phoenix) | Mike Dunleavy     | None                    |\n| 1991-92 | 46-36               | .561 | Lost Western Conf. Semifinals (2-4 vs. Portland) | Mike Dunleavy   | None                    |\n| 1990-91 | 58-24               | .707 | Lost NBA Finals (1-4 vs. Chicago)| Mike Dunleavy              | None                    |\n| 1989-90 | 63-19               | .768 | Lost Western Conf. Finals (3-4 vs. Portland) | Pat Riley         | None                    |\n| 1988-89 | 57-25               | .695 | Lost NBA Finals (0-4 vs. Detroit)| Pat Riley                  | None                    |\n| 1987-88 | 62-20               | .756 | Won NBA Finals (4-3 vs. Detroit)| Pat Riley                  | None                    |\n| 1986-87 | 65-17               | .793 | Won NBA Finals (4-2 vs. Boston) | Pat Riley                  | Magic Johnson           |\n| 1985-86 | 63-19               | .768 | Lost Western Conf. Finals (2-4 vs. Houston) | Pat Riley        | None                    |\n| 1984-85 | 62-20               | .756 | Won NBA Finals (4-2 vs. Boston) | Pat Riley                  | None                    |\n| 1983-84 | 58-24               | .707 | Lost NBA Finals (2-4 vs. Boston)| Pat Riley                  | None                    |\n| 1982-83 | 58-24               | .707 | Lost NBA Finals (0-4 vs. Philadelphia) | Pat Riley        | None                    |\n| 1981-82 | 57-25               | .695 | Won NBA Finals (4-2 vs. Philadelphia) | Pat Riley        | None                    |\n| 1980-81 | 62-20               | .756 | Lost NBA Finals (2-4 vs. Houston)| Paul Westhead              | None                    |\n| 1979-80 | 60-22               | .732 | Won NBA Finals (4-2 vs. Philadelphia) | Paul Westhead     | Kareem Abdul-Jabbar     |\n| 1978-79 | 53-29               | .646 | Lost Western Conf. Finals (1-4 vs. Seattle) | Jerry West        | None                    |\n| 1977-78 | 45-37               | .549 | Lost Western Conf. Semifinals (2-4 vs. Seattle) | Jerry West      | None                    |\n| 1976-77 | 53-29               | .646 | Lost Western Conf. Finals (2-4 vs. Golden State) | Bill Sharman    | Kareem Abdul-Jabbar     |\n| 1975-76 | 42-40               | .512 | Lost Western Conf. Semifinals (2-4 vs. Golden State) | Bill Sharman  | Kareem Abdul-Jabbar     |\n| 1974-75 | 40-42               | .488 | Did not qualify                 | Bill Sharman                | None                    |\n| 1973-74 | 47-35               | .573 | Lost Western Conf. Semifinals (1-4 vs. Golden State) | Bill Sharman  | None                    |\n| 1972-73 | 60-22               | .732 | Lost Western Conf. Finals (1-4 vs. Golden State) | Bill Sharman    | None                    |\n| 1971-72 | 69-13               | .841 | Won NBA Finals (4-1 vs. New York)| Bill Sharman                | None                    |\n| 1970-71 | 57-25               | .695 | Lost Western Conf. Finals (0-4 vs. Milwaukee) | Joe Mullaney     | None                    |\n| 1969-70 | 46-36               | .561 | Lost Western Conf. Semifinals (3-4 vs. Atlanta) | Joe Mullaney   | Wilt Chamberlain        |\n| 1968-69 | 55-27               | .671 | Lost Western Conf. Finals (3-4 vs. Golden State) | Butch van Breda Kolff | None               |\n| 1967-68 | 55-27               | .671 | Lost NBA Finals (2-4 vs. Boston)| Butch van Breda Kolff       | None                    |\n| 1966-67 | 62-20               | .756 | Lost NBA Finals (2-4 vs. Philadelphia) | Fred Schaus      | None                    |\n| 1965-66 | 45-35               | .563 | Lost Western Div. Finals (3-4 vs. Baltimore) | Fred Schaus     | None                    |\n| 1964-65 | 49-31               | .613 | Lost Western Div. Finals (3-4 vs. San Francisco) | Fred Schaus  | None                    |\n| 1963-64 | 54-26               | .675 | Lost NBA Finals (3-4 vs. Boston)| Fred Schaus                 | None                    |\n| 1962-63 | 53-27               | .663 | Lost NBA Finals (2-4 vs. Boston)| Fred Schaus                 | None                    |\n| 1961-62 | 54-26               | .675 | Lost NBA Finals (3-4 vs. Boston)| Fred Schaus                 | None                    |\n| 1960-61 | 51-28               | .646 | Lost Western Div. Finals (2-4 vs. St. Louis) | Fred Schaus    | None                    |\n| 1959-60 | 25-50               | .333 | Did not qualify (Minneapolis)   | John Kundla                 | None                    |\n| 1958-59 | 33-39               | .458 | Lost Western Div. Semifinals (0-2 vs. St. Louis) | John Kundla    | None                    |\n| 1957-58 | 25-47               | .347 | Did not qualify (Minneapolis)   | John Kundla                 | None                    |\n| 1956-57 | 34-38               | .472 | Lost Western Div. Finals (1-3 vs. St. Louis) | John Kundla      | None                    |\n| 1955-56 | 33-33               | .500 | Lost Western Div. Semifinals (1-2 vs. St. Louis) | John Kundla   | None                    |\n| 1954-55 | 37-35               | .514 | Lost Western Div. Finals (2-3 vs. Fort Wayne) | John Kundla    | None                    |\n| 1953-54 | 46-26               | .639 | Won NBA Finals (4-3 vs. Syracuse)| John Kundla                 | None                    |\n| 1952-53 | 48-26               | .649 | Won NBA Finals (4-1 vs. New York) | John Kundla     | None                    |\n| 1951-52 | 40-26               | .606 | Won NBA Finals (4-3 vs. New York)| John Kundla                 | None                    |\n| 1950-51 | 44-24               | .647 | Lost NBA Finals (3-4 vs. Rochester) | John Kundla       | None                    |\n| 1949-50 | 51-17               | .750 | Won NBA Finals (4-2 vs. Syracuse)| John Kundla                 | None                    |\n| 1948-49 | 44-16               | .733 | Won BAA Finals (4-2 vs. Washington) | John Kundla      | None                    |\n| 1947-48 | 43-17               | .717 | Lost NBL Finals (1-2 vs. Rochester) | John Kundla    | None                    |\n\nPlayoff outcomes reflect the structure of the era (e.g., divisions, conferences). Multiple coaches in a season are listed if applicable. MVP column lists only regular-season NBA MVP winners from the Lakers.\n\n### Franchise records\n\nThe Los Angeles Lakers franchise holds numerous statistical benchmarks that highlight its storied history, including individual career leaders in key categories and notable team achievements. These records reflect the contributions of legendary players and eras that have defined the team's success.\n\nIn terms of scoring, Kobe Bryant stands as the all-time leader with 33,643 points scored during his 20-season tenure from 1996 to 2016, a mark that underscores his role as the franchise's premier offensive force. For rebounds, Elgin Baylor holds the top spot with 11,463 over his 14 seasons from 1958 to 1971, exemplifying his dominance on the boards during the early Los Angeles era. Other prominent leaders include Magic Johnson with 10,141 assists across 13 seasons from 1979 to 1991 and 1996, and Kareem Abdul-Jabbar with 2,694 blocks in his 14 years from 1975 to 1989.\n\n| Category       | Leader              | Total     | Years with Lakers |\n|----------------|---------------------|-----------|-------------------|\n| Points        | Kobe Bryant        | 33,643   | 1996–2016        |\n| Rebounds      | Elgin Baylor       | 11,463   | 1958–1971        |\n| Assists       | Magic Johnson      | 10,141   | 1979–1991, 1996  |\n| Steals        | Kobe Bryant        | 1,944    | 1996–2016        |\n| Blocks        | Kareem Abdul-Jabbar| 2,694    | 1975–1989        |\n\nOn the team level, the 1971–72 Lakers set the franchise record for most regular-season wins with a 69–13 mark, led by Wilt Chamberlain and Jerry West in a season that also produced their first Los Angeles-era championship. That same campaign featured the longest winning streak in Lakers history, with 33 consecutive victories from November 5, 1971, to January 7, 1972, a run that spanned regular-season games and remains a benchmark of sustained excellence.\n\nIn the playoffs, the Lakers have appeared in the NBA Finals a franchise-record 32 times, securing 17 victories—the second-most in league history—across championships won in 1949, 1950, 1952, 1953, 1954 (as the Minneapolis Lakers), and 1972, 1980, 1982, 1985, 1987, 1988, 2000, 2001, 2002, 2009, 2010, and 2020. These accomplishments highlight the team's postseason prowess and its 17 total NBA titles.\n\n### NBA-wide accomplishments\n\nThe Los Angeles Lakers hold the second-most NBA championships with 17 titles, behind the Boston Celtics' 18, a feat that underscores their status as one of the league's most successful franchises. These victories span from the Minneapolis era in 1949 to the modern Los Angeles period, including the 2020 title amid the COVID-19 pandemic. The Lakers are one of only two NBA teams to achieve three consecutive championships twice: first with the Minneapolis Lakers from 1952 to 1954, and later with the Los Angeles Lakers from 2000 to 2002 under coach Phil Jackson, Shaquille O'Neal, and Kobe Bryant. This dual three-peat distinction highlights their repeated dominance across eras, with the 2000–2002 run marking the last such streak in NBA history as of 2025.\n\nIndividual contributions from Lakers players have also shaped league milestones. George Mikan, the franchise's inaugural superstar, exerted such control under the basket during the early 1950s that his dominance prompted key NBA rule changes, including the widening of the free-throw lane from 6 to 12 feet in 1951 to prevent him from camping too close to the rim and the introduction of the 24-second shot clock in 1954 to speed up play. These adjustments, known collectively as the \"Mikan rules,\" were designed to counter his scoring prowess and enhance competitive balance across the league. Additionally, Magic Johnson etched his name in NBA lore by becoming the only rookie to win Finals MVP honors in 1980, averaging 21.5 points, 11.2 rebounds, and 8.7 assists while filling in at center in Game 6 to clinch the series against the Philadelphia 76ers.\n\nIn terms of business achievements, the Lakers pioneered NBA franchise valuations in the 2010s, becoming one of the first teams valued at over $1 billion in 2013 according to Forbes, trailing only the New York Knicks that year at $1.1 billion. This milestone reflected the team's massive market in Los Angeles, lucrative media deals, and global brand appeal, setting a benchmark for the league's economic growth. By 2025, their valuation had soared to $10 billion following a record sale, further cementing their financial preeminence.\n\n## Personnel\n\n### Current front office\n\nThe Los Angeles Lakers' front office is led by Jeanie Buss, who serves as the team's governor and oversees day-to-day operations, a role she has held since 2017 and which she will continue for at least five years following the franchise's ownership transition. Rob Pelinka functions as the president of basketball operations and general manager, positions he has occupied since his initial appointment as GM in February 2017 and subsequent promotions in 2020 and 2025.\n\nUnder majority owner Mark Walter, who acquired a controlling stake in the Lakers for a $10 billion valuation in October 2025, the organizational structure emphasizes continuity in basketball decision-making while integrating Walter's broader sports portfolio influence from his Dodgers ownership. Pelinka reports directly to Buss, who in turn aligns with Walter on strategic matters, forming a streamlined executive hierarchy focused on roster construction and competitive sustainability.\n\nPelinka has been instrumental in recent high-profile decisions, most notably orchestrating the February 2025 three-team trade that brought Luka Dončić to the Lakers in exchange for Anthony Davis, Max Christie, and additional assets involving the Utah Jazz. This move, executed at the NBA trade deadline, repositioned the franchise around Dončić's superstar talent and was followed by Pelinka securing Dončić to a long-term contract extension in August 2025, solidifying the core for the 2025-26 season. These actions underscore Pelinka's role in leveraging the Lakers' assets to pursue championship contention amid the new ownership era.\n\n### Current roster\n\nThe Los Angeles Lakers' 2025–26 roster features a blend of veteran stars and emerging talents, anchored by superstar acquisitions and key retainers following significant offseason moves, including the blockbuster trade acquiring Luka Dončić from the Dallas Mavericks in exchange for Anthony Davis. As of November 16, 2025, the active roster consists of 15 standard-contract players plus three two-way contract holders, with an average age of approximately 27.1 years and a total salary commitment of $196,730,110 under the NBA's salary cap. The team emphasizes versatility in the frontcourt and backcourt depth to support a championship push, though injuries to key contributors like LeBron James (out with right sciatica, expected return next week), Gabe Vincent (out with left ankle sprain, 2-4 weeks remaining), and Rui Hachimura (out with left calf contusion) have prompted rotations. Austin Reaves and Maxi Kleber are active following recent recoveries from groin and oblique strains, respectively.\n\nThe projected starting lineup includes Luka Dončić at point guard, Austin Reaves (or Marcus Smart) at shooting guard, LeBron James at small forward when healthy, Rui Hachimura at power forward, and Deandre Ayton at center, providing a mix of scoring, playmaking, and rim protection. Bench players such as Jake LaRavia, Jarred Vanderbilt, and Jaxson Hayes offer rotational depth, with two-way players contributing in select games. All players are under multi-year contracts unless noted, with salaries reflecting the 2025-26 season figures.\n\n| No. | Player | Position | Height | Weight | Age | Experience | 2025-26 Salary | Status |\n|-----|--------|----------|--------|--------|-----|------------|----------------|--------|\n| 77 | Luka Dončić | PG | 6-6 | 230 | 26 | 7 years | $45,999,660 | Active (Starter) |\n| 15 | Austin Reaves | SG | 6-5 | 206 | 27 | 4 years | $13,937,574 | Active (Starter) |\n| 36 | Marcus Smart | SG | 6-3 | 220 | 31 | 11 years | $5,134,000 | Active (Starter) |\n| 23 | LeBron James | SF | 6-9 | 250 | 40 | 22 years | $52,627,153 | Out (Right Sciatica, expected next week) |\n| 28 | Rui Hachimura | PF | 6-8 | 230 | 27 | 6 years | $18,259,259 | Out (Left Calf Contusion) |\n| 12 | Jake LaRavia | PF | 6-8 | 235 | 24 | 3 years | $6,000,000 | Active (Starter) |\n| 5 | Deandre Ayton | C | 7-0 | 250 | 27 | 7 years | $8,104,000 | Active (Starter) |\n| 2 | Jarred Vanderbilt | PF | 6-8 | 214 | 26 | 7 years | $11,571,429 | Active (Bench) |\n| 4 | Dalton Knecht | SF | 6-6 | 215 | 24 | 1 year | $4,010,160 | Active (Bench) |\n| 11 | Jaxson Hayes | C | 7-0 | 220 | 25 | 6 years | $3,449,323 | Active (Bench) |\n| 9 | Bronny James | SG | 6-2 | 210 | 21 | 1 year | $1,955,377 | Active (Bench) |\n| 14 | Maxi Kleber | PF | 6-10 | 240 | 33 | 8 years | $11,000,000 | Active (Bench) |\n| 7 | Gabe Vincent | PG | 6-3 | 195 | 29 | 6 years | $11,500,000 | Out (Left Ankle Sprain, 2-4 weeks) |\n| 1 | Adou Thiero | SF | 6-6 | 234 | 21 | Rookie | $2,300,000 | Active (Bench) |\n| 30 | Chris Mañon (TW) | SG | 6-5 | 212 | 24 | Rookie | Two-Way | Active (Bench) |\n| 20 | Nick Smith Jr. (TW) | SG | 6-2 | 185 | 21 | 2 years | Two-Way | Active (Bench) |\n| 10 | Christian Koloko (TW) | C | 7-1 | 230 | 25 | 2 years | Two-Way | Active (Bench) |\n\nSalaries and statuses are current as of November 16, 2025, and subject to change based on NBA transactions or medical updates. The roster's high payroll reflects investments in proven talent, positioning the Lakers as contenders in the Western Conference despite early-season injury challenges.\n\n### Draft assets and history\n\nThe Los Angeles Lakers have a storied history of leveraging the NBA Draft to acquire transformative talent, with several selections becoming cornerstones of championship eras. In the 1979 NBA Draft, the Lakers selected point guard Magic Johnson with the first overall pick, a choice that initiated the franchise's \"Showtime\" dynasty and led to five NBA titles during his tenure. Johnson, a Michigan State standout, averaged 19.5 points, 7.2 rebounds, and 11.2 assists over his Lakers career, earning three MVP awards and revolutionizing the point guard position. Similarly, in the 1996 NBA Draft, the Lakers acquired Kobe Bryant after selecting him 13th overall on behalf of the Charlotte Hornets in a pre-arranged trade, immediately trading him to Los Angeles for Vlade Divac. Bryant's arrival sparked three straight championships from 2000 to 2002 and five overall, with him amassing 33,643 career points, the fourth-most in NBA history, during 20 seasons with the team. These picks exemplify the Lakers' ability to identify high-impact players even outside the lottery, contributing to 17 of their 17 championships through drafted talent.\n\nBeyond high selections, the Lakers have excelled at unearthing value from later rounds and undrafted players, adding depth and longevity to their rosters. A notable example is Austin Reaves, who went undrafted in the 2021 NBA Draft out of Oklahoma but signed a two-way contract with the Lakers shortly after, earning a standard contract by the end of his rookie season. Reaves has since become a key contributor, averaging 13.0 points and 5.5 assists in the 2023-24 season while shooting 40.4% from three-point range, helping the team reach the playoffs and providing cost-controlled production amid salary cap constraints. Such acquisitions highlight the franchise's scouting prowess in an era where draft capital is often traded away for star power.\n\nThe Lakers' draft strategy has been significantly shaped by major trades, particularly the 2019 acquisition of Anthony Davis from the New Orleans Pelicans, which cost the franchise substantial future assets. In exchange for Davis—who paired with LeBron James to win the 2020 NBA Championship—the Lakers surrendered Lonzo Ball, Brandon Ingram, Josh Hart, the unprotected first-round picks in 2021 and 2023, a top-10 protected first-round pick in 2025, and the right to swap first-round picks in 2022 and 2024. This deal depleted the team's draft inventory, forcing reliance on trades and free agency for rebuilding while conveying late picks like the No. 55 overall in 2025 (effectively a second-rounder due to protections). The 2025 first-round pick obligation was fulfilled when it conveyed as the #22 overall selection in the 2025 NBA Draft, which the Pelicans used. Under the remaining terms, if the 2025 pick had not conveyed, the obligation would have become an unprotected 2026 first-round pick to the Pelicans; with conveyance, no further first-round obligations remain from this trade.\n\nIn recent drafts, the Lakers selected guard Jalen Hood-Schifino 17th overall in 2023 as part of their youth infusion efforts, though his development stalled, leading to a trade to the Utah Jazz in December 2023 and the subsequent decline of his third-year option in October 2024, forfeiting any retained rights ahead of the 2025-26 season. This move, alongside the broader impacts of the Davis trade, underscores the franchise's ongoing challenge in balancing immediate contention with long-term draft flexibility, as they enter the 2025-26 season with limited incoming picks.\n\n## Coaching\n\n### Historical head coaches\n\nThe Los Angeles Lakers franchise, originally founded as the Minneapolis Lakers in 1947, has employed 29 head coaches through the 2024–25 NBA season, encompassing both the Minneapolis and Los Angeles eras. John Kundla, the inaugural head coach from 1948 to 1959, led the team to five NBA championships during its Minneapolis tenure, establishing a dynasty with innovative strategies that emphasized teamwork and fast breaks. His regular season record was 423–302 (.583), complemented by a playoff mark of 60–35 (.632), making him the winningest coach in franchise history by games coached until surpassed in later decades.\n\nIn the Los Angeles era, Phil Jackson holds the distinction of the most successful head coach, serving in two stints from 1999 to 2004 and 2011 to 2012, during which he secured five NBA championships, including a three-peat from 2000 to 2002 with the Shaquille O'Neal–Kobe Bryant core. Jackson's overall franchise record stands at 610–292 (.676) in the regular season and 118–63 (.652) in the playoffs, renowned for implementing the triangle offense that maximized player spacing and decision-making. Other pivotal figures include Pat Riley, who coached from 1982 to 1990 and won four titles while posting a .733 regular season winning percentage, the highest in franchise history.\n\nThe franchise's coaching history reflects periods of dominance interspersed with transitional phases. These include luminaries like Bill Sharman, who captured the 1972 championship, and Frank Vogel, who led the 2020 title run in the NBA bubble.\n\n| Coach                | Years       | Regular Season (W-L, Pct.) | Playoff (W-L, Pct.) | Championships |\n|----------------------|-------------|----------------------------|---------------------|---------------|\n| John Kundla         | 1948–1959  | 423–302 (.583)            | 60–35 (.632)       | 5            |\n| Fred Schaus         | 1960–1967  | 315–245 (.563)            | 33–38 (.465)       | 0            |\n| Butch van Breda Kolff | 1968–1969 | 107–57 (.652)             | 21–12 (.636)       | 0            |\n| Joe Mullaney        | 1969–1971  | 94–70 (.573)              | 16–14 (.533)       | 0            |\n| Bill Sharman        | 1971–1976  | 246–164 (.600)            | 22–15 (.595)       | 1            |\n| Jerry West          | 1976–1979  | 145–101 (.589)            | 8–14 (.364)        | 0            |\n| Jack McKinney       | 1979       | 10–4 (.714)               | —                  | 0            |\n| Paul Westhead       | 1979–1982  | 111–50 (.689)             | 13–6 (.684)        | 1            |\n| Pat Riley           | 1981–1990  | 533–194 (.733)            | 102–47 (.685)      | 4            |\n| Mike Dunleavy       | 1990–1992  | 101–63 (.616)             | 13–10 (.565)       | 0            |\n| Randy Pfund         | 1992–1993  | 66–80 (.452)              | 2–3 (.400)         | 0            |\n| Del Harris          | 1994–1999  | 224–116 (.659)            | 17–19 (.472)       | 0            |\n| Kurt Rambis         | 1999       | 24–13 (.649)              | 3–5 (.375)         | 0            |\n| Phil Jackson        | 1999–2004, 2011–2012 | 610–292 (.676)     | 118–63 (.652)      | 5            |\n| Rudy Tomjanovich    | 2004–2005  | 24–19 (.558)              | —                  | 0            |\n| Frank Hamblen       | 2005       | 10–29 (.256)              | —                  | 0            |\n| Luke Walton         | 2016–2019  | 98–148 (.398)             | —                  | 0            |\n| Byron Scott         | 2014–2016  | 38–126 (.232)             | —                  | 0            |\n| Frank Vogel         | 2019–2022  | 127–98 (.564)             | 18–9 (.667)        | 1            |\n| Darvin Ham          | 2022–2024  | 90–74 (.549)              | 9–12 (.429)        | 0            |\n| JJ Redick           | 2024–present | 59–36 (.621) (through Nov. 16, 2025) | 1–4 (.200) | 0            |\n\n*Note: Records include the full franchise history from 1948; interim coaches and partial seasons are incorporated where applicable. Playoff entries marked \"—\" indicate no postseason appearance. Data current as of November 16, 2025.*\n\n### Current coaching staff\n\nThe Los Angeles Lakers' head coach for the 2025–26 NBA season is JJ Redick, who was hired in 2024 and extended his contract in September 2025 ahead of the campaign. In his second year leading the team, Redick has guided the Lakers to a 9–4 start through November 16, 2025, emphasizing a high-tempo offensive system that leverages the skills of stars like LeBron James and Luka Dončić while maintaining defensive principles.\n\nThe assistant coaching staff under Redick consists of experienced NBA veterans and rising talents, focused on player development, offensive schemes, and defensive strategies to support the team's championship aspirations. Key members include lead assistants Scott Brooks and Nate McMillan, who bring head coaching pedigrees from prior stints with the Oklahoma City Thunder and Atlanta Hawks, respectively, aiding in game planning and in-game adjustments. Other assistants are Bob Beyer (defensive specialist), Greg St. Jean (offensive coordinator), Lindsey Harding (the franchise's first female assistant, specializing in guard development and Dončić's integration), Beau Levesque (player development), and Ty Abbott (scouting and analytics).\n\n| Coach Name       | Role                          | Notable Background |\n|------------------|-------------------------------|--------------------|\n| JJ Redick       | Head Coach                   | Former NBA player; hired 2024; focuses on modern analytics-driven offense. |\n| Scott Brooks    | Lead Assistant Coach         | Former Thunder head coach (2009–18); expertise in player motivation. |\n| Nate McMillan   | Associate Head Coach         | Former Hawks head coach (2020–23); defensive schemes emphasis. |\n| Bob Beyer       | Assistant Coach (Defense)    | Longtime NBA assistant; perimeter defense specialist. |\n| Greg St. Jean   | Assistant Coach (Offense)    | Son of former Kings coach; aids in pick-and-roll integration for Dončić. |\n| Lindsey Harding | Assistant Coach (Development)| First female Lakers coach; former WNBA player; key in backcourt training. |\n| Beau Levesque   | Assistant Coach (Development)| Focuses on big man conditioning and team chemistry. |\n| Ty Abbott       | Assistant Coach (Analytics)  | Supports data-driven decisions and scouting. |\n\nThis staff's philosophy, shaped post-Darvin Ham's tenure, prioritizes a balanced approach blending fluid offensive motion—tailored for Dončić's playmaking—with robust perimeter defense to address previous vulnerabilities, fostering a cohesive unit around the veteran core.\n\n## Honors\n\n### Naismith Memorial Basketball Hall of Famers\n\nThe Los Angeles Lakers franchise boasts one of the most storied legacies in professional basketball, with numerous individuals tied to the organization earning induction into the Naismith Memorial Basketball Hall of Fame for their exceptional contributions during their tenure with the team. As of 2025, 45 Hall of Famers have affiliations with the Lakers, spanning players, coaches, executives, and contributors, many of whom played pivotal roles in the franchise's 17 NBA championships and its status as a global basketball powerhouse. These inductees highlight the Lakers' tradition of attracting and developing elite talent, from the Minneapolis era through the modern Los Angeles dynasty.\n\n### Players\nThe majority of Lakers-affiliated Hall of Famers are players who spent significant portions of their careers with the team, often leading championship runs and setting franchise records. Below is a selection of key inductees, focusing on their Lakers-specific achievements:\n\n| Name              | Induction Year | Key Lakers Contributions |\n|-------------------|----------------|--------------------------|\n| Kareem Abdul-Jabbar | 1995          | Played 14 seasons (1975–1989), averaging 22.1 points and 9.4 rebounds per game; won 5 NBA championships, including Finals MVP in 1985; his skyhook became a signature move in Lakers Showtime era. |\n| Elgin Baylor      | 1977          | Entire 14-year career (1958–1971) with Lakers, averaging 27.4 points and 13.5 rebounds; 10-time All-NBA First Team, led team to 7 NBA Finals appearances. |\n| Kobe Bryant       | 2020          | 20 seasons (1996–2016), averaging 25.0 points; 5 NBA championships, 2 Finals MVPs, 1 MVP; orchestrated three-peat (2000–2002) and back-to-back titles (2009–2010). |\n| Wilt Chamberlain  | 1979          | 5 seasons (1968–1973), averaging 17.7 points and 19.2 rebounds; won 1972 NBA championship and Finals MVP, anchoring the team's first Los Angeles title. |\n| Magic Johnson     | 2002          | 13 seasons (1979–1991, 1996), averaging 19.5 points and 11.2 assists; 5 NBA championships, 3 MVPs, 3 Finals MVPs; revolutionized point guard play in Showtime offense. |\n| Shaquille O'Neal  | 2016          | 8 seasons (1996–2004), averaging 27.0 points and 11.5 rebounds; 3 NBA championships, 3 Finals MVPs; dominated as the most powerful center in Lakers three-peat. |\n| Jerry West        | 1980          | Entire 14-year career (1960–1974), averaging 27.0 points; 1 NBA championship (1972), 1 Finals MVP (1969); logo inspiration, known for clutch scoring in multiple Finals. |\n| James Worthy      | 2003          | 12 seasons (1982–1994), averaging 17.6 points; 3 NBA championships, 1 Finals MVP (1988); key forward in Showtime, renowned for fast-break dunks. |\n\nOther notable player inductees include Gail Goodrich (1996), who led the 1972 championship team with 19.0 points per game over 9 seasons; Pau Gasol (2023), a two-time champion (2009, 2010) averaging 17.7 points and 9.9 rebounds in 7 seasons; and Michael Cooper (2024), a five-time champion and 1987 Defensive Player of the Year over 12 seasons, excelling in perimeter defense. Recent additions like Carmelo Anthony (2025) and Dwight Howard (2025) reflect shorter but impactful stints, with Anthony averaging 13.3 points in his lone 2021–2022 season and Howard contributing to the 2020 championship with 10.7 points and 8.8 rebounds across 3 seasons.\n\n### Coaches and Executives\nLakers coaches and executives have also been richly represented, building dynasties through innovative strategies and shrewd personnel decisions. Phil Jackson (2007) coached 11 seasons (1999–2004, 2005–2011), securing 5 championships with his triangle offense, leveraging stars like Kobe Bryant and Shaquille O'Neal. Pat Riley (2008) served as head coach for 9 seasons (1981–1990), winning 4 championships and pioneering the fast-paced Showtime style with Magic Johnson.\n\nExecutives like Jerry West, inducted for a third time as a contributor in 2024 after prior honors as a player (1980) and contributor (2021), spent decades in Lakers front office roles (1968–2000, various capacities), assembling 8 championship teams as general manager, including drafting Magic Johnson and acquiring Kareem Abdul-Jabbar. Jerry Buss (2010, contributor) owned the team from 1979 to 2013, overseeing 10 championships and transforming the Lakers into a cultural phenomenon with high-profile signings like Shaquille O'Neal. Other executives include Elgin Baylor (2006, contributor), who as scout and GM (1970s–1990s) helped build the 1980s dynasty.\n\n### Contributors and Broadcasters\nChick Hearn (2003, contributor) served as the Lakers' play-by-play announcer for 42 seasons (1961–2002), coining terms like \"slam dunk\" and broadcasting 11 championships, enhancing the team's national appeal. Bill Sharman (2004, coach/contributor) coached the 1972 champions, implementing innovative training methods during his 5-year stint (1971–1976).\n\nThese inductees' Lakers tenures underscore the franchise's emphasis on winning and innovation, with many having their numbers retired in tribute to their legacies.\n\n### Retired and honored numbers\n\nThe Los Angeles Lakers honor their most impactful players by retiring their jersey numbers, a tradition that recognizes exceptional contributions to the franchise's success, including multiple championships, individual awards, and Hall of Fame induction. These numbers are permanently removed from circulation and displayed as banners in the rafters of Crypto.com Arena, the team's home venue since 1999. The criteria typically emphasize players who have been enshrined in the Naismith Memorial Basketball Hall of Fame and played pivotal roles in Lakers history, such as leading the team to NBA titles or earning MVP honors. As of November 2025, the Lakers have retired 14 numbers belonging to 13 players, with Kobe Bryant's Nos. 8 and 24 both honored in a single ceremony. In addition to these, the Lakers honor the league-wide retirement of No. 6 for Bill Russell.\n\nThe retirement ceremonies are emotional events held during home games, often featuring speeches from the honoree, teammates, and franchise legends, highlighting the player's legacy. For example, Jamaal Wilkes' No. 52 was retired in a halftime ceremony on December 28, 2012, against the Portland Trail Blazers, celebrating his three championships and All-Star selections during the 1970s and 1980s.\n\n| Number | Player              | Years with Lakers | Year Retired | Ceremony Date                  | Key Honors with Lakers                                                                 |\n|--------|---------------------|-------------------|--------------|--------------------------------|----------------------------------------------------------------------------------------|\n| 8      | Kobe Bryant        | 1996–2016        | 2017        | December 18, 2017             | 5× NBA champion, 2× Finals MVP, 15× All-Star; wore No. 8 for first 10 seasons.        |\n| 13     | Wilt Chamberlain   | 1968–1973        | 1983        | November 9, 1983              | 1× NBA champion (1972), Finals MVP (1972); averaged 14.8 points and 24.1 rebounds in Lakers tenure. |\n| 16     | Pau Gasol          | 2008–2014, 2018–2020 | 2023     | March 7, 2023                 | 2× NBA champion (2009, 2010), 2× All-Star; key frontcourt partner to Kobe Bryant.     |\n| 21     | Michael Cooper     | 1978–1990        | 2025        | January 13, 2025              | 5× NBA champion, Defensive Player of the Year (1987); renowned perimeter defender.    |\n| 22     | Elgin Baylor       | 1958–1971        | 1983        | November 9, 1983              | 11× All-Star, Rookie of the Year (1959); franchise scoring leader for decades.         |\n| 24     | Kobe Bryant        | 1996–2016        | 2017        | December 18, 2017             | 5× NBA champion, 2× Finals MVP, 15× All-Star; switched to No. 24 in 2006–07 season.   |\n| 25     | Gail Goodrich      | 1965–1968, 1970–1976 | 1996    | November 20, 1996             | 1× NBA champion (1972), 4× All-Star; scored 25 points in 1972 Finals-clinching Game 5. |\n| 32     | Magic Johnson      | 1979–1991, 1996  | 1992        | February 16, 1992             | 5× NBA champion, 3× MVP, 12× All-Star; revolutionized point guard position.           |\n| 33     | Kareem Abdul-Jabbar| 1975–1989        | 1990        | March 20, 1990                | 5× NBA champion, 3× MVP, 10× All-Star with Lakers; all-time NBA scoring leader at retirement. |\n| 34     | Shaquille O'Neal   | 1996–2004        | 2013        | April 2, 2013                 | 3× NBA champion (2000–2002), MVP (2000), Finals MVP (2000–2002).                      |\n| 42     | James Worthy       | 1982–1994        | 1995        | December 10, 1995             | 3× NBA champion, Finals MVP (1988), 7× All-Star; \"Big Game James\" in playoffs.        |\n| 44     | Jerry West         | 1960–1974        | 1983        | November 19, 1983             | 1× NBA champion (1972), 14× All-Star, Finals MVP (1969); \"The Logo\" of NBA.           |\n| 52     | Jamaal Wilkes      | 1977–1985        | 2012        | December 28, 2012             | 3× NBA champion, 3× All-Star, Rookie of the Year (1975).                              |\n| 99     | George Mikan       | 1948–1954 (Minneapolis Lakers) | 2022 | October 30, 2022              | 5× NBA champion (pre-Los Angeles era), 4× scoring champion; franchise founder.        |\n\nThese retirements underscore the Lakers' emphasis on legacy, with ceremonies often timed to coincide with milestone games or anniversaries to maximize fan engagement. Many of these honorees, such as Chamberlain, Johnson, and Bryant, are also Naismith Memorial Basketball Hall of Famers, linking the visual tributes to broader accolades.\n\n### FIBA Hall of Famers\n\nSeveral players associated with the Los Angeles Lakers have been inducted into the FIBA Hall of Fame for their outstanding contributions to international basketball. The FIBA Hall of Fame recognizes individuals who have significantly impacted the global growth of the sport, including through their performances in FIBA competitions and professional leagues. Among Lakers alumni, two international players stand out for their enshrinement, highlighting the franchise's role in bridging NBA talent with worldwide basketball excellence.\n\nVlade Divac, a Serbian center, was inducted into the FIBA Hall of Fame in 2010 as a player. Divac played for the Lakers from 1989 to 1996, appearing in 626 regular-season games and helping establish the team as a perennial contender during the early 1990s. His international career included leading Yugoslavia to EuroBasket titles in 1989 and 1991, as well as a silver medal at the 1996 Olympics, where he averaged 13.0 points and 8.5 rebounds per game. Divac's versatility as a 7-foot-1 center, combining scoring, passing, and defense, made him a pioneer for European big men in the NBA, influencing the league's globalization.\n\nPau Gasol, a Spanish power forward/center, was inducted into the FIBA Hall of Fame in 2025 as a player. Gasol joined the Lakers in 2008 and remained with the team until 2014, contributing to NBA championships in 2009 and 2010 alongside Kobe Bryant, where he averaged 18.8 points and 9.6 rebounds per game across 289 regular-season appearances. On the international stage, Gasol secured three Olympic medals with Spain (silver in 2008 and 2012, bronze in 2016) and two FIBA World Cup golds (2006 and 2019), earning MVP honors in 2006. His skill set, featuring post scoring, mid-range shooting, and playmaking, elevated Spain's dominance in European basketball and inspired a generation of international forwards.\n\nThese inductees exemplify the Lakers' contributions to basketball's international expansion, as their successes in purple and gold amplified their global legacies. No primary coaches from the Lakers have been inducted into the FIBA Hall of Fame, though the franchise's participation in international exhibitions, such as preseason games in Asia, has fostered broader cultural ties, including events linked to icons like Yao Ming during the NBA's early outreach efforts in China.\n\n| Inductee | Year Inducted | Role | Lakers Tenure | Key International Achievements |\n|----------|---------------|------|---------------|-------------------------------|\n| Vlade Divac | 2010 | Player | 1989–1996 | 2× EuroBasket gold (1989, 1991); Olympic silver (1996) |\n| Pau Gasol | 2025 | Player | 2008–2014 | 3× Olympic medals; 2× FIBA World Cup gold (MVP 2006) |\n\n## Media coverage\n\n### Broadcast history\n\nThe Los Angeles Lakers' broadcast history began shortly after the team's relocation from Minneapolis to Los Angeles in 1960, with local television coverage starting that season on KTTV Channel 11. In 1961, legendary play-by-play announcer Chick Hearn joined the team as the radio voice, quickly becoming synonymous with Lakers basketball through his innovative style and coined phrases like \"Forum Blue and Gold\" to describe the team's colors. Hearn's tenure from 1961 to 2002 marked a golden era for Lakers broadcasting, during which he called 3,338 consecutive games starting November 21, 1965, encompassing nine of the franchise's championships in Los Angeles. Most of his broadcasts in the television era were simulcast on both radio and TV, fostering a unified listening and viewing experience for fans across Southern California.\n\nFollowing Hearn's passing in 2002, the Lakers ended their long-standing simulcast tradition after the 2002-03 season, separating radio and TV coverage to allow for specialized production. Local television rights shifted over the years, with games airing on outlets like KCAL Channel 9 and Fox Sports Net West until 2012. That year, Time Warner Cable launched Spectrum SportsNet (initially branded as Time Warner Cable SportsNet) on October 1 as the team's exclusive regional sports network, under a landmark 20-year deal valued at approximately $3 billion. This network provided high-definition coverage of all non-nationally exclusive Lakers games, along with pre- and post-game shows, enhancing local access for subscribers in the team's market.\n\nNationally, Lakers games have been featured prominently on NBA broadcast partners since the league's television expansion in the 1960s, with current regular-season appearances on ESPN, ABC, NBC, Amazon Prime Video, and NBA TV—often totaling over 30 games per season due to the team's popularity. On radio, the Lakers have aired on various Los Angeles stations since the 1960s, transitioning to KLAC from 1980 to 2009 before moving to ESPN LA 710 (KSPN) as the flagship in the 2009-10 season, where it remains the primary outlet for play-by-play coverage across a regional network.\n\nPost-2020, broadcasting evolved with the rise of streaming amid cord-cutting trends, as the NBA expanded digital rights and Spectrum introduced SportsNet+ in October 2023—a direct-to-consumer service allowing authenticated out-of-market fans to stream live Lakers games via app or web without traditional cable. This shift complemented national streaming options on platforms like the NBA app and services carrying ESPN/TNT, broadening accessibility while maintaining Spectrum SportsNet's role in local TV distribution.\n\n### Local media outlets\n\nThe primary local print outlet for Los Angeles Lakers coverage is the *Los Angeles Times*, which has provided in-depth reporting on the team since its relocation to the city in 1960. Columnist Bill Plaschke has been a prominent voice since 1996, offering opinion pieces and analysis on Lakers games, roster moves, and franchise history, often drawing on his Hall of Fame credentials from the National Sports Media Association. Beat reporter Broderick \"Brad\" Turner covers daily news, including practices, injuries, and trades, with a focus on the team's on-court performance and front-office decisions; for instance, Turner detailed the Lakers' 2025 acquisition of Luka Dončić from the Dallas Mavericks, highlighting its impact on team dynamics.\n\nESPN LA (710 AM) features dedicated daily programming on the Lakers, such as *Lakers Talk Daily*, which airs weekday discussions on recent games, player interviews, and trade rumors, hosted by analysts like Andy Kamenetzky. The station's postgame shows provide immediate analysis following home games at Crypto.com Arena, integrating fan calls and expert breakdowns to engage the local audience.\n\nProminent online platforms include Silver Screen and Roll, a SB Nation affiliate that delivers fan-oriented news, game recaps, and opinion pieces since 2008, emphasizing statistical breakdowns and roster evaluations. Lakers Nation, established in 2009, operates as the self-proclaimed largest Lakers fan site, offering breaking news, rumors, and video content, with extensive coverage of the 2025 Dončić trade as a pivotal shift toward contention.\n\nPodcast integrations enhance local digital coverage, with Silver Screen and Roll producing *Lakers Lounge*, a daily show hosted by Anthony Irwin that features NBA insiders discussing Lakers strategies and player developments. Similarly, Lakers Nation's podcast, hosted by Trevor Lane, provides weekly episodes on team history and current events, often tying into broader LA media narratives.\n\nHistorically, Lakers media in Los Angeles has been shaped by figures like Chick Hearn, the team's legendary play-by-play announcer from 1961 to 2002, whose innovative terminology and accessible style influenced local reporting across print and broadcast outlets, fostering a conversational tone in coverage. In 2025, local outlets like the *Los Angeles Times* and Lakers Nation extensively covered the Dončić trade, analyzing its emotional and strategic implications for the franchise's championship aspirations.",
  "external_references": [
    {
      "text": "Lakers",
      "url": "https://www.nba.com/team/1610612747/lakers",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lal",
      "url": "https://www.basketball-reference.com/teams/LAL/",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "History Main",
      "url": "https://www.nba.com/lakers/history/history-main",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Sale Mark Walter E20fa3696abf1cc56b74babb02d621e4",
      "url": "https://apnews.com/article/lakers-sale-mark-walter-e20fa3696abf1cc56b74babb02d621e4",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Lakers Retired Numbers",
      "url": "https://www.nba.com/lakers/history/lakers-retired-numbers",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "1947.html",
      "url": "https://www.basketball-reference.com/nbl/teams/DTG/1947.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Behind The Name.html",
      "url": "https://www.nba.com/lakers/news/behind_the_name.html",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "George Mikan",
      "url": "https://www.hoophall.com/hall-of-famers/george-mikan/",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "History Nba Legend George Mikan",
      "url": "https://www.nba.com/news/history-nba-legend-george-mikan",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Mikange01.html",
      "url": "https://www.basketball-reference.com/players/m/mikange01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1950 Nba Finals Lakers Vs Nationals.html",
      "url": "https://www.basketball-reference.com/playoffs/1950-nba-finals-lakers-vs-nationals.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Season Capsule",
      "url": "https://www.nba.com/lakers/history/season-capsule",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Shot Clock History Invention Leo Ferris George Mikan",
      "url": "https://www.si.com/nba/2017/08/28/nba-shot-clock-history-invention-leo-ferris-george-mikan",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Bob Short",
      "url": "https://sabr.org/bioproj/person/bob-short/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Sports Arena History",
      "url": "https://www.lacoliseum.com/sports-arena-history/",
      "domain": "lacoliseum.com",
      "type": "citation"
    },
    {
      "text": "1959",
      "url": "https://www.espn.com/nba/history/awards/_/year/1959",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Westje01.html",
      "url": "https://www.basketball-reference.com/players/w/westje01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "History This Date In Nba July",
      "url": "https://www.nba.com/news/history-this-date-in-nba-july",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Top Moments Lakers Streak",
      "url": "https://www.nba.com/news/history-top-moments-lakers-streak",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Misc 20211119 Top Moments Celtics Lakers Rivalry",
      "url": "https://www.nba.com/celtics/news/sidebar/misc-20211119-top-moments-celtics-lakers-rivalry",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Nba Legend Bill Russell",
      "url": "https://www.nba.com/news/history-nba-legend-bill-russell",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Season Review 1975 76",
      "url": "https://www.nba.com/news/history-season-review-1975-76",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Archive 75 Kareem Abdul Jabbar",
      "url": "https://www.nba.com/news/archive-75-kareem-abdul-jabbar",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Earvin Magic Johnson",
      "url": "https://www.nba.com/lakers/history/alumni/earvin-magic-johnson",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Nba Legend Magic Johnson",
      "url": "https://www.nba.com/news/history-nba-legend-magic-johnson",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Finals Moments Magic Johnson Steps In At Center In 1980",
      "url": "https://www.nba.com/news/history-finals-moments-magic-johnson-steps-in-at-center-in-1980",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Pat Riley",
      "url": "https://www.nba.com/lakers/history/alumni/pat-riley",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Chick Hearn Los Angeles Lakers Magic Johnson Pat Riley",
      "url": "https://www.si.com/nba/2015/08/04/chick-hearn-los-angeles-lakers-magic-johnson-pat-riley",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Playoff History",
      "url": "https://www.nba.com/lakers/history/playoff-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "James Worthy",
      "url": "https://www.nba.com/lakers/history/alumni/james-worthy",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Archive 75 James Worthy",
      "url": "https://www.nba.com/news/archive-75-james-worthy",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Basketball Magic Johnson Ends His Career Saying He Has Aids Infection.html",
      "url": "https://www.nytimes.com/1991/11/08/sports/basketball-magic-johnson-ends-his-career-saying-he-has-aids-infection.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "A 70906185",
      "url": "https://www.dw.com/en/magic-johnsons-1991-press-conference-changed-how-hiv-and-aids-are-perceived/a-70906185",
      "domain": "dw.com",
      "type": "citation"
    },
    {
      "text": "Owners Gm Coach",
      "url": "https://www.nba.com/lakers/history/owners-gm-coach",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Vlade Divac Says Trading Kobe Bryant Was No Brainer",
      "url": "https://www.espn.com/nba/story/_/id/14511340/vlade-divac-says-trading-kobe-bryant-was-no-brainer",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 1996 07 19 Mn 25718 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-1996-07-19-mn-25718-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Kobe Bryant Jerry West Draft Workout Changed Nba History",
      "url": "https://www.espn.com/nba/story/_/id/30957423/kobe-bryant-jerry-west-draft-workout-changed-nba-history",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Week History Kobe Bryant Makes Nba Debut Los Angeles Lakers 1996",
      "url": "https://www.nba.com/news/week-history-kobe-bryant-makes-nba-debut-los-angeles-lakers-1996",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Fistfights Battle Lines Showboat Lakers Kobe Shaq Dynasty",
      "url": "https://www.espn.com/nba/story/_/id/29927167/fistfights-battle-lines-showboat-lakers-kobe-shaq-dynasty",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Where Do Nba Coaches Get Their Plays",
      "url": "https://www.espn.com/nba/story/_/id/29946346/nba-finals-where-do-nba-coaches-get-their-plays",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "History Finals Mvp Winners",
      "url": "https://www.nba.com/news/history-finals-mvp-winners",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "How 2004 Nba Finals Win Shaq Kobe Lakers Cemented Ben Wallace Hall Fame Legacy",
      "url": "https://www.espn.com/nba/story/_/id/32174156/how-2004-nba-finals-win-shaq-kobe-lakers-cemented-ben-wallace-hall-fame-legacy",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Legendary Moments Shaquille Oneal Trade Lakers Heat",
      "url": "https://www.nba.com/news/legendary-moments-shaquille-oneal-trade-lakers-heat",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Phil Jackson And Lakers To Reunite 361 Days After Breakup.html",
      "url": "https://www.nytimes.com/2005/06/14/sports/basketball/phil-jackson-and-lakers-to-reunite-361-days-after-breakup.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "1 22 06 Lakers Vs Raptors Kobes Immortal 81",
      "url": "https://www.nba.com/watch/video/1-22-06-lakers-vs-raptors-kobes-immortal-81",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Bryanko01.html",
      "url": "https://www.basketball-reference.com/players/b/bryanko01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Grizzlies Trade Gasol To Lakers 080201.html",
      "url": "https://www.nba.com/grizzlies/news/grizzlies_trade_gasol_to_lakers-080201.html",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals 2009 2",
      "url": "https://www.nba.com/watch/list/collection/nba-finals-2009-2",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals 2010 2",
      "url": "https://www.nba.com/watch/list/collection/nba-finals-2010-2",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "110531lakers Hire Mikebrown.html",
      "url": "https://www.nba.com/lakers/news/110531lakers_hire_mikebrown.html",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "121112lakers Hire Mike Dantoni",
      "url": "https://www.nba.com/lakers/releases/121112lakers-hire-mike-dantoni",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "140728byronscott Headcoach",
      "url": "https://www.nba.com/lakers/releases/140728byronscott_headcoach",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Kobe Bryant Los Angeles Lakers Says Knew 2015 16 Final Season",
      "url": "https://www.espn.com/nba/story/_/id/14257274/kobe-bryant-los-angeles-lakers-says-knew-2015-16-final-season",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2016.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2016.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Agree Deal Luke Walton New Head Coach",
      "url": "https://www.espn.com/nba/story/_/id/15430821/los-angeles-lakers-agree-deal-luke-walton-new-head-coach",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "160621 Luke Walton Introduced",
      "url": "https://www.nba.com/lakers/news/160621_luke-walton-introduced",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2016 Nba Draft Los Angeles Lakers Take Brandon Ingram No 2 Pick",
      "url": "https://www.espn.com/nba/draft2016/story/_/id/16458661/2016-nba-draft-los-angeles-lakers-take-brandon-ingram-no-2-pick",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "180423 Player Capsule Julius Randle",
      "url": "https://www.nba.com/lakers/news/180423-player-capsule-julius-randle",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2017 Nba Draft Los Angeles Lakers Draft Lonzo Ball No 2 Overall Pick",
      "url": "https://www.espn.com/nba/story/_/id/19710945/2017-nba-draft-los-angeles-lakers-draft-lonzo-ball-no-2-overall-pick",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Mitch Kupchak Magic Johnson.html",
      "url": "https://www.nytimes.com/2017/02/21/sports/basketball/los-angeles-lakers-mitch-kupchak-magic-johnson.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "2017.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2017.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "2018.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2018.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Lebron James Joining Los Angeles Lakers 4 Year 1533 Million Deal",
      "url": "https://www.espn.com/nba/story/_/id/23967725/lebron-james-joining-los-angeles-lakers-4-year-1533-million-deal",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2019.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2019.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Report Anthony Davis Lakers",
      "url": "https://www.nba.com/news/report-anthony-davis-lakers",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Hire Coach Frank Vogel Release",
      "url": "https://www.nba.com/news/lakers-hire-coach-frank-vogel-release",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Phil Handy Frank Vogel Turned Lakers Top Defensive Team",
      "url": "https://fadeawayworld.net/nba/los-angeles-lakers/phil-handy-frank-vogel-turned-lakers-top-defensive-team",
      "domain": "fadeawayworld.net",
      "type": "citation"
    },
    {
      "text": "2019 20 Season Reset Lakers",
      "url": "https://www.nba.com/2019-20-season-reset-lakers",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Lean Defense Dominant Game 6 Win Vs Miami Heat Capture First Nba Championship Decade",
      "url": "https://www.espn.com/nba/story/_/id/30096209/los-angeles-lakers-lean-defense-dominant-game-6-win-vs-miami-heat-capture-first-nba-championship-decade",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Jamesle01.html",
      "url": "https://www.basketball-reference.com/players/j/jamesle01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Wizards Russell Westbrook Traded To Lakers",
      "url": "https://www.nba.com/news/wizards-russell-westbrook-traded-to-lakers",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2021 Nba Western Conference First Round Lakers Vs Suns.html",
      "url": "https://www.basketball-reference.com/playoffs/2021-nba-western-conference-first-round-lakers-vs-suns.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Russell Westbrook Trade Lakers Jazz Timberwolves",
      "url": "https://www.theguardian.com/sport/2023/feb/08/russell-westbrook-trade-lakers-jazz-timberwolves",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Den Vs Lal 0042200314",
      "url": "https://www.nba.com/game/den-vs-lal-0042200314",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Fire Coach Darvin Ham 2 Seasons Sources Say",
      "url": "https://www.espn.com/nba/story/_/id/40076601/lakers-fire-coach-darvin-ham-2-seasons-sources-say",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2025.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2025.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Sources Mavericks Trading Doncic Lakers Anthony Davis",
      "url": "https://www.espn.com/nba/story/_/id/43659380/sources-mavericks-trading-doncic-lakers-anthony-davis",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers",
      "url": "https://www.covers.com/sport/basketball/nba/teams/main/los-angeles-lakers",
      "domain": "covers.com",
      "type": "citation"
    },
    {
      "text": "Report Lakers To Acquire Luka Doncic From Mavericks For Anthony Davis Others",
      "url": "https://www.nba.com/news/report-lakers-to-acquire-luka-doncic-from-mavericks-for-anthony-davis-others",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Trade Anthony Davis For Luka Doncic In One Of The Most Shocking Deals In Nba History 051920660.html",
      "url": "https://sports.yahoo.com/lakers-trade-anthony-davis-for-luka-doncic-in-one-of-the-most-shocking-deals-in-nba-history-051920660.html",
      "domain": "sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Lakers Extend Jj Redick Ahead Of 2025 26 Season Gm Rob Pelinka Says We Think Hes A Special Coach 210713150.html",
      "url": "https://sports.yahoo.com/nba/breaking-news/article/lakers-extend-jj-redick-ahead-of-2025-26-season-gm-rob-pelinka-says-we-think-hes-a-special-coach-210713150.html",
      "domain": "sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "2026.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2026.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Luka Doncic",
      "url": "https://www.espn.com/nba/player/gamelog/_/id/3945274/luka-doncic",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Luka Doncic",
      "url": "https://www.nba.com/player/1629029/luka-doncic",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Luka Doncic Stats In First 5 Games",
      "url": "https://www.statmuse.com/nba/ask/luka-doncic-stats-in-first-5-games",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Nba Lebron James Luka Doncic Combination For La Lakers Among Talking Points As 2025 26 Season Begins On Sky Sports",
      "url": "https://www.skysports.com/nba/news/12375/13453914/nba-lebron-james-luka-doncic-combination-for-la-lakers-among-talking-points-as-2025-26-season-begins-on-sky-sports",
      "domain": "skysports.com",
      "type": "citation"
    },
    {
      "text": "Luka Doncic Breaks Silence On Lebron James Injury That Will Keep Him Out For Start Of La Lakers 2025 26 Season",
      "url": "https://nbaanalysis.net/luka-doncic-breaks-silence-on-lebron-james-injury-that-will-keep-him-out-for-start-of-la-lakers-2025-26-season/",
      "domain": "nbaanalysis.net",
      "type": "citation"
    },
    {
      "text": "Lakers Preview A Closer Look At The 2025 26 Roster",
      "url": "https://www.ocregister.com/2025/10/20/lakers-preview-a-closer-look-at-the-2025-26-roster/",
      "domain": "ocregister.com",
      "type": "citation"
    },
    {
      "text": "How The Los Angeles Lakers New Starting Five Will Look For The 2025 26 Season F202510 N",
      "url": "https://en.as.com/nba/how-the-los-angeles-lakers-new-starting-five-will-look-for-the-2025-26-season-f202510-n/",
      "domain": "en.as.com",
      "type": "citation"
    },
    {
      "text": "Nba Lakers Defensive Rating",
      "url": "https://www.statmuse.com/nba/ask/nba-lakers-defensive-rating",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Ranking Every Nba Teams Defense Entering 2025 26 Season Thunder Clear No 1 Spurs Ready For Huge Leap",
      "url": "https://www.cbssports.com/nba/news/ranking-every-nba-teams-defense-entering-2025-26-season-thunder-clear-no-1-spurs-ready-for-huge-leap/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Nba Power Rankings Luka Doncic 130935645.html",
      "url": "https://uk.sports.yahoo.com/news/nba-power-rankings-luka-doncic-130935645.html",
      "domain": "uk.sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Power Rankings 2025 26 Week 3",
      "url": "https://www.nba.com/news/power-rankings-2025-26-week-3",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Power Rankings Thunder Cavs Lakers Spurs Wembanyama",
      "url": "https://www.nytimes.com/athletic/6794727/2025/11/10/nba-power-rankings-thunder-cavs-lakers-spurs-wembanyama/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "History Nba Champions",
      "url": "https://www.nba.com/news/history-nba-champions",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "B73525c442975600fb7ab056",
      "url": "https://www.sportingnews.com/us/nba/news/lakers-vs-celtics-key-stats-history-nba-rivalry/b73525c442975600fb7ab056",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Celtics All Time.htm",
      "url": "https://www.landofbasketball.com/head_to_head/lakers_vs_celtics_all_time.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Sunday Celtics Lakers Battle Had Everything Nba Premier Rivalry Needs",
      "url": "https://www.espn.com/nba/story/_/id/28766961/sunday-celtics-lakers-battle-had-everything-nba-premier-rivalry-needs",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "1988 Nba Finals Pistons Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/1988-nba-finals-pistons-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1989 Nba Finals Lakers Vs Pistons.html",
      "url": "https://www.basketball-reference.com/playoffs/1989-nba-finals-lakers-vs-pistons.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "2004 Nba Finals Pistons Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2004-nba-finals-pistons-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1988 Lakers Vs Pistons.htm",
      "url": "https://www.landofbasketball.com/playoffs_series/1988_lakers_vs_pistons.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "1989 Lakers Vs Pistons.htm",
      "url": "https://www.landofbasketball.com/playoffs_series/1989_lakers_vs_pistons.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "2004 Lakers Vs Pistons.htm",
      "url": "https://www.landofbasketball.com/playoffs_series/2004_lakers_vs_pistons.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Head2head.html",
      "url": "https://www.basketball-reference.com/teams/DET/head2head.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Pistons Record Vs Lakers In The Finals",
      "url": "https://www.statmuse.com/nba/ask/pistons-record-vs-lakers-in-the-finals",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Pistons Game Log Pl.htm",
      "url": "https://www.landofbasketball.com/head_to_head_gl/lakers_vs_pistons_game_log_pl.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "2023 Nba Western Conference Semifinals Lakers Vs Warriors.html",
      "url": "https://www.basketball-reference.com/playoffs/2023-nba-western-conference-semifinals-lakers-vs-warriors.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Lal Vs Gsw 0022400644",
      "url": "https://www.nba.com/game/lal-vs-gsw-0022400644",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Gsw Vs Lal 0022401117",
      "url": "https://www.nba.com/game/gsw-vs-lal-0022401117",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Clippers Rivalry Los Angeles Donald Sterling Jerry Buss",
      "url": "https://www.si.com/nba/2019/10/22/lakers-clippers-rivalry-los-angeles-donald-sterling-jerry-buss",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Clippers Moving To Los Angeles.html",
      "url": "https://www.nytimes.com/1984/05/16/sports/clippers-moving-to-los-angeles.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Lakers Clippers",
      "url": "https://www.espn.com/nba/game/_/gameId/260107012/lakers-clippers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Kobes 50 Points Lift Lakers Past Clippers",
      "url": "https://www.spokesman.com/stories/2006/jan/08/kobes-50-points-lift-lakers-past-clippers/",
      "domain": "spokesman.com",
      "type": "citation"
    },
    {
      "text": "Clippers Lakers",
      "url": "https://www.espn.com/nba/game/_/gameId/400828327/clippers-lakers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lakers Clippers Real Nba Rivalry Battle La Numbers",
      "url": "https://www.foxsports.com/stories/nba/lakers-clippers-real-nba-rivalry-battle-la-numbers",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "581119 Kobe Bryant Vs Blake Griffin Who Is The Biggest Draw In Los Angeles",
      "url": "https://bleacherreport.com/articles/581119-kobe-bryant-vs-blake-griffin-who-is-the-biggest-draw-in-los-angeles",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Clippers Final Score Lebron James Anthony Davis Avery Bradley Kawhi Leonard Paul George",
      "url": "https://www.silverscreenandroll.com/2020/3/8/21170678/lakers-vs-clippers-final-score-lebron-james-anthony-davis-avery-bradley-kawhi-leonard-paul-george",
      "domain": "silverscreenandroll.com",
      "type": "citation"
    },
    {
      "text": "Somewhere Out On The Freeway A Series Los Angeles Cant.html",
      "url": "https://www.nytimes.com/2006/05/02/sports/basketball/somewhere-out-on-the-freeway-a-series-los-angeles-cant.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "How Lakers Clippers Rule Staples Center Their Own Ways",
      "url": "https://www.espn.com/espn/feature/story/_/id/28261311/how-lakers-clippers-rule-staples-center-their-own-ways",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2061986 Map Shows Breakdown Of Each Nba Teams Fanbase Based On Facebook Data",
      "url": "https://bleacherreport.com/articles/2061986-map-shows-breakdown-of-each-nba-teams-fanbase-based-on-facebook-data",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "Nba Favorite Teams Us",
      "url": "https://www.statista.com/statistics/1478736/nba-favorite-teams-us/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Head Head History Suns Vs Lakers",
      "url": "https://www.nba.com/suns/gallery/head-head-history-suns-vs-lakers",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Phoenix Suns Los Angeles Lakers History Sweeps Clotheslines And Comebacks",
      "url": "https://www.brightsideofthesun.com/2021/5/22/22446792/phoenix-suns-los-angeles-lakers-history-sweeps-clotheslines-and-comebacks",
      "domain": "brightsideofthesun.com",
      "type": "citation"
    },
    {
      "text": "1970 Nba Western Division Semifinals Suns Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/1970-nba-western-division-semifinals-suns-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1990 Nba Western Conference Semifinals Suns Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/1990-nba-western-conference-semifinals-suns-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Throwback Thursday 1990 Suns End Pat Rileys Showtime By Finally",
      "url": "https://www.brightsideofthesun.com/2015/8/6/9098789/throwback-thursday-1990-suns-end-pat-rileys-showtime-by-finally",
      "domain": "brightsideofthesun.com",
      "type": "citation"
    },
    {
      "text": "2010 Nba Western Conference Finals Suns Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2010-nba-western-conference-finals-suns-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Lakers Suns",
      "url": "https://www.espn.com/nba/game/_/gameId/300529021/lakers-suns",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Suns Lakers",
      "url": "https://www.espn.com/nba/game/_/gameId/401327905/suns-lakers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Suns Game Log Pl.htm",
      "url": "https://www.landofbasketball.com/head_to_head_gl/lakers_vs_suns_game_log_pl.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Suns Game Log Season.htm",
      "url": "https://www.landofbasketball.com/head_to_head_gl/lakers_vs_suns_game_log_season.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "593731 San Antonio Spurs Vs Los Angeles Lakers Top 10 Turning Points In The Rivalry",
      "url": "https://bleacherreport.com/articles/593731-san-antonio-spurs-vs-los-angeles-lakers-top-10-turning-points-in-the-rivalry",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Spurs Game Log Season.htm",
      "url": "https://www.landofbasketball.com/head_to_head_gl/lakers_vs_spurs_game_log_season.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "2003 Nba Western Conference Semifinals Lakers Vs Spurs.html",
      "url": "https://www.basketball-reference.com/playoffs/2003-nba-western-conference-semifinals-lakers-vs-spurs.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "230513024",
      "url": "https://www.espn.com/nba/recap/_/gameId/230513024",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Antonio Daniels On The Fierce Spurslakers Rivalry That Defined The 2000s",
      "url": "https://www.basketballnetwork.net/old-school/antonio-daniels-on-the-fierce-spurslakers-rivalry-that-defined-the-2000s",
      "domain": "basketballnetwork.net",
      "type": "citation"
    },
    {
      "text": "2013 Nba Western Conference First Round Lakers Vs Spurs.html",
      "url": "https://www.basketball-reference.com/playoffs/2013-nba-western-conference-first-round-lakers-vs-spurs.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "2013 Spurs Vs Lakers.htm",
      "url": "https://www.landofbasketball.com/playoffs_series/2013_spurs_vs_lakers.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Lakers Spurs",
      "url": "https://www.espn.com/nba/game/_/gameId/400459787/lakers-spurs",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Kawhi Leonard 2014 Nba Finals Mvp Highlights",
      "url": "https://www.nba.com/watch/video/kawhi-leonard-2014-nba-finals-mvp-highlights",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2014 Nba Finals Heat Vs Spurs.html",
      "url": "https://www.basketball-reference.com/playoffs/2014-nba-finals-heat-vs-spurs.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "2100103 Breaking Down How Nba Finals Mvp Kawhi Leonard Shined For San Antonio Spurs",
      "url": "https://bleacherreport.com/articles/2100103-breaking-down-how-nba-finals-mvp-kawhi-leonard-shined-for-san-antonio-spurs",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "401810034",
      "url": "https://www.espn.com/nba/recap/_/gameId/401810034",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Luka Doncic Victor Wembanyama Lakers Spurs",
      "url": "https://www.nytimes.com/athletic/6782973/2025/11/06/luka-doncic-victor-wembanyama-lakers-spurs/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Lakers Vs Spurs Dynasty Vs Dynasty In The Western Decade War",
      "url": "https://sportsenemy.com/lakers-vs-spurs-dynasty-vs-dynasty-in-the-western-decade-war/",
      "domain": "sportsenemy.com",
      "type": "citation"
    },
    {
      "text": "Spurs Vs Lakers",
      "url": "https://birthdaygiftboxes.com/spurs-vs-lakers/",
      "domain": "birthdaygiftboxes.com",
      "type": "citation"
    },
    {
      "text": "Kings Vs Lakers Game Log Season.htm",
      "url": "https://www.landofbasketball.com/head_to_head_gl/kings_vs_lakers_game_log_season.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "8680561802055304",
      "url": "https://www.facebook.com/groups/SacramentoKings1985.Forever/posts/8680561802055304/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "1482171.html",
      "url": "https://www.espn.com/nba/columns/howard-cooper_scott/1482171.html",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2001 Nba Western Conference Semifinals Kings Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2001-nba-western-conference-semifinals-kings-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "2002 Nba Western Conference Finals Lakers Vs Kings.html",
      "url": "https://www.basketball-reference.com/playoffs/2002-nba-western-conference-finals-lakers-vs-kings.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://www.espn.com/nba/news/story?id=3436401",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "1310810",
      "url": "https://www.nbcsportsbayarea.com/nba/kings-robbed-in-2002-western-conference-finals-tim-donaghy-claims/1310810/",
      "domain": "nbcsportsbayarea.com",
      "type": "citation"
    },
    {
      "text": "Were The 2002 Nba Western Conference Finals Really Fixed",
      "url": "https://defector.com/were-the-2002-nba-western-conference-finals-really-fixed",
      "domain": "defector.com",
      "type": "citation"
    },
    {
      "text": "Kings Vs Lakers Game Log Pl.htm",
      "url": "https://www.landofbasketball.com/head_to_head_gl/kings_vs_lakers_game_log_pl.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Head To Head",
      "url": "https://www.teamrankings.com/nba/matchup/lakers-kings-2025-10-26/head-to-head",
      "domain": "teamrankings.com",
      "type": "citation"
    },
    {
      "text": "361357721",
      "url": "https://www.startribune.com/lakers-success-had-its-start-in-minneapolis/361357721",
      "domain": "startribune.com",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://nbahoopsonline.com/teams/LosAngelesLakers/History/MinneapolisLakers/index.html",
      "domain": "nbahoopsonline.com",
      "type": "citation"
    },
    {
      "text": "Amp",
      "url": "https://lakersnation.com/minneapolis-to-los-angeles-the-best-move-in-lakers-history/2/amp/",
      "domain": "lakersnation.com",
      "type": "citation"
    },
    {
      "text": "Long Live The Minneapolis Lakers How One Team Changed The Trajectory Of Minnesota Sports",
      "url": "https://www.minnesotamonthly.com/lifestyle/sports-2/long-live-the-minneapolis-lakers-how-one-team-changed-the-trajectory-of-minnesota-sports/",
      "domain": "minnesotamonthly.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 1997 04 07 Sp 46298 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-1997-04-07-sp-46298-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Three Names And A Barrel Of Money",
      "url": "https://vault.si.com/vault/1967/01/16/three-names-and-a-barrel-of-money",
      "domain": "vault.si.com",
      "type": "citation"
    },
    {
      "text": "Buss Family Agrees Sell Lakers Mark Walter Sources Say",
      "url": "https://www.espn.com/nba/story/_/id/45539931/buss-family-agrees-sell-lakers-mark-walter-sources-say",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Dr Jerry Buss The Oral History Of The Greatest Owner In Sports",
      "url": "https://www.nba.com/lakers/history/dr-jerry-buss-the-oral-history-of-the-greatest-owner-in-sports/",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "La Sp Buss Innovations 20130303 Story.html",
      "url": "https://www.latimes.com/sports/lakers/la-sp-buss-innovations-20130303-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Lakers Timeline Buss Family Sale Nba",
      "url": "https://www.nytimes.com/athletic/6438270/2025/06/20/lakers-timeline-buss-family-sale-nba/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Nba Breaking Down Buss Familys Sale La Lakers 10 Billion Valuation 2025 06 19",
      "url": "https://www.reuters.com/legal/transactional/nba-breaking-down-buss-familys-sale-la-lakers-10-billion-valuation-2025-06-19/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "The Story Los Angeles Lakers Owner Jeanie Buss Tough Decision",
      "url": "https://www.espn.com/nba/story/_/id/18840779/the-story-los-angeles-lakers-owner-jeanie-buss-tough-decision",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "110214lakers Timewarner Broadcastagreement.html",
      "url": "https://www.nba.com/lakers/news/110214lakers_timewarner_broadcastagreement.html",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Sale Mark Walter Nba 1234875227",
      "url": "https://www.sportico.com/business/team-sales/2025/los-angeles-lakers-sale-mark-walter-nba-1234875227/",
      "domain": "sportico.com",
      "type": "citation"
    },
    {
      "text": "Nba Approves Sale Majority Interest Lakers Mark Walter",
      "url": "https://www.nba.com/news/nba-approves-sale-majority-interest-lakers-mark-walter",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Approves Mark Walter Purchase Majority Stake Lakers",
      "url": "https://www.espn.com/nba/story/_/id/46782684/nba-approves-mark-walter-purchase-majority-stake-lakers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lakers Acquisition Mark Walter Beacon Stability Volatile Markets 2506",
      "url": "https://www.ainvest.com/news/lakers-acquisition-mark-walter-beacon-stability-volatile-markets-2506/",
      "domain": "ainvest.com",
      "type": "citation"
    },
    {
      "text": "Cryptocom Buys Naming Rights To Lakers Staples Center In A 700 Million Deal .html",
      "url": "https://www.cnbc.com/2021/11/17/cryptocom-buys-naming-rights-to-lakers-staples-center-in-a-700-million-deal-.html",
      "domain": "cnbc.com",
      "type": "citation"
    },
    {
      "text": "Cryptocom Arena Announced",
      "url": "https://www.cryptoarena.com/news/detail/cryptocom-arena-announced",
      "domain": "cryptoarena.com",
      "type": "citation"
    },
    {
      "text": "Crypto Staples",
      "url": "https://www.latimes.com/business/story/2021-11-16/crypto-staples",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Mark Walter Acquires Majority Stake In Lakers",
      "url": "https://lakers.com/news/mark-walter-acquires-majority-stake-in-lakers",
      "domain": "lakers.com",
      "type": "citation"
    },
    {
      "text": "Basketball Hall Of Fame Honors Spike Lee Jack Nicholson Nba Superfans",
      "url": "https://www.nba.com/news/basketball-hall-of-fame-honors-spike-lee-jack-nicholson-nba-superfans",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Instagram Followers Nba By Team",
      "url": "https://www.statista.com/statistics/1120282/instagram-followers-nba-by-team/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Jerseys",
      "url": "https://basketballjerseyarchive.com/los-angeles-lakers-jerseys/",
      "domain": "basketballjerseyarchive.com",
      "type": "citation"
    },
    {
      "text": "Not Always Coca Cola",
      "url": "https://time.com/archive/6929260/not-always-coca-cola/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "Lakers Bibigo 100 Million Jersey Patch Sponsorship Deal Korean Foodmaker",
      "url": "https://www.latimes.com/sports/lakers/story/2021-09-20/lakers-bibigo-100-million-jersey-patch-sponsorship-deal-korean-foodmaker",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "The Most Valuable Nba Teams 2025",
      "url": "https://www.forbes.com/sites/justinteitelbaum/2025/10/23/the-most-valuable-nba-teams-2025/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Staples Center Renaming Crypto Arena Ans Outraged 1650113",
      "url": "https://www.newsweek.com/staples-center-renaming-crypto-arena-ans-outraged-1650113",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Why Are Los Angeles Lakers Called Lakers",
      "url": "https://lakersnation.com/why-are-los-angeles-lakers-called-lakers/",
      "domain": "lakersnation.com",
      "type": "citation"
    },
    {
      "text": "Lakers",
      "url": "https://www.lines.com/nba/history-of-nba-teams/lakers",
      "domain": "lines.com",
      "type": "citation"
    },
    {
      "text": "When Did The Los Angeles Lakers Switch Purple And Gold",
      "url": "https://www.sportscasting.com/news/when-did-the-los-angeles-lakers-switch-purple-and-gold/",
      "domain": "sportscasting.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Logo Design",
      "url": "https://www.thewebfactory.us/blogs/los-angeles-lakers-logo-design/",
      "domain": "thewebfactory.us",
      "type": "citation"
    },
    {
      "text": "The History Of The Lakers Logo",
      "url": "https://www.logodesign.org/the-history-of-the-lakers-logo/",
      "domain": "logodesign.org",
      "type": "citation"
    },
    {
      "text": "Lakers Logo",
      "url": "https://1000logos.net/lakers-logo/",
      "domain": "1000logos.net",
      "type": "citation"
    },
    {
      "text": "Lakers Logo",
      "url": "https://blog.logomyway.com/lakers-logo/",
      "domain": "blog.logomyway.com",
      "type": "citation"
    },
    {
      "text": "Uniform Schedule",
      "url": "https://www.nba.com/lakers/team/uniform-schedule",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Hollywoodnights",
      "url": "https://www.nba.com/lakers/photogallery/hollywoodnights",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nike Los Angeles Lakers Kobe Bryant Black Mamba City Edition Swingman Jersey Black Gold",
      "url": "https://stockx.com/nike-los-angeles-lakers-kobe-bryant-black-mamba-city-edition-swingman-jersey-black-gold",
      "domain": "stockx.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 1999 Oct 20 Sp 24223 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-1999-oct-20-sp-24223-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "La Lakers Playing At The Forum For The First Time In A Decade",
      "url": "https://www.dailynews.com/20091009/la-lakers-playing-at-the-forum-for-the-first-time-in-a-decade/",
      "domain": "dailynews.com",
      "type": "citation"
    },
    {
      "text": "Index.htm",
      "url": "http://basketball.ballparks.com/NBA/LosAngelesLakers/index.htm",
      "domain": "basketball.ballparks.com",
      "type": "citation"
    },
    {
      "text": "Some Big Memorable Single Game Crowds In Nba History",
      "url": "https://www.nba.com/news/some-big-memorable-single-game-crowds-in-nba-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2574058",
      "url": "https://www.nbclosangeles.com/news/sports/lakers-fans-staples-center-coronavirus-pandemic-celtics-nba-basketball/2574058/",
      "domain": "nbclosangeles.com",
      "type": "citation"
    },
    {
      "text": "Lakers Clippers End 25 Years Shared Arena.html",
      "url": "https://www.bizjournals.com/losangeles/news/2024/04/10/lakers-clippers-end-25-years-shared-arena.html",
      "domain": "bizjournals.com",
      "type": "citation"
    },
    {
      "text": "Vital Stats",
      "url": "https://www.cryptoarena.com/arena-info/vital-stats",
      "domain": "cryptoarena.com",
      "type": "citation"
    },
    {
      "text": "School Bio Gersten Html.aspx",
      "url": "https://lmulions.com/sports/2018/5/29/school-bio-gersten-html.aspx",
      "domain": "lmulions.com",
      "type": "citation"
    },
    {
      "text": "Nba Training Camp Locations 2",
      "url": "https://sportsdelve.wordpress.com/2011/02/24/nba-training-camp-locations-2/",
      "domain": "sportsdelve.wordpress.com",
      "type": "citation"
    },
    {
      "text": "Toyota Sports Performance Center",
      "url": "https://en.wikipedia.org/wiki/Toyota_Sports_Performance_Center",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Open State Art Training Facility",
      "url": "https://www.espn.com/nba/story/_/id/17435104/los-angeles-lakers-open-state-art-training-facility",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lakers",
      "url": "https://www.uclahealth.org/discover-ucla-health/about/sports-partnerships/lakers",
      "domain": "uclahealth.org",
      "type": "citation"
    },
    {
      "text": "Ucla Health Training Center",
      "url": "https://perkinswill.com/project/ucla-health-training-center/",
      "domain": "perkinswill.com",
      "type": "citation"
    },
    {
      "text": "Lakers Life Inside The Nbas Covid 19 Bubble",
      "url": "https://www.uclahealth.org/news/article/lakers-life-inside-the-nbas-covid-19-bubble",
      "domain": "uclahealth.org",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Bubble Playoffs Fortune Misfortune Championship Phoenix Suns",
      "url": "https://www.foxsports.com/stories/nba/los-angeles-lakers-bubble-playoffs-fortune-misfortune-championship-phoenix-suns",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "Season By Season Records",
      "url": "https://www.nba.com/lakers/history/season-by-season-records",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Records Los Angeles Lakers.htm",
      "url": "https://www.landofbasketball.com/teams/records_los_angeles_lakers.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Leaders Career.html",
      "url": "https://www.basketball-reference.com/teams/LAL/leaders_career.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Top 5 All Time Los Angeles Lakers Rebounding Leaders",
      "url": "https://www.nba.com/news/top-5-all-time-los-angeles-lakers-rebounding-leaders",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "22",
      "url": "https://www.nba.com/lakers/news/the-72-lakers-33-game-win-streak-still-unbreakable-after-50-years-01/07/22",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Championship Rings",
      "url": "https://www.nba.com/lakers/history/lakers-championship-rings",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Top Moments Lakers Complete 5th Three Peat In Nba History",
      "url": "https://www.nba.com/news/history-top-moments-lakers-complete-5th-three-peat-in-nba-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Three Peat",
      "url": "https://en.wikipedia.org/wiki/Three-peat",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Archive 75 George Mikan",
      "url": "https://www.nba.com/news/archive-75-george-mikan",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "1980 Nba Finals 76ers Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/1980-nba-finals-76ers-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Forbes Study Finds Knicks Overtake Lakers As Nbas Most Valuable Team At 1 1 Billion",
      "url": "https://www.foxnews.com/sports/forbes-study-finds-knicks-overtake-lakers-as-nbas-most-valuable-team-at-1-1-billion",
      "domain": "foxnews.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers",
      "url": "https://www.forbes.com/teams/los-angeles-lakers/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Lakers News Jeanie Buss To Remain Team Governor For At Least Five Years",
      "url": "https://lakersnation.com/lakers-news-jeanie-buss-to-remain-team-governor-for-at-least-five-years/",
      "domain": "lakersnation.com",
      "type": "citation"
    },
    {
      "text": "Nba Approves Buss Family Sale Of Lakers To Dodgers Majority Owner Mark Walter",
      "url": "https://www.latimes.com/sports/lakers/story/2025-10-30/nba-approves-buss-family-sale-of-lakers-to-dodgers-majority-owner-mark-walter",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Lakers Sign Rob Pelinka Contract Extension President Gm",
      "url": "https://www.espn.com/nba/story/_/id/44735322/lakers-sign-rob-pelinka-contract-extension-president-gm",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "25153732 Lakers Rob Pelinka Agree Contract Extension Named President Basketball Ops",
      "url": "https://bleacherreport.com/articles/25153732-lakers-rob-pelinka-agree-contract-extension-named-president-basketball-ops",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "Lakers Sold Buss Family 1236437147",
      "url": "https://deadline.com/2025/10/lakers-sold-buss-family-1236437147/",
      "domain": "deadline.com",
      "type": "citation"
    },
    {
      "text": "Lukadonciccommits Long Term To The Lakers",
      "url": "https://lakers.com/news/lukadonciccommits-long-term-to-the-lakers",
      "domain": "lakers.com",
      "type": "citation"
    },
    {
      "text": "Rob Pelinka Lakers Nba Free Agency Deandre Ayton Jake Laravia Marcus Smart",
      "url": "https://www.silverscreenandroll.com/lakers-analysis/99612/rob-pelinka-lakers-nba-free-agency-deandre-ayton-jake-laravia-marcus-smart",
      "domain": "silverscreenandroll.com",
      "type": "citation"
    },
    {
      "text": "2025 26 Season Preview Lal",
      "url": "https://www.nba.com/news/2025-26-season-preview-lal",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "13",
      "url": "https://www.hoopshype.com/salaries/teams/los-angeles-lakers/13/",
      "domain": "hoopshype.com",
      "type": "citation"
    },
    {
      "text": "Injury Report 2025 11 15 05pm.pdf",
      "url": "https://ak-static.cms.nba.com/referee/injury/Injury-Report_2025-11-15_05PM.pdf",
      "domain": "ak-static.cms.nba.com",
      "type": "citation"
    },
    {
      "text": "Lakers Injury Report Austin Reaves Groin Strain Hornets Status Update Return",
      "url": "https://www.silverscreenandroll.com/lakers-injury-report/100012/lakers-injury-report-austin-reaves-groin-strain-hornets-status-update-return",
      "domain": "silverscreenandroll.com",
      "type": "citation"
    },
    {
      "text": "Roster",
      "url": "https://www.nba.com/lakers/roster",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2026.html",
      "url": "https://www.basketball-reference.com/teams/LAL/2026.html#salaries",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers",
      "url": "https://www.espn.com/nba/team/roster/_/name/lal/los-angeles-lakers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Sources Lakers Reach Deal Pelicans Davis",
      "url": "https://www.espn.com/nba/story/_/id/26981805/sources-lakers-reach-deal-pelicans-davis",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Pelicans Lakers Nba Draft 94708e7295dccd4257065260d763faaa",
      "url": "https://apnews.com/article/pelicans-lakers-nba-draft-94708e7295dccd4257065260d763faaa",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Ee238cbc396d99b61d60b023",
      "url": "https://www.sportingnews.com/us/nba/news/anthony-davis-trade-grades-revisited-lakers-pelicans/ee238cbc396d99b61d60b023",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "Sources Lakers Decline 3rd Year Option Jalen Hood Schifino",
      "url": "https://www.espn.com/nba/story/_/id/42114253/sources-lakers-decline-3rd-year-option-jalen-hood-schifino",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Coaches.html",
      "url": "https://www.basketball-reference.com/teams/LAL/coaches.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Nba Assistant Coaches",
      "url": "https://nbacoaches.com/nba-assistant-coaches/",
      "domain": "nbacoaches.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Announce Coaching Staff For 2024 25 Nba Season Redick",
      "url": "https://www.si.com/fannation/nba/fastbreak/news/los-angeles-lakers-announce-coaching-staff-for-2024-25-nba-season-redick",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Lakers Coaching Staff Jj Redicks Assistants Confirmed For 2024 25 Nba Season",
      "url": "https://www.cbssports.com/nba/news/lakers-coaching-staff-jj-redicks-assistants-confirmed-for-2024-25-nba-season/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Top Assistant Luka Doncic Lebron James",
      "url": "https://heavy.com/sports/nba/los-angeles-lakers/top-assistant-luka-doncic-lebron-james/",
      "domain": "heavy.com",
      "type": "citation"
    },
    {
      "text": "Coaching Staff",
      "url": "https://www.nba.com/lakers/team/coaching-staff",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Coaches",
      "url": "https://losangeleslakersschedule.us/coaches/",
      "domain": "losangeleslakersschedule.us",
      "type": "citation"
    },
    {
      "text": "Lindsey Harding Incredible Journey Los Angeles Lakers Bench Unprecedented Next Step Nba",
      "url": "https://www.espn.com/nba/story/_/id/46858987/lindsey-harding-incredible-journey-los-angeles-lakers-bench-unprecedented-next-step-nba",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Query",
      "url": "https://www.hoophall.com/hall-of-famers/query/?q=lakers",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "Kobe Bryant",
      "url": "https://www.hoophall.com/hall-of-famers/kobe-bryant/",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "Jerry West",
      "url": "https://www.hoophall.com/hall-of-famers/jerry-west/",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "Hall Of Fame",
      "url": "https://basketball.realgm.com/nba/teams/Los-Angeles-Lakers/13/hall-of-fame",
      "domain": "basketball.realgm.com",
      "type": "citation"
    },
    {
      "text": "Jerry West1",
      "url": "https://www.hoophall.com/hall-of-famers/jerry-west1/",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "Jerry Buss",
      "url": "https://www.hoophall.com/hall-of-famers/jerry-buss/",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "Lakers Retire Pau Gasol No 16 Jersey",
      "url": "https://www.nba.com/news/lakers-retire-pau-gasol-no-16-jersey",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Los Angeles Lakers Add Kareem Abdul Jabbar Statue Retire Numbers Shaquille Oneal Jamaal Wilkes",
      "url": "https://www.espn.com/los-angeles/nba/story/_/id/8319413/los-angeles-lakers-add-kareem-abdul-jabbar-statue-retire-numbers-shaquille-oneal-jamaal-wilkes",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lakers George Mikan Jersey Retirement",
      "url": "https://www.nba.com/news/lakers-george-mikan-jersey-retirement",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Fiba Hall Of Fame",
      "url": "https://about.fiba.basketball/en/fiba-hall-of-fame",
      "domain": "about.fiba.basketball",
      "type": "citation"
    },
    {
      "text": "Vlade Divac",
      "url": "https://about.fiba.basketball/en/fiba-hall-of-fame/hall-of-famers/vlade-divac",
      "domain": "about.fiba.basketball",
      "type": "citation"
    },
    {
      "text": "2025 Fiba Hall Of Fame Pau Gasol",
      "url": "https://about.fiba.basketball/en/news/2025-fiba-hall-of-fame-pau-gasol",
      "domain": "about.fiba.basketball",
      "type": "citation"
    },
    {
      "text": "Nba Local Television Announcer History",
      "url": "https://archive.506sports.com/wiki/NBA_Local_Television_Announcer_History",
      "domain": "archive.506sports.com",
      "type": "citation"
    },
    {
      "text": "Lakers History Legendary Chick Hearn Paves The Way For Future Broadcasters",
      "url": "https://www.si.com/nba/lakers/news/lakers-history-legendary-chick-hearn-paves-the-way-for-future-broadcasters",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Chick Hearn",
      "url": "https://www.hoophall.com/hall-of-famers/chick-hearn/",
      "domain": "hoophall.com",
      "type": "citation"
    },
    {
      "text": "The Greatness Of Chick Hearn As Explained By Other Lakers Announcers",
      "url": "https://www.nytimes.com/athletic/1872361/2020/06/19/the-greatness-of-chick-hearn-as-explained-by-other-lakers-announcers/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 2003 Apr 18 Sp Tvcol18 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-2003-apr-18-sp-tvcol18-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Time Warner Sports Nets To Launch Oct 1 1118053795",
      "url": "https://variety.com/2012/tv/news/time-warner-sports-nets-to-launch-oct-1-1118053795/",
      "domain": "variety.com",
      "type": "citation"
    },
    {
      "text": "Faq",
      "url": "https://spectrumsportsnet.com/faq",
      "domain": "spectrumsportsnet.com",
      "type": "citation"
    },
    {
      "text": "Watch Listen",
      "url": "https://www.nba.com/lakers/broadcast/watch-listen",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Espn La",
      "url": "https://goodkarmabrands.com/espn-la/",
      "domain": "goodkarmabrands.com",
      "type": "citation"
    },
    {
      "text": "Charter Launches Dtc Service Spectrum Sportsnet Offering La Lakers Games",
      "url": "https://www.streamtvinsider.com/video/charter-launches-dtc-service-spectrum-sportsnet-offering-la-lakers-games",
      "domain": "streamtvinsider.com",
      "type": "citation"
    },
    {
      "text": "Spectrum Sportsnet Lakers Broadcast Faqs",
      "url": "https://www.nba.com/lakers/broadcast/spectrum-sportsnet-lakers-broadcast-faqs",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "15697802",
      "url": "https://www.espn.com/espnradio/losangeles/podcast/archive/_/id/15697802",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "silverscreenandroll.com",
      "url": "https://www.silverscreenandroll.com/",
      "domain": "silverscreenandroll.com",
      "type": "citation"
    },
    {
      "text": "lakersnation.com",
      "url": "https://lakersnation.com/",
      "domain": "lakersnation.com",
      "type": "citation"
    },
    {
      "text": "Lakers Podcasts",
      "url": "https://www.silverscreenandroll.com/lakers-podcasts",
      "domain": "silverscreenandroll.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 2002 Aug 06 Me Hearn6 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-2002-aug-06-me-hearn6-story.html",
      "domain": "latimes.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "basketball",
      "page": "Basketball"
    },
    {
      "text": "National Basketball Association",
      "page": "National_Basketball_Association"
    },
    {
      "text": "Western",
      "page": "Western"
    },
    {
      "text": "National Basketball League",
      "page": "National_Basketball_League"
    },
    {
      "text": "Basketball Association of America",
      "page": "Basketball_Association_of_America"
    },
    {
      "text": "Los Angeles",
      "page": "Los_Angeles"
    },
    {
      "text": "Boston Celtics",
      "page": "Boston_Celtics"
    },
    {
      "text": "Crypto.com Arena",
      "page": "Crypto.com_Arena"
    },
    {
      "text": "Elgin Baylor",
      "page": "Elgin_Baylor"
    },
    {
      "text": "Jerry West",
      "page": "Jerry_West"
    },
    {
      "text": "Wilt Chamberlain",
      "page": "Wilt_Chamberlain"
    },
    {
      "text": "Guggenheim Partners",
      "page": "Guggenheim_Partners"
    },
    {
      "text": "Mark Walter",
      "page": "Mark_Walter"
    },
    {
      "text": "center",
      "page": "Center"
    },
    {
      "text": "hook shot",
      "page": "Hook_shot"
    },
    {
      "text": "1951",
      "page": "1951"
    },
    {
      "text": "Mikan",
      "page": "George_Mikan"
    },
    {
      "text": "1949",
      "page": "1949"
    },
    {
      "text": "points per game",
      "page": "Points_per_game"
    },
    {
      "text": "All-Star",
      "page": "All-star"
    },
    {
      "text": "player-coach",
      "page": "Player-coach"
    },
    {
      "text": "Vern Mikkelsen",
      "page": "Vern_Mikkelsen"
    },
    {
      "text": "Jim Pollard",
      "page": "Jim_Pollard"
    },
    {
      "text": "NBL",
      "page": "NBL"
    },
    {
      "text": "Washington Capitols",
      "page": "Washington_Capitols"
    },
    {
      "text": "three-peat",
      "page": "Three-peat"
    },
    {
      "text": "New York Knicks",
      "page": "New_York_Knicks"
    },
    {
      "text": "NBA Finals",
      "page": "NBA_Finals"
    },
    {
      "text": "shot clock",
      "page": "Shot_clock"
    },
    {
      "text": "Clyde Lovellette",
      "page": "Clyde_Lovellette"
    },
    {
      "text": "West Coast",
      "page": "West_Coast"
    },
    {
      "text": "Philadelphia 76ers",
      "page": "Philadelphia_76ers"
    },
    {
      "text": "Darrall Imhoff",
      "page": "Darrall_Imhoff"
    },
    {
      "text": "Jerry Chambers",
      "page": "Jerry_Chambers"
    },
    {
      "text": "Finals",
      "page": "The_Finals"
    },
    {
      "text": "Boston",
      "page": "Boston"
    },
    {
      "text": "Bill Russell",
      "page": "Bill_Russell"
    },
    {
      "text": "Kareem Abdul-Jabbar",
      "page": "Kareem_Abdul-Jabbar"
    },
    {
      "text": "Milwaukee Bucks",
      "page": "Milwaukee_Bucks"
    },
    {
      "text": "Elmore Smith",
      "page": "Elmore_Smith"
    },
    {
      "text": "Brian Winters",
      "page": "Brian_Winters"
    },
    {
      "text": "Junior Bridgeman",
      "page": "Junior_Bridgeman"
    },
    {
      "text": "MVP",
      "page": "MVP"
    },
    {
      "text": "skyhook",
      "page": "Skyhook"
    },
    {
      "text": "1979 NBA Draft",
      "page": "1979_NBA_draft"
    },
    {
      "text": "Johnson",
      "page": "Magic_Johnson"
    },
    {
      "text": "New Orleans Jazz",
      "page": "New_Orleans_Jazz"
    },
    {
      "text": "1980 NBA Finals",
      "page": "1980_NBA_Finals"
    },
    {
      "text": "Pat Riley",
      "page": "Pat_Riley"
    },
    {
      "text": "Philadelphia",
      "page": "Philadelphia"
    },
    {
      "text": "Detroit",
      "page": "Detroit"
    },
    {
      "text": "Chick Hearn",
      "page": "Chick_Hearn"
    },
    {
      "text": "playoffs",
      "page": "Playoffs"
    },
    {
      "text": "James Worthy",
      "page": "James_Worthy"
    },
    {
      "text": "Michael Cooper",
      "page": "Michael_Cooper"
    },
    {
      "text": "NBA entertainment",
      "page": "NBA_Entertainment"
    },
    {
      "text": "HIV",
      "page": "HIV"
    },
    {
      "text": "press conference",
      "page": "Press_conference"
    },
    {
      "text": "Portland Trail Blazers",
      "page": "Portland_Trail_Blazers"
    },
    {
      "text": "Randy Pfund",
      "page": "Randy_Pfund"
    },
    {
      "text": "1950s",
      "page": "1950s"
    },
    {
      "text": "Del Harris",
      "page": "Del_Harris"
    },
    {
      "text": "point guard",
      "page": "Point_guard"
    },
    {
      "text": "1993 NBA Draft",
      "page": "1993_NBA_draft"
    },
    {
      "text": "Phoenix Suns",
      "page": "Phoenix_Suns"
    },
    {
      "text": "Vlade Divac",
      "page": "Vlade_Divac"
    },
    {
      "text": "Kobe Bryant",
      "page": "Kobe_Bryant"
    },
    {
      "text": "Shaquille O'Neal",
      "page": "Shaquille_O'Neal"
    },
    {
      "text": "Orlando Magic",
      "page": "Orlando_Magic"
    },
    {
      "text": "NBA Draft",
      "page": "NBA_draft"
    },
    {
      "text": "Kurt Rambis",
      "page": "Kurt_Rambis"
    },
    {
      "text": "Utah Jazz",
      "page": "Utah_Jazz"
    },
    {
      "text": "San Antonio Spurs",
      "page": "San_Antonio_Spurs"
    },
    {
      "text": "Phil Jackson",
      "page": "Phil_Jackson"
    },
    {
      "text": "head coach",
      "page": "Head_coach"
    },
    {
      "text": "Chicago Bulls",
      "page": "Chicago_Bulls"
    },
    {
      "text": "triangle offense",
      "page": "Triangle_offense"
    },
    {
      "text": "Michael Jordan",
      "page": "Michael_Jordan"
    },
    {
      "text": "Scottie Pippen",
      "page": "Scottie_Pippen"
    },
    {
      "text": "Derek Fisher",
      "page": "Derek_Fisher"
    },
    {
      "text": "Rick Fox",
      "page": "Rick_Fox"
    },
    {
      "text": "dynasty",
      "page": "Dynasty"
    },
    {
      "text": "2000 NBA Finals",
      "page": "2000_NBA_Finals"
    },
    {
      "text": "Indiana Pacers",
      "page": "Indiana_Pacers"
    },
    {
      "text": "toe",
      "page": "Toe"
    },
    {
      "text": "New Jersey",
      "page": "New_Jersey"
    },
    {
      "text": "2004 NBA Finals",
      "page": "2004_NBA_Finals"
    },
    {
      "text": "Detroit Pistons",
      "page": "Detroit_Pistons"
    },
    {
      "text": "Karl Malone",
      "page": "Karl_Malone"
    },
    {
      "text": "Gary Payton",
      "page": "Gary_Payton"
    },
    {
      "text": "Ben Wallace",
      "page": "Ben_Wallace"
    },
    {
      "text": "Rasheed Wallace",
      "page": "Rasheed_Wallace"
    },
    {
      "text": "Miami Heat",
      "page": "Miami_Heat"
    },
    {
      "text": "Lamar Odom",
      "page": "Lamar_Odom"
    },
    {
      "text": "Caron Butler",
      "page": "Caron_Butler"
    },
    {
      "text": "Brian Grant",
      "page": "Brian_Grant"
    },
    {
      "text": "Rudy Tomjanovich",
      "page": "Rudy_Tomjanovich"
    },
    {
      "text": "Frank Hamblen",
      "page": "Frank_Hamblen"
    },
    {
      "text": "Toronto Raptors",
      "page": "Toronto_Raptors"
    },
    {
      "text": "Andrew Bynum",
      "page": "Andrew_Bynum"
    },
    {
      "text": "Dallas Mavericks",
      "page": "Dallas_Mavericks"
    },
    {
      "text": "Mike D'Antoni",
      "page": "Mike_D'Antoni"
    },
    {
      "text": "Byron Scott",
      "page": "Byron_Scott"
    },
    {
      "text": "Jordan Clarkson",
      "page": "Jordan_Clarkson"
    },
    {
      "text": "D'Angelo Russell",
      "page": "D'Angelo_Russell"
    },
    {
      "text": "Luke Walton",
      "page": "Luke_Walton"
    },
    {
      "text": "Golden State Warriors",
      "page": "Golden_State_Warriors"
    },
    {
      "text": "Steve Kerr",
      "page": "Steve_Kerr"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "pace",
      "page": "Pace"
    },
    {
      "text": "DeMarcus Cousins",
      "page": "DeMarcus_Cousins"
    },
    {
      "text": "Paul George",
      "page": "Paul_George"
    },
    {
      "text": "Oklahoma City",
      "page": "Oklahoma_City"
    },
    {
      "text": "LeBron James",
      "page": "LeBron_James"
    },
    {
      "text": "Most Valuable Player",
      "page": "Most_valuable_player"
    },
    {
      "text": "free agent",
      "page": "Free_agent"
    },
    {
      "text": "ACL",
      "page": "ACL"
    },
    {
      "text": "Rajon Rondo",
      "page": "Rajon_Rondo"
    },
    {
      "text": "COVID-19 pandemic",
      "page": "COVID-19_pandemic"
    },
    {
      "text": "Davis",
      "page": "Davis"
    },
    {
      "text": "Walt Disney World",
      "page": "Walt_Disney_World"
    },
    {
      "text": "Houston Rockets",
      "page": "Houston_Rockets"
    },
    {
      "text": "Denver Nuggets",
      "page": "Denver_Nuggets"
    },
    {
      "text": "NBA championship ring",
      "page": "NBA_championship_ring"
    },
    {
      "text": "Bubble",
      "page": "Bubble"
    },
    {
      "text": "Kyle Kuzma",
      "page": "Kyle_Kuzma"
    },
    {
      "text": "Alex Caruso",
      "page": "Alex_Caruso"
    },
    {
      "text": "starting lineup",
      "page": "Starting_lineup"
    },
    {
      "text": "Anthony Davis",
      "page": "Anthony_Davis"
    },
    {
      "text": "Westbrook",
      "page": "Russell_Westbrook"
    },
    {
      "text": "sign-and-trade deal",
      "page": "Sign-and-trade_deal"
    },
    {
      "text": "Washington Wizards",
      "page": "Washington_Wizards"
    },
    {
      "text": "Kentavious Caldwell-Pope",
      "page": "Kentavious_Caldwell-Pope"
    },
    {
      "text": "Montrezl Harrell",
      "page": "Montrezl_Harrell"
    },
    {
      "text": "Malik Beasley",
      "page": "Malik_Beasley"
    },
    {
      "text": "Jarred Vanderbilt",
      "page": "Jarred_Vanderbilt"
    },
    {
      "text": "Minnesota Timberwolves",
      "page": "Minnesota_Timberwolves"
    },
    {
      "text": "Darvin Ham",
      "page": "Darvin_Ham"
    },
    {
      "text": "Nikola Jokić",
      "page": "Nikola_Jokić"
    },
    {
      "text": "Kareem",
      "page": "Kareem"
    },
    {
      "text": "Oklahoma City Thunder",
      "page": "Oklahoma_City_Thunder"
    },
    {
      "text": "2023 NBA Draft",
      "page": "2023_NBA_draft"
    },
    {
      "text": "Jalen Hood-Schifino",
      "page": "Jalen_Hood-Schifino"
    },
    {
      "text": "Indiana University",
      "page": "Indiana_University"
    },
    {
      "text": "Tournament",
      "page": "Tournament"
    },
    {
      "text": "regular-season record",
      "page": "Record"
    },
    {
      "text": "JJ Redick",
      "page": "JJ_Redick"
    },
    {
      "text": "blockbuster",
      "page": "Blockbuster"
    },
    {
      "text": "trade",
      "page": "Trade"
    },
    {
      "text": "Luka Dončić",
      "page": "Luka_Dončić"
    },
    {
      "text": "Maxi Kleber",
      "page": "Maxi_Kleber"
    },
    {
      "text": "Markieff Morris",
      "page": "Markieff_Morris"
    },
    {
      "text": "Dallas",
      "page": "Dallas"
    },
    {
      "text": "blocks",
      "page": "Block"
    },
    {
      "text": "DeAndre Ayton",
      "page": "Deandre_Ayton"
    },
    {
      "text": "Marcus Smart",
      "page": "Marcus_Smart"
    },
    {
      "text": "defense",
      "page": "Defense"
    },
    {
      "text": "Miami",
      "page": "Miami"
    },
    {
      "text": "San Antonio",
      "page": "San_Antonio"
    },
    {
      "text": "USA TODAY",
      "page": "USA_Today"
    },
    {
      "text": "history",
      "page": "History"
    },
    {
      "text": "1956",
      "page": "1956"
    },
    {
      "text": "rivalry",
      "page": "Rivalry"
    },
    {
      "text": "2000s",
      "page": "2000s"
    },
    {
      "text": "Paul Pierce",
      "page": "Paul_Pierce"
    },
    {
      "text": "Kevin Garnett",
      "page": "Kevin_Garnett"
    },
    {
      "text": "Ray Allen",
      "page": "Ray_Allen"
    },
    {
      "text": "Kobe",
      "page": "Kobe"
    },
    {
      "text": "2008",
      "page": "2008"
    },
    {
      "text": "2010",
      "page": "2010"
    },
    {
      "text": "Lakers–Pistons rivalry",
      "page": "Lakers–Pistons_rivalry"
    },
    {
      "text": "Bad Boys",
      "page": "Bad_Boys"
    },
    {
      "text": "Hollywood",
      "page": "Hollywood"
    },
    {
      "text": "Thomas",
      "page": "Thomas'"
    },
    {
      "text": "Johnson",
      "page": "Johnson"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "California",
      "page": "California"
    },
    {
      "text": "Curry",
      "page": "Curry"
    },
    {
      "text": "isolation",
      "page": "Isolation"
    },
    {
      "text": "the Warriors",
      "page": "The_Warriors"
    },
    {
      "text": "2023",
      "page": "2023"
    },
    {
      "text": "Conference",
      "page": "Conference"
    },
    {
      "text": "123",
      "page": "123"
    },
    {
      "text": "threes",
      "page": "Threes"
    },
    {
      "text": "Los Angeles Clippers",
      "page": "Los_Angeles_Clippers"
    },
    {
      "text": "San Diego",
      "page": "San_Diego"
    },
    {
      "text": "media market",
      "page": "Media_market"
    },
    {
      "text": "Donald Sterling",
      "page": "Donald_Sterling"
    },
    {
      "text": "lawsuit",
      "page": "Lawsuit"
    },
    {
      "text": "Los Angeles Memorial Sports Arena",
      "page": "Los_Angeles_Memorial_Sports_Arena"
    },
    {
      "text": "Freeway Series",
      "page": "Freeway_Series"
    },
    {
      "text": "Intuit Dome",
      "page": "Intuit_Dome"
    },
    {
      "text": "greater Los Angeles",
      "page": "Greater_Los_Angeles"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "inception",
      "page": "Inception"
    },
    {
      "text": "Division",
      "page": "Division"
    },
    {
      "text": "1960s",
      "page": "1960s"
    },
    {
      "text": "1970s",
      "page": "1970s"
    },
    {
      "text": "victory",
      "page": "Victory"
    },
    {
      "text": "key",
      "page": "Key"
    },
    {
      "text": "players",
      "page": "Players"
    },
    {
      "text": "Gail Goodrich",
      "page": "Gail_Goodrich"
    },
    {
      "text": "Phoenix",
      "page": "Phoenix"
    },
    {
      "text": "Steve Nash",
      "page": "Steve_Nash"
    },
    {
      "text": "Amar'e Stoudemire",
      "page": "Amar'e_Stoudemire"
    },
    {
      "text": "Devin Booker",
      "page": "Devin_Booker"
    },
    {
      "text": "regular season",
      "page": "1986_NFL_season"
    },
    {
      "text": "Tim Duncan",
      "page": "Tim_Duncan"
    },
    {
      "text": "Duncan",
      "page": "Duncan"
    },
    {
      "text": "Victor Wembanyama",
      "page": "Victor_Wembanyama"
    },
    {
      "text": "ethos",
      "page": "Ethos"
    },
    {
      "text": "versus",
      "page": "Versus"
    },
    {
      "text": "Gregg Popovich",
      "page": "Gregg_Popovich"
    },
    {
      "text": "Leonard",
      "page": "Leonard"
    },
    {
      "text": "Sacramento Kings",
      "page": "Sacramento_Kings"
    },
    {
      "text": "Sacramento",
      "page": "Sacramento"
    },
    {
      "text": "1990s",
      "page": "1990s"
    },
    {
      "text": "Chris Webber",
      "page": "Chris_Webber"
    },
    {
      "text": "Peja Stojaković",
      "page": "Peja_Stojaković"
    },
    {
      "text": "Mike Bibby",
      "page": "Mike_Bibby"
    },
    {
      "text": "Game 6",
      "page": "Game_6"
    },
    {
      "text": "2002",
      "page": "2002"
    },
    {
      "text": "edge",
      "page": "edge"
    },
    {
      "text": "De'Aaron Fox",
      "page": "De'Aaron_Fox"
    },
    {
      "text": "Minneapolis",
      "page": "Minneapolis"
    },
    {
      "text": "Berger",
      "page": "Berger"
    },
    {
      "text": "Bob Short",
      "page": "Bob_Short"
    },
    {
      "text": "hockey",
      "page": "Hockey"
    },
    {
      "text": "Jack Kent Cooke",
      "page": "Jack_Kent_Cooke"
    },
    {
      "text": "football",
      "page": "Football"
    },
    {
      "text": "the stage",
      "page": "The_Stage"
    },
    {
      "text": "Jerry Buss",
      "page": "Jerry_Buss"
    },
    {
      "text": "Los Angeles Kings",
      "page": "Los_Angeles_Kings"
    },
    {
      "text": "business model",
      "page": "Business_model"
    },
    {
      "text": "broadcasting",
      "page": "Broadcasting"
    },
    {
      "text": "Todd Boehly",
      "page": "Todd_Boehly"
    },
    {
      "text": "AEG",
      "page": "AEG"
    },
    {
      "text": "Philip Anschutz",
      "page": "Philip_Anschutz"
    },
    {
      "text": "Walter",
      "page": "Walter"
    },
    {
      "text": "minority interest",
      "page": "Minority_interest"
    },
    {
      "text": "Jeanie Buss",
      "page": "Jeanie_Buss"
    },
    {
      "text": "Los Angeles Dodgers",
      "page": "Los_Angeles_Dodgers"
    },
    {
      "text": "naming rights",
      "page": "Naming_rights"
    },
    {
      "text": "Crypto.com",
      "page": "Crypto.com"
    },
    {
      "text": "cryptocurrency",
      "page": "Cryptocurrency"
    },
    {
      "text": "championship",
      "page": "Championship"
    },
    {
      "text": "social media",
      "page": "Social_media"
    },
    {
      "text": "Jack Nicholson",
      "page": "Jack_Nicholson"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "Instagram",
      "page": "Instagram"
    },
    {
      "text": "philosophy",
      "page": "Philosophy"
    },
    {
      "text": "work ethic",
      "page": "Work_ethic"
    },
    {
      "text": "mental toughness",
      "page": "Mental_toughness"
    },
    {
      "text": "culture",
      "page": "Culture"
    },
    {
      "text": "COVID-19",
      "page": "COVID-19"
    },
    {
      "text": "coronavirus",
      "page": "Coronavirus"
    },
    {
      "text": "social justice",
      "page": "Social_justice"
    },
    {
      "text": "November",
      "page": "November"
    },
    {
      "text": "Nike",
      "page": "Nike"
    },
    {
      "text": "partnership",
      "page": "Partnership"
    },
    {
      "text": "Coca-Cola",
      "page": "Coca-Cola"
    },
    {
      "text": "2021",
      "page": "2021"
    },
    {
      "text": "ecosystem",
      "page": "Ecosystem"
    },
    {
      "text": "revenue",
      "page": "Revenue"
    },
    {
      "text": "season",
      "page": "Season"
    },
    {
      "text": "commercialization",
      "page": "Commercialization"
    },
    {
      "text": "legacy",
      "page": "Legacy"
    },
    {
      "text": "Minnesota",
      "page": "Minnesota"
    },
    {
      "text": "1947",
      "page": "1947"
    },
    {
      "text": "royal blue",
      "page": "Royal_blue"
    },
    {
      "text": "purple",
      "page": "Purple"
    },
    {
      "text": "logo",
      "page": "Logo"
    },
    {
      "text": "wordmark",
      "page": "Wordmark"
    },
    {
      "text": "Hollywood Nights",
      "page": "Hollywood_Nights"
    },
    {
      "text": "Minneapolis Auditorium",
      "page": "Minneapolis_Auditorium"
    },
    {
      "text": "10,000",
      "page": "10,000"
    },
    {
      "text": "Southern California",
      "page": "Southern_California"
    },
    {
      "text": "Charles Luckman",
      "page": "Charles_Luckman"
    },
    {
      "text": "Colosseum",
      "page": "Colosseum"
    },
    {
      "text": "1969 NBA Finals",
      "page": "1969_NBA_Finals"
    },
    {
      "text": "capacity",
      "page": "Capacity"
    },
    {
      "text": "Pepperdine University",
      "page": "Pepperdine_University"
    },
    {
      "text": "Loyola Marymount University",
      "page": "Loyola_Marymount_University"
    },
    {
      "text": "Toyota Sports Performance Center",
      "page": "Toyota_Sports_Performance_Center"
    },
    {
      "text": "El Segundo, California",
      "page": "El_Segundo,_California"
    },
    {
      "text": "Sparks",
      "page": "Sparks"
    },
    {
      "text": "hydrotherapy",
      "page": "Hydrotherapy"
    },
    {
      "text": "South Bay Lakers",
      "page": "South_Bay_Lakers"
    },
    {
      "text": "rehabilitation",
      "page": "Rehabilitation"
    },
    {
      "text": "2020 NBA bubble",
      "page": "2020_NBA_Bubble"
    },
    {
      "text": "1960",
      "page": "1960"
    },
    {
      "text": "winning percentage",
      "page": "Winning_percentage"
    },
    {
      "text": "playoffs",
      "page": "playoffs"
    },
    {
      "text": "winning streak",
      "page": "Winning_streak"
    },
    {
      "text": "2013",
      "page": "2013"
    },
    {
      "text": "Forbes",
      "page": "Forbes"
    },
    {
      "text": "Rob Pelinka",
      "page": "Rob_Pelinka"
    },
    {
      "text": "general manager",
      "page": "General_manager"
    },
    {
      "text": "two-way contract",
      "page": "Two-way_contract"
    },
    {
      "text": "salary cap",
      "page": "Salary_cap"
    },
    {
      "text": "sciatica",
      "page": "Sciatica"
    },
    {
      "text": "Gabe Vincent",
      "page": "Gabe_Vincent"
    },
    {
      "text": "Rui Hachimura",
      "page": "Rui_Hachimura"
    },
    {
      "text": "Austin Reaves",
      "page": "Austin_Reaves"
    },
    {
      "text": "Jake LaRavia",
      "page": "Jake_LaRavia"
    },
    {
      "text": "Jaxson Hayes",
      "page": "Jaxson_Hayes"
    },
    {
      "text": "2021 NBA Draft",
      "page": "2021_NBA_draft"
    },
    {
      "text": "New Orleans Pelicans",
      "page": "New_Orleans_Pelicans"
    },
    {
      "text": "Lonzo Ball",
      "page": "Lonzo_Ball"
    },
    {
      "text": "Brandon Ingram",
      "page": "Brandon_Ingram"
    },
    {
      "text": "Josh Hart",
      "page": "Josh_Hart"
    },
    {
      "text": "John Kundla",
      "page": "John_Kundla"
    },
    {
      "text": "teamwork",
      "page": "Teamwork"
    },
    {
      "text": "Bill Sharman",
      "page": "Bill_Sharman"
    },
    {
      "text": "Frank Vogel",
      "page": "Frank_Vogel"
    },
    {
      "text": "Fred Schaus",
      "page": "Fred_Schaus"
    },
    {
      "text": "Butch van Breda Kolff",
      "page": "Butch_van_Breda_Kolff"
    },
    {
      "text": "Joe Mullaney",
      "page": "Sorcerer_Supreme"
    },
    {
      "text": "Paul Westhead",
      "page": "Paul_Westhead"
    },
    {
      "text": "Scott Brooks",
      "page": "Scott_Brooks"
    },
    {
      "text": "Nate McMillan",
      "page": "Nate_McMillan"
    },
    {
      "text": "Atlanta Hawks",
      "page": "Atlanta_Hawks"
    },
    {
      "text": "Lindsey Harding",
      "page": "Lindsey_Harding"
    },
    {
      "text": "analytics",
      "page": "Analytics"
    },
    {
      "text": "Kings",
      "page": "Kings"
    },
    {
      "text": "scouting",
      "page": "Scouting"
    },
    {
      "text": "45",
      "page": "45"
    },
    {
      "text": "Pau Gasol",
      "page": "Pau_Gasol"
    },
    {
      "text": "Carmelo Anthony",
      "page": "Carmelo_Anthony"
    },
    {
      "text": "Dwight Howard",
      "page": "Dwight_Howard"
    },
    {
      "text": "slam dunk",
      "page": "Slam_dunk"
    },
    {
      "text": "Jamaal Wilkes",
      "page": "Jamaal_Wilkes"
    },
    {
      "text": "milestone",
      "page": "Milestone"
    },
    {
      "text": "Chamberlain",
      "page": "Chamberlain"
    },
    {
      "text": "Memorial",
      "page": "Memorial"
    },
    {
      "text": "FIBA",
      "page": "FIBA"
    },
    {
      "text": "Yugoslavia",
      "page": "Yugoslavia"
    },
    {
      "text": "EuroBasket",
      "page": "EuroBasket"
    },
    {
      "text": "Spanish",
      "page": "Spanish"
    },
    {
      "text": "Olympic",
      "page": "Olympic"
    },
    {
      "text": "Spain",
      "page": "Spain"
    },
    {
      "text": "World Cup",
      "page": "World_cup"
    },
    {
      "text": "Yao Ming",
      "page": "Yao_Ming"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "simulcast",
      "page": "Simulcast"
    },
    {
      "text": "Fox Sports",
      "page": "Fox_Sports"
    },
    {
      "text": "Time Warner Cable",
      "page": "Time_Warner_Cable"
    },
    {
      "text": "regional sports network",
      "page": "Regional_sports_network"
    },
    {
      "text": "ESPN",
      "page": "ESPN"
    },
    {
      "text": "ABC",
      "page": "ABC"
    },
    {
      "text": "NBC",
      "page": "NBC"
    },
    {
      "text": "Amazon Prime Video",
      "page": "Amazon_Prime_Video"
    },
    {
      "text": "NBA TV",
      "page": "NBA_TV"
    },
    {
      "text": "KLAC",
      "page": "KLAC"
    },
    {
      "text": "cord-cutting",
      "page": "Cord-cutting"
    },
    {
      "text": "digital rights",
      "page": "Digital_rights"
    },
    {
      "text": "Spectrum",
      "page": "Spectrum"
    },
    {
      "text": "direct-to-consumer",
      "page": "Direct-to-consumer"
    },
    {
      "text": "TNT",
      "page": "TNT"
    },
    {
      "text": "SB Nation",
      "page": "SB_Nation"
    },
    {
      "text": "podcast",
      "page": "Podcast"
    },
    {
      "text": "LA",
      "page": "La"
    },
    {
      "text": "media in Los Angeles",
      "page": "Media_in_Los_Angeles"
    },
    {
      "text": "Los Angeles Times",
      "page": "Los_Angeles_Times"
    }
  ],
  "fetched_at": "2025-12-07T07:25:36.978727",
  "elapsed_ms": 689916
}