{
  "topic": "mRNA",
  "title": "Messenger RNA",
  "slug": "mrna",
  "grokipedia_slug": "Messenger_RNA",
  "grokipedia_url": "https://grokipedia.com/page/Messenger_RNA",
  "source": "grokipedia",
  "content": "# Messenger RNA\n\n**Messenger RNA (mRNA)** is a single-stranded ribonucleic acid (RNA) molecule that carries genetic information from deoxyribonucleic acid (DNA) to ribosomes, where it serves as a template for protein synthesis during translation. In eukaryotes, mRNA is transcribed from a gene's DNA template via RNA polymerase II and transported from the nucleus to the cytoplasm. mRNA encodes the amino acid sequence of proteins using a series of three-nucleotide codons that specify particular amino acids or translation signals. As a key intermediary in the central dogma of molecular biology, mRNA enables the expression of genetic information stored in DNA to produce functional proteins essential for cellular processes.\n\nThe discovery of mRNA occurred in 1961, when Sydney Brenner, François Jacob, and Matthew Meselson demonstrated that it acts as an unstable, short-lived carrier of genetic information from DNA to protein-synthesizing ribosomes in bacteria. This finding built on earlier hypotheses by Jacob and Monod and resolved how genetic instructions are transferred without direct DNA involvement in translation. In eukaryotes, mRNA production involves transcription in the nucleus followed by extensive processing of the initial transcript, known as pre-mRNA, to generate mature mRNA ready for export and translation.\n\nEukaryotic pre-mRNA processing includes three major steps: addition of a 5' cap (a 7-methylguanosine structure) to protect the mRNA and facilitate ribosome binding; splicing to remove non-coding introns and join coding exons; and cleavage and polyadenylation at the 3' end, adding a poly-A tail for stability and export. The mature mRNA structure typically consists of a 5' untranslated region (UTR), the coding sequence, a 3' UTR, the 5' cap, and the poly-A tail, with the overall length varying from hundreds to thousands of nucleotides depending on the gene. These modifications ensure mRNA stability, efficient nuclear export through nuclear pore complexes, and accurate translation, where ribosomes decode the mRNA sequence in coordination with transfer RNA (tRNA) molecules.\n\nBeyond its fundamental role in gene expression, mRNA has gained prominence in biotechnology, particularly in mRNA vaccines that instruct cells to produce viral proteins for immune response training, as seen in COVID-19 vaccines. Dysregulation of mRNA processing or stability is implicated in various diseases, including cancer and neurodegenerative disorders, highlighting its critical regulatory functions. Over 150,000 unique mRNAs have been identified in human cells, enabling the diversity of the proteome from a limited genome through mechanisms like alternative splicing.\n\n## Introduction\n\n### Definition and Discovery\n\nMessenger RNA (mRNA) is a single-stranded ribonucleic acid (RNA) molecule transcribed from a DNA template that serves as an intermediary carrying the genetic code to ribosomes for directing protein synthesis. In eukaryotes, transcription occurs in the nucleus, with mRNA exported to ribosomes in the cytoplasm; in prokaryotes, both transcription and translation take place in the cytoplasm. This process aligns with the central dogma of molecular biology, which posits that genetic information flows from DNA to RNA to proteins.\n\nThe concept of mRNA emerged in 1961 when François Jacob and Jacques Monod proposed it as an unstable intermediary in bacterial gene expression, particularly in their studies of the lac operon, where it was envisioned as a short-lived RNA that transmits regulatory signals from genes to ribosomes for rapid protein production. Their model explained the observed quick turnover of RNA in bacteria, contrasting with the stability of other RNA types, and laid the groundwork for understanding inducible gene systems.\n\nThis proposal was experimentally confirmed through pulse-labeling studies in the early 1960s, notably by Sydney Brenner, Jacob, and Matthew Meselson, who demonstrated that a small fraction of rapidly labeled, unstable RNA becomes associated with ribosomes during protein synthesis in bacteriophage-infected *Escherichia coli*, directly linking it to the lac operon induction. These findings established mRNA's role as the specific carrier of genetic information, distinguishing it from transfer RNA (tRNA) and ribosomal RNA (rRNA), which primarily function in the translational apparatus rather than encoding protein sequences.\n\n### Role in Gene Expression\n\nMessenger RNA (mRNA) occupies a central position in the central dogma of molecular biology, which posits a unidirectional flow of genetic information from DNA to RNA to proteins. In this framework, mRNA is transcribed from DNA templates in the nucleus (in eukaryotes) or cytoplasm (in prokaryotes), capturing the genetic sequence as a single-stranded RNA molecule complementary to the template strand of DNA (and thus matching the coding strand, with uracil replacing thymine). This process, known as transcription, ensures that the information encoded in genes is transferred to a portable form that can direct protein synthesis. Once produced, mRNA serves as the template during translation, where ribosomes bind to it and decode its nucleotide triplets—codons—into a specific sequence of amino acids, thereby producing functional proteins essential for cellular processes.\n\nA key distinction in mRNA function arises from its organization in different organisms. In eukaryotes, mRNAs are predominantly monocistronic, meaning each molecule encodes a single polypeptide chain, which facilitates independent regulation of individual proteins and aligns with the compartmentalized nature of eukaryotic cells. Conversely, prokaryotic mRNAs are often polycistronic, derived from operons that group multiple genes under a single promoter, allowing coordinated translation of several proteins from one mRNA transcript to support rapid responses to environmental changes, such as nutrient availability. This polycistronic strategy is exemplified in bacterial operons like the lac operon, where lactose metabolism enzymes are expressed together. In prokaryotes, mRNA is translated directly without the extensive processing seen in eukaryotes.\n\nmRNA integrates deeply with broader cellular regulatory networks, serving as a focal point for control at both transcriptional and post-transcriptional levels. Transcriptional regulation modulates mRNA production rates through factors like promoters and enhancers, while post-transcriptional mechanisms— including mRNA degradation, splicing, and interactions with RNA-binding proteins—adjust its availability, stability, and translation efficiency to achieve precise spatiotemporal gene expression. These layers of regulation allow cells to adapt dynamically, for instance, by rapidly degrading unnecessary mRNAs during stress responses.\n\nThe functional role of mRNA in gene expression exhibits remarkable evolutionary conservation, underpinned by the near-universal genetic code that interprets its codons consistently across bacteria, archaea, and eukaryotes. This code, deciphered through pioneering experiments using synthetic mRNAs, assigns specific amino acids or stop signals to each of the 64 possible triplets, enabling seamless translation machinery compatibility across diverse life forms and highlighting mRNA's ancient origins in the last universal common ancestor. Minor variations in the code occur in certain organelles and organisms, but the core triplet-based decoding remains invariant, underscoring mRNA's fundamental conservation.\n\n## Structure\n\n### Core Components\n\nMature messenger RNA (mRNA) in eukaryotes exhibits a fundamental linear architecture consisting of a 5' cap, a coding sequence, and a 3' end, flanked by untranslated regions. This core structure ensures the mRNA's stability, export from the nucleus, and efficient translation into proteins. The 5' cap is added post-transcriptionally and consists of a 7-methylguanosine (m⁷G) moiety linked via a 5'-5' triphosphate bridge to the first nucleotide of the transcript, protecting the mRNA from exonucleolytic degradation and facilitating ribosome binding.\n\nThe coding sequence (CDS), also known as the open reading frame (ORF), spans from the start codon AUG to a stop codon (UAA, UAG, or UGA), directly encoding the amino acid sequence of the polypeptide. Unlike DNA, mRNA incorporates uracil (U) in place of thymine (T) within its nucleotide composition of adenine (A), guanine (G), cytosine (C), and uracil, with eukaryotic mRNAs typically ranging from 500 to 10,000 nucleotides in length to accommodate the CDS and flanking elements.\n\nAt the 3' end, mRNA maturation involves endonucleolytic cleavage at a site downstream of the polyadenylation signal, most commonly the hexanucleotide AAUAAA in eukaryotes, followed by the addition of a poly(A) tail. This cleavage and tailing process defines the mature 3' terminus, contributing to mRNA stability and translational efficiency. Additionally, mRNA achieves a closed-loop configuration through interactions between the 5' cap and the poly(A)-binding protein (PABP) at the 3' end, mediated by the scaffold protein eIF4G, which enhances mRNA circularization and promotes ribosome recycling for sustained translation.\n\n### Untranslated Regions\n\nMessenger RNA (mRNA) untranslated regions (UTRs) are non-coding segments flanking the coding sequence (CDS) that play crucial roles in regulating translation initiation, mRNA stability, and localization. The 5' UTR is located upstream of the start codon, while the 3' UTR is downstream of the stop codon; both contain sequence elements and structures that modulate gene expression without being translated into protein.\n\nThe 5' UTR serves as the primary site for ribosome recruitment and initiation codon recognition. In prokaryotes, it typically harbors the Shine-Dalgarno sequence, a purine-rich motif approximately 5-10 nucleotides upstream of the AUG start codon, which base-pairs with the anti-Shine-Dalgarno sequence in the 16S rRNA to position the ribosome accurately. Prokaryotic 5' UTRs are generally short, averaging 20-30 nucleotides, reflecting the streamlined nature of bacterial translation. In eukaryotes, the 5' UTR contains the Kozak consensus sequence surrounding the start codon (e.g., GCCA/GCC AUG G), which enhances recognition by the scanning 40S ribosomal subunit. Eukaryotic 5' UTRs average 100-200 nucleotides in length and facilitate the scanning mechanism, where the 43S pre-initiation complex binds near the 5' cap and moves downstream to identify the first suitable AUG codon.\n\nThe 3' UTR exerts control over mRNA stability and translational efficiency through embedded regulatory motifs. It often includes AU-rich elements (AREs), sequences rich in adenine and uracil (e.g., AUUUA repeats), that bind proteins to promote or inhibit decay, thereby fine-tuning transcript half-life. Additionally, 3' UTRs serve as binding platforms for microRNAs (miRNAs), where seed sequences complementary to miRNA guide the RNA-induced silencing complex (RISC) to repress translation or induce degradation. Eukaryotic 3' UTRs vary widely in length, typically ranging from 100 to 2000 nucleotides, with averages around 1000 nucleotides in humans, allowing for layered regulatory inputs. The poly-A tail, appended to the 3' end, interacts with elements in the adjacent 3' UTR to stabilize the mRNA and facilitate circularization during translation.\n\nSecondary structures, such as stem-loops formed by base-pairing within UTRs, significantly influence mRNA functionality. In the 5' UTR, stable hairpins can impede ribosomal scanning, reducing translation efficiency, while moderate structures may enhance initiation by positioning the ribosome. In the 3' UTR, stem-loops can shield or expose regulatory sites, affecting miRNA access or protein binding that modulates stability and decay rates.\n\nProkaryotic UTRs are characteristically shorter and simpler, with fewer regulatory elements suited to rapid, constitutive expression in unicellular organisms. In contrast, eukaryotic UTRs are longer and more complex, incorporating diverse motifs for sophisticated post-transcriptional control that supports multicellular development and environmental responses.\n\n### Modifications and Variants\n\nMessenger RNA undergoes various post-transcriptional modifications that influence its stability, localization, and function in gene expression. One of the most prevalent internal modifications is N6-methyladenosine (m⁶A), which marks adenosine residues within the mRNA sequence and is the most abundant modification in eukaryotic mRNAs. This modification is dynamically regulated by writer proteins such as METTL3 and erasers like FTO, affecting multiple aspects of mRNA metabolism, including alternative splicing through interactions with splicing factors and nuclear export via recognition by YTHDC1 protein. In eukaryotic processing, m⁶A sites are enriched in 3' untranslated regions and near stop codons, contributing to fine-tuning of mRNA fate without altering the primary sequence.\n\nAnother key modification is the addition of a poly(A) tail at the 3' end, consisting of 50-250 adenine residues in mammalian mRNAs, which is enzymatically synthesized by poly(A) polymerase during nuclear processing. This homopolymeric tail binds multiple copies of poly(A)-binding protein (PABP), enhancing mRNA stability by protecting against 3' exonucleolytic degradation and promoting translation efficiency through circularization of the mRNA via PABP-eIF4G interactions. The length of the poly(A) tail is tightly controlled, with longer tails correlating with increased translational output and cytoplasmic persistence.\n\nmRNA exists in distinct structural variants, primarily linear and circular forms. Linear mRNA, the canonical form, features 5' cap, coding sequence, and 3' poly(A) tail, rendering it susceptible to exonucleases but optimized for ribosomal translation. In contrast, circular mRNA (circRNA) forms through back-splicing, where a splice donor joins an upstream splice acceptor, creating a covalently closed loop that resists degradation by exonucleases due to the absence of free ends. Most circRNAs are derived from exonic sequences, though some retain intronic elements (EIcircRNAs) or arise purely from introns (ciRNAs), and they primarily function in post-transcriptional regulation, such as acting as miRNA sponges or modulating protein activity, rather than serving as templates for protein synthesis.\n\nBeyond endogenous forms, synthetic mRNA variants have emerged, particularly in therapeutic applications. In vitro transcribed (IVT) mRNA mimics endogenous linear mRNA but is engineered with optimized untranslated regions and capping analogs for enhanced stability and immunogenicity control, as seen in COVID-19 vaccines like those encoding spike protein. Circular synthetic mRNAs, produced via ligation or ribozyme-mediated strategies, offer advantages over linear IVT counterparts, including greater resistance to degradation and prolonged expression, positioning them as next-generation platforms for vaccines and gene therapies. These variants highlight the versatility of mRNA engineering while preserving core functional principles of natural transcripts.\n\n## Biosynthesis\n\n### Transcription Initiation and Elongation\n\nIn prokaryotic transcription, the sigma (σ) factor associates with the core RNA polymerase to form the holoenzyme, which specifically recognizes and binds to promoter regions on the DNA. The promoter typically features conserved sequences known as the -10 box (TATAAT consensus) and the -35 box (TTGACA consensus), located upstream of the transcription start site at +1. Upon binding, the holoenzyme unwinds the DNA to form an open complex, initiating RNA synthesis at the +1 site by incorporating the first nucleotide, usually a purine. The σ factor is then released, allowing the core polymerase to enter the elongation phase, where it synthesizes the RNA transcript at an average rate of approximately 50 nucleotides per second.\n\nEukaryotic transcription of messenger RNA (mRNA) precursors is carried out by RNA polymerase II (Pol II), which requires the assembly of a preinitiation complex (PIC) at the core promoter. The TATA-binding protein (TBP), a subunit of the transcription factor IID (TFIID) complex, binds to the TATA box, a core promoter element typically located 25-35 base pairs upstream of the transcription start site. Additional general transcription factors (TFIIA, TFIIB, TFIIE, TFIIF, and TFIIH) join to recruit Pol II, while the Mediator complex bridges the PIC with gene-specific activators to stabilize assembly and facilitate promoter opening. Elongation proceeds following phosphorylation of the C-terminal domain (CTD) of Pol II's largest subunit by TFIIH's kinase subunit, which releases Pol II from the promoter and promotes processive RNA chain extension.\n\nPromoter elements dictate the specificity and efficiency of transcription initiation. The core promoter, encompassing sequences like the TATA box, initiator (Inr), and downstream promoter element (DPE) in eukaryotes—or the -10 and -35 boxes in prokaryotes—directly interacts with the transcription machinery to define the start site and directionality. Enhancers, in contrast, are distal regulatory elements that loop to contact the core promoter via Mediator and other coactivators, enhancing transcription rates but not altering the primary initiation site. Transcription directionality is established by the orientation of these elements relative to the antisense (template) strand, which is read 3' to 5' to synthesize the sense RNA strand 5' to 3'.\n\nA key feature of initiation in both prokaryotes and eukaryotes is abortive initiation, where RNA polymerase repeatedly synthesizes and releases short RNA transcripts (typically 2-15 nucleotides) without clearing the promoter. This non-productive cycling allows the enzyme to probe promoter conformation until stable promoter clearance occurs, transitioning to productive elongation; during synthesis, uracil is incorporated opposite adenine on the template strand.\n\n### Termination and Primary Transcript\n\nIn prokaryotes, transcription termination occurs through two primary mechanisms: Rho-independent and Rho-dependent. Rho-independent termination, also known as intrinsic termination, involves the formation of a stable RNA hairpin structure in the nascent transcript, followed by a run of uridine residues (U-run) that weakens the RNA-DNA hybrid, causing RNA polymerase to dissociate from the DNA template. This process does not require additional protein factors and is driven solely by the sequence-specific folding of the RNA and its interaction with the polymerase. In contrast, Rho-dependent termination relies on the Rho protein, a hexameric RNA helicase that binds to specific rut (Rho utilization) sites on the emerging RNA, translocates along the transcript in a 5' to 3' direction using ATP hydrolysis, and unwinds the transcription elongation complex, leading to polymerase release. This mechanism is particularly important for terminating transcription at sites lacking strong intrinsic signals and helps prevent unwanted read-through into downstream genes.\n\nIn eukaryotes, transcription termination by RNA polymerase II (Pol II) is more complex and tightly linked to the processing of the primary transcript. Termination is triggered by the polyadenylation signal (typically AAUAAA) located in the 3' untranslated region of the pre-mRNA, which causes Pol II to pause approximately 1-2 kilobases downstream. The cleavage and polyadenylation specificity factor (CPSF) complex then recognizes this signal and recruits endonucleases, such as CPSF-73, to cleave the RNA at the poly(A) site, separating the upstream pre-mRNA from the downstream fragment. The 5'-3' exoribonuclease Xrn2 (also known as Rat1 in yeast) subsequently degrades the downstream cleaved RNA, acting as a \"torpedo\" that catches up to the paused Pol II, destabilizes the elongation complex, and promotes polymerase release through allosteric changes and dephosphorylation of the C-terminal domain. This process ensures efficient termination and prevents the production of aberrant extended transcripts.\n\nThe primary transcript, often referred to as pre-mRNA or heterogeneous nuclear RNA (hnRNA) in eukaryotes, is the initial, unprocessed product of transcription that includes both exons and introns, along with extended 5' and 3' untranslated regions beyond the mature mRNA boundaries. In prokaryotes, the primary transcript is typically mature mRNA without introns, but in eukaryotes, it encompasses the full gene sequence transcribed by Pol II, with exons representing the coding and regulatory segments (averaging 50-250 base pairs each) interspersed by introns that can span hundreds to thousands of base pairs. Eukaryotic primary transcripts can reach lengths of up to 100 kilobases or more, reflecting the expansive intron content that constitutes about 95% of the total in many protein-coding genes. These transcripts also feature temporary 5' extensions from promoter-proximal regions and 3' extensions downstream of the poly(A) site, which are later trimmed during processing.\n\nTranscription termination is functionally coupled to pre-mRNA processing in eukaryotes to enhance efficiency and fidelity, with termination factors like CPSF recruiting processing machinery such as capping enzymes and splicing components during elongation. This co-transcriptional integration ensures that 3' end cleavage facilitates Xrn2-mediated termination while simultaneously enabling polyadenylation and export signals, reducing the risk of defective transcripts. In prokaryotes, termination more directly coordinates with translation initiation, but the eukaryotic coupling underscores the compartmentalized nature of gene expression.\n\n## Processing\n\n### 5' Capping and Export Signals\n\nThe 5' capping of messenger RNA (mRNA) occurs co-transcriptionally shortly after transcription initiation, typically when the nascent transcript reaches a length of 20-30 nucleotides, allowing the 5' end to emerge from the RNA polymerase II (Pol II) exit channel. This process begins with the RNA triphosphatase removing the γ-phosphate from the 5' triphosphate end of the pre-mRNA, followed by the guanylyltransferase component of the capping enzyme (CE, also known as RNGTT in humans) transferring a guanosine monophosphate (GMP) moiety from GTP to form an unusual 5'-5' triphosphate linkage, resulting in GpppN at the 5' end. Subsequent methylation steps involve the RNA guanine-7-methyltransferase (RNMT) adding a methyl group to the N7 position of the guanosine to produce m7GpppN, while cap methyltransferases 1 and 2 (CMTR1 and CMTR2) catalyze 2'-O-ribose methylation on the first and second nucleotides, respectively, yielding the mature cap 0 (m7GpppN) or cap 1 (m7GpppNm) structures essential for mRNA stability and function. These enzymes associate directly with the phosphorylated C-terminal domain of Pol II and the paused elongation complex, ensuring efficient coupling of capping to transcription.\n\nThe primary functions of the 5' cap include protecting the mRNA from degradation by 5' to 3' exonucleases, such as Xrn1, thereby enhancing transcript stability during processing and export. Additionally, the cap promotes translation initiation by serving as a binding site for the eukaryotic initiation factor 4E (eIF4E), which is part of the eIF4F complex that recruits the 40S ribosomal subunit to the mRNA 5' end, facilitating scanning to the start codon. This cap-eIF4E interaction is critical for efficient ribosome recruitment and is modulated by phosphorylation of 4E-BP proteins, underscoring the cap's role in translational control.\n\nIn terms of export signals, the mature 5' cap is immediately recognized by the nuclear cap-binding complex (CBC), composed of CBP80 (NCBP1) and CBP20 (NCBP2), which binds the m7G structure with high affinity and shields it from exonucleases while recruiting the TREX (transcription-export) complex. The CBC-TREX interaction, mediated by components like ALYREF, couples the capped mRNA to the nuclear pore complex for passage into the cytoplasm, ensuring that only properly capped transcripts are exported efficiently. This cap-dependent signaling also briefly coordinates with splicing factors to promote intron removal, though the primary export linkage occurs via CBC.\n\nUnlike eukaryotic mRNA, prokaryotic transcripts lack a 5' cap due to the absence of Pol II-like capping machinery, relying instead on direct binding of the 30S ribosomal subunit to the Shine-Dalgarno sequence upstream of the start codon for translation initiation without cap-mediated protection or recruitment.\n\n### Splicing and Intron Removal\n\nSplicing is a critical post-transcriptional process in eukaryotic cells that removes non-coding introns from pre-mRNA and ligates the coding exons to produce mature mRNA. This process is carried out by the spliceosome, a large ribonucleoprotein complex composed of five small nuclear ribonucleoproteins (snRNPs: U1, U2, U4/U6, and U5) and numerous associated proteins. The spliceosome assembles stepwise on the pre-mRNA, recognizing specific sequence motifs at intron boundaries and internal sites to ensure precise excision and joining.00146-9)\n\nSpliceosome assembly begins with the recognition of the 5' splice site by the U1 snRNP, which base-pairs with the conserved GU dinucleotide at the intron-exon junction, adhering to the GU rule established from early sequence analyses of splice junctions. Subsequently, the U2 snRNP binds the branch point sequence, typically located 20–50 nucleotides upstream of the 3' splice site and featuring a conserved adenine (A) residue within a YNCURAC consensus (where Y is pyrimidine, N any nucleotide, R purine), forming base pairs with U2 snRNA to stabilize the commitment complex. The 3' splice site is marked by an AG dinucleotide, also recognized through interactions involving U2 and later U5 snRNPs, completing the early recognition phase.\n\nThe splicing mechanism proceeds via two sequential transesterification reactions. In the first step, the 2'-OH group of the branch point adenine attacks the phosphodiester bond at the 5' splice site, cleaving the 5' exon and forming a lariat intermediate where the intron is looped via a 2'-5' phosphodiester bond. The second transesterification involves the 3'-OH of the freed 5' exon attacking the 3' splice site, ligating the exons and releasing the lariat intron. These reactions are catalyzed within the spliceosome's active site, with Prp8 serving as a central scaffold protein that positions substrates and coordinates catalysis across both steps. Prp16, an ATPase associated with the U5 snRNP, drives conformational rearrangements and proofreading after the first step to ensure fidelity before the second transesterification.\n\nAlternative splicing allows a single pre-mRNA to generate multiple mRNA isoforms by varying exon inclusion, such as through exon skipping, mutually exclusive exons, or intron retention, thereby expanding proteome diversity. In humans, approximately 95% of multi-exon genes undergo alternative splicing, producing numerous isoforms that can differ in function, localization, or stability. This regulation often involves sequence elements like exonic or intronic splicing enhancers/silencers and is influenced by splicing factors that modulate splice site choice during spliceosome assembly.\n\nIn contrast to spliceosomal splicing, certain introns in organellar genomes, such as those in mitochondria and chloroplasts, can undergo self-splicing without proteins, relying on the RNA's intrinsic ribozyme activity. Group I introns, common in fungal and plant organelles, initiate splicing with an exogenous guanosine cofactor attacking the 5' splice site, followed by exon ligation, as first demonstrated in Tetrahymena rRNA.90176-3.pdf) Group II introns, prevalent in bacterial and organellar genomes, mirror the spliceosomal pathway more closely by forming a lariat intermediate via branch point attack, with self-splicing observed in yeast mitochondrial introns. These self-splicing mechanisms highlight evolutionary links between ancient ribozymes and the modern spliceosome.\n\n### Polyadenylation and 3' End Formation\n\nIn eukaryotic mRNA processing, the polyadenylation signal, typically the hexanucleotide sequence AAUAAA located 10-30 nucleotides upstream of the cleavage site, is recognized by the cleavage and polyadenylation specificity factor (CPSF) complex. Downstream of this signal, GU- or U-rich elements, situated approximately 20-30 nucleotides after the AAUAAA motif, are bound by the cleavage stimulation factor (CstF), which helps position the cleavage machinery. The pre-mRNA is then cleaved endonucleolytically by the CPSF-associated endonuclease between these signals, generating the 3' end for subsequent polyadenylation.\n\nFollowing cleavage, poly(A) polymerase (PAP) catalyzes the addition of a poly(A) tail, consisting of approximately 200-250 adenine residues, to the newly exposed 3' hydroxyl group. The nuclear poly(A)-binding protein 1 (PABPN1) binds to the growing tail, stimulating PAP activity and ensuring controlled elongation until the optimal length is reached, after which it inhibits further addition to prevent over-adenylation. This length regulation is critical, as tails shorter or longer than this range can impair mRNA function.\n\nThe poly(A) tail serves multiple essential functions in mRNA maturation and utilization. It promotes nuclear export by facilitating the recruitment of export adaptors such as ALYREF, which links the mRNA to the NXF1/NXT1 export receptor at the nuclear pore complex. In the cytoplasm, the tail bound by cytoplasmic poly(A)-binding protein (PABP) enhances mRNA stability by shielding the 3' end from exonucleolytic degradation, thereby extending the mRNA's half-life.01137-6.pdf) Additionally, PABP interacts with the translation initiation factor eIF4G, forming a closed-loop structure with the 5' cap that stimulates ribosome recruitment and enhances translation efficiency.\n\nA notable variant occurs in replication-dependent histone mRNAs, which lack a poly(A) tail and instead terminate in a conserved stem-loop structure formed through a distinct processing pathway. In this case, the U7 small nuclear ribonucleoprotein (snRNP) recognizes a specific binding site downstream of the stem-loop, directing cleavage and ligation to generate the mature 3' end, which regulates histone mRNA stability in a cell cycle-dependent manner.\n\n### RNA Editing\n\nRNA editing refers to post-transcriptional enzymatic modifications that alter the nucleotide sequence of messenger RNA (mRNA), thereby expanding the proteome and influencing gene expression without changing the genomic DNA. These changes are catalyzed by deaminase enzymes and occur primarily in specific contexts to fine-tune protein function, stability, and regulatory interactions.\n\nThe most prevalent form of RNA editing in eukaryotes is adenosine-to-inosine (A-to-I) editing, mediated by adenosine deaminases acting on RNA (ADAR) enzymes, which deaminate adenosine residues to inosine; during translation, inosine is recognized as guanosine (G) by the ribosome. ADAR1, ADAR2, and ADAR3 are the primary enzymes involved, with ADAR1 and ADAR2 being catalytically active; ADAR2 is particularly abundant in the brain, where it contributes to transcriptome diversity by editing neuronal mRNAs, such as those encoding glutamate receptors, to modulate synaptic plasticity and neurotransmitter signaling. A-to-I editing often targets double-stranded RNA structures formed by inverted Alu repeats in primates, leading to synonymous or nonsynonymous codon changes that can affect protein isoforms.\n\nIn contrast, cytidine-to-uridine (C-to-U) editing is less common and primarily mediated by the APOBEC1 enzyme, which deaminates cytidine to uridine in specific mRNA targets. A canonical example occurs in the apolipoprotein B (apoB) mRNA in the mammalian small intestine, where APOBEC1, in complex with cofactors like ACF, edits a CAA codon to UAA at position 6666, introducing a premature stop codon that truncates the protein to produce the shorter ApoB48 isoform essential for lipid transport, rather than the full-length ApoB100. This editing is tissue-specific and requires mooring sequence elements downstream of the target cytidine for enzyme recruitment.\n\nGenome-wide studies have identified thousands of RNA editing sites in the human transcriptome, with over 14,000 A-to-I sites in more than 1,400 mRNAs reported early on, predominantly in Alu elements, though recent analyses reveal up to 189,000 cell-type-specific sites, particularly in the brain. These edits influence various processes, including alternative splicing by altering splice site recognition, coding sequence changes that modify protein function, and modulation of microRNA binding sites to affect mRNA stability and translation. For instance, A-to-I editing can recode ion channel subunits, enhancing calcium permeability in neurons.\n\nRegulation of RNA editing occurs at multiple levels, with ADAR enzymes localized differently: nuclear isoforms like ADAR1-p110 edit pre-mRNAs, potentially integrating with splicing machinery to influence exon inclusion, while cytoplasmic forms such as ADAR1-p150 target mature mRNAs or viral RNAs. Dysregulation is linked to diseases; for example, mutations or downregulation of ADAR2 lead to inefficient editing of the GluA2 receptor Q/R site in amyotrophic lateral sclerosis (ALS), causing excitotoxicity in motor neurons and contributing to neurodegeneration.\n\n## Translation\n\n### Initiation Complex Formation\n\nIn prokaryotes, translation initiation commences with the binding of the 30S ribosomal subunit to the messenger RNA (mRNA) at the Shine-Dalgarno (SD) sequence located in the 5' untranslated region (UTR), which base-pairs with the complementary anti-Shine-Dalgarno (ASD) sequence (CCUCC) near the 3' end of the 16S ribosomal RNA (rRNA). This interaction aligns the start codon, typically AUG, in proximity to the ribosomal P site, ensuring accurate positioning for initiator tRNA binding. The process is facilitated by three initiation factors: IF1, which occupies the A site to block non-initiator tRNAs and stabilize the 30S subunit; IF3, which promotes mRNA binding and prevents premature association with the 50S subunit to maintain fidelity; and IF2, a GTPase that delivers the initiator formylmethionyl-tRNA^fMet (fMet-tRNA^fMet) to the AUG codon in the P site. Upon GTP hydrolysis by IF2, the 50S subunit joins to form the complete 70S initiation complex, releasing the initiation factors.\n\nIn eukaryotes, initiation begins with the assembly of the 43S preinitiation complex (PIC), comprising the 40S ribosomal subunit associated with eukaryotic initiation factors (eIFs) eIF1, eIF1A, and eIF3, along with the ternary complex of eIF2-GTP-bound initiator methionyl-tRNA^i (Met-tRNA^i). eIF2 specifically recognizes and stabilizes Met-tRNA^i in the ternary complex, delivering it to the 40S subunit's P site in a partially accommodated orientation.00512-6) The 43S PIC is then recruited to the mRNA's 5' cap structure (m^7GpppN) via the eIF4F complex, which includes the cap-binding protein eIF4E, the multifunctional scaffold eIF4G, and the ATP-dependent RNA helicase eIF4A; eIF4G bridges eIF4E and eIF3 to tether the ribosome to the mRNA. From this cap-bound position, the 43S PIC scans the 5' UTR in a 5'-to-3' direction, unwinding secondary structures with eIF4A's helicase activity, until it identifies the start AUG codon.\n\nOptimal recognition of the eukaryotic start codon depends on its surrounding sequence context, known as the Kozak consensus: GCCRCCAUGG, where R denotes a purine (A or G) at the -3 position relative to the AUG, and the +4 position is preferably G; this motif enhances initiation efficiency by stabilizing codon-anticodon pairing and PIC accommodation. Mutations deviating from this consensus reduce translation accuracy and efficiency, as the -3 purine and +4 G positions interact directly with ribosomal elements and eIFs to promote GTP hydrolysis by eIF2 and release of eIFs. The 5' UTR influences this scanning process by providing binding sites for regulatory factors that modulate ribosome movement.\n\nWhile most eukaryotic mRNAs rely on this cap-dependent scanning mechanism, certain viral mRNAs and cellular transcripts under stress conditions utilize internal ribosome entry sites (IRES) for cap-independent initiation. IRES elements, often complex RNA structures in the 5' UTR, directly recruit the 40S subunit and associated eIFs to an internal AUG without prior cap binding or scanning, enabling translation when cap-dependent pathways are inhibited, as first demonstrated in poliovirus RNA. This alternative mode supports viral replication and cellular adaptation to stressors like hypoxia.\n\n### Elongation and Codon Decoding\n\nDuring elongation, the ribosome moves along the mRNA in the 5' to 3' direction, adding amino acids to the growing polypeptide chain one at a time. This process begins after the formation of the initiation complex, where the initiator tRNA occupies the P site and the A site is empty. Each cycle of elongation involves decoding of the mRNA codon in the A site, formation of a peptide bond, and translocation of the mRNAs and tRNAs relative to the ribosome.\n\nCodon-anticodon pairing occurs when the anticodon of an incoming aminoacyl-tRNA (aa-tRNA) base-pairs with the mRNA codon in the ribosomal A site. According to the wobble hypothesis, the third position of the codon allows for non-standard base pairing, enabling a single tRNA to recognize multiple synonymous codons and reducing the number of required tRNAs. This flexibility arises from modifications in the anticodon's first position (corresponding to the codon's third), such as inosine pairing with A, C, or U.\n\nSelection of the cognate aa-tRNA for the A-site codon is facilitated by elongation factors. In prokaryotes, elongation factor Tu (EF-Tu) forms a ternary complex with GTP and aa-tRNA, delivering it to the A site where codon recognition induces GTP hydrolysis, releasing EF-Tu-GDP and allowing accommodation of the aa-tRNA. In eukaryotes, the homologous elongation factor 1A (eEF1A) performs an analogous role, binding GTP and aa-tRNA to promote accurate decoding via induced-fit conformational changes in the ribosome upon cognate pairing. GTP hydrolysis by eEF1A ensures fidelity through kinetic proofreading, rejecting near-cognate tRNAs.\n\nPeptide bond formation is catalyzed by the peptidyl transferase center (PTC) in the large ribosomal subunit, which is composed entirely of ribosomal RNA (rRNA) acting as a ribozyme. The 23S rRNA in prokaryotes (or 28S rRNA in eukaryotes) positions the peptidyl-tRNA in the P site and the aa-tRNA in the A site, facilitating nucleophilic attack by the A-site amino group on the P-site ester bond without requiring protein catalysis. This rRNA-mediated reaction transfers the nascent peptide chain to the A-site aa-tRNA.\n\nFollowing peptide bond formation, translocation shifts the deacylated tRNA to the E site, the peptidyl-tRNA to the P site, and advances the mRNA by one codon to expose the next codon in the A site. In prokaryotes, elongation factor G (EF-G), bound to GTP, binds the ribosome and promotes this movement; GTP hydrolysis by EF-G accelerates the conformational changes in the ribosome and tRNAs, resolving hybrid states and ensuring efficient translocation. The eukaryotic counterpart, elongation factor 2 (eEF2), operates similarly, using GTP hydrolysis to drive tRNA and mRNA movement within the 80S ribosome.\n\nThe speed of elongation varies between organisms and is influenced by codon usage. In prokaryotes, ribosomes typically incorporate 10-20 amino acids per second under optimal conditions. Eukaryotic translation is generally slower, at approximately 5-6 amino acids per second, with additional pauses at rare codons due to limited availability of corresponding tRNAs, which can regulate co-translational protein folding and quality control.\n\n### Termination and Ribosome Release\n\nTranslation termination occurs when the ribosome encounters one of three stop codons—UAA, UAG, or UGA—in the mRNA, signaling the end of protein synthesis and triggering the release of the completed polypeptide chain. In prokaryotes, RF1 recognizes UAA and UAG, while RF2 recognizes UAA and UGA; both possess peptidyl-tRNA hydrolase activity that cleaves the ester bond linking the nascent peptide to the tRNA in the P site. In eukaryotes, eRF1 decodes all three stop codons and catalyzes the hydrolysis, functioning in a ternary complex with GTP-bound eRF3, a GTPase that enhances termination efficiency. The GTP hydrolysis by RF3 or eRF3 promotes the dissociation of the class I release factors (RF1/RF2 or eRF1) from the ribosome, ensuring rapid progression to the next phase.00519-3)\n\nFollowing peptide release, the post-termination ribosomal complex must be disassembled to recycle components for new rounds of translation. In both prokaryotes and eukaryotes, the ATP-binding cassette protein ABCE1 plays a central role in splitting the ribosome into its 40S/30S and 60S/50S subunits, facilitating the release of the deacylated tRNA and mRNA.00969-1) In eukaryotes, this process is assisted by initiation factors such as eIF1 and eIF1A, which help in subunit separation and prevent premature reinitiation on the same mRNA.00413-9) The freed mRNA can then be recycled for additional translation cycles or marked for decay, depending on cellular conditions.\n\nAlthough stop codons generally halt translation, certain mechanisms allow read-through in specific contexts. Suppressor tRNAs with anticodons complementary to stop codons can occasionally insert an amino acid, enabling translation to continue, though this is rare and often mutagenic. A notable exception is the recoding of UGA as selenocysteine in selenoproteins, where a selenocysteine insertion sequence (SECIS) element in the 3' untranslated region recruits selenocysteyl-tRNA^Sec and elongation factor SelB/eEFSec to decode UGA without terminating translation. Such programmed read-through is essential for incorporating this rare amino acid and exemplifies how mRNA context can override standard termination signals.\n\n## Localization and Stability\n\n### Nuclear Export Mechanisms\n\nIn eukaryotic cells, the nuclear export of messenger RNA (mRNA) is a tightly regulated process that ensures only mature, properly processed transcripts are transported from the nucleus to the cytoplasm for translation. This translocation occurs through nuclear pore complexes (NPCs), large protein assemblies embedded in the nuclear envelope, and involves the formation of export-competent messenger ribonucleoprotein (mRNP) particles. The process is essential for gene expression, as it separates transcription in the nucleus from translation in the cytoplasm, preventing premature translation of immature mRNAs.\n\nA key player in this pathway is the TREX (transcription-export) complex, a conserved multisubunit assembly that couples mRNA transcription and processing to nuclear export. In yeast and mammals, the TREX complex, which includes the THO subcomplex and the RNA helicase Sub2 (or UAP56 in humans), is recruited to nascent mRNA during transcription elongation and splicing. This recruitment facilitates the loading of the primary mRNA export receptor, NXF1 (Mex67 in yeast) bound to NXT1 (Mtr2 in yeast), onto the mRNP, directing it to the nuclear basket of the NPC for translocation. The THO component of TREX prevents R-loop formation during transcription, ensuring smooth handover to export factors, while Sub2 unwinds secondary structures to promote NXF1 binding. Seminal studies have shown that TREX mutation disrupts mRNA export, leading to nuclear accumulation and cellular defects.\n\nDirectionality of mRNA export is achieved independently of the classical Ran-GTP gradient that drives most nuclear transport, relying instead on asymmetric localization and ATP-dependent remodeling at the NPC. Although the Ran-GTP/GDP gradient maintains overall nuclear-cytoplasmic asymmetry, the NXF1-NXT1 mediated export of mRNPs does not directly require Ran-GTP for translocation. Instead, the DEAD-box ATPase Dbp5 (DDX19 in humans), anchored to the cytoplasmic fibrils of the NPC via Nup159 (Nup214), uses ATP hydrolysis to unwind mRNP complexes upon arrival at the cytoplasmic side, releasing mature mRNA into the cytoplasm and recycling export factors back to the nucleus. This Dbp5 cycle, stimulated by Gle1 and inositol hexakisphosphate (IP6), ensures unidirectional transport and prevents back-diffusion of mRNPs.\n\nQuality control during export is mediated by the exon junction complex (EJC), a multiprotein assembly deposited 20-24 nucleotides upstream of exon-exon junctions by the splicing machinery. The EJC, consisting of core components eIF4A3, MAGOH, Y14, and MLN51, marks spliced mRNAs as export-competent and distinguishes them from unspliced or aberrantly processed transcripts, which are retained in the nucleus. EJCs recruit TREX and NXF1, enhancing export efficiency, and also flag mRNAs for post-export surveillance, such as nonsense-mediated decay (NMD) if premature stop codons are detected. This mechanism ensures that only high-quality mRNAs proceed to translation.\n\nThe 5' cap and poly(A) tail, added during processing, briefly facilitate export by serving as binding sites for adaptor proteins like CBP80 and PABPN1, which indirectly link to NXF1 and promote mRNP remodeling. In prokaryotes, nuclear export is irrelevant due to the absence of a nucleus; instead, transcription and translation are directly coupled in the cytoplasm, with ribosomes binding nascent mRNA as it emerges from RNA polymerase.\n\n### Cytoplasmic Trafficking and Localization\n\nOnce in the cytoplasm, messenger RNAs (mRNAs) are assembled into messenger ribonucleoprotein (mRNP) complexes that facilitate their trafficking and localization to specific subcellular sites, enabling spatially restricted protein synthesis. This process is crucial for cellular asymmetry, such as in polarized cells like neurons and oocytes. Localization signals, often termed \"zipcodes,\" are primarily located in the 3' untranslated region (3' UTR) of mRNAs and serve as recognition motifs for RNA-binding proteins (RBPs) that direct mRNPs to target destinations.00126-3) For instance, the β-actin mRNA contains a 54-nucleotide zipcode in its 3' UTR that binds the RBP ZBP1 (zipcode-binding protein 1), which mediates transport to neuronal dendrites, supporting actin cytoskeleton dynamics at synaptic sites. These interactions ensure that mRNAs are packaged into transport-competent mRNPs shortly after nuclear export.00651-7)\n\nDirected transport of mRNPs relies on motor proteins that move along the cytoskeleton, particularly microtubules. Kinesin motors, such as kinesin-1, drive plus-end-directed transport toward the cell periphery, while dynein powers minus-end-directed movement toward the microtubule-organizing center. In asymmetric distribution, these motors coordinate to position mRNAs; for example, in Drosophila oocytes, dynein transports gurken mRNA to the anterior-dorsal region for eggshell patterning, while kinesin-1 relocates oskar mRNA to the posterior pole for germline specification.01302-7) This motor-driven mechanism is essential for long-distance trafficking in large cells, where mRNPs form granules visible by microscopy and associate with microtubules via adaptor proteins.00602-X)\n\nmRNP granules play key roles in cytoplasmic regulation and storage during trafficking. Processing bodies (P-bodies) sequester mRNAs for translational repression or decay, acting as hubs for mRNA surveillance and quality control without directly driving localization.00643-X) Stress granules, induced by cellular stress, temporarily store mRNAs by halting translation, allowing rapid resumption upon stress relief; they often dock with P-bodies, facilitating mRNA exchange and contributing to spatiotemporal control in the cytoplasm.01027-9) In contrast to directed transport, shorter mRNAs typically rely on passive diffusion for local positioning, whereas longer or structurally complex mRNAs favor active, motor-mediated delivery to overcome cytoplasmic barriers.01213-8) This dichotomy ensures efficient resource allocation, with diffusion sufficing for uniform distribution and directed mechanisms enabling precise asymmetry.\n\n## Degradation\n\n### Prokaryotic mRNA Decay Pathways\n\nIn prokaryotes, particularly bacteria like *Escherichia coli*, mRNA decay is a rapid process that ensures quick adaptation to environmental changes, with an average mRNA half-life of approximately 3-7 minutes under exponential growth conditions. This turnover is primarily mediated by a combination of endonucleolytic and exonucleolytic activities, often coupled to translation, and contrasts with the longer-lived eukaryotic mRNAs. The core machinery includes ribonucleases such as RNase E, polynucleotide phosphorylase (PNPase), and RNase II, which collectively degrade mRNA from internal sites or the ends.\n\nA major initiation pathway involves endonucleolytic cleavage by RNase E, a key enzyme in the RNA degradosome complex, which targets unstructured regions, stem-loops, or monosome-bound mRNAs. RNase E preferentially cleaves at A/U-rich sites downstream of the 5' end, often in a translation-independent manner, generating fragments that are subsequently susceptible to exonucleolytic attack. In polycistronic mRNAs, common in bacteria, such cleavages can differentially destabilize individual cistrons, allowing coordinated yet modular gene expression.\n\nFollowing endonucleolytic cuts or direct 3' end processing, degradation proceeds via 3'-5' exonucleases like PNPase and RNase II, which require prior shortening of the 3' end. Unlike eukaryotes, prokaryotic mRNAs lack extensive poly(A) tails; instead, limited polyadenylation by poly(A) polymerase I (PAP I) adds short A-tails to facilitate processive degradation by these exonucleases. PNPase, a phosphorolytic enzyme, degrades from the 3' end using phosphate as a cofactor, while RNase II hydrolyzes phosphodiester bonds but stalls at stem-loops.\n\nAn alternative 5'-3' decay pathway begins with the RNA pyrophosphohydrolase RppH, which converts the 5'-triphosphate end of primary transcripts to a monophosphate, priming the mRNA for exonucleolytic degradation. This RppH-mediated decapping is often translation-coupled, as ribosome protection hinders access, and is followed by enhanced endonucleolytic cleavage primarily by RNase E, with subsequent 3'-5' exonucleolytic degradation by enzymes such as PNPase. The efficiency of this pathway depends on 5' end accessibility and can be modulated by upstream open reading frames or secondary structures.\n\nmRNA stability in bacteria is further regulated by small regulatory RNAs (sRNAs) that base-pair with target mRNAs, often facilitated by the chaperone protein Hfq, leading to enhanced recruitment of RNases like RNase E for accelerated decay. For instance, Hfq-sRNA complexes can expose cleavage sites or block translation, thereby promoting endonucleolytic initiation and shortening mRNA lifespan in response to stress. This post-transcriptional control layer allows fine-tuned regulation without altering transcription rates.\n\n### Eukaryotic mRNA Turnover Processes\n\nIn eukaryotic cells, mRNA turnover is a tightly regulated process that determines transcript stability and gene expression levels, primarily occurring in the cytoplasm through a deadenylation-dependent pathway that contrasts with the more rapid, translation-coupled decay seen in prokaryotes. This basal degradation pathway ensures the removal of mRNAs after their functional lifespan, recycling nucleotides and preventing accumulation of potentially harmful transcripts.\n\nThe initial and rate-limiting step in most eukaryotic mRNA decay is deadenylation, where the poly(A) tail is progressively shortened by deadenylase complexes. The CCR4-NOT complex, a major multi-subunit deadenylase, plays a central role by recruiting to the mRNA via interactions with poly(A)-binding proteins (PABPs) and catalyzing the removal of adenylate residues through its catalytic subunits Ccr4 and Caf1 (also known as Pop2). This process typically reduces the poly(A) tail length from over 200 nucleotides to a stub of 10-20 adenines, which destabilizes the mRNA and triggers subsequent decay steps.\n\nShortening of the poly(A) tail promotes decapping, the hydrolysis of the 5' cap structure (m7GpppN) by the Dcp1/Dcp2 heterodimeric enzyme complex. Dcp2 provides the catalytic activity, while Dcp1 acts as a cofactor that enhances decapping efficiency and recruits other decay factors. Once the cap is removed, the mRNA body becomes accessible to the 5'-3' exoribonuclease Xrn1, which rapidly degrades the transcript from the 5' end in a processive manner. This decapping-dependent 5'-3' pathway accounts for the majority of bulk mRNA turnover in eukaryotes.\n\nIn parallel or as an alternative route, particularly for aberrant or unadenylated mRNAs, the RNA exosome complex mediates 3'-5' exonucleolytic degradation. The cytoplasmic exosome, assisted by the cofactor Ski7, targets non-polyadenylated or prematurely deadenylated transcripts for surveillance and decay, ensuring quality control of defective mRNAs. In the nucleus, the exosome subunit Rrp6 (also known as Exonuclease R) contributes to the processing and degradation of aberrant transcripts before export, further supporting mRNA surveillance.\n\nEukaryotic mRNA half-lives vary widely, typically ranging from several hours to days, allowing for fine-tuned control of protein synthesis. Factors such as codon bias—where optimal codons correlate with increased stability—and mRNA secondary structure in the coding sequence influence decay rates by modulating translation efficiency and accessibility to decay factors. For instance, mRNAs enriched in optimal codons exhibit longer half-lives, while structured regions can protect against rapid degradation.\n\n### Regulatory Decay Mechanisms\n\nMessenger RNA (mRNA) degradation serves as a critical regulatory mechanism to fine-tune gene expression by targeting specific transcripts for rapid decay under physiological conditions. These pathways, distinct from constitutive turnover, respond to sequence features or cellular signals to selectively eliminate mRNAs, thereby controlling protein levels in processes like development, stress response, and immune regulation. Key examples include surveillance systems that detect aberrant transcripts and RNA interference pathways that silence endogenous or viral genes.\n\nNonsense-mediated decay (NMD) is a quality control pathway that targets mRNAs containing premature termination codons (PTCs) for degradation, preventing the production of truncated proteins. In eukaryotes, NMD recognizes PTCs located more than 50 nucleotides upstream of an exon-exon junction, where the exon junction complex (EJC) is deposited during splicing. The UPF1 RNA helicase, along with UPF2 and UPF3, forms a complex that interacts with the EJC; UPF2 and UPF3 bridge UPF1 to the EJC, stimulating UPF1's helicase activity to unwind the mRNA and recruit decay factors.\n\nAU-rich elements (AREs), often found in the 3' untranslated regions (UTRs) of mRNAs encoding cytokines and proto-oncogenes, mediate rapid decay to limit inflammatory responses. The zinc finger protein tristetraprolin (TTP) binds directly to these AREs, such as in tumor necrosis factor-alpha (TNF-α) mRNA, and recruits the deadenylation machinery to shorten the poly(A) tail, thereby promoting decapping and exonucleolytic degradation. This TTP-ARE interaction is regulated by phosphorylation, which modulates TTP's binding affinity and decay-promoting activity.\n\nMicroRNAs (miRNAs) regulate gene expression post-transcriptionally by guiding the RNA-induced silencing complex (RISC), which includes Argonaute proteins, to complementary sites in the 3' UTR of target mRNAs. Binding of Argonaute-loaded miRISC to the 3' UTR recruits GW182 (also known as TNRC6), which interacts with deadenylation complexes like CCR4-NOT to trigger poly(A) tail removal, followed by decapping and 5'-to-3' exonucleolytic decay, often without significant translational repression in animals. This mechanism silences hundreds of genes involved in development and disease.\n\nSmall interfering RNAs (siRNAs) mediate precise mRNA silencing through RISC in both plants and animals, primarily for antiviral defense and endogenous gene regulation. In plants, siRNAs derived from viral double-stranded RNA direct Argonaute proteins in RISC to cleave complementary viral or endogenous transcripts via perfect base-pairing. In animals, siRNAs contribute to antiviral responses by targeting viral genomes and also silence endogenous transposons or repetitive elements, enhancing genome stability.\n\n## Regulation and Functions\n\n### Post-Transcriptional Regulation\n\nPost-transcriptional regulation of messenger RNA (mRNA) encompasses mechanisms that fine-tune gene expression after transcription, including spatial localization that controls where and when translation occurs. mRNA localization to specific subcellular compartments enables precise spatial regulation of protein synthesis, ensuring proteins are produced at the right time and place to support cellular functions such as development and polarity. For instance, in animal embryos, maternally deposited mRNAs are localized and translationally repressed until fertilization, allowing coordinated activation to drive early developmental processes like axis formation in *Drosophila* or cell fate specification in vertebrates. This spatial control restricts translation to targeted sites, preventing ectopic protein production and enhancing efficiency in resource-limited environments.00126-3)\n\nRNA-binding proteins (RBPs) play a central role in post-transcriptional regulation by modulating mRNA stability and translation through interactions with untranslated regions (UTRs). The RBP HuR binds to AU-rich elements (AREs) in the 3' UTRs of target mRNAs, promoting their stabilization and increasing protein output, as seen in the regulation of inflammatory cytokines like TNF-α where HuR competes with destabilizing factors to extend mRNA half-life. In contrast, tristetraprolin (TTP) recognizes similar AREs to recruit decay machinery, accelerating mRNA degradation and suppressing excessive immune responses; for example, TTP targets mRNAs encoding feedback inhibitors of inflammation, maintaining homeostasis by preventing overproduction. These antagonistic actions of HuR and TTP exemplify how RBPs achieve dynamic control over mRNA fate via UTR sequences.\n\nBiomolecular phase separation further contributes to localized mRNA regulation by forming membraneless condensates that compartmentalize mRNA-ribonucleoprotein (mRNP) complexes. RNAs and RBPs drive liquid-liquid phase separation to create dynamic droplets enriched in specific mRNAs, which sequester transcripts for localized control of translation and processing, as observed in cytoplasmic granules that buffer mRNA stoichiometries and restrict access to ribosomes. In human embryonic stem cells, for instance, FXR1-containing condensates spatially organize mRNPs to influence differentiation by concentrating regulatory RNAs and proteins. These condensates provide a scaffold for efficient, insulated reactions, enhancing spatiotemporal precision in gene expression.00738-X)\n\nFeedback loops involving mRNAs that encode regulators of their own processing represent another layer of autoregulation, ensuring balanced expression of splicing factors and other RBPs. Splicing factors often bind their own pre-mRNAs to promote alternative splicing events that include premature stop codons, triggering nonsense-mediated decay (NMD) to autoregulate levels and prevent toxic accumulation, as demonstrated in networks involving SR proteins and hnRNPs. For example, RBPMS, a master regulator of smooth muscle splicing, engages in such loops to maintain homeostasis during cellular differentiation. These auto-regulatory mechanisms, including positive feedbacks with transcription factors, robustly coordinate post-transcriptional events during development.\n\n### Non-Coding and Emerging Roles\n\nCircular RNAs (circRNAs) derived from mRNA loci represent a major class of non-coding transcripts with regulatory functions distinct from protein synthesis. These circRNAs are produced via back-splicing of pre-mRNA exons, resulting in stable, closed-loop structures resistant to exonuclease degradation. A key example is ciRS-7 (also known as CDR1as), generated from the CDR1 locus, which functions primarily as a microRNA (miRNA) sponge. ciRS-7 harbors more than 70 conserved binding sites for miR-7, sequestering the miRNA and derepressing its targets, such as those involved in neuronal function; this was first identified through high-throughput sequencing and functional assays in human and mouse brain tissues. Such sponging activity exemplifies how circRNAs from protein-coding genes modulate post-transcriptional gene regulation without translating into proteins.\n\nWhile predominantly non-coding, certain circRNAs exhibit protein-coding potential, challenging traditional classifications. Translation occurs via cap-independent mechanisms, including internal ribosome entry sites (IRES) or N6-methyladenosine (m6A) modifications that recruit ribosomes to the circular structure. For instance, circ-ZNF609, derived from the ZNF609 mRNA locus, encodes a short protein that promotes myoblast proliferation and differentiation during muscle development, as demonstrated by ribosome profiling and knockout studies in mouse models. This capability has been observed in a subset of circRNAs, where the encoded peptides regulate cellular processes independently of their linear counterparts. Brief reference to their structural origins highlights how back-splicing events from linear mRNA precursors enable these diverse roles.\n\nLinear mRNAs also contribute non-coding functions by serving as scaffolds for protein complexes in signaling pathways. Such scaffolding roles extend mRNA utility beyond coding, organizing ribonucleoprotein complexes for efficient cellular responses.\n\nEmerging evidence positions mRNA export as a cellular stress sensor. Under conditions like heat shock, global mRNA export is inhibited through the inactivation and dissociation of export adaptors and guard proteins from the export receptor NXF1 (also known as TAP), such as via phosphorylation of Nab2 by the MAPK kinase Slt2 in yeast, retaining bulk transcripts in the nucleus while permitting selective export of stress-inducible mRNAs (e.g., heat shock proteins). This adaptive response prioritizes survival gene expression and was elucidated through studies on nuclear retention dynamics in yeast and mammalian cells. For viral infections, export can be modulated differently, often through viral interference with export factors.\n\nmRNAs further participate in phase-separated organelles, membraneless compartments formed by liquid-liquid phase separation (LLPS). In stress granules and processing bodies (P-bodies), mRNAs act as scaffolds or modulators, recruiting RNA-binding proteins like G3BP1 to drive condensate assembly and sequester stalled translation initiation complexes. Specific mRNA secondary structures influence LLPS specificity, as shown in polyglutamine-driven systems where mRNA length and sequence dictate partitioning into droplets. This role enhances mRNA stability and regulates translation under stress, with implications for neurodegeneration.\n\nDistinguishing mRNAs from long non-coding RNAs (lncRNAs) relies on coding potential: mRNAs contain a coding sequence (CDS) typically encoding proteins of at least 100 amino acids, enabling ribosomal translation, whereas lncRNAs (\\u003e200 nucleotides) lack substantial ORFs and primarily exert regulatory effects. Despite this, functional overlap exists, as some mRNAs perform lncRNA-like roles (e.g., scaffolding) without relying on their CDS, underscoring convergent evolutionary adaptations in RNA functionality.\n\n## History and Applications\n\n### Historical Milestones\n\nThe concept of messenger RNA (mRNA) as an intermediary carrier of genetic information from DNA to protein synthesis was first proposed in 1961 by François Jacob and Jacques Monod, who described it within their operon model of gene regulation in *Escherichia coli*, suggesting that mRNA serves as a transient template dictated by structural genes and regulated by operator regions. This theoretical framework was experimentally validated later that year through pulse-labeling experiments by Sydney Brenner, Jacob, and Matthew Meselson, which demonstrated the existence of a short-lived, rapidly turning-over RNA species in bacteria that correlates with β-galactosidase synthesis.\n\nIn the 1970s, the discovery of heterogeneous nuclear RNA (hnRNA) revealed large, rapidly labeled nuclear transcripts in eukaryotic cells, identified by Sheldon Penman and colleagues as polydisperse RNAs with sizes up to 100 kb, serving as precursors to mature mRNA. Concurrently, Phillip A. Sharp and Richard J. Roberts independently uncovered split genes and RNA splicing in 1977 while studying adenovirus transcripts, showing that non-coding introns are removed from pre-mRNA to form continuous coding exons, a finding that earned them the 1993 Nobel Prize in Physiology or Medicine. Their work demonstrated that eukaryotic genes are discontinuous, with splicing enabling diverse protein isoforms from single genes.\n\nThe 1970s also saw the elucidation of mRNA modifications essential for stability and processing. Aaron J. Shatkin and Yasuhiro Furuichi identified the 5' cap structure in 1975, a 7-methylguanosine linked via a 5'-5' triphosphate bridge to the mRNA's first nucleotide, initially observed in reovirus mRNA and later confirmed in eukaryotic cellular mRNAs to protect against exonucleases and facilitate translation initiation. James E. Darnell and coworkers discovered the poly(A) tail in 1971, a 3' addition of 100–250 adenine residues to most eukaryotic mRNAs, and by the 1980s established its roles in nuclear export, translation enhancement, and mRNA stability through studies on HeLa cell transcripts.\n\nDuring the 1990s and 2000s, advances in sequencing technologies enabled the cataloging of alternative splicing patterns, with B. R. Graveley and others compiling comprehensive databases from expressed sequence tags (ESTs), revealing that over 60% of human genes undergo alternative splicing to generate proteomic diversity, as detailed in early genome-wide analyses like those from the Human Genome Project era. The discovery of microRNAs (miRNAs) as key post-transcriptional regulators stemmed from Victor Ambros's identification of lin-4 in 1993, but gained mechanistic insight through Andrew Z. Fire and Craig C. Mello's 1998 experiments in *C. elegans*, showing that double-stranded RNA triggers sequence-specific mRNA degradation via RNA interference (RNAi), for which they received the 2006 Nobel Prize in Physiology or Medicine.\n\nIn the 2010s, the epitranscriptome emerged as a dynamic layer of mRNA regulation, with N6-methyladenosine (m6A) modifications mapped genome-wide; key studies by Dan Dominissini, Chuan He, and Samie R. Jaffrey in 2012–2013 identified m6A as the most abundant internal mRNA modification, influencing splicing, export, and decay through writer (e.g., METTL3), reader (e.g., YTHDF2), and eraser (e.g., FTO) proteins. Concurrently, CRISPR-based tools expanded to RNA editing, with Omar O. Abudayyeh and Feng Zhang's 2017 discovery of Cas13 enabling programmable cleavage and base editing of mRNAs without altering the genome, advancing targeted transcript modulation in eukaryotic systems.\n\n### Biotechnological and Therapeutic Uses\n\nMessenger RNA (mRNA) has emerged as a versatile platform in biotechnology and therapeutics, enabling rapid production of antigens and proteins for vaccines and treatments. The most prominent application is in vaccines, where synthetic mRNA instructs cells to produce viral proteins, triggering immune responses without using live pathogens. This approach accelerated during the COVID-19 pandemic, with mRNA vaccines from Pfizer-BioNTech and Moderna receiving emergency authorization in late 2020. By 2025, over 13 billion doses of COVID-19 vaccines, including a significant number of mRNA-based doses, have been administered globally, significantly reducing severe illness and hospitalizations. Self-amplifying mRNA vaccines, which encode replicase enzymes to amplify antigen production within cells, offer potential for lower dosing and longer-lasting immunity; for instance, ARCT-154 demonstrated superior persistence compared to conventional mRNA vaccines in phase 3 trials completed by 2025 and received authorization in Japan in 2023. By 2025, mRNA platforms have expanded to other respiratory viruses, with Moderna's mRNA-1345 receiving FDA approval for expanded use in preventing RSV lower respiratory tract disease in adults aged 18–59 at increased risk. Moderna's mRNA-1010 quadrivalent seasonal influenza vaccine also reported positive phase 3 efficacy data in mid-2025, showing relative vaccine efficacy against influenza A and B strains, paving the way for potential regulatory approval.\n\nIn therapeutic applications, mRNA enables targeted protein expression for disease treatment. Personalized cancer immunotherapies represent a key advance, with BioNTech developing individualized mRNA vaccines that encode neoantigens derived from patient tumor mutations to stimulate T-cell responses. For example, autogene cevumeran (BNT122) has advanced to phase 2 trials for pancreatic and other cancers, showing durable T-cell activation in three-year follow-up data from phase 1 studies. mRNA also facilitates protein replacement therapies, particularly for ischemic conditions. AZD8601, an mRNA encoding VEGF-A delivered via intramyocardial injection, has been evaluated in clinical trials for patients with heart failure undergoing coronary artery bypass grafting (CABG), promoting angiogenesis to reduce myocardial ischemia in preclinical models and early human studies, with potential applications for refractory angina. These therapies leverage mRNA's transient expression to avoid long-term risks associated with gene therapy vectors.\n\nmRNA serves as a critical tool in research, produced via in vitro transcription (IVT) for various applications. IVT mRNA encoding reporter proteins like luciferase or GFP is widely used in assays to monitor translation efficiency, mRNA stability, and cellular responses in high-throughput screens. In genome editing, IVT mRNA delivers CRISPR-Cas9 guide RNAs as ribonucleoproteins, enabling precise, temporary modifications without genomic integration, though chemical modifications are often required to mitigate innate immune activation via RIG-I pathways. Synthetic biology employs mRNA circuits for engineering cellular behaviors, such as inducible protein expression in response to transcription factors, facilitating the construction of logic gates and metabolic pathways in mammalian cells.\n\nDelivery and stability challenges have driven innovations essential to mRNA's success. Lipid nanoparticles (LNPs) encapsulate mRNA, shielding it from degradation and promoting endosomal escape for cytosolic delivery, as validated in the lipid formulations of approved COVID-19 vaccines. Incorporation of modified nucleosides, such as pseudouridine, further enhances performance by reducing recognition by Toll-like receptors and RIG-I, thereby minimizing inflammatory responses while boosting translation yields up to tenfold in human cells. These modifications, combined with optimized 5' caps and poly-A tails in IVT processes, have enabled mRNA's transition from research reagent to scalable therapeutic modality.",
  "external_references": [
    {
      "text": "Messenger Rna Mrna",
      "url": "https://www.genome.gov/genetics-glossary/Messenger-RNA-mRNA",
      "domain": "genome.gov",
      "type": "citation"
    },
    {
      "text": "Ribonucleic Acid Fact Sheet",
      "url": "https://www.genome.gov/about-genomics/educational-resources/fact-sheets/ribonucleic-acid-fact-sheet",
      "domain": "genome.gov",
      "type": "citation"
    },
    {
      "text": "Online Education Kit 1961 A Mrna Ferries Information",
      "url": "https://www.genome.gov/25520298/online-education-kit-1961-a-mrna-ferries-information",
      "domain": "genome.gov",
      "type": "citation"
    },
    {
      "text": "26126273",
      "url": "https://pubmed.ncbi.nlm.nih.gov/26126273/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk26887",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK26887/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk9864",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK9864/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Mrnavaccines",
      "url": "https://medlineplus.gov/genetics/understanding/therapy/mrnavaccines/",
      "domain": "medlineplus.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2241648",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2241648/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk9850",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK9850/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "190576a0",
      "url": "https://www.nature.com/articles/190576a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "227561a0",
      "url": "https://www.nature.com/articles/227561a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Translation Dna To Mrna To Protein 393",
      "url": "https://www.nature.com/scitable/topicpage/translation-dna-to-mrna-to-protein-393",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Regulation Of Transcription And Gene Expression In 1086",
      "url": "https://www.nature.com/scitable/topicpage/regulation-of-transcription-and-gene-expression-in-1086",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc6414751",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6414751/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Translation Dna To Mrna To Protein 393",
      "url": "https://www.nature.com/scitable/topicpage/translation-dna-to-mrna-to-protein-393/",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Nbk558999",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK558999/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Biobookprotsyn",
      "url": "https://biobook.estrellamountain.edu/BioBookPROTSYn",
      "domain": "biobook.estrellamountain.edu",
      "type": "citation"
    },
    {
      "text": "Pmc9981743",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9981743/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41392 020 00450 X",
      "url": "https://www.nature.com/articles/s41392-020-00450-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "31311",
      "url": "https://elifesciences.org/articles/31311",
      "domain": "elifesciences.org",
      "type": "citation"
    },
    {
      "text": "Wrna.56",
      "url": "https://wires.onlinelibrary.wiley.com/doi/10.1002/wrna.56",
      "domain": "wires.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc7614307",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7614307/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S12943 020 01286 3",
      "url": "https://molecular-cancer.biomedcentral.com/articles/10.1186/s12943-020-01286-3",
      "domain": "molecular-cancer.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "S1097276518305094",
      "url": "https://www.sciencedirect.com/science/article/pii/S1097276518305094",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc10610676",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10610676/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3023630",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3023630/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "15.2%253a Prokaryotic Transcription",
      "url": "https://bio.libretexts.org/Bookshelves/Introductory_and_General_Biology/General_Biology_1e_%28OpenStax%29/3%253A_Genetics/15%253A_Genes_and_Proteins/15.2%253A_Prokaryotic_Transcription",
      "domain": "bio.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Pmc2819089",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2819089/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "465.full",
      "url": "https://genesdev.cshlp.org/content/34/7-8/465.full",
      "domain": "genesdev.cshlp.org",
      "type": "citation"
    },
    {
      "text": "Pmc6205604",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6205604/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9339144",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9339144/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S1097276514002573",
      "url": "https://www.sciencedirect.com/science/article/pii/S1097276514002573",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc4874897",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4874897/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Promoters",
      "url": "https://www.addgene.org/mol-bio-reference/promoters/",
      "domain": "addgene.org",
      "type": "citation"
    },
    {
      "text": "Pmc3529798",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3529798/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Abortive Initiation",
      "url": "https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/abortive-initiation",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Rna Transcription",
      "url": "https://chem.libretexts.org/Bookshelves/Biological_Chemistry/Supplemental_Modules_%28Biological_Chemistry%29/Nucleic_Acids/RNA/RNA_-_Transcription",
      "domain": "chem.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Pmc12360218",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12360218/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3622210",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3622210/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4964609",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4964609/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6995273",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6995273/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5830926",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5830926/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6150625",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6150625/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7614299",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7614299/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk21121",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK21121/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk459456",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK459456/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3677254",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3677254/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1084129",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1084129/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3672281",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3672281/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4304646",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4304646/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41467 024 48963 1",
      "url": "https://www.nature.com/articles/s41467-024-48963-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc7169794",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7169794/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S1097276523004240",
      "url": "https://www.sciencedirect.com/science/article/pii/S1097276523004240",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2460195",
      "url": "https://academic.oup.com/nar/article/44/16/7511/2460195",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Pmc2327359",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2327359/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41557 022 00972 7",
      "url": "https://www.nature.com/articles/s41557-022-00972-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "30745412",
      "url": "https://pubmed.ncbi.nlm.nih.gov/30745412/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0092 8674%2806%2901526 1",
      "url": "https://www.cell.com/fulltext/S0092-8674%2806%2901526-1",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "1113.full",
      "url": "https://genesdev.cshlp.org/content/34/17-18/1113.full",
      "domain": "genesdev.cshlp.org",
      "type": "citation"
    },
    {
      "text": "Pmc326150",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC326150/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "6088074",
      "url": "https://pubmed.ncbi.nlm.nih.gov/6088074/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1370742",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1370742/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "18978789",
      "url": "https://pubmed.ncbi.nlm.nih.gov/18978789/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2755.full",
      "url": "https://genesdev.cshlp.org/content/11/21/2755.full",
      "domain": "genesdev.cshlp.org",
      "type": "citation"
    },
    {
      "text": "Pmc4163081",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4163081/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1382244",
      "url": "https://academic.oup.com/nar/article/36/3/1037/1382244",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "7693433",
      "url": "https://academic.oup.com/nar/article/52/13/7792/7693433",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "U7 Deciphered The Mechanism That Forms The Unusual",
      "url": "https://portlandpress.com/biochemsoctrans/article/49/5/2229/229457/U7-deciphered-the-mechanism-that-forms-the-unusual",
      "domain": "portlandpress.com",
      "type": "citation"
    },
    {
      "text": "S1535610815003049",
      "url": "https://www.sciencedirect.com/science/article/pii/S1535610815003049",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc5731795",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5731795/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gm508",
      "url": "https://genomemedicine.biomedcentral.com/articles/10.1186/gm508",
      "domain": "genomemedicine.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc2953425",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2953425/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.0020391",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Pmc8284327",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8284327/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gb 2014 15 6 R79",
      "url": "https://genomebiology.biomedcentral.com/articles/10.1186/gb-2014-15-6-r79",
      "domain": "genomebiology.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.jbc.org/article/S0021-9258%2819%2931048-8/fulltext",
      "domain": "jbc.org",
      "type": "citation"
    },
    {
      "text": "Science.1170995",
      "url": "https://www.science.org/doi/10.1126/science.1170995",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S41467 022 30531 0",
      "url": "https://www.nature.com/articles/s41467-022-30531-0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S12864 015 2291 9",
      "url": "https://bmcgenomics.biomedcentral.com/articles/10.1186/s12864-015-2291-9",
      "domain": "bmcgenomics.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc8536083",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8536083/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7797042",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7797042/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3647337",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3647337/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4611024",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4611024/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6280705",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6280705/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0092 8674(13",
      "url": "https://www.cell.com/cell/fulltext/S0092-8674(13",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Nbk6597",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK6597/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9691599",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9691599/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "779504v1.full",
      "url": "https://www.biorxiv.org/content/10.1101/779504v1.full",
      "domain": "biorxiv.org",
      "type": "citation"
    },
    {
      "text": "Pmc6884710",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6884710/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "5969078",
      "url": "https://pubmed.ncbi.nlm.nih.gov/5969078/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3753929",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3753929/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3385960",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3385960/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1604315",
      "url": "https://pubmed.ncbi.nlm.nih.gov/1604315/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "385037a0",
      "url": "https://www.nature.com/articles/385037a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc7829197",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7829197/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "01257",
      "url": "https://elifesciences.org/articles/01257",
      "domain": "elifesciences.org",
      "type": "citation"
    },
    {
      "text": "Pmc8284178",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8284178/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.1714554115",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1714554115",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pnas.95.14.8165",
      "url": "https://www.pnas.org/doi/10.1073/pnas.95.14.8165",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S41467 020 18765 2",
      "url": "https://www.nature.com/articles/s41467-020-18765-2",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0092 8674(07",
      "url": "https://www.cell.com/cell/fulltext/S0092-8674(07",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "S1097 2765(09",
      "url": "https://www.cell.com/molecular-cell/fulltext/S1097-2765(09",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "S1097 2765(13",
      "url": "https://www.cell.com/molecular-cell/fulltext/S1097-2765(13",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Pnas.1113956108",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1113956108",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pnas.030541097",
      "url": "https://www.pnas.org/doi/10.1073/pnas.030541097",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Ncomms12941",
      "url": "https://www.nature.com/articles/ncomms12941",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pnas.0610683104",
      "url": "https://www.pnas.org/doi/10.1073/pnas.0610683104",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc7074880",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7074880/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "The Role Of Trex In Gene Expression And Disease",
      "url": "https://portlandpress.com/biochemj/article/473/19/2911/49675/The-role-of-TREX-in-gene-expression-and-disease",
      "domain": "portlandpress.com",
      "type": "citation"
    },
    {
      "text": "S009286740200627x",
      "url": "https://www.sciencedirect.com/science/article/pii/S009286740200627X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc1172058",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1172058/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Mrna Nuclear Export At A Glance",
      "url": "https://journals.biologists.com/jcs/article/122/12/1933/35414/mRNA-nuclear-export-at-a-glance",
      "domain": "journals.biologists.com",
      "type": "citation"
    },
    {
      "text": "17.9.2651",
      "url": "https://www.embopress.org/doi/10.1093/emboj/17.9.2651",
      "domain": "embopress.org",
      "type": "citation"
    },
    {
      "text": "Pmc3093122",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3093122/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0168952516301044",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0168952516301044",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc7355637",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7355637/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7858274",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7858274/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Srep00140",
      "url": "https://www.nature.com/articles/srep00140",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 021 26383 9",
      "url": "https://www.nature.com/articles/s41467-021-26383-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pnas.112318199",
      "url": "https://www.pnas.org/doi/10.1073/pnas.112318199",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc4431577",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4431577/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4191395",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4191395/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S00018 013 1472 4",
      "url": "https://link.springer.com/article/10.1007/s00018-013-1472-4",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Rstb.2018.0166",
      "url": "https://royalsocietypublishing.org/doi/10.1098/rstb.2018.0166",
      "domain": "royalsocietypublishing.org",
      "type": "citation"
    },
    {
      "text": "Pmc3670317",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3670317/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.1222670110",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1222670110",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc3605619",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3605619/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/microbiology/articles/10.3389/fmicb.2020.02111/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/cell-and-developmental-biology/articles/10.3389/fcell.2023.1153624/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "23142987",
      "url": "https://pubmed.ncbi.nlm.nih.gov/23142987/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4371251",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4371251/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4371251",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4371251",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Embr.201948220",
      "url": "https://www.embopress.org/doi/10.15252/embr.201948220",
      "domain": "embopress.org",
      "type": "citation"
    },
    {
      "text": "Pnas.1908052116",
      "url": "https://www.pnas.org/doi/10.1073/pnas.1908052116",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "Pmc4359748",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4359748/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5437961",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5437961/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5999336",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5999336/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc104391",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC104391/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3752887",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3752887/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1522082",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1522082/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc2921184",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2921184/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1350842",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1350842/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12546453",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12546453/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0092 8674(09",
      "url": "https://www.cell.com/fulltext/S0092-8674(09",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Pmc6804641",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6804641/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2457687",
      "url": "https://academic.oup.com/nar/article/44/15/7418/2457687",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "S1097 2765(24",
      "url": "https://www.cell.com/molecular-cell/fulltext/S1097-2765(24",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "S41467 025 63700 Y",
      "url": "https://www.nature.com/articles/s41467-025-63700-y",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc6884704",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6884704/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0092867414012422",
      "url": "https://www.sciencedirect.com/science/article/pii/S0092867414012422",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Ctm2.70369",
      "url": "https://onlinelibrary.wiley.com/doi/full/10.1002/ctm2.70369",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Pmc5773157",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5773157/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5731798",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5731798/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S1097276524007056",
      "url": "https://www.sciencedirect.com/science/article/pii/S1097276524007056",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc6204303",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6204303/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Science.aar7432",
      "url": "https://www.science.org/doi/10.1126/science.aar7432",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Pmc2518207",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2518207/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Press Release",
      "url": "https://www.nobelprize.org/prizes/medicine/1993/press-release/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Vaccines",
      "url": "https://data.who.int/dashboards/covid19/vaccines",
      "domain": "data.who.int",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "structure",
      "page": "Structure"
    },
    {
      "text": "ribosome",
      "page": "Ribosome"
    },
    {
      "text": "polyadenylation",
      "page": "Polyadenylation"
    },
    {
      "text": "stability",
      "page": "Stability"
    },
    {
      "text": "export",
      "page": "Export"
    },
    {
      "text": "5' untranslated region",
      "page": "Five_prime_untranslated_region"
    },
    {
      "text": "transfer RNA",
      "page": "Transfer_RNA"
    },
    {
      "text": "gene expression",
      "page": "Gene_expression"
    },
    {
      "text": "biotechnology",
      "page": "Biotechnology"
    },
    {
      "text": "COVID-19",
      "page": "COVID-19"
    },
    {
      "text": "human",
      "page": "Human"
    },
    {
      "text": "proteome",
      "page": "Proteome"
    },
    {
      "text": "genome",
      "page": "Genome"
    },
    {
      "text": "alternative splicing",
      "page": "Alternative_splicing"
    },
    {
      "text": "RNA",
      "page": "RNA"
    },
    {
      "text": "genetic code",
      "page": "Genetic_code"
    },
    {
      "text": "nucleus",
      "page": "Nucleus"
    },
    {
      "text": "cytoplasm",
      "page": "Cytoplasm"
    },
    {
      "text": "translation",
      "page": "Translation"
    },
    {
      "text": "central dogma of molecular biology",
      "page": "Central_dogma_of_molecular_biology"
    },
    {
      "text": "Jacques Monod",
      "page": "Jacques_Monod"
    },
    {
      "text": "lac operon",
      "page": "Lac_operon"
    },
    {
      "text": "genes",
      "page": "Gene"
    },
    {
      "text": "bacteria",
      "page": "Bacteria"
    },
    {
      "text": "Sydney Brenner",
      "page": "Sydney_Brenner"
    },
    {
      "text": "Jacob",
      "page": "Jacob"
    },
    {
      "text": "Matthew Meselson",
      "page": "Matthew_Meselson"
    },
    {
      "text": "synthesis",
      "page": "Synthesis"
    },
    {
      "text": "Escherichia coli",
      "page": "Escherichia_coli"
    },
    {
      "text": "ribosomal RNA",
      "page": "Ribosomal_RNA"
    },
    {
      "text": "molecule",
      "page": "Molecule"
    },
    {
      "text": "lactose",
      "page": "Lactose"
    },
    {
      "text": "metabolism",
      "page": "Metabolism"
    },
    {
      "text": "archaea",
      "page": "Archaea"
    },
    {
      "text": "amino acids",
      "page": "Amino_acid"
    },
    {
      "text": "last universal common ancestor",
      "page": "Last_universal_common_ancestor"
    },
    {
      "text": "architecture",
      "page": "Architecture"
    },
    {
      "text": "nucleotide",
      "page": "Nucleotide"
    },
    {
      "text": "adenine",
      "page": "Adenine"
    },
    {
      "text": "guanine",
      "page": "Guanine"
    },
    {
      "text": "cytosine",
      "page": "Cytosine"
    },
    {
      "text": "half-life",
      "page": "Half-life"
    },
    {
      "text": "seed",
      "page": "Seed"
    },
    {
      "text": "RNA-induced silencing complex",
      "page": "RNA-induced_silencing_complex"
    },
    {
      "text": "initiation",
      "page": "Initiation"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "spike protein",
      "page": "Spike_protein"
    },
    {
      "text": "ligation",
      "page": "Ligation"
    },
    {
      "text": "RNA polymerase II",
      "page": "RNA_polymerase_II"
    },
    {
      "text": "complex",
      "page": "Complex"
    },
    {
      "text": "TATA-binding protein",
      "page": "TATA-binding_protein"
    },
    {
      "text": "TATA box",
      "page": "TATA_box"
    },
    {
      "text": "Elongation",
      "page": "Elongation"
    },
    {
      "text": "phosphorylation",
      "page": "Phosphorylation"
    },
    {
      "text": "domain",
      "page": "Domain"
    },
    {
      "text": "kinase",
      "page": "Kinase"
    },
    {
      "text": "Mediator",
      "page": "The_Mediator"
    },
    {
      "text": "template",
      "page": "Template"
    },
    {
      "text": "sense",
      "page": "Sense"
    },
    {
      "text": "abortive initiation",
      "page": "Abortive_initiation"
    },
    {
      "text": "RNA polymerase",
      "page": "RNA_polymerase"
    },
    {
      "text": "intrinsic termination",
      "page": "Intrinsic_termination"
    },
    {
      "text": "hairpin",
      "page": "Hairpin"
    },
    {
      "text": "uridine",
      "page": "Uridine"
    },
    {
      "text": "helicase",
      "page": "Helicase"
    },
    {
      "text": "ATP hydrolysis",
      "page": "ATP_hydrolysis"
    },
    {
      "text": "polymerase",
      "page": "Polymerase"
    },
    {
      "text": "read-through",
      "page": "Read-through"
    },
    {
      "text": "intron",
      "page": "Intron"
    },
    {
      "text": "processing",
      "page": "Processing"
    },
    {
      "text": "efficiency",
      "page": "Efficiency"
    },
    {
      "text": "fidelity",
      "page": "Fidelity"
    },
    {
      "text": "integration",
      "page": "Integration"
    },
    {
      "text": "coupling",
      "page": "Coupling"
    },
    {
      "text": "messenger RNA",
      "page": "Messenger_RNA"
    },
    {
      "text": "capping enzyme",
      "page": "Capping_enzyme"
    },
    {
      "text": "guanosine monophosphate",
      "page": "Guanosine_monophosphate"
    },
    {
      "text": "methylation",
      "page": "Methylation"
    },
    {
      "text": "methyl group",
      "page": "Methyl_group"
    },
    {
      "text": "guanosine",
      "page": "Guanosine"
    },
    {
      "text": "cap",
      "page": "Cap"
    },
    {
      "text": "binding site",
      "page": "Binding_site"
    },
    {
      "text": "eukaryotic initiation factor",
      "page": "Eukaryotic_initiation_factor"
    },
    {
      "text": "eIF4E",
      "page": "EIF4E"
    },
    {
      "text": "40S",
      "page": "40s"
    },
    {
      "text": "start codon",
      "page": "Start_codon"
    },
    {
      "text": "interaction",
      "page": "Interaction"
    },
    {
      "text": "CBC",
      "page": "CBC"
    },
    {
      "text": "TREX",
      "page": "Trex"
    },
    {
      "text": "spliceosome",
      "page": "Spliceosome"
    },
    {
      "text": "U2",
      "page": "U2"
    },
    {
      "text": "GU",
      "page": "GU"
    },
    {
      "text": "pyrimidine",
      "page": "Pyrimidine"
    },
    {
      "text": "purine",
      "page": "Purine"
    },
    {
      "text": "phosphodiester bond",
      "page": "Phosphodiester_bond"
    },
    {
      "text": "exon",
      "page": "Exon"
    },
    {
      "text": "lariat",
      "page": "Vighnaharta_Ganesh"
    },
    {
      "text": "active site",
      "page": "Active_site"
    },
    {
      "text": "scaffold protein",
      "page": "Scaffold_protein"
    },
    {
      "text": "ATPase",
      "page": "ATPase"
    },
    {
      "text": "snRNP",
      "page": "SnRNP"
    },
    {
      "text": "exon skipping",
      "page": "Exon_skipping"
    },
    {
      "text": "ribozyme",
      "page": "Ribozyme"
    },
    {
      "text": "Tetrahymena",
      "page": "Tetrahymena"
    },
    {
      "text": "branch point",
      "page": "Branch_point"
    },
    {
      "text": "yeast",
      "page": "Yeast"
    },
    {
      "text": "cleavage",
      "page": "Cleavage"
    },
    {
      "text": "factor",
      "page": "Factor"
    },
    {
      "text": "elements",
      "page": "Fifth_Element"
    },
    {
      "text": "motif",
      "page": "Motif"
    },
    {
      "text": "nuclear pore",
      "page": "Nuclear_pore"
    },
    {
      "text": "cytidine",
      "page": "Cytidine"
    },
    {
      "text": "canonical",
      "page": "Canonical"
    },
    {
      "text": "apolipoprotein B",
      "page": "Apolipoprotein_B"
    },
    {
      "text": "small intestine",
      "page": "Small_intestine"
    },
    {
      "text": "stop codon",
      "page": "Stop_codon"
    },
    {
      "text": "brain",
      "page": "Brain"
    },
    {
      "text": "ion channel",
      "page": "Ion_channel"
    },
    {
      "text": "ADAR1-p110",
      "page": "ADAR"
    },
    {
      "text": "viral",
      "page": "Viral"
    },
    {
      "text": "amyotrophic lateral sclerosis",
      "page": "ALS"
    },
    {
      "text": "excitotoxicity",
      "page": "Excitotoxicity"
    },
    {
      "text": "30S",
      "page": "30s"
    },
    {
      "text": "ASD",
      "page": "ASD"
    },
    {
      "text": "16S ribosomal RNA",
      "page": "16S_ribosomal_RNA"
    },
    {
      "text": "AUG",
      "page": "Aug"
    },
    {
      "text": "P site",
      "page": "P-site"
    },
    {
      "text": "GTPase",
      "page": "GTPase"
    },
    {
      "text": "GTP hydrolysis",
      "page": "Hydrolysis"
    },
    {
      "text": "eIF2",
      "page": "EIF2"
    },
    {
      "text": "orientation",
      "page": "Orientation"
    },
    {
      "text": "stress",
      "page": "Ukrainian_phonology"
    },
    {
      "text": "poliovirus",
      "page": "Poliovirus"
    },
    {
      "text": "hypoxia",
      "page": "Hypoxia"
    },
    {
      "text": "peptide bond",
      "page": "Peptide_bond"
    },
    {
      "text": "aminoacyl-tRNA",
      "page": "Aminoacyl-tRNA"
    },
    {
      "text": "inosine",
      "page": "Inosine"
    },
    {
      "text": "cognate",
      "page": "Cognate"
    },
    {
      "text": "elongation factors",
      "page": "Elongation_factor"
    },
    {
      "text": "Tu",
      "page": "TU"
    },
    {
      "text": "accommodation",
      "page": "Accommodation"
    },
    {
      "text": "proofreading",
      "page": "Proofreading"
    },
    {
      "text": "peptidyl transferase",
      "page": "Peptidyl_transferase"
    },
    {
      "text": "catalysis",
      "page": "Catalysis"
    },
    {
      "text": "peptide",
      "page": "Peptide"
    },
    {
      "text": "EF-G",
      "page": "EF-G"
    },
    {
      "text": "eEF2",
      "page": "EEF2"
    },
    {
      "text": "hydrolase",
      "page": "Hydrolase"
    },
    {
      "text": "ester",
      "page": "Ester"
    },
    {
      "text": "dissociation",
      "page": "Dissociation"
    },
    {
      "text": "recycle",
      "page": "Re-cycle"
    },
    {
      "text": "decay",
      "page": "Decay"
    },
    {
      "text": "nuclear envelope",
      "page": "Nuclear_envelope"
    },
    {
      "text": "nuclear",
      "page": "Nuclear"
    },
    {
      "text": "R-loop",
      "page": "R-loop"
    },
    {
      "text": "mutation",
      "page": "Mutation"
    },
    {
      "text": "fibrils",
      "page": "Fibril"
    },
    {
      "text": "recycling",
      "page": "Recycling"
    },
    {
      "text": "inositol",
      "page": "Inositol"
    },
    {
      "text": "exon junction complex",
      "page": "Exon_junction_complex"
    },
    {
      "text": "nonsense-mediated decay",
      "page": "Nonsense-mediated_decay"
    },
    {
      "text": "binding",
      "page": "Binding"
    },
    {
      "text": "link",
      "page": "Link"
    },
    {
      "text": "cytoskeleton",
      "page": "Cytoskeleton"
    },
    {
      "text": "microtubules",
      "page": "Microtubule"
    },
    {
      "text": "Kinesin",
      "page": "Kinesin"
    },
    {
      "text": "cell",
      "page": "Cell"
    },
    {
      "text": "dynein",
      "page": "Dynein"
    },
    {
      "text": "Drosophila",
      "page": "Drosophila"
    },
    {
      "text": "germline",
      "page": "Germline"
    },
    {
      "text": "microscopy",
      "page": "Microscopy"
    },
    {
      "text": "quality control",
      "page": "Quality_control"
    },
    {
      "text": "Stress",
      "page": "Stress"
    },
    {
      "text": "transport",
      "page": "Transport"
    },
    {
      "text": "diffusion",
      "page": "Diffusion"
    },
    {
      "text": "resource allocation",
      "page": "Resource_allocation"
    },
    {
      "text": "uniform distribution",
      "page": "Uniform_distribution"
    },
    {
      "text": "exponential growth",
      "page": "Exponential_growth"
    },
    {
      "text": "decapping",
      "page": "Decapping"
    },
    {
      "text": "degradation",
      "page": "Degradation"
    },
    {
      "text": "Ccr4",
      "page": "CCR4"
    },
    {
      "text": "enzyme",
      "page": "Enzyme"
    },
    {
      "text": "surveillance",
      "page": "Surveillance"
    },
    {
      "text": "Exonuclease",
      "page": "Exonuclease"
    },
    {
      "text": "codon bias",
      "page": "codon_bias"
    },
    {
      "text": "regulation",
      "page": "Regulation"
    },
    {
      "text": "RNA interference",
      "page": "RNA_interference"
    },
    {
      "text": "AREs",
      "page": "Ares"
    },
    {
      "text": "necrosis",
      "page": "Necrosis"
    },
    {
      "text": "Argonaute",
      "page": "Argonaute"
    },
    {
      "text": "disease",
      "page": "Disease"
    },
    {
      "text": "plants",
      "page": "Plant"
    },
    {
      "text": "animals",
      "page": "Mole"
    },
    {
      "text": "polarity",
      "page": "Polarity"
    },
    {
      "text": "post-transcriptional regulation",
      "page": "Post-transcriptional_regulation"
    },
    {
      "text": "feedback",
      "page": "Feedback"
    },
    {
      "text": "inflammation",
      "page": "Inflammation"
    },
    {
      "text": "homeostasis",
      "page": "Homeostasis"
    },
    {
      "text": "phase separation",
      "page": "Phase_separation"
    },
    {
      "text": "differentiation",
      "page": "Differentiation"
    },
    {
      "text": "scaffold",
      "page": "The_Scaffold"
    },
    {
      "text": "SR proteins",
      "page": "SR_protein"
    },
    {
      "text": "cellular differentiation",
      "page": "Cellular_differentiation"
    },
    {
      "text": "proliferation",
      "page": "Proliferation"
    },
    {
      "text": "ribosome profiling",
      "page": "Ribosome_profiling"
    },
    {
      "text": "mouse",
      "page": "Mouse"
    },
    {
      "text": "processing bodies (P-bodies)",
      "page": "P-bodies"
    },
    {
      "text": "coding sequence (CDS)",
      "page": "CDS"
    },
    {
      "text": "scaffolding",
      "page": "Scaffolding"
    },
    {
      "text": "operon",
      "page": "Operon"
    },
    {
      "text": "1970s",
      "page": "1970s"
    },
    {
      "text": "Richard J. Roberts",
      "page": "Richard_J._Roberts"
    },
    {
      "text": "RNA splicing",
      "page": "RNA_splicing"
    },
    {
      "text": "Nobel Prize",
      "page": "Nobel_Prize"
    },
    {
      "text": "Physiology",
      "page": "Physiology"
    },
    {
      "text": "Medicine",
      "page": "Medicine"
    },
    {
      "text": "HeLa",
      "page": "HeLa"
    },
    {
      "text": "Human Genome Project",
      "page": "Human_Genome_Project"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "Chuan He",
      "page": "Chuan_He"
    },
    {
      "text": "writer",
      "page": "Writer"
    },
    {
      "text": "eraser",
      "page": "Eraser"
    },
    {
      "text": "RNA editing",
      "page": "RNA_editing"
    },
    {
      "text": "antigen",
      "page": "Antigen"
    },
    {
      "text": "vaccines",
      "page": "vaccines"
    },
    {
      "text": "COVID-19 pandemic",
      "page": "COVID-19_pandemic"
    },
    {
      "text": "Moderna",
      "page": "Moderna"
    },
    {
      "text": "Japan",
      "page": "Japan"
    },
    {
      "text": "respiratory tract",
      "page": "Respiratory_tract"
    },
    {
      "text": "influenza vaccine",
      "page": "Influenza_vaccine"
    },
    {
      "text": "influenza",
      "page": "Influenza"
    },
    {
      "text": "BioNTech",
      "page": "BioNTech"
    },
    {
      "text": "heart failure",
      "page": "Heart_failure"
    },
    {
      "text": "angiogenesis",
      "page": "Angiogenesis"
    },
    {
      "text": "angina",
      "page": "Angina"
    },
    {
      "text": "gene therapy",
      "page": "Gene_therapy"
    },
    {
      "text": "in vitro",
      "page": "In_vitro"
    },
    {
      "text": "luciferase",
      "page": "Luciferase"
    },
    {
      "text": "Synthetic biology",
      "page": "Synthetic_biology"
    },
    {
      "text": "engineering",
      "page": "Engineering"
    },
    {
      "text": "construction",
      "page": "Construction"
    },
    {
      "text": "pseudouridine",
      "page": "Pseudouridine"
    }
  ],
  "fetched_at": "2025-12-07T07:23:31.293797",
  "elapsed_ms": 564232
}