{
  "topic": "NBA Finals",
  "title": "NBA Finals",
  "slug": "nba-finals",
  "grokipedia_slug": "NBA_Finals",
  "grokipedia_url": "https://grokipedia.com/page/NBA_Finals",
  "source": "grokipedia",
  "content": "# NBA Finals\n\nThe **NBA Finals** is the annual championship series of the National Basketball Association (NBA), pitting the winners of the Eastern and Western conference playoffs against each other in a best-of-seven game format to determine the league's season champion. The victorious team receives the Larry O'Brien Championship Trophy, a sterling silver award with a 24-karat gold overlay designed and manufactured by Tiffany \\u0026 Co. Held each June following the conclusion of the regular season and conference playoffs, the series features intense competition among the top 16 playoff teams that qualify from the 30 NBA franchises, culminating in this decisive matchup.\n\nThe NBA Finals originated in 1947 as part of the Basketball Association of America (BAA), the precursor to the modern NBA, which formed in 1949 through a merger with the National Basketball League (NBL). From its inception, the series has consistently followed a best-of-seven structure, with the first team to secure four wins declared the champion. The home-court advantage format evolved over time: it used a 2–3–2 setup from 1985 to 2013, favoring the higher seed with three home games in the middle, before reverting to the current 2–2–1–1–1 arrangement in 2014 to better balance travel demands.\n\nOver 79 series since 1947, the Finals have showcased dynasties, rivalries, and legendary performances that define professional basketball. The Boston Celtics hold the record for most championships with 18 titles, closely followed by the Los Angeles Lakers with 17, while the league has seen 21 different franchises claim the crown. Iconic matchups, such as the Celtics-Lakers rivalry spanning decades, have produced some of the sport's most memorable moments, including multiple seven-game series and the introduction of the Bill Russell NBA Finals Most Valuable Player Award in 1969 to honor the series' standout performer. The event draws global audiences, broadcast on major networks, and represents the pinnacle of NBA achievement, blending athletic excellence with cultural significance.\n\n## Overview and Format\n\n### Series Structure and Rules\n\nThe NBA Finals is conducted as a best-of-seven series, in which the Eastern and Western Conference champions compete until one team secures four victories to claim the league championship. This format has been used since the inception of the league in 1947 as the Basketball Association of America (BAA), continuing after the 1949 merger with the National Basketball League (NBL) to form the unified National Basketball Association (NBA). The series typically spans up to two weeks, with games scheduled every other day to allow recovery, and serves as the culmination of the playoff qualification process.\n\nHome-court advantage in the Finals is awarded to the conference champion with the superior regular-season record, dictating the hosting sequence under the 2-2-1-1-1 format: the higher seed hosts Games 1 and 2, the lower seed hosts Games 3 and 4, and the higher seed regains the court for Games 5, 6, and 7 if necessary. This arrangement, originally implemented since the league's early years including 1950, was altered to a 2-3-2 setup in 1985 to minimize cross-country travel but reverted to 2-2-1-1-1 in 2014 following owner approval, as it better balances competitive equity by giving the favored team a potential closeout opportunity at home.\n\nIf a game ends in a tie after the standard 48-minute regulation, it proceeds to unlimited five-minute overtime periods until a winner emerges, beginning with a jump ball at center court and no basket switch between overtimes. Each team receives two timeouts per overtime period, independent of any remaining from regulation, to facilitate strategic adjustments during these high-pressure extensions.\n\nIn the fourth period and overtime, timeout usage is restricted to promote continuous play: teams are limited to two team timeouts after the later of the three-minute mark or the second mandatory timeout, effectively curbing stoppages in the closing stages. These \"two-minute\" constraints refer to the intensified oversight in the final minutes, where excessive timeouts can influence game flow, though each timeout itself lasts 75 seconds.\n\nReplay reviews in the Finals adhere to NBA protocols but emphasize precision in critical moments, with officials or the Replay Center initiating examinations for matters like field goals, fouls, clock malfunctions, or violations occurring in the last two minutes of the fourth period or any overtime, without allowance for coach challenges on certain subjective calls such as traveling, double dribbles, or non-reviewable shot clock violations unless tied to a broader trigger. Coach's challenges, limited to one per game (with a potential second if successful), may only address specific observable errors like out-of-bounds possession or called fouls, ensuring reviews do not unduly prolong the championship contest.\n\nUpon clinching the series, the winning team receives the Larry O'Brien Championship Trophy, named for the former NBA commissioner and redesigned in 1977 to symbolize excellence with its sterling silver and 24-karat gold elements weighing approximately 31 pounds. The presentation occurs immediately post-game on the court, where NBA Commissioner Adam Silver hands the trophy to the team's owner or a designated representative, followed by players hoisting it in celebration amid confetti and fanfare, marking the official conclusion of the Finals.\n\n### Qualification and Seeding Process\n\nThe NBA playoffs consist of 16 teams, eight from each conference, determined by regular-season performance. The top six teams in each conference—the Eastern and Western—qualify directly based on their win-loss records at the end of the 82-game regular season. Teams finishing seventh through tenth in their conference standings participate in the SoFi NBA Play-In Tournament, a mini-tournament held over two days (typically mid-April) to determine the seventh and eighth seeds. In this format, the seventh seed plays the eighth seed in a single game, with the winner securing the No. 7 spot; the loser then faces the winner of the ninth-versus-tenth game for the No. 8 seed. The ninth and tenth seeds play an elimination game, with the victor advancing to challenge for the final playoff berth. This structure, introduced in 2020, ensures broader competition while rewarding top performers.\n\nSeeding within each conference is assigned strictly according to regular-season winning percentage, with the team holding the best record receiving the No. 1 seed and proceeding downward. In cases of ties, the NBA applies a series of tiebreakers to determine higher seeding. For two tied teams, the order begins with head-to-head winning percentage, followed by whether one team is a division leader (division winners prevail over non-division leaders), division winning percentage (if both are in the same division), conference winning percentage, winning percentage against playoff-eligible teams in their own conference, winning percentage against playoff-eligible teams in the opposite conference, and finally point differential (points scored minus points allowed across the season). For three or more tied teams, the process starts similarly but emphasizes games among the tied teams after checking division leadership, then applies conference and other records, with point differential as the ultimate decider if needed. These rules maintain fairness and prioritize intra-conference and divisional strength.\n\nThe playoff bracket is structured as a single-elimination tournament within each conference, culminating in the Conference Finals. The winners of the Eastern Conference Finals and Western Conference Finals advance to represent their conferences in the NBA Finals. Throughout the playoffs, higher seeds receive home-court advantage in best-of-seven series, hosting Games 1, 2, 5, and 7. For the NBA Finals itself, home-court advantage is awarded to the conference champion with the superior regular-season record, regardless of conference affiliation, using the same 2-2-1-1-1 format to give them Games 1, 2, 5, and 7 at home. If the conference champions have identical records, tiebreakers mirror those used for seeding, starting with head-to-head results. This system underscores the importance of regular-season success in gaining an edge on the Finals stage.\n\n## Historical Development\n\n### Origins and Early Years (1947–1959)\n\nThe Basketball Association of America (BAA) was established on June 6, 1946, by owners of major ice hockey arenas in the Northeastern and Midwestern United States, aiming to capitalize on empty facilities during the basketball offseason. The league launched its inaugural season in November 1946 with 11 teams divided into Eastern and Western Divisions, culminating in the first BAA playoffs in spring 1947. The inaugural BAA Finals featured the Eastern Division's Philadelphia Warriors against the Western Division's Chicago Stags in a best-of-seven series, with the Warriors prevailing 4–1. Game 5, which clinched the title for Philadelphia on April 22, 1947, at the Philadelphia Arena, ended 83–80 after Howie Dallmar's game-winning basket with under a minute remaining.\n\nFollowing three seasons of financial challenges and competition from the rival National Basketball League (NBL), the BAA merged with the NBL on August 3, 1949, to form the National Basketball Association (NBA), incorporating six former NBL franchises and adopting the BAA's structure as the foundation. This consolidation stabilized the league, which began its first official NBA season in 1949–50 with 17 teams. The merger preserved continuity in championship recognition, with prior BAA titles retroactively included in NBA history.\n\nThe Minneapolis Lakers, who joined the NBL in 1947 before transitioning to the BAA, emerged as the dominant force in the league's early years under coach John Kundla and center George Mikan, winning five championships from 1949 to 1954. Their 1949 BAA title came in a 4–2 series victory over the Washington Capitols, highlighted by Mikan's scoring prowess in the finals clincher. The Lakers secured their first NBA crown in 1950 by defeating the Syracuse Nationals 4–2, a series marked by Mikan's leadership in overcoming a resilient opponent that pushed the contest to six games, with the decisive Game 6 at the Minneapolis Auditorium drawing 9,812 fans. Additional titles followed in 1952 (4–3 over the New York Knicks), 1953 (4–1 over the Nationals), and 1954 (4–3 over the Nationals), establishing the Lakers as the era's gold standard through Mikan's interior dominance and team depth.\n\nSigns of emerging parity appeared amid the Lakers' run, exemplified by the Rochester Royals' 1951 championship. As the Western Division's second seed, the Royals upset the top-seeded Lakers in the division finals before edging the New York Knicks 4–3 in the NBA Finals, clinching the title 79–75 in Game 7 at Rochester's Edgerton Park Arena on April 21, 1951. This victory interrupted the Lakers' bid for a three-peat and highlighted the league's growing competitiveness. Similarly, the Fort Wayne Pistons' unexpected run to the 1955 Finals represented an early underdog story, as the third-seeded Western team advanced past higher seeds to face the favored Syracuse Nationals, losing 4–3 in a hard-fought series that went to seven games. The Pistons' deep playoff push, capped by a 109–102 win in Game 4, underscored the potential for non-dominant teams to contend in the pre-expansion landscape.\n\nNBA Finals during this period were hosted in modest municipal venues reflecting the league's nascent status, such as the Philadelphia Arena (capacity around 8,000) for the 1947 series opener drawing 7,918 spectators and Chicago Stadium for subsequent games with crowds as low as 2,209. Attendance trends showed initial struggles, with league-wide averages hovering near 3,000 per regular-season game in 1946–47 due to post-World War II economic constraints and competition from other entertainment. By the mid-1950s, Finals crowds grew to 8,000–10,000, as seen in the 1950 series finale, signaling rising interest amid the shot clock's 1954 introduction and star-driven play. Teams increasingly shifted to larger arenas like Madison Square Garden (capacity over 15,000) for key matchups, accommodating expanded fan bases while maintaining intimate atmospheres compared to later multipurpose stadiums. In 1950, the Finals format solidified as best-of-seven across all playoff rounds to enhance drama and revenue.\n\n### 1960s: Boston Celtics Dynasty\n\nThe Boston Celtics established an unparalleled dynasty in the 1960s, capturing eight NBA championships between 1957 and 1966, including a record eight consecutive titles from 1959 to 1966. This run contributed to Bill Russell's remarkable achievement of 11 championships in 13 seasons from 1957 to 1969, anchoring the team's success as its defensive cornerstone. Russell revolutionized defensive play with his shot-blocking prowess and rebounding dominance, leading the Celtics to the league's best defense in 12 of his 13 seasons and enabling a team-oriented style that overwhelmed opponents. His impact was evident in key playoff performances, such as averaging 27 rebounds per game during the 1960 Eastern Division Finals.\n\nCentral to the era's drama were the Celtics' rivalries, particularly their six NBA Finals matchups against the Los Angeles Lakers in 1959, 1962, 1963, 1965, 1966, and 1969, all of which Boston won. These series often featured intense battles, highlighted by the 1962 Finals' Game 7 overtime victory (110-107) and the 1966 thriller where the Celtics edged out a 95-93 win in Game 7. The 1969 Finals stood out for its comeback drama, as Boston overcame a 3-1 deficit against a Lakers squad bolstered by Wilt Chamberlain, clinching the title 108-106 in Game 7 on a go-ahead shot by Don Nelson. Despite Jerry West earning Finals MVP honors in defeat, the series underscored the Lakers' persistent challenge to the dynasty.\n\nThe NBA's expansion in the early 1960s, adding teams such as the Chicago Packers in 1961 and the Chicago Bulls in 1966, had minimal immediate effect on the Finals landscape, as newcomers struggled to contend amid the established powerhouses. The St. Louis Hawks' 1958 championship, their only NBA title won 4-2 over the Celtics, marked the final pre-dynasty victory for a non-Celtics Eastern Conference team before Boston's sustained reign.\n\nUnder coach Red Auerbach, the Celtics pioneered innovations like the fast-break offense, emphasizing speed, transition scoring, and collective play over individual stardom, which fueled their cultural shift toward modern basketball strategy. Auerbach's approach, combined with drafting talents like Russell in 1956, created a cohesive unit that won nine titles during his coaching tenure from 1950 to 1966.\n\n### 1970s: Expansion and Parity\n\nThe 1970s marked a transformative era for the NBA Finals, characterized by league expansion and the 1976 merger with the American Basketball Association (ABA), which diluted established powerhouses and fostered greater competitive balance. Following the end of the Boston Celtics' dominance in the late 1960s, the NBA added new franchises, including the Buffalo Braves, Cleveland Cavaliers, and Portland Trail Blazers in 1970, followed by the Houston Rockets in 1971 and the New Orleans Jazz in 1974, expanding from 14 teams in 1969 to 19 by 1975. The pivotal ABA-NBA merger, finalized on June 17, 1976, incorporated four ABA teams—the Denver Nuggets, Indiana Pacers, New York Nets, and San Antonio Spurs—bringing the total to 22 teams and injecting fresh talent and styles into the league. This growth spread talent across more rosters, preventing any single team from repeating as champions throughout the decade and enabling a variety of winners to emerge.\n\nChampionships in the 1970s highlighted this parity, with seven different teams claiming the title: the New York Knicks in 1970 and 1973, the Los Angeles Lakers in 1972, the Golden State Warriors in 1975, the Portland Trail Blazers in 1977, the Washington Bullets in 1978, and the Seattle SuperSonics in 1979. Iconic moments underscored the drama of these series; in the 1970 Finals, Knicks center Willis Reed, sidelined by a severe thigh injury from Game 5, made a legendary return for Game 7 at Madison Square Garden on May 8, limping onto the court to cheers and hitting his first two shots before exiting after 27 seconds, inspiring his team to a 113-99 victory over the Lakers for their first title. A significant roster shift occurred in 1975 when the Milwaukee Bucks traded Kareem Abdul-Jabbar and Walt Wesley to the Lakers on June 16 in exchange for Elmore Smith, Brian Winters, Dave Meyers, and Junior Bridgeman, bolstering Los Angeles' future contention but not yielding an immediate championship that year.\n\nUnderdog triumphs exemplified the era's unpredictability, most notably the 1975 Warriors' stunning sweep of the heavily favored Bullets. Despite finishing with a 48-34 regular-season record compared to Washington's 60-22, Golden State won all four games, including a 96-95 thriller in Game 4, with Rick Barry earning Finals MVP honors for his 29.5 points per game average. This upset, along with other series like the Trail Blazers' 1977 defeat of the Philadelphia 76ers and the Bullets' 1978 seven-game comeback against the SuperSonics, illustrated how expansion and merger had leveled the playing field, allowing mid-tier teams to challenge and topple perennial contenders without any dynasty emerging.\n\n### 1980s: Iconic Rivalries\n\nThe 1980s NBA Finals were defined by intense rivalries that elevated the league's popularity, particularly the renewed clash between the Los Angeles Lakers and Boston Celtics, which featured in four championship series during the decade. This matchup pitted Magic Johnson's \"Showtime\" Lakers against Larry Bird's gritty Celtics, showcasing contrasting styles of fast-paced offense versus tough defense and drawing massive television audiences that helped globalize the NBA. The Lakers captured five championships in the era (1980, 1982, 1985, 1987, 1988), while the Celtics secured three (1981, 1984, 1986), with their head-to-head battles in 1984, 1985, 1987, and 1988 embodying the decade's competitive spirit.\n\nThe Lakers-Celtics Finals began in 1984, when Boston edged Los Angeles 4-3 in a grueling seven-game series, highlighted by Kevin McHale's clothesline foul on Kurt Rambis in Game 4, which intensified the bad blood between the franchises. The Lakers rebounded in 1985, winning 4-2 behind Kareem Abdul-Jabbar's resurgence at age 38 and a dominant performance in Game 6 at Boston Garden. The rivalry peaked again in 1987, with Los Angeles prevailing 4-2, including Magic Johnson's iconic \"junior sky hook\" in Game 4 to secure a 107-106 victory, and a triple-overtime thriller in Game 5 won by the Lakers 131-123. By 1988, the Lakers defeated Detroit 4-3 to claim their fifth title, but the Celtics-Lakers feud had already cemented its legacy as the era's signature rivalry.\n\nUnder coach Pat Riley, the Lakers' Showtime era revolutionized the game with a high-octane fast-break offense, led by Johnson's no-look passes and Abdul-Jabbar's sky hooks, which emphasized transition play and entertainment value, boosting the NBA's appeal through national broadcasts. This style contributed to their 1980 triumph over Philadelphia (4-2), 1982 victory against the 76ers (4-2), and the later championships, making Los Angeles the decade's most successful franchise.\n\nTowards the decade's end, the Detroit Pistons emerged as a disruptive force with their \"Bad Boys\" persona, employing a physical, defense-first approach under coach Chuck Daly and stars like Isiah Thomas and Joe Dumars. Detroit swept the Lakers 4-0 in the 1989 Finals to claim their first title, using aggressive tactics to neutralize Showtime's speed, then repeated as champions in 1990 by defeating Portland 4-1, marking a shift from West Coast dominance to Midwestern tenacity.\n\n### 1990s: Chicago Bulls Dominance\n\nThe 1990s marked a period of unprecedented dominance by the Chicago Bulls in the NBA Finals, securing six championships over the decade under the leadership of Michael Jordan. This era transformed the league, emphasizing individual brilliance combined with team synergy, and solidified the Bulls as the preeminent force in basketball. The Bulls' success was built on a core roster featuring Jordan, Scottie Pippen, and coaching from Phil Jackson, who implemented the triangle offense—a system that prioritized ball movement, spacing, and player versatility to maximize offensive efficiency.\n\nThe Bulls began their reign with a three-peat from 1991 to 1993, defeating Western Conference opponents in each series. In 1991, they overcame the Los Angeles Lakers 4-1, with Jordan averaging 31.2 points per game to claim the first title of the dynasty. The following year, Chicago swept the Portland Trail Blazers 4-2 in the Finals, highlighted by Jordan's iconic \"Shrug Game\" where he hit six three-pointers in the first half of Game 1. The streak culminated in 1993 with a 4-2 victory over the Phoenix Suns, a series noted for its intensity and Jordan's 41-point performance in Game 3. These triumphs ended the Eastern Conference's intermittent challenges from the 1980s, ushering in a superstar-driven era.\n\nJordan's abrupt retirement in 1993 to pursue baseball created a hiatus, allowing the Houston Rockets, led by Hakeem Olajuwon, to secure back-to-back titles in 1994 and 1995—the only interruption to Eastern Conference representation in the Finals during the decade. The Rockets defeated the New York Knicks 4-3 in 1994 and the Orlando Magic 4-0 in 1995, with Olajuwon earning Finals MVP honors both times for his defensive prowess and scoring versatility.\n\nJordan's return in 1995 propelled the Bulls to an NBA-record 72 regular-season wins the following year, leading to a 1996 Finals sweep of the Seattle SuperSonics 4-0. The second three-peat extended through 1997 and 1998 against the Utah Jazz. In 1997, Chicago won 4-2, with a pivotal Game 5 victory in Salt Lake City where Jordan, battling severe flu symptoms, scored 38 points in the \"Flu Game\"—a moment symbolizing his relentless determination. The dynasty concluded in 1998 with another 4-2 series win, capped by Jordan's iconic game-winning shot over Bryon Russell in Game 6, securing the sixth title.\n\nScottie Pippen played a crucial complementary role, providing elite defense, playmaking, and scoring—averaging 19.0 points, 7.9 rebounds, and 5.6 assists across the six Finals series—to enable the triangle offense's fluidity and balance the load on Jordan. Jackson's implementation of the triangle, influenced by Tex Winter, emphasized reads and reactions over set plays, allowing the Bulls to adapt against varied defenses and achieve a 6-0 Finals record in the 1990s.\n\n| Year | Opponent | Series Result | Key Note |\n|------|----------|---------------|----------|\n| 1991 | Los Angeles Lakers | Bulls 4–1 | Jordan's first Finals triple-double in Game 2 |\n| 1992 | Portland Trail Blazers | Bulls 4–2 | Jordan's 33 points in Game 6 clincher |\n| 1993 | Phoenix Suns | Bulls 4–2 | Barkley's 24 points and 19 rebounds in triple-overtime Game 3 |\n| 1996 | Seattle SuperSonics | Bulls 4–0 | Sweep with 72-win regular season |\n| 1997 | Utah Jazz | Bulls 4–2 | \"Flu Game\" in Game 5 |\n| 1998 | Utah Jazz | Bulls 4–2 | Jordan's jumper in Game 6 |\n\n### 2000s: Western Conference Supremacy\n\nThe 2000s marked a period of pronounced Western Conference dominance in the NBA Finals, with Western teams securing seven of the decade's ten championships, a stark contrast to the Eastern-led successes of the prior decade following the Chicago Bulls' dynasty fade. This era showcased powerhouse franchises like the Los Angeles Lakers and San Antonio Spurs, who combined for six titles, leveraging star-driven rosters and strategic coaching to overpower Eastern opponents. The shift highlighted the West's depth and talent concentration, though Eastern teams occasionally broke through with gritty, team-oriented play.\n\nThe Los Angeles Lakers, led by the dynamic duo of Shaquille O'Neal and Kobe Bryant under coach Phil Jackson, achieved a three-peat from 2000 to 2002, becoming the last team to win three straight NBA titles. In 2000, they defeated the Indiana Pacers 4-2, with O'Neal earning Finals MVP honors after averaging 38 points and 16.7 rebounds per game. The following year, the Lakers overcame the Philadelphia 76ers 4-1, highlighted by Bryant's performance of 31 points despite a sprained ankle in Game 2. Completing the run in 2002, they swept the New Jersey Nets 4-0, as O'Neal dominated with 36.3 points and 12.3 rebounds per game to secure his third straight Finals MVP.\n\nThe San Antonio Spurs, anchored by Tim Duncan and coached by Gregg Popovich, emerged as the decade's most consistent force, winning four championships in the span from 1999 to 2007 and exemplifying the growing international impact on the league through Duncan's leadership alongside global talents like Tony Parker and Manu Ginóbili. Building on their 1999 title, the Spurs claimed the 2003 championship by defeating the Nets 4-2, with Duncan averaging 24.2 points, 17 rebounds, and 5.3 blocks per game en route to Finals MVP. In 2005, they edged the Detroit Pistons 4-3 in a defensive battle, as Duncan's 21-point, 14.1-rebound average propelled the team to victory. The Spurs capped their 2000s run in 2007 with a dominant 4-0 sweep of the Cleveland Cavaliers, where Duncan posted 24.5 points and 10 rebounds per game, underscoring the franchise's emphasis on fundamentals and international versatility.\n\nThe Detroit Pistons provided a rare Eastern interruption in 2004, upsetting the favored Lakers 4-1 to end their dynasty and claim the title with a blue-collar defense featuring Chauncey Billups, Ben Wallace, and Rasheed Wallace. In a series defined by physicality, the Pistons limited O'Neal to 26.6 points on poor efficiency while holding Bryant to 22.6 points, with Billups earning Finals MVP after averaging 21 points and 5.2 assists. This victory highlighted the value of team cohesion over star power.\n\nThe Miami Heat's 2006 triumph stood as the decade's lone Eastern win outside the Pistons', with Dwyane Wade leading a comeback from a 2-0 deficit against the Dallas Mavericks to win 4-2 and earn Finals MVP. Wade's aggressive drives resulted in a record 97 free-throw attempts in the series (making 75 at 77.3%), including 25 in Game 3 alone—matching the Mavericks' total for the game—as he averaged 34.7 points overall to secure the franchise's first championship.\n\n### 2010s: Superteams and LeBron's Quest\n\nThe 2010s marked a transformative era in the NBA Finals, characterized by the formation of superteams and LeBron James' unprecedented quest for championships, which spanned eight consecutive appearances from 2011 to 2018. This period began with James' high-profile free agency decision in July 2010 to join the Miami Heat, partnering with Dwyane Wade and Chris Bosh to create one of the league's first modern superteams and ushering in an age of player empowerment through strategic free agency moves. James' relocation not only shifted the balance of power toward the Eastern Conference but also intensified competition in the Finals, as teams assembled star-laden rosters to counter such alliances.\n\nJames led the Heat to four straight Finals from 2011 to 2014, securing back-to-back titles in 2012 and 2013. In 2011, Miami fell to the Dallas Mavericks in six games, a shocking upset highlighted by Dirk Nowitzki's dominant performance. The following year, the Heat defeated the Oklahoma City Thunder in five games, with James earning Finals MVP honors for his all-around contributions. They repeated in 2013 against the San Antonio Spurs in seven games, overcoming a 3-2 deficit in a dramatic series finale where James scored 37 points and Ray Allen's iconic three-pointer shifted momentum. However, the Spurs exacted revenge in 2014, winning 4-1 behind Kawhi Leonard's defensive mastery on James and a record-setting team shooting display in Game 3, ending Miami's dynasty and prompting James' return to the Cleveland Cavaliers.\n\nWith the Cavaliers, James extended his Finals streak to eight years, facing the dominant Golden State Warriors in four consecutive matchups from 2015 to 2018. In 2015, the Warriors claimed their first title in 40 years by defeating Cleveland 4-2, propelled by Stephen Curry's historic regular-season MVP campaign and Andre Iguodala's Finals MVP performance. The 2015-16 Warriors set an NBA record with 73 regular-season wins but squandered a 3-1 Finals lead, allowing James and Cleveland to stage the league's first-ever comeback from that deficit, clinching the series in seven games and delivering Cleveland its first championship. Golden State responded by adding Kevin Durant in free agency, forming their own superteam that won the 2017 Finals 4-1 and swept Cleveland 4-0 in 2018, with Durant earning Finals MVP in both years amid Curry's sharpshooting and Draymond Green's defensive intensity. This Warriors dynasty, built on small-ball innovation and three-point volume, defined the decade's Western Conference supremacy while underscoring James' relentless pursuit across team changes.\n\n### 2020s: Parity and New Champions\n\nThe 2020 NBA Finals marked a historic adaptation to the COVID-19 pandemic, as the league conducted the entire postseason in a bio-secure \"bubble\" at Walt Disney World Resort in Orlando, Florida, with no fans in attendance and strict health protocols in place. The Los Angeles Lakers defeated the Miami Heat 4–2 to claim their 17th championship, with LeBron James earning Finals MVP honors for his performance averaging 29.8 points, 11.8 rebounds, and 8.5 assists per game. This victory ended a decade-long Lakers drought and was the first NBA title decided entirely without live audiences.\n\nThe 2020–21 season introduced the expanded play-in tournament, a format change that determined the No. 7 and No. 8 seeds in each conference via games among the No. 7–10 teams, aiming to increase late-season motivation and competitive balance across the league. This structure, made permanent after a trial run in 2020, has allowed underdogs to extend their seasons and reach deeper into the playoffs, contributing to the era's parity by preventing top-heavy dominance. In the 2021 Finals, the Milwaukee Bucks overcame the Phoenix Suns 4–2 for their second franchise title and first since 1971, with Giannis Antetokounmpo securing Finals MVP after averaging 30.2 points, 12.8 rebounds, and 5.2 assists, including a 50-point closeout game. The Bucks' path included play-in beneficiaries in earlier rounds, highlighting the tournament's role in broadening access to the postseason.\n\nThe trend of diverse victors continued in 2022, as the Golden State Warriors bested the Boston Celtics 4–2 to secure their seventh championship, with Stephen Curry earning Finals MVP for his 31.2 points per game average, including a record-setting 43.0% from three-point range. Unlike the star-driven superteams of the 2010s that dissolved through retirements and free agency shifts, the 2020s emphasized balanced rosters and emerging talent. In 2023, the Denver Nuggets swept past the Miami Heat 4–1 for their inaugural NBA title, propelled by Nikola Jokić's Finals MVP performance of 30.2 points, 14.0 rebounds, and 7.2 assists per game, underscoring a new champion's rise through homegrown development rather than assembled stardom.\n\nThe parity persisted into 2024, with the Boston Celtics defeating the Dallas Mavericks 4–1 to claim their 18th championship, Jaylen Brown named Finals MVP after averaging 20.8 points, 5.4 rebounds, and 5.0 assists in a series that showcased defensive depth over individual heroics. No team has repeated as champions since the 2018 Warriors, resulting in seven unique winners from 2019 to 2025—a streak reflecting heightened league-wide competitiveness fueled by salary cap dynamics, player movement, and the play-in's inclusivity. The 2025 Finals exemplified this balance, as the Oklahoma City Thunder edged the Indiana Pacers 4–3 for the franchise's first title since relocating from Seattle, with Shai Gilgeous-Alexander's 30.4 points, 6.8 assists, and 5.6 rebounds per game earning him Finals MVP and capping a season of rapid ascent for a young core.\n\n## Championships and Winners\n\n### Complete List of NBA Champions\n\nThe NBA Finals, contested annually since the 1946–47 season, determine the league champion through a best-of-seven series between the Eastern and Western Conference winners (with format adjustments in early years). The Basketball Association of America (BAA) operated from 1946 to 1949 before merging with the National Basketball League (NBL) to form the National Basketball Association (NBA) in 1949–50; all BAA Finals are retroactively recognized as NBA championships. The American Basketball Association (ABA) merged with the NBA in 1976–77, but no ABA champions are included in this NBA list, as the merger occurred after the 1975–76 ABA season. The Finals Most Valuable Player (MVP) award, officially named the Bill Russell NBA Finals MVP Award since 2009, has been given annually since the 1968–69 season (with Jerry West of the losing Lakers as the inaugural recipient).\n\nThe table below provides a complete chronological list of NBA champions from 1947 to 2025.\n\n| Year | Champion | Runner-up | Series | MVP |\n|------|----------|-----------|--------|-----|\n| 1947 | Philadelphia Warriors | Chicago Stags | 4–1 | — |\n| 1948 | Baltimore Bullets | Philadelphia Warriors | 4–2 | — |\n| 1949 | Minneapolis Lakers | Washington Capitols | 4–2 | — |\n| 1950 | Minneapolis Lakers | Syracuse Nationals | 4–2 | — |\n| 1951 | Rochester Royals | New York Knicks | 4–3 | — |\n| 1952 | Minneapolis Lakers | New York Knicks | 4–3 | — |\n| 1953 | Minneapolis Lakers | New York Knicks | 4–0 | — |\n| 1954 | Minneapolis Lakers | Syracuse Nationals | 4–3 | — |\n| 1955 | Syracuse Nationals | Fort Wayne Pistons | 4–3 | — |\n| 1956 | Philadelphia Warriors | Fort Wayne Pistons | 4–1 | — |\n| 1957 | Boston Celtics | St. Louis Hawks | 4–3 | — |\n| 1958 | St. Louis Hawks | Boston Celtics | 4–2 | — |\n| 1959 | Boston Celtics | Minneapolis Lakers | 4–0 | — |\n| 1960 | Boston Celtics | St. Louis Hawks | 4–3 | — |\n| 1961 | Boston Celtics | St. Louis Hawks | 4–1 | — |\n| 1962 | Boston Celtics | Los Angeles Lakers | 4–3 | — |\n| 1963 | Boston Celtics | Los Angeles Lakers | 4–2 | — |\n| 1964 | Boston Celtics | San Francisco Warriors | 4–1 | — |\n| 1965 | Boston Celtics | Los Angeles Lakers | 4–1 | — |\n| 1966 | Boston Celtics | Los Angeles Lakers | 4–3 | — |\n| 1967 | Philadelphia 76ers | San Francisco Warriors | 4–2 | — |\n| 1968 | Boston Celtics | Los Angeles Lakers | 4–2 | — |\n| 1969 | Boston Celtics | Los Angeles Lakers | 4–3 | Jerry West (Los Angeles Lakers) |\n| 1970 | New York Knicks | Los Angeles Lakers | 4–3 | Willis Reed (New York Knicks) |\n| 1971 | Milwaukee Bucks | Baltimore Bullets | 4–0 | Lew Alcindor (Milwaukee Bucks) |\n| 1972 | Los Angeles Lakers | New York Knicks | 4–1 | Wilt Chamberlain (Los Angeles Lakers) |\n| 1973 | New York Knicks | Los Angeles Lakers | 4–1 | Willis Reed (New York Knicks) |\n| 1974 | Boston Celtics | Milwaukee Bucks | 4–3 | John Havlicek (Boston Celtics) |\n| 1975 | Golden State Warriors | Washington Bullets | 4–0 | Rick Barry (Golden State Warriors) |\n| 1976 | Boston Celtics | Phoenix Suns | 4–2 | Jo Jo White (Boston Celtics) |\n| 1977 | Portland Trail Blazers | Philadelphia 76ers | 4–2 | Bill Walton (Portland Trail Blazers) |\n| 1978 | Washington Bullets | Seattle SuperSonics | 4–3 | Wes Unseld (Washington Bullets) |\n| 1979 | Seattle SuperSonics | Washington Bullets | 4–1 | Dennis Johnson (Seattle SuperSonics) |\n| 1980 | Los Angeles Lakers | Philadelphia 76ers | 4–2 | Magic Johnson (Los Angeles Lakers) |\n| 1981 | Boston Celtics | Houston Rockets | 4–2 | Cedric Maxwell (Boston Celtics) |\n| 1982 | Los Angeles Lakers | Philadelphia 76ers | 4–2 | Magic Johnson (Los Angeles Lakers) |\n| 1983 | Philadelphia 76ers | Los Angeles Lakers | 4–0 | Moses Malone (Philadelphia 76ers) |\n| 1984 | Boston Celtics | Los Angeles Lakers | 4–3 | Larry Bird (Boston Celtics) |\n| 1985 | Los Angeles Lakers | Boston Celtics | 4–2 | Kareem Abdul-Jabbar (Los Angeles Lakers) |\n| 1986 | Boston Celtics | Houston Rockets | 4–2 | Larry Bird (Boston Celtics) |\n| 1987 | Los Angeles Lakers | Boston Celtics | 4–2 | Magic Johnson (Los Angeles Lakers) |\n| 1988 | Los Angeles Lakers | Detroit Pistons | 4–3 | James Worthy (Los Angeles Lakers) |\n| 1989 | Detroit Pistons | Los Angeles Lakers | 4–0 | Joe Dumars (Detroit Pistons) |\n| 1990 | Detroit Pistons | Portland Trail Blazers | 4–1 | Isiah Thomas (Detroit Pistons) |\n| 1991 | Chicago Bulls | Los Angeles Lakers | 4–1 | Michael Jordan (Chicago Bulls) |\n| 1992 | Chicago Bulls | Portland Trail Blazers | 4–2 | Michael Jordan (Chicago Bulls) |\n| 1993 | Chicago Bulls | Phoenix Suns | 4–2 | Michael Jordan (Chicago Bulls) |\n| 1994 | Houston Rockets | New York Knicks | 4–3 | Hakeem Olajuwon (Houston Rockets) |\n| 1995 | Houston Rockets | Orlando Magic | 4–0 | Hakeem Olajuwon (Houston Rockets) |\n| 1996 | Chicago Bulls | Seattle SuperSonics | 4–2 | Michael Jordan (Chicago Bulls) |\n| 1997 | Chicago Bulls | Utah Jazz | 4–2 | Michael Jordan (Chicago Bulls) |\n| 1998 | Chicago Bulls | Utah Jazz | 4–2 | Michael Jordan (Chicago Bulls) |\n| 1999 | San Antonio Spurs | New York Knicks | 4–1 | Tim Duncan (San Antonio Spurs) |\n| 2000 | Los Angeles Lakers | Indiana Pacers | 4–2 | Shaquille O'Neal (Los Angeles Lakers) |\n| 2001 | Los Angeles Lakers | Philadelphia 76ers | 4–1 | Shaquille O'Neal (Los Angeles Lakers) |\n| 2002 | Los Angeles Lakers | New Jersey Nets | 4–2 | Shaquille O'Neal (Los Angeles Lakers) |\n| 2003 | San Antonio Spurs | New Jersey Nets | 4–2 | Tim Duncan (San Antonio Spurs) |\n| 2004 | Detroit Pistons | Los Angeles Lakers | 4–1 | Chauncey Billups (Detroit Pistons) |\n| 2005 | San Antonio Spurs | Detroit Pistons | 4–3 | Tim Duncan (San Antonio Spurs) |\n| 2006 | Miami Heat | Dallas Mavericks | 4–2 | Dwyane Wade (Miami Heat) |\n| 2007 | San Antonio Spurs | Cleveland Cavaliers | 4–0 | Tony Parker (San Antonio Spurs) |\n| 2008 | Boston Celtics | Los Angeles Lakers | 4–2 | Paul Pierce (Boston Celtics) |\n| 2009 | Los Angeles Lakers | Orlando Magic | 4–1 | Kobe Bryant (Los Angeles Lakers) |\n| 2010 | Los Angeles Lakers | Boston Celtics | 4–3 | Kobe Bryant (Los Angeles Lakers) |\n| 2011 | Dallas Mavericks | Miami Heat | 4–2 | Dirk Nowitzki (Dallas Mavericks) |\n| 2012 | Miami Heat | Oklahoma City Thunder | 4–1 | LeBron James (Miami Heat) |\n| 2013 | Miami Heat | San Antonio Spurs | 4–3 | LeBron James (Miami Heat) |\n| 2014 | San Antonio Spurs | Miami Heat | 4–1 | Kawhi Leonard (San Antonio Spurs) |\n| 2015 | Golden State Warriors | Cleveland Cavaliers | 4–2 | Andre Iguodala (Golden State Warriors) |\n| 2016 | Cleveland Cavaliers | Golden State Warriors | 4–3 | LeBron James (Cleveland Cavaliers) |\n| 2017 | Golden State Warriors | Cleveland Cavaliers | 4–1 | Kevin Durant (Golden State Warriors) |\n| 2018 | Golden State Warriors | Cleveland Cavaliers | 4–0 | Kevin Durant (Golden State Warriors) |\n| 2019 | Toronto Raptors | Golden State Warriors | 4–2 | Kawhi Leonard (Toronto Raptors) |\n| 2020 | Los Angeles Lakers | Miami Heat | 4–2 | LeBron James (Los Angeles Lakers) |\n| 2021 | Milwaukee Bucks | Phoenix Suns | 4–2 | Giannis Antetokounmpo (Milwaukee Bucks) |\n| 2022 | Golden State Warriors | Boston Celtics | 4–2 | Stephen Curry (Golden State Warriors) |\n| 2023 | Denver Nuggets | Miami Heat | 4–1 | Nikola Jokić (Denver Nuggets) |\n| 2024 | Boston Celtics | Dallas Mavericks | 4–1 | Jaylen Brown (Boston Celtics) |\n| 2025 | Oklahoma City Thunder | Indiana Pacers | 4–3 | Shai Gilgeous-Alexander (Oklahoma City Thunder) |\n\nNotable unique series include several sweeps (4–0), such as the 1953 Minneapolis Lakers over the New York Knicks, the 1971 Milwaukee Bucks over the Baltimore Bullets, the 1983 Philadelphia 76ers over the Los Angeles Lakers, the 1995 Houston Rockets over the Orlando Magic, the 2007 San Antonio Spurs over the Cleveland Cavaliers, and the 2018 Golden State Warriors over the Cleveland Cavaliers. Upsets feature prominently in the 1969 Finals, where the aging Boston Celtics defeated the favored Los Angeles Lakers in seven games despite injuries, and the 2016 Finals, where the Cleveland Cavaliers overcame a 3–1 deficit against the dominant Golden State Warriors for their first championship. The 1976–77 season marked the ABA-NBA merger's impact, integrating four ABA teams (including the 1976 ABA champion New York Nets, who did not reach the NBA Finals that year) into the league structure without altering the prior championship lineage.\n\n### Most Successful Franchises\n\nThe Boston Celtics hold the record for the most NBA championships with 18 titles, achieved across various eras including their dominant runs in the 1950s and 1960s, as well as their 2024 victory. The Los Angeles Lakers follow closely with 17 championships, spanning from their early successes to multiple dynasties in the 1980s, 2000s, and beyond. The Golden State Warriors have secured 7 titles, bolstered by their recent dominance in the 2010s and 2022. The Chicago Bulls claim 6 championships, primarily from their Michael Jordan-led era in the 1990s, while the San Antonio Spurs have 5, all won between 1999 and 2014 under Gregg Popovich.\n\n| Franchise          | Championships | Years Won (Selected)                  |\n|--------------------|---------------|---------------------------------------|\n| Boston Celtics    | 18            | 1957, 1959–1966, 1968, 1969, 1974, 1976, 1981, 1984, 1986, 2008, 2024 |\n| Los Angeles Lakers| 17            | 1949–1950, 1952–1954 (as Minneapolis), 1972, 1980, 1982, 1985, 1987–1988, 2000–2002, 2009–2010, 2020 |\n| Golden State Warriors | 7         | 1947, 1956 (as Philadelphia), 1975, 2015, 2017–2018, 2022 |\n| Chicago Bulls     | 6             | 1991–1993, 1996–1998                  |\n| San Antonio Spurs | 5             | 1999, 2003, 2005, 2007, 2014          |\n\nThese totals reflect franchise histories, including championships won prior to relocations, ensuring continuity for teams that have moved cities. The Lakers' count incorporates five titles from their Minneapolis era (1949–1954), establishing the foundation for their Los Angeles success after relocating in 1960. Similarly, the Warriors' tally includes their 1947 and 1956 championships as the Philadelphia Warriors, before moving to San Francisco in 1962 and later to Oakland and back to San Francisco.\n\nSeveral franchises endure prolonged championship droughts, highlighting the challenges of sustained excellence in the league. The New York Knicks have the longest active drought among original NBA teams, with no title since 1973, spanning 52 seasons as of 2025. In contrast, recent breakthroughs have added new champions to the list, such as the Denver Nuggets claiming their first-ever title in 2023 after 56 years in the league. The Oklahoma City Thunder's 2025 victory marked their second franchise championship, the first since 1979 as the Seattle SuperSonics, ending a 46-year wait.\n\nGeographically, the Eastern Conference has historically outperformed the Western Conference in championships, holding a 41–38 edge as of the 2025 Finals, a disparity rooted in the early dominance of East Coast teams like the Celtics and Knicks before the league's expansion westward in the 1960s and 1970s. This imbalance has narrowed in recent decades with Western successes from franchises like the Lakers and Warriors, reflecting the NBA's growth and competitive realignment.\n\n## Appearances and Streaks\n\n### Finals Appearances by Team\n\nThe NBA Finals, contested annually since 1947, have seen participation from 25 different franchises across the league's history, with records combined for teams that have relocated or undergone name changes, such as the Philadelphia/San Francisco/Golden State Warriors and the Seattle SuperSonics/Oklahoma City Thunder. These appearances reflect a team's sustained excellence over decades, though outcomes vary widely, with championship wins forming a subset of total entries. The table below details the Finals appearances, wins, and losses for all 30 current NBA franchises as of after the 2025 NBA Finals.\n\n| Team                      | Appearances | Wins | Losses |\n|---------------------------|-------------|------|--------|\n| Atlanta Hawks             | 4           | 1    | 3      |\n| Boston Celtics            | 24          | 18   | 6      |\n| Brooklyn Nets             | 2           | 0    | 2      |\n| Charlotte Hornets         | 0           | 0    | 0      |\n| Chicago Bulls             | 6           | 6    | 0      |\n| Cleveland Cavaliers       | 5           | 1    | 4      |\n| Dallas Mavericks          | 3           | 1    | 2      |\n| Denver Nuggets            | 1           | 1    | 0      |\n| Detroit Pistons           | 6           | 3    | 3      |\n| Golden State Warriors     | 11          | 5    | 6      |\n| Houston Rockets           | 4           | 2    | 2      |\n| Indiana Pacers            | 2           | 0    | 2      |\n| Los Angeles Clippers      | 0           | 0    | 0      |\n| Los Angeles Lakers        | 32          | 17   | 15     |\n| Memphis Grizzlies         | 0           | 0    | 0      |\n| Miami Heat                | 7           | 3    | 4      |\n| Milwaukee Bucks           | 3           | 2    | 1      |\n| Minnesota Timberwolves    | 0           | 0    | 0      |\n| New Orleans Pelicans      | 0           | 0    | 0      |\n| New York Knicks           | 8           | 2    | 6      |\n| Oklahoma City Thunder     | 5           | 2    | 3      |\n| Orlando Magic             | 2           | 0    | 2      |\n| Philadelphia 76ers        | 7           | 3    | 4      |\n| Phoenix Suns              | 3           | 0    | 3      |\n| Portland Trail Blazers    | 3           | 1    | 2      |\n| Sacramento Kings          | 1           | 1    | 0      |\n| San Antonio Spurs         | 6           | 5    | 1      |\n| Toronto Raptors           | 1           | 1    | 0      |\n| Utah Jazz                 | 2           | 0    | 2      |\n| Washington Wizards        | 4           | 1    | 3      |\n\nThe Charlotte Hornets, Los Angeles Clippers, Memphis Grizzlies, Minnesota Timberwolves, and New Orleans Pelicans remain the only active franchises without a Finals appearance.\n\nOver the past several decades, the Eastern and Western Conferences have each accounted for 26 Finals berths since the 2000 season, reflecting balanced participation despite periodic surges by one conference.\n\n### Consecutive Appearances and Streaks\n\nThe Boston Celtics hold the record for the longest streak of consecutive NBA Finals appearances, reaching the championship series for ten straight years from 1957 to 1966 and winning eight of those matchups. This dominance under coach Red Auerbach and center Bill Russell established an era of unparalleled consistency for the franchise.\n\nOther significant team streaks include the Golden State Warriors' five consecutive Finals appearances from 2015 to 2019, during which they secured three championships behind stars Stephen Curry, Klay Thompson, and Kevin Durant. Earlier in league history, the Minneapolis Lakers achieved three straight appearances from 1952 to 1954, winning all three titles led by George Mikan.\n\nThe Los Angeles Lakers experienced a notable period of frequent Finals contention from 1959 to 1970, appearing eight times but suffering defeats in each series, marking the longest streak of consecutive Finals losses by any team. This run, often against the rival Celtics, highlighted the intensity of the era's competition despite the Lakers' talent including Elgin Baylor and Jerry West.\n\nUndefeated runs through the Finals series are exceptionally rare, occurring only nine times via 4-0 sweeps since the league's inception. Examples include the 1975 Golden State Warriors' sweep of the Washington Bullets, powered by Rick Barry's scoring, and the 2007 San Antonio Spurs' decisive 4-0 victory over the Cleveland Cavaliers, showcasing Tim Duncan's leadership.\n\nIn the modern era, the Miami Heat strung together four consecutive Finals appearances from 2011 to 2014, capturing back-to-back titles in 2012 and 2013 with LeBron James, Dwyane Wade, and Chris Bosh. This was followed by the Cleveland Cavaliers' four straight trips from 2015 to 2018, including a historic 2016 comeback from a 3-1 deficit against the Warriors to claim their first championship. Together, these efforts represented an eight-year sequence of Eastern Conference dominance in the Finals from 2011 to 2018.\n\n## Game and Series Records\n\n### Team Records in Finals Series\n\nThe Boston Celtics hold the highest winning percentage in NBA Finals series history, achieving 18 championships in 23 appearances for a .783 success rate, underscoring their unparalleled efficiency in title contests. In comparison, the Los Angeles Lakers lead in total appearances with 32 but have a .531 winning percentage with 17 titles.\n\nThe most dramatic series comeback occurred in 2016, when the Cleveland Cavaliers rallied from a 3-1 deficit to defeat the Golden State Warriors in seven games, the only such reversal in Finals history. This feat highlighted the rarity of overcoming a 3-1 hole in best-of-seven series, with prior instances typically favoring the leading team.\n\nOffensive output has varied significantly across eras, with the Toronto Raptors posting the highest team scoring average at 111.5 points per game during their 2019 championship series against the Warriors. Conversely, early NBA Finals featured much lower totals due to slower paces and defensive emphasis; for instance, the Chicago Stags averaged just 74.2 points per game in the 1947 Finals, emblematic of the league's low-scoring 1940s and 1950s.\n\nIn rebounding aggregates, the Lakers exemplified dominance during their 2000s three-peat era, averaging 41.3 total rebounds per game in the 2000 Finals en route to victory over the Pacers, fueled by Shaquille O'Neal's interior presence. Their series totals in rebounds during the 2000-2002 Finals underscored control of the boards, contributing to a combined 12-3 record in those matchups. For assists, the Lakers also showcased playmaking prowess in the 2000s, averaging 23.3 per game in 2000 while leveraging Shaq-Kobe pick-and-rolls effectively.\n\n### Individual Records in Single Finals Games\n\nThe individual records in single NBA Finals games represent extraordinary feats of athleticism and skill under the highest pressure, often defining moments in championship history. These peaks, tracked since the league's inception, highlight players who dominated in scoring, rebounding, assisting, or all-around play during isolated contests. While series aggregates provide broader context, single-game marks underscore peak performances that can swing outcomes, such as Elgin Baylor's iconic explosion in a losing effort. Official statistics from the NBA, beginning with comprehensive tracking in the 1940s, confirm these benchmarks, with modern eras introducing multifaceted stats like triple-doubles.\n\nIn scoring, the record belongs to Elgin Baylor, who tallied 61 points for the Los Angeles Lakers against the Boston Celtics in Game 5 of the 1962 NBA Finals on April 14, 1962, despite a 126-115 loss; Baylor shot 22-of-46 from the field in 47 minutes. Rick Barry holds the second-highest mark with 55 points for the San Francisco Warriors versus the Philadelphia 76ers in Game 3 of the 1967 NBA Finals on April 18, 1967, leading to a 127-108 victory on 21-of-34 shooting. Other notable highs include Michael Jordan's 55 points for the Chicago Bulls against the Phoenix Suns in Game 4 of the 1993 NBA Finals on June 16, 1993. These outbursts, often in eras with higher pace and fewer three-pointers, illustrate the evolution of offensive efficiency.\n\nRebounding records emphasize the defensive prowess of 1960s big men, with Bill Russell securing 40 rebounds for the Boston Celtics against the Los Angeles Lakers in Game 3 of the 1962 NBA Finals on April 18, 1962, in a 117-115 win. Russell matched this feat in Game 2 of the 1960 NBA Finals on March 29, 1960, also versus the Lakers. Wilt Chamberlain's best Finals rebounding game came with 38 boards for the Philadelphia 76ers against the San Francisco Warriors in Game 4 of the 1967 NBA Finals on April 28, 1967, during a 122-119 overtime victory; he repeated 38 in Game 1 of the 1964 NBA Finals. These totals, achieved in games averaging around 120 possessions, reflect the physicality of mid-century basketball, where centers like Russell and Chamberlain routinely controlled the glass.\n\nThe single-game assists record is held by Magic Johnson, who dished out 21 for the Los Angeles Lakers against the Boston Celtics in Game 3 of the 1984 NBA Finals on June 3, 1984, contributing to a 137-104 rout. Johnson also reached 20 assists twice: in Game 5 of the 1991 NBA Finals versus the Chicago Bulls on June 12, 1991, and Game 1 of the 1987 NBA Finals against the same opponent on June 4, 1987. Earlier standouts include Walt Frazier's 19 assists for the New York Knicks against the Los Angeles Lakers in Game 3 of the 1970 NBA Finals on May 8, 1970. These playmaking highs, peaking in the fast-paced 1980s, demonstrate how point guards like Johnson orchestrated offenses to overwhelm defenses.\n\nTriple-doubles—games with at least 10 in points, rebounds, and assists—have become a hallmark of versatile stars in the Finals, with 37 recorded since 1958, though official tracking began in 1973. LeBron James holds the most with 11, including a 40-point, 14-rebound, 11-assist effort for the Cleveland Cavaliers against the Golden State Warriors in Game 2 of the 2015 NBA Finals on June 14, 2015, in a 95-93 loss, and a 39-16-11 line in Game 1 of that series on June 7, 2015. Magic Johnson follows with eight, such as his 14-11-21 stat line in the aforementioned 1984 Game 3. Other notables include Draymond Green's 16-11-10 for the Warriors versus the Cavaliers in Game 5 of the 2015 NBA Finals on June 16, 2015, and Wilt Chamberlain's 10-38-10 for the Warriors against the 76ers in Game 4 of the 1967 NBA Finals. These all-around performances, increasingly common since the 2010s, highlight the shift toward positionless basketball.\n\n| Category | Player | Stat Line | Game Details |\n|----------|--------|-----------|--------------|\n| Scoring | Elgin Baylor | 61 points | 1962 Finals Game 5, LAL vs. BOS (L) |\n| Rebounding | Bill Russell | 40 rebounds | 1962 Finals Game 3, BOS vs. LAL (W) |\n| Assists | Magic Johnson | 21 assists | 1984 Finals Game 3, LAL vs. BOS (W) |\n| Triple-Double | LeBron James | 40-14-11 | 2015 Finals Game 2, CLE vs. GSW (L) |\n\n## Player Achievements\n\n### Finals Most Valuable Player Award\n\nThe Bill Russell NBA Finals Most Valuable Player (MVP) Award is an annual honor given by the National Basketball Association (NBA) to the player judged to have exhibited superior play during the NBA Finals championship series. The award recognizes the most impactful performer across the best-of-seven series, emphasizing contributions to team success rather than individual statistics alone. It has been presented since the 1969 NBA Finals, marking the first official recognition of a Finals standout by the league. In 2009, NBA Commissioner David Stern announced the renaming of the award to honor Bill Russell, the legendary Boston Celtics center who won 11 championships but never had the opportunity to receive the Finals MVP during his playing career, as the award began after his final season.\n\nThe selection process involves a panel of 11 media members who cover the NBA Finals, chosen in advance by the league. These voters cast ballots immediately following the conclusion of Game 7 or the final game of the series, each selecting one player from the eligible pool of participants. The criteria prioritize overall series impact, including offensive and defensive performance, clutch plays, leadership, and versatility, rather than a single game's dominance. The player receiving the most first-place votes wins, with ties resolved by the odd number of voters to ensure a clear outcome.\n\nSeveral players have won the award multiple times, highlighting sustained excellence in high-stakes Finals play. Michael Jordan leads with six awards, earned with the Chicago Bulls in 1991, 1992, 1993, 1996, 1997, and 1998. LeBron James follows with four, achieved with the Miami Heat in 2012 and 2013 and with the Cleveland Cavaliers in 2016, plus one with the Los Angeles Lakers in 2020. Shaquille O'Neal and Magic Johnson each secured three, with O'Neal's coming consecutively for the Los Angeles Lakers from 2000 to 2002, and Johnson's for the Lakers in 1980, 1982, and 1987. More recently, Jaylen Brown won the award in 2024 with the Boston Celtics, and Shai Gilgeous-Alexander became the first Canadian recipient in 2025 with the Oklahoma City Thunder.\n\nThe award has not been without controversy, particularly in cases where the recipient's selection sparked debate over fairness and criteria. In 1969, Jerry West became the only player to win Finals MVP on a losing team, averaging 37.9 points, 7.4 assists, and 4.7 rebounds per game for the Lakers in their defeat to the Boston Celtics; West later described the honor as embarrassing, viewing it as a consolation rather than a true merit-based achievement. Similarly, the 2013 award to LeBron James drew criticism from some observers who argued that Ray Allen's dramatic game-tying three-pointer in Game 6—off a crucial offensive rebound by Chris Bosh—warranted shared recognition, as it prevented a Spurs sweep and shifted the series momentum decisively. Despite these debates, James received unanimous votes for his series-long dominance.\n\n### Career and Series Player Records\n\nLeBron James holds the record for most points scored in NBA Finals history, with 2,719 points across 10 appearances as of November 2025. This surpasses Jerry West's previous mark of 1,679 points, accumulated over 9 Finals appearances from 1962 to 1973. James's total underscores his longevity and scoring prowess in high-stakes playoff environments, where he has averaged 28.4 points per game in 56 contests.\n\nNotable single-series performances highlight scoring dominance, such as Michael Jordan's 33.6 points per game average across his six undefeated Finals appearances with the Chicago Bulls. On the rebounding front, Bill Russell established an enduring benchmark with a career Finals average of 24.5 rebounds per game over 12 series, totaling 1,718 boards while anchoring the Boston Celtics' dynasty.\n\nIn terms of championships secured, Russell leads all players with 11 NBA titles, all won in the Finals during his tenure with the Celtics from 1956 to 1969. Michael Jordan follows with six, achieved consecutively from 1991 to 1993 and 1996 to 1998.\n\nDefensive impacts are exemplified by Hakeem Olajuwon's career total of 41 blocks in the NBA Finals, primarily from his two championship runs with the Houston Rockets in 1994 and 1995. Modern defensive leaders in steals include LeBron James with 93 career Finals thefts, reflecting his all-around game in 10 series.\n\nThree-point shooting has evolved prominently in recent decades, with Stephen Curry leading all players in career Finals threes made at 152, spanning six appearances. In the 2022 Finals, Curry exemplified efficiency by shooting 43.7% from beyond the arc (31-for-71) over six games against the Boston Celtics, helping secure the Warriors' fourth title.\n\n| Category | Leader | Total/Average | Appearances |\n|----------|--------|---------------|-------------|\n| Points (Career) | LeBron James | 2,719 points | 10 |\n| PPG (Series Avg.) | Michael Jordan | 33.6 PPG | 6 |\n| Rebounds (Career Avg.) | Bill Russell | 24.5 RPG | 12 |\n| Championships Won | Bill Russell | 11 | 12 |\n| Blocks (Career) | Hakeem Olajuwon | 41 | 2 |\n| Steals (Career, Modern) | LeBron James | 93 | 10 |\n| 3-Pointers Made (Career) | Stephen Curry | 152 | 6 |\n\n## Sponsorship and Broadcasting\n\n### Sponsorship and Naming Evolution\n\nThe NBA Finals originated as the BAA World Series in 1947, reflecting the league's initial identity as the Basketball Association of America (BAA), with the inaugural series contested between the Philadelphia Warriors and Chicago Stags. Following the 1949 merger between the BAA and the National Basketball League to form the National Basketball Association (NBA), the championship series was rebranded as the NBA World Series, a name that persisted through the 1950s and into the 1980s to emphasize its status as the league's premier postseason event. This nomenclature drew inspiration from Major League Baseball's World Series, underscoring the NBA's aspiration for similar cultural prominence in professional sports.\n\nThe shift to the modern \"NBA Finals\" moniker occurred in 1986, marking a streamlined branding that has endured to the present day and aligning with the league's growing global identity under Commissioner David Stern. Prior to this, occasional variations like the \"NBA Championship Series\" appeared in the early 1980s, but the \"Finals\" title solidified the event's concise, high-stakes connotation. Concurrently, the championship trophy evolved to symbolize this branding progression; it was first officially named the Walter A. Brown Trophy in 1977 after the Boston Celtics founder and early NBA proponent, replacing earlier, less formalized awards from the BAA and early NBA eras. In 1984, the trophy was renamed the Larry O'Brien Championship Trophy in honor of the NBA commissioner who oversaw the league's expansion and merger with the American Basketball Association, featuring a sterling silver design depicting a basketball passing through a net. This iteration, standing about 24 inches tall and weighing 15 pounds, remains the award presented to champions as of 2025.\n\nSponsorship integration into the NBA Finals' naming and presentation remained minimal through the league's first seven decades, with corporate involvement largely confined to general league partnerships rather than event-specific titling, preserving the series' traditional prestige. This changed in 2018 when YouTube TV secured a multiyear deal to become the first-ever presenting sponsor, rebranding the event as \"The NBA Finals presented by YouTube TV,\" which includes prominent logo placements on broadcasts, courtside signage, and promotional materials to enhance visibility among streaming audiences. The partnership, extended into 2025, represents a pivotal evolution in monetizing the Finals' massive reach without altering the core name, as evidenced by the 2025 campaign featuring nostalgic tributes to past moments.\n\nIn the 2020s, the NBA's embrace of legalized sports betting further influenced Finals branding through league-wide authorized gaming operator partnerships, such as those with DraftKings and FanDuel established in 2021, which integrate odds displays and promotional integrations into broadcasts and arena experiences without direct title sponsorship of the series itself. Additional collaborators like BetMGM and Caesars Sportsbook, designated as official betting partners by 2025, contribute to enhanced in-game data feeds and fan engagement tools that extend to Finals coverage, amplifying commercial opportunities amid the U.S. betting market's expansion post-2018 Supreme Court ruling. As of November 2025, the NBA Finals retains no overarching primary sponsor beyond the YouTube TV presenting role, with broader league deals—valued in the billions annually—subtly shaping event aesthetics through uniform branding elements like sponsor logos on uniforms and digital overlays.\n\n### Media Coverage and Broadcast History\n\nThe NBA Finals' media coverage began primarily through radio in the 1940s, when national broadcasts were limited and mostly local, reflecting the league's early stages as the Basketball Association of America before its 1949 merger into the NBA. The transition to television marked a pivotal shift, with the first national TV broadcast of a Finals game occurring in 1954 on the DuMont Network, covering the series between the Minneapolis Lakers and Syracuse Nationals, narrated by pioneering announcer Marty Glickman. Throughout the 1970s and into the 1980s, CBS secured exclusive national broadcast rights for the Finals, airing the series live and contributing to the league's growing prominence during eras like the Bill Russell dynasty and the rise of stars such as Wilt Chamberlain.\n\nThe advent of cable television in the 1980s expanded coverage, as TBS began airing select NBA games in 1984, followed by TNT's entry in 1988 under a joint agreement with TBS to broadcast regular-season and playoff contests, including portions of the Finals through the early 2000s. This cable era complemented over-the-air networks, but ABC assumed exclusive rights to the Finals starting in 2003, delivering comprehensive live coverage that has continued uninterrupted, featuring high-profile announcing teams like Mike Breen and analysts such as Jeff Van Gundy. Viewership trends have fluctuated significantly; the 1998 Finals between Michael Jordan's Chicago Bulls and the Utah Jazz peaked with an average of 29 million viewers per game, including a record 35.89 million for Game 6, driven by Jordan's iconic \"Last Shot.\" In contrast, the 2020 Finals in the Orlando bubble averaged just 7.5 million viewers amid the COVID-19 pandemic's disruptions, marking a historic low before rebounding to 11.3 million on average for the 2024 Boston Celtics-Dallas Mavericks series.\n\nInternationally, ESPN and ABC have produced global feeds of the Finals since the 1990s, distributed through partnerships with local broadcasters worldwide to reach audiences in over 200 countries. The launch of NBA League Pass in 1994 revolutionized access, offering subscription-based streaming of Finals games and archives to international fans, with consumption surging in regions like Europe and Asia due to targeted social media promotion. By 2025, digital platforms amplified this growth, as connected TV (CTV) and streaming via League Pass contributed to a viewership surge, with the Finals between the Indiana Pacers and Oklahoma City Thunder averaging 10.3 million U.S. viewers alongside record international digital engagement exceeding prior years by over 20%. Sponsorship deals have notably influenced ad integrations during these broadcasts, enhancing revenue through prominent placements.",
  "external_references": [
    {
      "text": "History Nba Champions",
      "url": "https://www.nba.com/news/history-nba-champions",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Trophy 020712.html",
      "url": "https://www.nba.com/lakers/news/trophy_020712.html",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Season Recaps Index",
      "url": "https://www.nba.com/news/history-season-recaps-index",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Coast To Coast Finals Matchup Brings Attention Back To Old 2 3 2 Format",
      "url": "https://www.nba.com/news/coast-to-coast-finals-matchup-brings-attention-back-to-old-2-3-2-format",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Most Championships Nba History",
      "url": "https://www.nba.com/news/most-championships-nba-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals History Top Player Team Records Stats",
      "url": "https://www.espn.com/nba/story/_/id/45166097/nba-finals-history-top-player-team-records-stats",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Format Change 2014",
      "url": "https://pr.nba.com/nba-finals-format-change-2014/",
      "domain": "pr.nba.com",
      "type": "citation"
    },
    {
      "text": "Rule No 5 Scoring And Timing",
      "url": "https://official.nba.com/rule-no-5-scoring-and-timing/",
      "domain": "official.nba.com",
      "type": "citation"
    },
    {
      "text": "Rule No 13 Instant Replay",
      "url": "https://official.nba.com/rule-no-13-instant-replay/",
      "domain": "official.nba.com",
      "type": "citation"
    },
    {
      "text": "Rule No 14 Coachs Challenge",
      "url": "https://official.nba.com/rule-no-14-coachs-challenge/",
      "domain": "official.nba.com",
      "type": "citation"
    },
    {
      "text": "Adam Silver Celtics Larry Obrien Championship Trophy Presentation 2024 Nba Finals",
      "url": "https://www.nba.com/watch/video/adam-silver-celtics-larry-obrien-championship-trophy-presentation-2024-nba-finals",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2025 Nba Playoffs Standings And Bracket Updates",
      "url": "https://www.nba.com/news/2025-nba-playoffs-standings-and-bracket-updates",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Play In Tournament",
      "url": "https://www.nba.com/news/nba-play-in-tournament",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Tiebreaker Procedures.pdf",
      "url": "https://ak-static-int.nba.com/wp-content/uploads/sites/2/2017/06/NBA_Tiebreaker_Procedures.pdf",
      "domain": "ak-static-int.nba.com",
      "type": "citation"
    },
    {
      "text": "Standings",
      "url": "https://www.nba.com/standings",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://careers.nba.com/history/",
      "domain": "careers.nba.com",
      "type": "citation"
    },
    {
      "text": "On This Day In Nba History August 3 Baa Nbl Merge To Form Nba",
      "url": "https://www.si.com/fannation/nba/fastbreak/news/on-this-day-in-nba-history-august-3-baa-nbl-merge-to-form-nba",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "History Top Moments Warriors First Nba Title 1947",
      "url": "https://www.nba.com/news/history-top-moments-warriors-first-nba-title-1947",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "194704220phw.html",
      "url": "https://www.basketball-reference.com/boxscores/194704220PHW.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Merger.html",
      "url": "https://nbahoopsonline.com/History/articles/merger.html",
      "domain": "nbahoopsonline.com",
      "type": "citation"
    },
    {
      "text": "Long Live The Minneapolis Lakers How One Team Changed The Trajectory Of Minnesota Sports",
      "url": "https://www.minnesotamonthly.com/lifestyle/sports-2/long-live-the-minneapolis-lakers-how-one-team-changed-the-trajectory-of-minnesota-sports/",
      "domain": "minnesotamonthly.com",
      "type": "citation"
    },
    {
      "text": "This Day In History George Mikan Leads Lakers In 1949 Finals Clincher",
      "url": "https://www.nba.com/watch/video/this-day-in-history-george-mikan-leads-lakers-in-1949-finals-clincher",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "1949 1950",
      "url": "https://projects.latimes.com/lakers/season/1949-1950/",
      "domain": "projects.latimes.com",
      "type": "citation"
    },
    {
      "text": "195004230mnl.html",
      "url": "https://www.basketball-reference.com/boxscores/195004230MNL.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "9223799002",
      "url": "https://www.usatoday.com/story/sports/nba/2022/01/26/rochester-royals-were-1951-nba-champions-what-happened-team/9223799002/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Looking Back At Rochester Royals Championship 65 Years Later",
      "url": "https://13wham.com/news/local/looking-back-at-rochester-royals-championship-65-years-later",
      "domain": "13wham.com",
      "type": "citation"
    },
    {
      "text": "Nbafinal1955.htm",
      "url": "https://goldenrankings.com/NBAFinal1955.htm",
      "domain": "goldenrankings.com",
      "type": "citation"
    },
    {
      "text": "Nba Championship 60 Years Ago Fiery Pistons Tie Syracuse Nats 2 2.html",
      "url": "https://www.syracuse.com/kirst/2015/04/nba_championship_60_years_ago_fiery_pistons_tie_syracuse_nats_2-2.html",
      "domain": "syracuse.com",
      "type": "citation"
    },
    {
      "text": "194704160phw.html",
      "url": "https://www.basketball-reference.com/boxscores/194704160PHW.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1946 47.html",
      "url": "https://nbahoopsonline.com/Articles/Seasons/1946-47.html",
      "domain": "nbahoopsonline.com",
      "type": "citation"
    },
    {
      "text": "Nba Facilities",
      "url": "https://www.sportsbusinessjournal.com/Journal/Issues/2021/10/11/In-Depth/NBA-facilities/",
      "domain": "sportsbusinessjournal.com",
      "type": "citation"
    },
    {
      "text": "Nba Playoff Reform Adam Silver History",
      "url": "https://fansided.com/2017/10/12/nba-playoff-reform-adam-silver-history/",
      "domain": "fansided.com",
      "type": "citation"
    },
    {
      "text": "Boston Celtics Nba Finals History Matchups Mvps Other Stats",
      "url": "https://www.espn.com/nba/story/_/id/40337041/boston-celtics-nba-finals-history-matchups-mvps-other-stats",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "History Nba Legend Bill Russell",
      "url": "https://www.nba.com/news/history-nba-legend-bill-russell",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Bill Russell Legacy Nba Ambassador Defensive Force Leader Bay Area Original Dynasty",
      "url": "https://www.espn.com/nba/story/_/id/34329069/bill-russell-legacy-nba-ambassador-defensive-force-leader-bay-area-original-dynasty",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Misc 20211220 Celtics Decade Night Recapping 1960s",
      "url": "https://www.nba.com/celtics/news/sidebar/misc-20211220-celtics-decade-night-recapping-1960s",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Celtics Lakers History Central",
      "url": "https://www.espn.com/blog/boston/celtics/post/_/id/4674834/celtics-lakers-history-central",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "History Finals Moments Don Nelsons Shot Helps Secure Win In Game 7",
      "url": "https://www.nba.com/news/history-finals-moments-don-nelsons-shot-helps-secure-win-in-game-7",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "1969 Nba Finals Celtics Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/1969-nba-finals-celtics-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "How Many Nba Teams Are There A Brief History Of Expansion And How We Got To 30",
      "url": "https://www.si.com/nba/how-many-nba-teams-are-there-a-brief-history-of-expansion-and-how-we-got-to-30",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "1958 Nba Finals Hawks Vs Celtics.html",
      "url": "https://www.basketball-reference.com/playoffs/1958-nba-finals-hawks-vs-celtics.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Nba 75 From Red To Phil To Pop What Does It Take To Be The Cream Of The Coaching Crop",
      "url": "https://www.nytimes.com/athletic/3047259/2022/01/24/nba-75-from-red-to-phil-to-pop-what-does-it-take-to-be-the-cream-of-the-coaching-crop/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Boston Celtics Dynasty 1960s Roster Players",
      "url": "https://www.history.com/articles/boston-celtics-dynasty-1960s-roster-players",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "When Was Every Nba Team Created Key Years Know",
      "url": "https://www.espn.com/nba/story/_/id/43226684/when-was-every-nba-team-created-key-years-know",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Nba Merges With Aba",
      "url": "https://www.history.com/this-day-in-history/june-17/nba-merges-with-aba",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "Here Comes Willis",
      "url": "https://www.nba.com/watch/video/here-comes-willis",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Abduljabbar Traded By Bucks For Four Lakers Jabbar Traded To Lakers.html",
      "url": "https://www.nytimes.com/1975/06/17/archives/abduljabbar-traded-by-bucks-for-four-lakers-jabbar-traded-to-lakers.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "1975 Nba Finals Warriors Vs Bullets.html",
      "url": "https://www.basketball-reference.com/playoffs/1975-nba-finals-warriors-vs-bullets.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "History Finals Moments Rick Barry Underdog Warriors Sweep Bullets",
      "url": "https://www.nba.com/news/history-finals-moments-rick-barry-underdog-warriors-sweep-bullets",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Nba Top Moments 1980s",
      "url": "https://www.nba.com/news/history-nba-top-moments-1980s",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "1984 Nba Finals Lakers Vs Celtics.html",
      "url": "https://www.basketball-reference.com/playoffs/1984-nba-finals-lakers-vs-celtics.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1985 Nba Finals Lakers Vs Celtics.html",
      "url": "https://www.basketball-reference.com/playoffs/1985-nba-finals-lakers-vs-celtics.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "1987 Nba Finals Celtics Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/1987-nba-finals-celtics-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Detroit Pistons Nba Championships",
      "url": "https://www.nba.com/news/detroit-pistons-nba-championships",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "199206140chi.html",
      "url": "https://www.basketball-reference.com/boxscores/199206140CHI.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "199306130chi.html",
      "url": "https://www.basketball-reference.com/boxscores/199306130CHI.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "200106080lal.html",
      "url": "https://www.basketball-reference.com/boxscores/200106080LAL.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "On The Day 6 12 02 Dazzling Dominant Dynasty Lakers Three Peat",
      "url": "https://www.nba.com/lakers/news/on-the-day-6-12-02-dazzling-dominant-dynasty-lakers-three-peat",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2002 Nba Finals Nets Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2002-nba-finals-nets-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "San Antonio Spurs Classic Games",
      "url": "https://www.nba.com/watch/list/collection/san-antonio-spurs-classic-games",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals 2004",
      "url": "https://www.nba.com/watch/list/collection/nba-finals-2004",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2004 Nba Finals Pistons Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2004-nba-finals-pistons-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "2006 Nba Finals Heat Vs Mavericks.html",
      "url": "https://www.basketball-reference.com/playoffs/2006-nba-finals-heat-vs-mavericks.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "History Top Moments Heat Super Team 2010",
      "url": "https://www.nba.com/news/history-top-moments-heat-super-team-2010",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "E0d0eeb1299f4fda18f1c35b",
      "url": "https://www.sportingnews.com/us/nba/news/lebron-james-decision-free-agency-cleveland-south-beach/e0d0eeb1299f4fda18f1c35b",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "Lebron James Hit Free Agency Again Anything Possible Nba",
      "url": "https://www.espn.com/nba/story/_/id/23303509/lebron-james-hit-free-agency-again-anything-possible-nba",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "History Season Review 2010 11",
      "url": "https://www.nba.com/news/history-season-review-2010-11",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Lebron James Past Finals Trips History",
      "url": "https://www.nba.com/lebron-james-past-finals-trips-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Spurs Heat",
      "url": "https://www.espn.com/nba/game/_/gameId/400559376/spurs-heat",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2014 Nba Finals Heat Vs Spurs.html",
      "url": "https://www.basketball-reference.com/playoffs/2014-nba-finals-heat-vs-spurs.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Golden State Warriors Nba Championships",
      "url": "https://www.nba.com/news/golden-state-warriors-nba-championships",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Nba Top Moments 2010s",
      "url": "https://www.nba.com/news/history-nba-top-moments-2010s",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "2018 Nba Finals Cavaliers Vs Warriors.html",
      "url": "https://www.basketball-reference.com/playoffs/2018-nba-finals-cavaliers-vs-warriors.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Warriors Cavaliers",
      "url": "https://www.espn.com/nba/game/_/gameId/400796850/warriors-cavaliers",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Lakers Win Nba Finals No Coronavirus Cases Reported In Bubble",
      "url": "https://www.npr.org/2020/10/12/923064484/lakers-win-nba-finals-no-coronavirus-cases-reported-in-bubble",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "2020 Nba Finals Heat Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2020-nba-finals-heat-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Play In Tournament History",
      "url": "https://www.nba.com/news/play-in-tournament-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Who Won Nba Finals Championship Winners Year",
      "url": "https://www.espn.com/nba/story/_/id/37736110/who-won-nba-finals-championship-winners-year",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Celtics Jaylen Brown Named 2024 Finals Mvp",
      "url": "https://www.nba.com/news/celtics-jaylen-brown-named-2024-finals-mvp",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba To Have Seven Different Champions In Seven Years As Parity Reigns",
      "url": "https://www.sportsnet.ca/nba/article/nba-to-have-seven-different-champions-in-seven-years-as-parity-reigns/",
      "domain": "sportsnet.ca",
      "type": "citation"
    },
    {
      "text": "History Finals Mvp Winners",
      "url": "https://www.nba.com/news/history-finals-mvp-winners",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Playoffs",
      "url": "https://www.basketball-reference.com/playoffs/",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals",
      "url": "https://www.nba.com/playoffs/2025/nba-finals",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Thunder Shai Gilgeous Alexander Named Nba Finals Mvp",
      "url": "https://www.espn.com/nba/story/_/id/45566292/thunder-shai-gilgeous-alexander-named-nba-finals-mvp",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Which Nba Teams Won Most Championships",
      "url": "https://www.espn.com/nba/story/_/id/40291233/which-nba-teams-won-most-championships",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Nba Champions By Year Complete List Of Nba Finals Winners",
      "url": "https://www.foxsports.com/stories/nba/nba-champions-by-year-complete-list-of-nba-finals-winners",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "Oklahoma City Thunder Nba Finals Championship Indiana Pacers",
      "url": "https://www.foxsports.com/stories/nba/oklahoma-city-thunder-nba-finals-championship-indiana-pacers",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "Oklahoma City Thunders Nba Championships",
      "url": "https://www.nba.com/news/oklahoma-city-thunders-nba-championships",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Series.html",
      "url": "https://www.basketball-reference.com/playoffs/series.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Team Consecutive Finals.htm",
      "url": "https://www.landofbasketball.com/statistics/team_consecutive_finals.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Lakers Championships Finals Appearances History",
      "url": "https://lakeshowlife.com/2023/08/23/lakers-championships-finals-appearances-history/",
      "domain": "lakeshowlife.com",
      "type": "citation"
    },
    {
      "text": "14lakers History In The Nba Finals",
      "url": "https://www.si.com/nba/2009/06/15/14lakers-history-in-the-nba-finals",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Looking Back Every Sweep Nba Finals History",
      "url": "https://www.si.com/nba/looking-back-every-sweep-nba-finals-history",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Last Time There Was A Sweep In Nba Finals Boston Celtics Cant Join List Of Teams Who Won Title Going 4 0",
      "url": "https://www.cbssports.com/nba/news/last-time-there-was-a-sweep-in-nba-finals-boston-celtics-cant-join-list-of-teams-who-won-title-going-4-0/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "I82xbs1fpisr19fb1g9pn01f4",
      "url": "https://www.sportingnews.com/ca/nba/news/nba-finals-most-consecutive-finals-appearances-by-a-franchise/i82xbs1fpisr19fb1g9pn01f4",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "What Biggest Comebacks Nba Finals History",
      "url": "https://www.espn.com/nba/story/_/id/40337606/what-biggest-comebacks-nba-finals-history",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2019 Warriors Vs Raptors.htm",
      "url": "https://www.landofbasketball.com/playoffs_series/2019_warriors_vs_raptors.htm",
      "domain": "landofbasketball.com",
      "type": "citation"
    },
    {
      "text": "Lowest Scoring Team Nba Finals Series",
      "url": "https://www.statmuse.com/nba/ask/lowest-scoring-team-nba-finals-series",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "2000 Nba Finals Pacers Vs Lakers.html",
      "url": "https://www.basketball-reference.com/playoffs/2000-nba-finals-pacers-vs-lakers.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Pts Game Finals.html",
      "url": "https://www.basketball-reference.com/leaders/pts_game_finals.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "History All Time Records",
      "url": "https://www.nba.com/news/history-all-time-records",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Trb Game Finals.html",
      "url": "https://www.basketball-reference.com/leaders/trb_game_finals.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Most Rebounds In An Nba Finals Game",
      "url": "https://www.nba.com/news/most-rebounds-in-an-nba-finals-game",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Ast Game Finals.html",
      "url": "https://www.basketball-reference.com/leaders/ast_game_finals.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Most Assists In An Nba Finals Game",
      "url": "https://www.nba.com/news/most-assists-in-an-nba-finals-game",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Triple Doubles.html",
      "url": "https://sporviz.com/data/nba-finals-triple-doubles.html",
      "domain": "sporviz.com",
      "type": "citation"
    },
    {
      "text": "Most Triple Doubles In Nba Finals History",
      "url": "https://www.nba.com/news/most-triple-doubles-in-nba-finals-history",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Mvp Voting Explanation Winners History",
      "url": "https://www.si.com/nba/nba-finals-mvp-voting-explanation-winners-history",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "52096452007",
      "url": "https://www.fosters.com/story/sports/pro/2009/02/15/nba-names-finals-mvp-award/52096452007/",
      "domain": "fosters.com",
      "type": "citation"
    },
    {
      "text": "Zf7ugylewr6owlqzhpqqw46b",
      "url": "https://www.sportingnews.com/us/nba/news/nba-finals-mvp-voting-process-winners-by-year/zf7ugylewr6owlqzhpqqw46b",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Mvp Voting Process Heres How The Mvp Will Be Decided And Full List Of Past Winners 101749329348493.html",
      "url": "https://www.hindustantimes.com/sports/us-sports/nba-finals-mvp-voting-process-heres-how-the-mvp-will-be-decided-and-full-list-of-past-winners-101749329348493.html",
      "domain": "hindustantimes.com",
      "type": "citation"
    },
    {
      "text": "Finals Mvp.html",
      "url": "https://www.basketball-reference.com/awards/finals_mvp.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Jaylen Brown Named 2024 Nba Finals Mvp",
      "url": "https://www.nba.com/news/jaylen-brown-named-2024-nba-finals-mvp",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Shai Gilgeous Alexander Named 2025 Nba Finals Mvp",
      "url": "https://www.nba.com/news/shai-gilgeous-alexander-named-2025-nba-finals-mvp",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "San Antonio Spurs How They Let The 2013 Nba Finals Slip Away",
      "url": "https://hoopshabit.com/2013/06/21/san-antonio-spurs-how-they-let-the-2013-nba-finals-slip-away/",
      "domain": "hoopshabit.com",
      "type": "citation"
    },
    {
      "text": "Jamesle01.html",
      "url": "https://www.basketball-reference.com/players/j/jamesle01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Westje01.html",
      "url": "https://www.basketball-reference.com/players/w/westje01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Lebron James",
      "url": "https://www.nba.com/player/2544/lebron-james",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Jordami01.html",
      "url": "https://www.basketball-reference.com/players/j/jordami01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Russebi01.html",
      "url": "https://www.basketball-reference.com/players/r/russebi01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Olajuha01.html",
      "url": "https://www.basketball-reference.com/players/o/olajuha01.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Stl Career Finals.html",
      "url": "https://www.basketball-reference.com/leaders/stl_career_finals.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Fg3 Career Finals.html",
      "url": "https://www.basketball-reference.com/leaders/fg3_career_finals.html",
      "domain": "basketball-reference.com",
      "type": "citation"
    },
    {
      "text": "Research",
      "url": "https://www.espn.com/nba/research/",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Nba Champions By Year Complete History And Results Of The Nba Finals",
      "url": "https://www.si.com/nba/nba-champions-by-year-complete-history-and-results-of-the-nba-finals",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals",
      "url": "https://www.dictionary.com/e/historical-current-events/nba-finals/",
      "domain": "dictionary.com",
      "type": "citation"
    },
    {
      "text": "Nba Youtube Tv Announce First Ever Presenting Partnership Nba Finals",
      "url": "https://pr.nba.com/nba-youtube-tv-announce-first-ever-presenting-partnership-nba-finals/",
      "domain": "pr.nba.com",
      "type": "citation"
    },
    {
      "text": "Unforgettable Awaits 2025 Nba Finals",
      "url": "https://www.nba.com/news/unforgettable-awaits-2025-nba-finals",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Draftkings Fanduel Become Nbas Co Official Sports Betting Partners",
      "url": "https://www.nba.com/news/draftkings-fanduel-become-nbas-co-official-sports-betting-partners",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Official Nba Gaming Partners And Operators 2",
      "url": "https://www.nba.com/nbabet/official-nba-gaming-partners-and-operators-2",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "History Season Review 1946 47",
      "url": "https://www.nba.com/news/history-season-review-1946-47",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "A Storied History Remembering Nba Finals Through A Broadcast Lens",
      "url": "https://www.sportsbroadcastjournal.com/a-storied-history-remembering-nba-finals-through-a-broadcast-lens/",
      "domain": "sportsbroadcastjournal.com",
      "type": "citation"
    },
    {
      "text": "The History Of The Nba On Nbc Everything To Know",
      "url": "https://www.nbc.com/nbc-insider/the-history-of-the-nba-on-nbc-everything-to-know",
      "domain": "nbc.com",
      "type": "citation"
    },
    {
      "text": "Nba Nbc Legendary History",
      "url": "https://www.nbcuniversal.com/article/nba-nbc-legendary-history",
      "domain": "nbcuniversal.com",
      "type": "citation"
    },
    {
      "text": "Abcs Exclusive Coverage Of The 2025 Nba Finals Presented By Youtube Tv Begins June 5 Indiana Pacers Vs Oklahoma City Thunder",
      "url": "https://espnpressroom.com/us/press-releases/2025/06/abcs-exclusive-coverage-of-the-2025-nba-finals-presented-by-youtube-tv-begins-june-5-indiana-pacers-vs-oklahoma-city-thunder/",
      "domain": "espnpressroom.com",
      "type": "citation"
    },
    {
      "text": "Most Watched Nba Finals",
      "url": "https://frontofficesports.com/most-watched-nba-finals/",
      "domain": "frontofficesports.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Hit Lowest Viewership In 3 Years",
      "url": "https://www.forbes.com/sites/mollybohannon/2024/06/18/nba-finals-hit-lowest-viewership-in-3-years/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Nba Social Digial Platforms Record Season 2022 23",
      "url": "https://www.nba.com/news/nba-social-digial-platforms-record-season-2022-23",
      "domain": "nba.com",
      "type": "citation"
    },
    {
      "text": "Nba Seeing Uptick In International League Pass Consumption",
      "url": "https://www.forbes.com/sites/mortenjensen/2022/03/06/nba-seeing-uptick-in-international-league-pass-consumption/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals 2025 Ctv Advertising",
      "url": "https://www.viantinc.com/insights/nba-finals-2025-ctv-advertising/",
      "domain": "viantinc.com",
      "type": "citation"
    },
    {
      "text": "Nba Finals Ratings Viewership History",
      "url": "https://www.sportsmediawatch.com/nba-finals-ratings-viewership-history/",
      "domain": "sportsmediawatch.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "National Basketball Association",
      "page": "National_Basketball_Association"
    },
    {
      "text": "playoffs",
      "page": "Playoffs"
    },
    {
      "text": "Larry O'Brien Championship Trophy",
      "page": "Larry_O'Brien_Championship_Trophy"
    },
    {
      "text": "sterling silver",
      "page": "Sterling_silver"
    },
    {
      "text": "Tiffany \\u0026 Co",
      "page": "Tiffany_\\u0026_Co."
    },
    {
      "text": "Basketball Association of America",
      "page": "Basketball_Association_of_America"
    },
    {
      "text": "National Basketball League",
      "page": "National_Basketball_League"
    },
    {
      "text": "1947",
      "page": "1947"
    },
    {
      "text": "basketball",
      "page": "Basketball"
    },
    {
      "text": "Boston Celtics",
      "page": "Boston_Celtics"
    },
    {
      "text": "Los Angeles Lakers",
      "page": "Los Angeles Lakers"
    },
    {
      "text": "champion",
      "page": "Champion"
    },
    {
      "text": "format",
      "page": "The_Format"
    },
    {
      "text": "seed",
      "page": "Seed"
    },
    {
      "text": "court",
      "page": "Court"
    },
    {
      "text": "1950",
      "page": "1950"
    },
    {
      "text": "1985",
      "page": "1985"
    },
    {
      "text": "regulation",
      "page": "Regulation"
    },
    {
      "text": "overtime",
      "page": "Overtime"
    },
    {
      "text": "winner",
      "page": "Winner"
    },
    {
      "text": "jump ball",
      "page": "Jump_ball"
    },
    {
      "text": "shot clock",
      "page": "Shot_clock"
    },
    {
      "text": "SoFi NBA Play-In Tournament",
      "page": "NBA_play-in_tournament"
    },
    {
      "text": "conference",
      "page": "Conference"
    },
    {
      "text": "winning percentage",
      "page": "Winning_percentage"
    },
    {
      "text": "record",
      "page": "Record"
    },
    {
      "text": "seeding",
      "page": "Seeding"
    },
    {
      "text": "division",
      "page": "Division"
    },
    {
      "text": "single-elimination tournament",
      "page": "Single-elimination_tournament"
    },
    {
      "text": "Midwestern United States",
      "page": "Midwestern_United_States"
    },
    {
      "text": "Philadelphia",
      "page": "Philadelphia"
    },
    {
      "text": "Chicago Stags",
      "page": "Chicago_Stags"
    },
    {
      "text": "Philadelphia Arena",
      "page": "Philadelphia_Arena"
    },
    {
      "text": "NBL",
      "page": "NBL"
    },
    {
      "text": "John Kundla",
      "page": "John_Kundla"
    },
    {
      "text": "George Mikan",
      "page": "George_Mikan"
    },
    {
      "text": "Washington Capitols",
      "page": "Washington_Capitols"
    },
    {
      "text": "Minneapolis Auditorium",
      "page": "Minneapolis_Auditorium"
    },
    {
      "text": "New York Knicks",
      "page": "New_York_Knicks"
    },
    {
      "text": "Edgerton Park Arena",
      "page": "Edgerton_Park_Arena"
    },
    {
      "text": "three-peat",
      "page": "Three-peat"
    },
    {
      "text": "underdog",
      "page": "Underdog"
    },
    {
      "text": "Chicago Stadium",
      "page": "Chicago_Stadium"
    },
    {
      "text": "Madison Square Garden",
      "page": "Madison_Square_Garden"
    },
    {
      "text": "Finals",
      "page": "The_Finals"
    },
    {
      "text": "Los Angeles Lakers",
      "page": "Los_Angeles_Lakers"
    },
    {
      "text": "Boston",
      "page": "Boston"
    },
    {
      "text": "Wilt Chamberlain",
      "page": "Wilt_Chamberlain"
    },
    {
      "text": "Don Nelson",
      "page": "Don_Nelson"
    },
    {
      "text": "Jerry West",
      "page": "Jerry_West"
    },
    {
      "text": "Chicago Bulls",
      "page": "Chicago_Bulls"
    },
    {
      "text": "Red Auerbach",
      "page": "Red_Auerbach"
    },
    {
      "text": "Russell",
      "page": "Russell"
    },
    {
      "text": "1970s",
      "page": "1970s"
    },
    {
      "text": "American Basketball Association",
      "page": "American_Basketball_Association"
    },
    {
      "text": "ABA",
      "page": "ABA"
    },
    {
      "text": "Buffalo Braves",
      "page": "Buffalo_Braves"
    },
    {
      "text": "Cleveland Cavaliers",
      "page": "Cleveland_Cavaliers"
    },
    {
      "text": "Portland Trail Blazers",
      "page": "Portland_Trail_Blazers"
    },
    {
      "text": "Houston Rockets",
      "page": "Houston_Rockets"
    },
    {
      "text": "New Orleans Jazz",
      "page": "New_Orleans_Jazz"
    },
    {
      "text": "Denver Nuggets",
      "page": "Denver_Nuggets"
    },
    {
      "text": "Indiana Pacers",
      "page": "Indiana_Pacers"
    },
    {
      "text": "San Antonio Spurs",
      "page": "San_Antonio_Spurs"
    },
    {
      "text": "Golden State Warriors",
      "page": "Golden_State_Warriors"
    },
    {
      "text": "Seattle SuperSonics",
      "page": "Seattle_SuperSonics"
    },
    {
      "text": "Willis Reed",
      "page": "Willis_Reed"
    },
    {
      "text": "Milwaukee Bucks",
      "page": "Milwaukee_Bucks"
    },
    {
      "text": "Kareem Abdul-Jabbar",
      "page": "Kareem_Abdul-Jabbar"
    },
    {
      "text": "Elmore Smith",
      "page": "Elmore_Smith"
    },
    {
      "text": "Brian Winters",
      "page": "Brian_Winters"
    },
    {
      "text": "Junior Bridgeman",
      "page": "Junior_Bridgeman"
    },
    {
      "text": "Golden State",
      "page": "Golden_State"
    },
    {
      "text": "Rick Barry",
      "page": "Rick_Barry"
    },
    {
      "text": "Philadelphia 76ers",
      "page": "Philadelphia_76ers"
    },
    {
      "text": "Magic",
      "page": "Magic!"
    },
    {
      "text": "Los Angeles",
      "page": "Los_Angeles"
    },
    {
      "text": "Kurt Rambis",
      "page": "Kurt_Rambis"
    },
    {
      "text": "Kareem",
      "page": "Kareem"
    },
    {
      "text": "Boston Garden",
      "page": "Boston_Garden"
    },
    {
      "text": "Detroit",
      "page": "Detroit"
    },
    {
      "text": "Pat Riley",
      "page": "Pat_Riley"
    },
    {
      "text": "Detroit Pistons",
      "page": "Detroit_Pistons"
    },
    {
      "text": "Bad Boys",
      "page": "Bad_Boys"
    },
    {
      "text": "Chuck Daly",
      "page": "Chuck_Daly"
    },
    {
      "text": "Isiah Thomas",
      "page": "Isiah_Thomas"
    },
    {
      "text": "Joe Dumars",
      "page": "Joe_Dumars"
    },
    {
      "text": "Portland",
      "page": "Portland"
    },
    {
      "text": "Jordan",
      "page": "Jordan"
    },
    {
      "text": "Chicago",
      "page": "Chicago"
    },
    {
      "text": "Phoenix Suns",
      "page": "Phoenix_Suns"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "baseball",
      "page": "Baseball"
    },
    {
      "text": "Hakeem Olajuwon",
      "page": "Hakeem_Olajuwon"
    },
    {
      "text": "Orlando Magic",
      "page": "Orlando_Magic"
    },
    {
      "text": "Finals MVP",
      "page": "MVP"
    },
    {
      "text": "Utah Jazz",
      "page": "Utah_Jazz"
    },
    {
      "text": "Salt Lake City",
      "page": "Salt_Lake_City"
    },
    {
      "text": "Bryon Russell",
      "page": "Bryon_Russell"
    },
    {
      "text": "triangle",
      "page": "Triangle"
    },
    {
      "text": "Tex Winter",
      "page": "Tex_Winter"
    },
    {
      "text": "Flu Game",
      "page": "Flu_Game"
    },
    {
      "text": "Shaquille O'Neal",
      "page": "Shaquille_O'Neal"
    },
    {
      "text": "Kobe Bryant",
      "page": "Kobe_Bryant"
    },
    {
      "text": "Phil Jackson",
      "page": "Phil_Jackson"
    },
    {
      "text": "sprained ankle",
      "page": "Sprained_ankle"
    },
    {
      "text": "Tim Duncan",
      "page": "Tim_Duncan"
    },
    {
      "text": "Gregg Popovich",
      "page": "Gregg_Popovich"
    },
    {
      "text": "1999",
      "page": "1999"
    },
    {
      "text": "2007",
      "page": "2007"
    },
    {
      "text": "Tony Parker",
      "page": "Tony_Parker"
    },
    {
      "text": "Manu Ginóbili",
      "page": "Manu_Ginóbili"
    },
    {
      "text": "2005",
      "page": "2005"
    },
    {
      "text": "2004",
      "page": "2004"
    },
    {
      "text": "Chauncey Billups",
      "page": "Chauncey_Billups"
    },
    {
      "text": "Ben Wallace",
      "page": "Ben_Wallace"
    },
    {
      "text": "Rasheed Wallace",
      "page": "Rasheed_Wallace"
    },
    {
      "text": "Dwyane Wade",
      "page": "Dwyane_Wade"
    },
    {
      "text": "Dallas Mavericks",
      "page": "Dallas_Mavericks"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "LeBron James",
      "page": "LeBron_James"
    },
    {
      "text": "Miami Heat",
      "page": "Miami_Heat"
    },
    {
      "text": "Chris Bosh",
      "page": "Chris_Bosh"
    },
    {
      "text": "Oklahoma City Thunder",
      "page": "Oklahoma_City_Thunder"
    },
    {
      "text": "Warriors",
      "page": "The_Warriors"
    },
    {
      "text": "Cleveland",
      "page": "Cleveland"
    },
    {
      "text": "Stephen",
      "page": "Stephen"
    },
    {
      "text": "Kevin Durant",
      "page": "Kevin_Durant"
    },
    {
      "text": "innovation",
      "page": "Innovation"
    },
    {
      "text": "2020 NBA Finals",
      "page": "2020_NBA_Finals"
    },
    {
      "text": "COVID-19 pandemic",
      "page": "COVID-19_pandemic"
    },
    {
      "text": "Orlando, Florida",
      "page": "Orlando,_Florida"
    },
    {
      "text": "championship",
      "page": "Championship"
    },
    {
      "text": "the league",
      "page": "The_League"
    },
    {
      "text": "Giannis Antetokounmpo",
      "page": "Giannis_Antetokounmpo"
    },
    {
      "text": "Stephen Curry",
      "page": "Stephen_Curry"
    },
    {
      "text": "Jaylen Brown",
      "page": "Jaylen_Brown"
    },
    {
      "text": "salary cap",
      "page": "Salary_cap"
    },
    {
      "text": "Seattle",
      "page": "Seattle"
    },
    {
      "text": "San Antonio Spurs",
      "page": "San_Angio_Spurts"
    },
    {
      "text": "2000s",
      "page": "2000s"
    },
    {
      "text": "1990s",
      "page": "1990s"
    },
    {
      "text": "San Antonio Spurs",
      "page": "San_Angeles_Spur"
    },
    {
      "text": "franchise",
      "page": "Franchise"
    },
    {
      "text": "2025",
      "page": "2025"
    },
    {
      "text": "Atlanta Hawks",
      "page": "Atlanta_Hawks"
    },
    {
      "text": "Brooklyn Nets",
      "page": "Brooklyn_Nets"
    },
    {
      "text": "Sacramento Kings",
      "page": "Sacramento_Kings"
    },
    {
      "text": "Toronto Raptors",
      "page": "Toronto_Raptors"
    },
    {
      "text": "Washington Wizards",
      "page": "Washington_Wizards"
    },
    {
      "text": "Los Angeles Clippers",
      "page": "Los_Angeles_Clippers"
    },
    {
      "text": "Memphis Grizzlies",
      "page": "Memphis_Grizzlies"
    },
    {
      "text": "Minnesota Timberwolves",
      "page": "Minnesota_Timberwolves"
    },
    {
      "text": "New Orleans Pelicans",
      "page": "New_Orleans_Pelicans"
    },
    {
      "text": "Bill Russell",
      "page": "Bill_Russell"
    },
    {
      "text": "Klay Thompson",
      "page": "Klay_Thompson"
    },
    {
      "text": "Minneapolis",
      "page": "Minneapolis"
    },
    {
      "text": "Elgin Baylor",
      "page": "Elgin_Baylor"
    },
    {
      "text": "points per game",
      "page": "Points_per_game"
    },
    {
      "text": "1940s",
      "page": "1940s"
    },
    {
      "text": "1950s",
      "page": "1950s"
    },
    {
      "text": "inception",
      "page": "Inception"
    },
    {
      "text": "1962 NBA Finals",
      "page": "1962_NBA_Finals"
    },
    {
      "text": "1967 NBA Finals",
      "page": "1967_NBA_Finals"
    },
    {
      "text": "1993 NBA Finals",
      "page": "1993_NBA_Finals"
    },
    {
      "text": "1960 NBA Finals",
      "page": "1960_NBA_Finals"
    },
    {
      "text": "Magic Johnson",
      "page": "Magic_Johnson"
    },
    {
      "text": "1969 NBA Finals",
      "page": "1969_NBA_Finals"
    },
    {
      "text": "David Stern",
      "page": "David_Stern"
    },
    {
      "text": "NBA Finals",
      "page": "NBA_Finals"
    },
    {
      "text": "Michael Jordan",
      "page": "Michael_Jordan"
    },
    {
      "text": "Shai Gilgeous-Alexander",
      "page": "Shai_Gilgeous-Alexander"
    },
    {
      "text": "Major League",
      "page": "Major_League"
    },
    {
      "text": "World Series",
      "page": "World_Series"
    },
    {
      "text": "professional sports",
      "page": "Professional_sports"
    },
    {
      "text": "Commissioner",
      "page": "Commissioner"
    },
    {
      "text": "Walter A. Brown Trophy",
      "page": "Walter_A._Brown_Trophy"
    },
    {
      "text": "YouTube TV",
      "page": "YouTube_TV"
    },
    {
      "text": "sports betting",
      "page": "Sports_betting"
    },
    {
      "text": "DraftKings",
      "page": "DraftKings"
    },
    {
      "text": "FanDuel",
      "page": "FanDuel"
    },
    {
      "text": "arena",
      "page": "Are.na"
    },
    {
      "text": "Sportsbook",
      "page": "Sportsbook"
    },
    {
      "text": "official",
      "page": "Official"
    },
    {
      "text": "data",
      "page": "Data"
    },
    {
      "text": "fan",
      "page": "Fan"
    },
    {
      "text": "engagement",
      "page": "Engagement"
    },
    {
      "text": "Supreme Court",
      "page": "Supreme_court"
    },
    {
      "text": "cable television",
      "page": "Cable_television"
    },
    {
      "text": "TBS",
      "page": "TBS"
    },
    {
      "text": "Jeff Van Gundy",
      "page": "Jeff_Van_Gundy"
    },
    {
      "text": "COVID-19",
      "page": "COVID-19"
    },
    {
      "text": "ESPN",
      "page": "ESPN"
    },
    {
      "text": "ABC",
      "page": "ABC"
    },
    {
      "text": "NBA League Pass",
      "page": "NBA_League_Pass"
    },
    {
      "text": "1994",
      "page": "1994"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "social media",
      "page": "Social_media"
    },
    {
      "text": "surge",
      "page": "Surge"
    }
  ],
  "fetched_at": "2025-12-07T07:25:10.210068",
  "elapsed_ms": 663147
}