{
  "topic": "Neuroscience",
  "title": "Neuroscience",
  "slug": "neuroscience",
  "grokipedia_slug": "Neuroscience",
  "grokipedia_url": "https://grokipedia.com/page/Neuroscience",
  "source": "grokipedia",
  "content": "# Neuroscience\n\nNeuroscience is the scientific study of the nervous system, which includes the brain, spinal cord, and networks of sensory, motor, and other neurons throughout the body. This interdisciplinary field integrates biology, psychology, chemistry, physics, and medicine to investigate the structure, function, development, genetics, biochemistry, physiology, pharmacology, and pathology of the nervous system. At its core, neuroscience seeks to understand how the nervous system enables processes such as perception, movement, learning, memory, emotion, and cognition, while also addressing disorders like Alzheimer's disease, Parkinson's disease, epilepsy, and mental health conditions.\n\nThe history of neuroscience traces back to ancient civilizations, with early records from around 1700 B.C. in the Edwin Smith Surgical Papyrus describing the nervous system and brain injuries. In ancient Greece, Hippocrates (c. 460–379 B.C.) proposed that the brain was the seat of intelligence and sensation, challenging earlier views that attributed these to the heart. The field advanced during the Renaissance with Andreas Vesalius's detailed anatomical illustrations in 1543, followed by Thomas Willis's coining of the term \"neurology\" in 1664 and his descriptions of brain structures. The 19th and 20th centuries brought breakthroughs like the discovery of electrical activity in nerves by Luigi Galvani in the 1790s, the identification of neurons by Santiago Ramón y Cajal in the 1890s, and the first human electroencephalogram (EEG) recording by Hans Berger in 1924, laying the foundation for modern techniques such as functional magnetic resonance imaging (fMRI).\n\nNeuroscience encompasses several key subfields that address different scales and aspects of the nervous system. Developmental neuroscience examines how the brain forms, grows, and adapts over the lifespan. Cognitive neuroscience explores the neural basis of mental processes like language, problem-solving, and decision-making. Molecular and cellular neuroscience investigates the roles of genes, proteins, and cellular mechanisms in neuron function, while systems neuroscience analyzes how neural circuits integrate to produce behavior. Behavioral neuroscience links brain activity to observable actions in humans and animals, and clinical neuroscience focuses on diagnosing, treating, and preventing neurological disorders.\n\nThe importance of neuroscience lies in its potential to unravel the mechanisms underlying human health and disease, informing treatments for conditions affecting over 3 billion people worldwide (more than 40% of the global population, as of 2025), including stroke, multiple sclerosis, and psychiatric disorders. Advances in the field have led to innovations like deep brain stimulation for Parkinson's and targeted therapies for epilepsy, while ongoing initiatives such as the BRAIN Initiative (launched in 2013) aim to accelerate discoveries in brain mapping and repair. By bridging basic research with clinical applications, neuroscience not only enhances our understanding of consciousness and behavior but also drives progress in education, artificial intelligence, and neuroethics.\n\n## History of Neuroscience\n\n### Ancient and Early Observations\n\nThe roots of neuroscience trace back to ancient civilizations, including early descriptions in the Edwin Smith Surgical Papyrus from around 1700 BCE, which documented brain injuries and the role of the nervous system. In ancient Greece, Hippocrates of Kos (c. 460–370 BCE) challenged prevailing supernatural explanations for neurological disorders, particularly epilepsy, which was often attributed to divine possession or sacred origins. In his treatise *On the Sacred Disease*, part of the Hippocratic Corpus, he argued that epilepsy arose from natural causes, such as imbalances in bodily humors originating in the brain, emphasizing heredity and phlegmatic constitutions as key factors rather than mystical interventions. This materialist perspective laid foundational ideas for understanding the brain as the organ responsible for mental functions, influencing subsequent medical thought.\n\nBuilding on Greek traditions, the Roman physician Galen (c. 129–c. 216 CE) advanced anatomical knowledge through extensive dissections, primarily of animals like oxen and apes, due to restrictions on human cadavers. He proposed a ventricular theory of the brain, positing that the cerebral ventricles served as the seat of the rational soul, with sensory impressions processed in the anterior ventricle, imagination in the middle, and memory in the posterior one. Galen's observations of brain injuries in gladiators and animals reinforced his view of the brain as the center of the animal spirit, which he believed distributed sensations and movements via nerves, though his reliance on non-human subjects introduced inaccuracies that persisted for centuries.\n\nDuring the medieval Islamic Golden Age, scholars preserved and expanded Greek knowledge while integrating empirical methods. Ibn Sina (Avicenna, 980–1037 CE) detailed the nervous system's structure in his *Canon of Medicine*, describing the brain, spinal cord, and neural pathways as interconnected components originating from the neural tube during embryogenesis, with nerves extending from the brain to convey sensory and motor functions. He emphasized the brain's role in processing impressions and generating animal spirits, while also noting the skin's nervous origin, linking it to the central nervous system. Islamic physicians, including those in Al-Andalus, conducted early vivisections on animals to study neural responses, as human dissection was generally prohibited, allowing observations of nerve function in living subjects that refined Galenic theories.\n\nThe Renaissance marked a pivotal shift toward direct human anatomy, exemplified by Andreas Vesalius (1514–1564) in his seminal work *De Humani Corporis Fabrica* (1543), which featured unprecedented illustrations of the brain based on personal dissections of human cadavers. Vesalius corrected numerous Galenic errors, such as the portrayal of the brain's ventricles and nerve origins, by depicting accurate cross-sections, sulci, and cranial nerve distributions, thereby challenging the animal-based assumptions of prior anatomists. These detailed engravings, attributed to artists like Jan van Calcar, facilitated a more precise understanding of brain topography and its relation to sensory pathways.\n\nIn the 17th century, philosophical debates further intertwined anatomy with theories of mind, as René Descartes (1596–1650) articulated mind-body dualism in works like *Meditations on First Philosophy* (1641) and *Passions of the Soul* (1649). He proposed that the immaterial mind (res cogitans) interacted with the mechanical body (res extensa) via the pineal gland, which he incorrectly located as a single structure in the brain's midline, serving as the principal seat for uniting sensory inputs into unified perceptions. This localization, drawn from anatomical studies, underscored the brain's centrality in consciousness while positing a non-physical soul, influencing dualistic views that persisted into modern neuroscience.\n\n### 19th and 20th Century Foundations\n\nThe 19th and 20th centuries marked the transition of neuroscience from speculative anatomy to an empirical discipline, driven by advances in microscopy, electrical recording techniques, and clinical observations that established the cellular and functional basis of the nervous system. Key developments included the visualization of individual neurons, the measurement of their electrical activity, and the mapping of brain regions to specific functions, laying the groundwork for modern neurobiology.\n\nA pivotal advancement was the neuron doctrine, which posited that the nervous system comprises discrete cellular units rather than a continuous reticulum, as proposed by Camillo Golgi. In the late 1880s and 1890s, Santiago Ramón y Cajal utilized Golgi's silver staining method to produce detailed histological observations of neural tissue, revealing neurons as independent cells with axons and dendrites that do not fuse but communicate across junctions. Cajal's illustrations from rabbit cerebellum and other tissues, published in works such as *La Texture du Système Nerveux* (1894–1904), provided compelling evidence against the reticular theory and earned him the 1906 Nobel Prize in Physiology or Medicine, shared with Golgi. These findings resolved longstanding debates originating from ancient misconceptions of a networked nerve substance, confirming the cellular nature of neural organization.\n\nElectrophysiology emerged as a cornerstone of neuroscience through experiments demonstrating the electrical basis of nerve and muscle activity. In 1791, Luigi Galvani reported that electrical stimulation caused contractions in frog leg muscles, interpreting the phenomenon as \"animal electricity\" inherent to living tissue, detailed in his treatise *De Viribus Electricitatis in Motu Musculari Commentarius*. This work initiated quantitative studies of bioelectricity, influencing later researchers despite debates with Alessandro Volta over exogenous versus endogenous sources. Building on this, in the 1920s, Edgar Douglas Adrian developed vacuum tube amplifiers to record action potentials from single sensory and motor nerve fibers in decerebrate cats, demonstrating their all-or-none nature and frequency coding for stimulus intensity. Adrian's recordings, which showed action potentials as brief voltage spikes of fixed amplitude, earned him the 1932 Nobel Prize in Physiology or Medicine, shared with Charles Sherrington.\n\nBrain mapping advanced through clinical correlations of lesions and direct stimulation, localizing functions to specific cortical areas. In 1861, Paul Broca identified a left inferior frontal gyrus lesion in patient \"Tan\" (Louis Leborgne), who exhibited expressive aphasia despite intact comprehension, establishing Broca's area as critical for speech production. This lesion-based approach supported cerebral localization, contrasting with holistic views. In the 1930s, Wilder Penfield refined intraoperative electrical stimulation during epilepsy surgeries at the Montreal Neurological Institute, mapping the primary motor cortex by eliciting movements in awake patients, which informed the homunculus representation of body parts. Penfield's technique, using brief 60 Hz pulses, confirmed somatotopic organization and minimized risks, influencing surgical neuroscience.\n\nCharles Sherrington introduced the synapse concept in 1906 to describe the functional junction between neurons, inferred from reflex studies in spinal preparations where summation and inhibition occurred without direct continuity. In *The Integrative Action of the Nervous System*, Sherrington coined \"synapse\" (from Greek *synapsis*, meaning \"clasp\") to explain delayed transmission and plasticity in neural circuits, integrating Cajal's doctrine with physiological data. This framework elucidated how reflexes coordinate behavior, earning Sherrington a share of the 1932 Nobel Prize.\n\nA mathematical pinnacle was the 1952 Hodgkin-Huxley model, which quantitatively described action potential generation in squid giant axons using voltage-clamp recordings to isolate ionic currents. Alan Hodgkin and Andrew Huxley formulated differential equations for membrane potential \\(V\\), incorporating voltage-dependent sodium (Na\\(^+\\)) and potassium (K\\(^+\\)) conductances, with leak current, as follows:\n\n$$\n\\frac{dV}{dt} = \\frac{1}{C_m} \\left( I - g_{\\\text{Na}} m^3 h (V - E_{\\\text{Na}}) - g_{\\\text{K}} n^4 (V - E_{\\\text{K}}) - g_{\\\text{L}} (V - E_{\\\text{L}}) \\right)\n$$\n\nwhere \\(C_m\\) is membrane capacitance, \\(I\\) is applied current, \\(g\\) terms are maximal conductances, \\(E\\) are reversal potentials, and \\(m, h, n\\) are gating variables obeying first-order kinetics. This model predicted action potential propagation via regenerative Na\\(^+\\) influx followed by K\\(^+\\) efflux, earning Hodgkin and Huxley the 1963 Nobel Prize and enabling computational neuroscience.\n\n### Post-2000 Breakthroughs\n\nThe completion of the Human Genome Project in 2003 marked a pivotal advancement in neuroscience by providing the complete sequence of the human genome, which facilitated the identification of over 20,000 protein-coding genes, many of which are expressed in neural tissues and implicated in brain function and disorders. This genomic blueprint accelerated the discovery of neural-specific genes, such as those involved in synaptic transmission and neurodevelopment, enabling researchers to link genetic variations to conditions like schizophrenia and epilepsy through genome-wide association studies (GWAS). For instance, post-2003 analyses revealed hundreds of candidate genes for neurological traits, transforming neurogenetics from hypothesis-driven to data-rich inquiry.\n\nBuilding on this genomic foundation, the adaptation of CRISPR-Cas9 gene-editing technology for neuroscience began around 2012, with initial demonstrations of precise editing in neuronal cells by 2014. This tool allowed targeted modifications of genes in post-mitotic neurons, overcoming previous limitations of viral vectors and enabling in vivo studies of neural circuits; early applications included knocking out genes like *MeCP2* in mouse models of Rett syndrome to dissect synaptic dysfunction. By the mid-2010s, CRISPR variants such as Cas9 nickases and base editors were optimized for neuron-specific delivery via adeno-associated viruses (AAVs), achieving up to 80% editing efficiency in cortical regions without off-target effects, thus advancing therapeutic potential for genetic epilepsies and neurodegenerative diseases.\n\nConnectomics emerged as a major post-2000 frontier, with electron microscopy techniques enabling nanoscale mapping of neural wiring; efforts beginning with the 2018 electron microscopy imaging of the adult *Drosophila melanogaster* brain culminated in 2024 with the complete connectome revealing over 139,000 neurons and 50 million synapses, providing the first whole-brain connectome for a complex adult insect nervous system. Jeff Lichtman's laboratory advanced this field through serial section electron microscopy of mammalian brains, culminating in 2024 with the reconstruction of a 1-cubic-millimeter fragment of human cerebral cortex containing 57,000 cells, 230 millimeters of blood vessels, and 150 million synapses from 1.4 petabytes of imaging data. This human-scale connectomic dataset, processed via automated segmentation algorithms, illuminated cortical microcircuitry and variability across individuals, setting the stage for 2025 extensions toward larger volumes using machine learning-assisted proofreading.\n\nLarge-scale collaborations further propelled multi-scale brain modeling in the 2010s. The U.S. BRAIN Initiative, launched in 2013, prioritized technologies for circuit-scale mapping and dynamic brain activity recording, achieving milestones like the development of high-density electrode arrays and optogenetic tools that enabled simultaneous monitoring of thousands of neurons across scales from synapses to networks. Complementing this, the European Human Brain Project (HBP), also initiated in 2013 and concluding in 2023, integrated multiscale simulations on the EBRAINS platform, modeling neural activity from ion channels to whole-brain dynamics and validating predictions against empirical data in rodent cognition tasks. These initiatives fostered interoperability of datasets, with HBP's virtual brain models simulating epileptic seizures at cellular-to-systems levels.\n\nIn 2025, integrations of AlphaFold3 with neural proteomics have enabled AI-driven predictions of synaptic protein complexes, enhancing understanding of synapse formation and plasticity. Released in 2024, AlphaFold3 predicts structures and interactions of proteins, ligands, and nucleic acids with atomic accuracy, allowing reconstruction of synaptic protein structures and interactions. Applications in neuroscience include modeling neurotransmitter receptor assemblies, such as AMPA receptors in excitatory synapses, revealing conformational changes that underpin learning; this has informed studies predicting synaptic remodeling in Alzheimer's models. These advancements bridge structural biology and connectomics, accelerating drug design for synaptic disorders.\n\n## Core Concepts in Neuroscience\n\n### Neuronal Structure and Function\n\nNeurons serve as the fundamental signaling units of the nervous system, specialized cells capable of receiving, processing, and transmitting electrochemical signals to coordinate bodily functions. A typical neuron consists of a cell body, known as the soma, which houses the nucleus and organelles essential for protein synthesis and cellular maintenance; multiple branching dendrites that extend from the soma to receive incoming signals from other neurons; and a single elongated axon that conducts outgoing signals away from the soma toward target cells. The axon is often insulated by a myelin sheath, a lipid-rich layer formed by glial cells that enhances the speed of signal propagation by reducing capacitance and increasing resistance along the axon membrane.\n\nNeurons exhibit diverse morphologies adapted to their specific roles in different brain regions. For instance, pyramidal neurons, which constitute the majority of excitatory projection neurons in the cerebral cortex and hippocampus, feature a distinctive triangular soma with a prominent apical dendrite extending toward the cortical surface and basal dendrites branching laterally. In contrast, Purkinje cells in the cerebellar cortex possess highly elaborate, fan-like dendritic arbors that receive inputs from thousands of parallel fibers, enabling complex integration of motor coordination signals. These structural variations underscore the functional specialization of neurons across neural circuits.\n\nAt rest, neurons maintain a membrane potential of approximately -70 mV, a negative voltage inside the cell relative to the extracellular space, primarily due to unequal distributions of ions such as potassium, sodium, and chloride across the semipermeable membrane. This resting potential arises from the selective permeability of the membrane to potassium ions and the action of ion pumps like the sodium-potassium ATPase. The equilibrium potential for a given ion can be calculated using the Nernst equation:\n\n$$\nE_{\\\text{ion}} = \\frac{RT}{zF} \\ln \\left( \\frac{[\\\text{ion}]_{\\\text{out}}}{[\\\text{ion}]_{\\\text{in}}} \\right)\n$$\n\nwhere \\(R\\) is the gas constant, \\(T\\) is the absolute temperature, \\(z\\) is the ion's valence, \\(F\\) is Faraday's constant, and \\([\\\text{ion}]_{\\\text{out}}\\) and \\([\\\text{ion}]_{\\\text{in}}\\) are the extracellular and intracellular ion concentrations, respectively. For potassium, this yields a value near -90 mV, which dominates the resting state.\n\nSupporting neurons are glial cells, which are present in the human brain at a ratio of approximately 1:1 to neurons, though this varies by region. Astrocytes, star-shaped glia, provide structural and metabolic support to neurons by regulating extracellular ion balance, recycling neurotransmitters, and forming the blood-brain barrier to maintain a stable microenvironment. Oligodendrocytes, in turn, generate the myelin sheath around neuronal axons in the central nervous system, insulating multiple axons per cell to facilitate rapid signal conduction. These non-neuronal cells are indispensable for neuronal health and function.\n\nDespite comprising only about 2% of the body's mass, neurons and their supporting glia in the brain consume roughly 20% of the total ATP produced at rest, reflecting the high energy demands of maintaining ion gradients, synthesizing neurotransmitters, and sustaining constant signaling readiness. This disproportionate metabolic cost highlights the brain's priority in resource allocation for information processing. Neurons integrate inputs across their dendrites and soma before propagating outputs along the axon to communicate with other cells via synapses.\n\n### Synaptic Transmission\n\nSynaptic transmission is the process by which neurons communicate with one another, primarily through specialized junctions called synapses, where an action potential in the presynaptic neuron triggers the release of signaling molecules that influence the postsynaptic neuron.\n\nThere are two main types of synapses: chemical synapses, which are the most prevalent form of interneuronal communication in the vertebrate nervous system, and electrical synapses, which allow direct ion flow between cells via gap junctions composed of connexin proteins. In chemical synapses, neurotransmission occurs via the release of neurotransmitters from synaptic vesicles in the presynaptic terminal, a process initiated by calcium influx through voltage-gated calcium channels when an action potential depolarizes the terminal. This calcium-dependent exocytosis ensures rapid and precise signaling, with synaptic vesicles docking at the active zone before fusing with the presynaptic membrane.\n\nThe neurotransmitter release cycle follows a quantal nature, where neurotransmitters are packaged into discrete vesicles that are released in fixed amounts, or quanta, upon calcium entry. This quantal release can be modeled using Poisson statistics, which describes the probabilistic nature of vesicle fusion, with the number of quanta released (quantal content) depending on the probability of release at each active site and the number of available sites. Each quantum generates a miniature postsynaptic potential, and the overall response amplitude reflects the summation of these events, allowing for reliable transmission under varying presynaptic activity levels.\n\nUpon release, neurotransmitters diffuse across the synaptic cleft to bind postsynaptic receptors, generating excitatory postsynaptic potentials (EPSPs) that depolarize the membrane or inhibitory postsynaptic potentials (IPSPs) that hyperpolarize it, thereby modulating the likelihood of an action potential in the postsynaptic neuron. These potentials undergo spatial summation, where inputs from multiple synapses converge on the same postsynaptic site, or temporal summation, where successive inputs from the same synapse add up over time, enabling the integration of diverse signals to determine neuronal firing. A foundational principle underlying synaptic efficacy is the Hebbian rule, which posits that synapses strengthen when presynaptic and postsynaptic neurons are active simultaneously—\"cells that fire together wire together\"—providing a basis for associative learning. (Hebb, 1949)\n\nTo terminate signaling and recycle neurotransmitters, mechanisms such as reuptake into the presynaptic neuron or glial cells and enzymatic degradation are employed; for instance, serotonin is primarily cleared from the synapse via the serotonin transporter (SERT), a sodium-dependent carrier protein that facilitates its recapture for repackaging into vesicles. This reuptake process, first molecularly characterized through cloning of the rat SERT, maintains synaptic homeostasis and regulates serotonergic tone.\n\n### Neural Plasticity\n\nNeural plasticity, or neuroplasticity, encompasses the brain's ability to reorganize its structure, functions, and connections in response to intrinsic or extrinsic stimuli, enabling adaptation to new experiences, learning, or recovery from injury. This dynamic process operates at multiple scales, from molecular changes at synapses to large-scale network remodeling, and persists throughout life, though its extent varies by developmental stage and brain region. Seminal studies have established that plasticity underlies both developmental refinement of neural circuits and compensatory mechanisms in adulthood, highlighting its role in maintaining neural stability and function.\n\nKey types of neural plasticity include synaptic, structural, and homeostatic forms. Synaptic plasticity manifests as activity-dependent modifications in the efficacy of signal transmission between neurons, primarily through mechanisms like long-term potentiation (LTP) and long-term depression (LTD), which rely on N-methyl-D-aspartate (NMDA) receptor activation to strengthen or weaken connections, respectively. Structural plasticity involves physical alterations in neuronal architecture, such as the formation, stabilization, or elimination of dendritic spines, which serve as postsynaptic sites for excitatory synapses and can rapidly expand or contract in response to stimuli. Homeostatic scaling acts as a regulatory mechanism to preserve overall network balance, uniformly adjusting synaptic strengths across multiple inputs to counteract chronic changes in neuronal activity and prevent hyperexcitability or silencing.\n\nA core mechanism of synaptic plasticity is the induction of LTP, first demonstrated in the hippocampus by high-frequency stimulation of afferent pathways, which triggers robust, persistent enhancement of synaptic transmission. This process begins with coincident presynaptic glutamate release and postsynaptic depolarization, relieving the magnesium block on NMDA receptors and allowing calcium (Ca²⁺) influx into the postsynaptic neuron; the elevated Ca²⁺ then activates signaling cascades that promote the trafficking and insertion of α-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid (AMPA) receptors into the synaptic membrane, thereby increasing postsynaptic responsiveness. LTP and LTD, induced by high- and low-frequency stimulation patterns, respectively, provide a cellular basis for bidirectional control of synaptic weights.\n\nNeural plasticity is particularly pronounced during critical periods, discrete developmental windows when neural circuits are highly susceptible to environmental inputs for proper organization. Classic experiments by Hubel and Wiesel in the 1960s revealed this in the visual system of kittens: monocular deprivation during the critical period from eye opening to about three months of age caused a permanent shift in ocular dominance, with most cortical neurons becoming responsive exclusively to the non-deprived eye, demonstrating how experience shapes cortical maps through competitive plasticity mechanisms. These findings underscored the time-limited nature of developmental plasticity, where closure of the eye lid disrupts normal binocular input and leads to enduring amblyopia-like deficits.\n\nIn the adult brain, plasticity supports recovery from neurological insults like stroke, where perilesional areas exhibit remapping and sprouting of surviving pathways to restore lost functions, such as motor control, through intensive rehabilitation that harnesses activity-dependent reorganization. Studies from the 2020s have further illuminated adult plasticity's potential via psychedelics; for instance, psilocybin administration in preclinical models promotes rapid dendritic spine proliferation and synaptogenesis in the prefrontal cortex, enhancing structural rewiring that correlates with behavioral flexibility and therapeutic outcomes in mood disorders. These effects stem from psychedelic-induced activation of plasticity-related gene expression and reversal of stress-induced synaptic deficits, opening avenues for targeted interventions in neurodegeneration.\n\n## Molecular and Cellular Mechanisms\n\n### Ion Channels and Action Potentials\n\nIon channels are integral membrane proteins that facilitate the selective passage of ions across the neuronal plasma membrane, enabling the rapid electrical signaling essential for neuronal communication. Voltage-gated ion channels, in particular, open or close in response to changes in membrane potential, playing a central role in generating action potentials. These channels include voltage-gated sodium (Na⁺) channels, which permit Na⁺ influx to drive depolarization, and voltage-gated potassium (K⁺) channels, which allow K⁺ efflux to promote repolarization. The discovery and characterization of these single-channel currents were made possible by the patch-clamp technique, developed by Erwin Neher and Bert Sakmann, who refined it in 1981 to achieve high-resolution recordings from cell-free membrane patches.\n\nAction potentials arise when the membrane potential, typically maintained at a resting level of around -70 mV by ion gradients established via pumps like Na⁺/K⁺-ATPase, is depolarized beyond a threshold of approximately -55 mV. The rising phase occurs as voltage-gated Na⁺ channels open rapidly, allowing Na⁺ ions to enter the cell and further depolarize the membrane to about +30 mV. This is followed by the falling phase, where Na⁺ channels inactivate and voltage-gated K⁺ channels open, leading to K⁺ efflux that repolarizes the membrane toward the K⁺ equilibrium potential. The process concludes with a refractory period: an absolute phase during Na⁺ channel inactivation, preventing immediate re-excitation, and a relative phase where stronger stimuli can initiate another potential despite partial hyperpolarization.\n\nAction potentials propagate along axons without decrement, with speeds varying based on axon diameter and myelination. In myelinated axons, saltatory conduction at nodes of Ranvier enables velocities from 1 to 100 m/s, far exceeding the 0.5–10 m/s in unmyelinated fibers, due to insulation that confines ion flow to these gaps.\n\nThe biophysical mechanisms underlying these dynamics were quantitatively modeled in the seminal Hodgkin-Huxley equations, derived from voltage-clamp experiments on squid giant axons in 1952. The model describes the membrane current as the sum of leak, sodium, and potassium components:\n\n$$\nI = C_m \\frac{dV}{dt} + I_{Na} + I_K + I_L\n$$\n\nwhere \\(C_m\\) is membrane capacitance, \\(V\\) is membrane potential, and \\(I_L = g_L (V - E_L)\\) is the leak current with conductance \\(g_L\\) and reversal potential \\(E_L\\). The sodium current is given by\n\n$$\nI_{Na} = g_{Na} m^3 h (V - E_{Na}),\n$$\n\nwith maximum conductance \\(g_{Na}\\) and gating variables \\(m\\) (activation) and \\(h\\) (inactivation) following first-order kinetics:\n\n$$\n\\frac{dm}{dt} = \\alpha_m (1 - m) - \\beta_m m, \\quad \\frac{dh}{dt} = \\alpha_h (1 - h) - \\beta_h h,\n$$\n\nwhere rate constants \\(\\alpha\\) and \\(\\beta\\) are voltage-dependent. Similarly, the potassium current is\n\n$$\nI_K = g_K n^4 (V - E_K),\n$$\n\nwith \\(n\\) (activation) obeying\n\n$$\n\\frac{dn}{dt} = \\alpha_n (1 - n) - \\beta_n n.\n$$\n\nThese equations capture the nonlinear voltage- and time-dependent conductances that generate the action potential's characteristic shape and propagation.\n\nDysfunction in voltage-gated ion channels, known as channelopathies, can disrupt action potential generation and propagation, leading to neurological disorders. For instance, loss-of-function mutations in the SCN1A gene, encoding the Naᵥ1.1 sodium channel α-subunit, cause Dravet syndrome, a severe infantile epilepsy characterized by frequent seizures due to impaired neuronal excitability in inhibitory interneurons. Such mutations highlight the precise role of channel kinetics in maintaining balanced neural signaling.\n\n### Neurotransmitter Systems\n\nNeurotransmitter systems encompass the diverse chemical messengers that facilitate communication across synapses in the nervous system, enabling excitatory, inhibitory, and modulatory effects on neuronal activity. These systems involve the synthesis, release, and receptor binding of neurotransmitters, which are small molecules or peptides stored in synaptic vesicles and discharged in response to presynaptic signals. Major neurotransmitter systems are broadly categorized into classical fast-acting transmitters and slower modulatory ones, each interacting with specific receptor subtypes to influence processes ranging from basic signal propagation to complex behaviors like reward and mood regulation.\n\nClassical neurotransmitter systems primarily handle rapid excitatory and inhibitory signaling in the central nervous system. **Glutamate** serves as the principal excitatory neurotransmitter, accounting for the majority of excitatory synaptic transmission in the brain; it binds to ionotropic receptors such as **AMPA** (α-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid) and **NMDA** (N-methyl-D-aspartate) subtypes, which mediate fast depolarization and calcium influx critical for synaptic plasticity. In contrast, **GABA** (gamma-aminobutyric acid) is the dominant inhibitory neurotransmitter, hyperpolarizing postsynaptic neurons to dampen excitability; it acts through **GABAA** receptors, which are ligand-gated chloride channels, and **GABAB** receptors, which indirectly inhibit via G-protein signaling. These systems ensure balanced neural activity, with glutamate promoting excitation and GABA counteracting it to prevent overstimulation.\n\nModulatory neurotransmitter systems provide finer, longer-lasting regulation of neural circuits, often influencing diffuse brain networks involved in motivation and homeostasis. **Dopamine**, central to reward processing and motor control, primarily engages **D1-like** (Gs-coupled, excitatory) and **D2-like** (Gi-coupled, inhibitory) receptors in regions like the striatum, where D1 activation facilitates goal-directed behaviors and D2 modulates inhibition of unwanted actions. **Serotonin** (5-hydroxytryptamine) modulates mood, anxiety, and sleep through at least 14 receptor subtypes (5-HT1 to 5-HT7 families), many of which are G-protein coupled and distributed across cortical and limbic areas to fine-tune emotional responses. **Acetylcholine** plays a key role in peripheral neuromuscular transmission, binding to nicotinic receptors at the neuromuscular junction to trigger skeletal muscle contraction via rapid cation influx. These modulatory systems often overlap with classical ones, integrating sensory inputs with behavioral outputs. Neurotransmitters are released from presynaptic terminals into the synaptic cleft, where they diffuse to bind postsynaptic receptors, initiating downstream effects.\n\nReceptors within these systems are divided into two main classes based on their signaling mechanisms: **ionotropic** receptors, which function as ligand-gated ion channels to produce fast, direct postsynaptic potentials through ion flux (e.g., glutamate's AMPA/NMDA or GABA's GABAA), and **metabotropic** receptors, which are seven-transmembrane G-protein-coupled receptors that activate intracellular cascades, such as the production of second messengers like **cAMP** (cyclic adenosine monophosphate), leading to slower, modulatory changes in neuronal excitability (e.g., GABAB, D1/D2, or most 5-HT subtypes). Ionotropic receptors enable millisecond-scale transmission essential for sensory processing, while metabotropic ones sustain effects over seconds to minutes, influencing gene expression and plasticity. This dual receptor architecture allows neurotransmitter systems to support both immediate reflexes and adaptive learning.\n\nDysfunctions in neurotransmitter systems underlie various neurological disorders, highlighting their clinical significance. In **Parkinson's disease**, progressive degeneration of dopaminergic neurons in the substantia nigra pars compacta results in striatal dopamine depletion, disrupting motor circuits and leading to bradykinesia, rigidity, and tremor as core symptoms. Serotonin imbalances are implicated in mood disorders, with studies as of 2025 indicating that gut microbiota influence central serotonin signaling via the microbiota-gut-brain axis; for instance, certain bacteria such as Lactobacillus and Bifidobacterium can produce serotonin precursors, modulating brain activity through vagal and immune pathways and potentially contributing to anxiety and depression. These insights underscore the interconnectedness of neurotransmitter systems with peripheral factors, paving the way for targeted interventions.\n\n### Gene Expression in Neurons\n\nGene expression in neurons is tightly regulated to support cellular differentiation, synaptic plasticity, and adaptation to environmental stimuli, involving transcription factors, epigenetic modifications, and rapid induction of specific genes in response to neuronal activity. This process ensures that neurons maintain their specialized identity while responding dynamically to signals, such as those from synaptic inputs. Key mechanisms include the activation of transcription factors that bind to promoter regions and the alteration of chromatin states to facilitate or repress gene transcription.\n\nTranscription factors play a central role in controlling neuronal gene expression. The cAMP response element-binding protein (CREB) is a pivotal activator of activity-dependent genes in neurons, phosphorylated at Ser-133 in response to calcium influx triggered by synaptic stimulation, thereby promoting the transcription of genes essential for neuronal survival and plasticity. In contrast, the RE1-silencing transcription factor (REST), also known as NRSF, acts as a repressor of neuronal genes in non-neuronal cells and during early neural development, binding to RE1 motifs to silence genes involved in neuronal differentiation, ion channel function, and synaptic transmission until appropriate cellular contexts allow derepression. These factors collectively orchestrate the precise temporal and spatial expression patterns required for neuronal function.\n\nEpigenetic modifications further fine-tune gene expression in neurons, particularly in processes like long-term memory formation. DNA methylation typically represses gene activity by adding methyl groups to cytosine residues in CpG islands, but in neurons, activity-induced demethylation at promoters of plasticity-related genes enables their expression during memory consolidation. Histone acetylation, mediated by enzymes like CREB-binding protein (CBP), opens chromatin structure to enhance transcription; for instance, increased acetylation of histone H4 at lysine 12 in the hippocampus correlates with long-term potentiation and spatial memory formation, as demonstrated in studies using histone deacetylase inhibitors to boost memory performance.\n\nActivity-regulated genes are rapidly induced following neuronal stimulation, contributing to synaptic plasticity. The activity-regulated cytoskeleton-associated protein (Arc) and brain-derived neurotrophic factor (BDNF) are prominent examples; Arc mRNA is transported to dendrites and localizes to active synapses to modulate AMPA receptor trafficking and long-term depression, while BDNF supports dendritic growth and synapse stabilization through TrkB receptor signaling. Immediate early genes (IEGs), such as c-fos and egr-1, are transcribed within minutes of stimulation via calcium-dependent pathways, serving as markers of neuronal activation and effectors of downstream plasticity changes, including those underlying learning and memory.\n\nAdvances in the 2020s have illuminated the diversity of neuronal gene expression through single-cell RNA sequencing (scRNA-seq), revealing transcriptomic profiles of thousands of neuronal subtypes. The 2023 Allen Brain Cell Atlas for the mouse brain, integrating approximately 4 million single-cell transcriptomes, has mapped region-specific gene expression patterns, identifying novel subtypes based on markers like neurotransmitter transporters and ion channels, thereby enhancing understanding of neuronal heterogeneity and disease vulnerability. Later integrations, such as the 2024 BRAIN Initiative atlas, extended this to over 11 million cells including human brains. Recent 2025 developments include spatial transcriptomics integrations with scRNA-seq to map gene expression in 3D brain contexts, aiding disease modeling. These datasets underscore how gene expression varies across subtypes, informing targeted therapies for neurological disorders.\n\n## Systems-Level Organization\n\n### Sensory and Motor Pathways\n\nSensory pathways in the nervous system transmit information from peripheral receptors to the central nervous system, enabling the processing of environmental stimuli across various modalities. These pathways are organized in a hierarchical manner, beginning with primary sensory neurons that detect stimuli and progressing through relay stations to cortical areas for higher-order analysis. Key examples include the visual and somatosensory pathways, which illustrate the precision of topographic mapping and modality-specific routing.\n\nThe visual pathway originates in the retina, where photoreceptors transduce light into electrical signals processed by bipolar and ganglion cells. Retinal ganglion cell axons form the optic nerve, which partially decussates at the optic chiasm to segregate information from the left and right visual fields. The optic tract then carries this input to the lateral geniculate nucleus (LGN) of the thalamus, preserving retinotopic organization that maps the visual field spatially onto neural layers. From the LGN, axons project via the geniculostriate pathway through the optic radiations to the primary visual cortex (V1) in the occipital lobe, where initial feature detection for orientation, color, and motion occurs. This pathway maintains monocular input segregation in the LGN's layered structure, with magnocellular layers handling motion and parvocellular layers processing color and form.\n\nIn contrast, the somatosensory pathway for pain, temperature, and crude touch follows the spinothalamic tract. First-order neurons in dorsal root ganglia receive input from peripheral nociceptors and thermoreceptors, synapsing onto second-order neurons in the spinal cord's dorsal horn. These second-order neurons decussate immediately via the anterior white commissure and ascend contralaterally in the anterolateral white matter as the spinothalamic tract, forming the spinal lemniscus in the brainstem. The tract terminates in the ventral posterolateral nucleus (VPL) of the thalamus, from which third-order neurons project to the primary somatosensory cortex in the postcentral gyrus. This organization ensures rapid transmission of potentially harmful stimuli, with fibers conducting at velocities suited to their urgency.\n\nThe thalamus serves as a critical gateway, relaying nearly all sensory information (except olfaction) to the cerebral cortex through specific nuclei. For vision, the LGN receives retinal input and forwards it to V1, while for somatosensation, the VPL processes spinothalamic signals before projecting to the somatosensory cortex. This relay function involves gating and modulation, filtering irrelevant signals and enhancing salient ones based on cortical feedback, thereby shaping perceptual awareness.\n\nCross-modal integration occurs at subcortical sites like the superior colliculus, where sensory inputs from different modalities converge to produce enhanced behavioral responses. In audiovisual integration, superior colliculus neurons respond more robustly to spatiotemporally aligned visual and auditory stimuli within overlapping receptive fields, often yielding a 100-150% response increase compared to unimodal inputs. This enhancement, mediated by competitive neural networks and NMDA receptor nonlinearity, facilitates rapid orienting behaviors such as saccades, with spatial disparity leading to response depression. Such integration exemplifies how pathways interact beyond isolated modalities.\n\nMotor pathways exhibit a hierarchical organization, coordinating movement from reflexive actions to voluntary, goal-directed behaviors. At the lowest level, spinal reflexes involve local circuits where sensory afferents directly activate alpha motor neurons via interneurons, enabling rapid responses like the knee-jerk reflex without supraspinal input. Higher levels incorporate brainstem nuclei for posture and locomotion, while the primary motor cortex (M1) in the precentral gyrus encodes movement parameters such as direction and force, firing 5-100 milliseconds prior to execution.\n\nThe basal ganglia contribute to motor planning through cortico-basal ganglia-thalamo-cortical loops, selecting and initiating appropriate motor programs. Inputs from motor and prefrontal cortices converge in the striatum, which inhibits the globus pallidus internal segment to disinhibit thalamic projections back to the cortex, effectively gating movement onset. These loops integrate sensory and cognitive cues to refine action selection, with disruptions impairing initiation as seen in Parkinson's disease.\n\nThe cerebellum refines motor coordination via predictive internal models, compensating for sensory delays through forward and inverse computations. It receives cortical inputs via the pontine nuclei and climbs fibers, processing error signals to adjust timing in tasks like grip force modulation and saccades. Output through the dentatothalamic tract modulates motor cortex excitability, ensuring smooth, accurate movements; lesions result in ataxia and dysmetria due to impaired predictive control.\n\n### Neural Circuits and Networks\n\nNeural circuits refer to interconnected ensembles of neurons that process and transmit information through coordinated activity, forming the building blocks of brain function. These circuits operate at multiple scales, from local microcircuits in specific brain regions to distributed large-scale networks spanning the brain. Microcircuits, such as those in the cerebral cortex, rely on balanced excitatory and inhibitory interactions to shape neural responses. For instance, feedforward inhibition occurs when excitatory inputs activate inhibitory interneurons that suppress downstream pyramidal neurons, preventing overexcitation and refining signal timing. Feedback inhibition, in contrast, arises from recurrent connections where active pyramidal neurons recruit interneurons to dampen their own activity, stabilizing network dynamics. Canonical motifs like disinhibition further enhance flexibility; in cortical layers, vasoactive intestinal peptide (VIP)-expressing interneurons inhibit somatostatin-positive interneurons, thereby releasing pyramidal neurons from suppression and gating information flow. This disinhibitory motif allows selective enhancement of specific pathways, as seen in sensory processing where it modulates dendritic inputs to principal neurons.\n\nAt larger scales, neural networks integrate multiple regions to support complex operations. The default mode network (DMN), comprising the medial prefrontal cortex, posterior cingulate cortex, and angular gyrus, activates during introspection, self-referential thinking, and mind-wandering, showing anticorrelation with task-focused networks. This network's intrinsic connectivity facilitates internal mentation but deactivates during externally directed attention. Complementarily, the salience network, anchored in the anterior insula and dorsal anterior cingulate cortex, detects behaviorally relevant stimuli and orchestrates rapid shifts in attention by toggling between the DMN and central executive network. For example, salient events like unexpected sounds trigger salience network activation, suppressing DMN activity to prioritize goal-directed processing.\n\nNeural oscillations synchronize circuit activity, enabling communication across scales. Theta oscillations (4-8 Hz) in the hippocampus coordinate spatial navigation by phase-locking neuronal firing to environmental cues, as evidenced in human intracranial recordings during virtual maze tasks. These rhythms, generated by interactions between hippocampal pyramidal cells and GABAergic interneurons, support sequence encoding for path integration. Gamma oscillations (30-100 Hz), prevalent in cortical and hippocampal circuits, promote perceptual binding by synchronizing distributed neurons representing related features, such as linking visual contours into coherent objects. This high-frequency activity arises from excitatory-inhibitory loops, with 40 Hz gamma particularly implicated in cross-regional integration during attention.\n\nRecent connectomics efforts map these circuits' wiring, revealing architectural principles. The nematode *Caenorhabditis elegans* boasts a fully reconstructed connectome of 302 neurons and over 7,000 synapses, enabling detailed simulations of simple behaviors like foraging. In contrast, mammalian brains yield partial maps; 2025 analyses of mouse visual cortex via electron microscopy describe dense local motifs, including thousands of inhibitory connections per column, but full-brain resolution remains elusive due to scale.\n\n### Brain Regions and Their Roles\n\nThe human brain is anatomically divided into major regions, including the forebrain, midbrain, and hindbrain, each contributing specialized functions essential for cognition, emotion, movement, and survival. The forebrain, encompassing the cerebral cortex and subcortical structures, handles higher-order processing, while the midbrain and hindbrain manage sensory relay, motor coordination, and autonomic regulation. These regions interact through neural circuits to support integrated behavior, though their primary roles stem from distinct anatomical specializations.\n\nThe forebrain includes the cerebral cortex, a convoluted outer layer comprising about 80% of the brain's volume, which is responsible for advanced cognitive functions such as planning, decision-making, and integrating sensory information. Association areas within the cortex, particularly in the frontal and parietal lobes, synthesize diverse sensory inputs to form coherent perceptions and guide voluntary actions, enabling complex behaviors like problem-solving. The limbic system, a collection of forebrain structures including the amygdala and hippocampus, plays a central role in emotional processing and memory formation. The amygdala, located in the medial temporal lobe, rapidly evaluates emotional significance, particularly fear responses, by integrating sensory cues with affective valence to trigger adaptive reactions. In contrast, the hippocampus facilitates the consolidation of declarative memories, especially spatial navigation, by encoding contextual relationships between environmental features.\n\nHemispheric lateralization further refines forebrain functions, with the left hemisphere typically dominant for language processing in about 90% of right-handed individuals and 66% of left-handed ones. Broca's area in the left frontal lobe coordinates speech production, while Wernicke's area in the left temporal lobe supports language comprehension, allowing articulate expression and interpretation of verbal information. The right hemisphere, conversely, excels in spatial tasks, such as visuospatial orientation and holistic pattern recognition, contributing to abilities like face perception and musical processing.\n\nSubcortical structures in the forebrain, such as the basal ganglia and hypothalamus, underpin motor and homeostatic regulation. The basal ganglia form interconnected loops with the cortex and thalamus, modulating voluntary movement selection and execution through direct and indirect pathways. The direct pathway facilitates desired actions by disinhibiting thalamic projections to the motor cortex, while the indirect pathway suppresses competing movements, ensuring precise motor program activation. The hypothalamus, a small region at the base of the forebrain, maintains bodily homeostasis by monitoring and adjusting physiological parameters like hunger, thirst, and temperature. Nuclei such as the arcuate and ventromedial hypothalamus regulate feeding and energy balance, while the preoptic area controls thermoregulation, and the paraventricular nucleus oversees hormone release via the pituitary gland to sustain internal stability.\n\nThe midbrain and hindbrain collectively support basic motor and autonomic functions. The substantia nigra, a midbrain nucleus, initiates and modulates movement through dopaminergic projections to the basal ganglia's striatum, enhancing the direct pathway to promote action vigor and reward-based selection. Dopamine release from its pars compacta neurons signals motivational salience, facilitating the transition from intention to execution in voluntary behaviors. The brainstem, comprising the hindbrain's medulla oblongata, pons, and midbrain portions, governs vital involuntary processes, including respiration and cardiovascular control. Respiratory rhythm is generated in the medullary reticular formation, with pontine centers fine-tuning inhalation and exhalation rates, while vagal nuclei in the medulla adjust heart rate to match metabolic demands. These brainstem mechanisms ensure continuous support for life-sustaining activities without conscious effort.\n\n## Cognitive and Behavioral Processes\n\n### Perception and Sensory Integration\n\nPerception and sensory integration refer to the neural processes by which the brain combines and interprets inputs from multiple sensory modalities to form a unified and coherent representation of the external world. This integration occurs across hierarchical levels of the sensory processing stream, where low-level features are detected and progressively combined into higher-order percepts. Fundamental to this is the detection of basic stimulus attributes, such as edges and orientations, in early sensory areas, followed by the synthesis of these features into recognizable objects and the cross-modal fusion of signals from different senses. Disruptions in these mechanisms can lead to perceptual illusions, highlighting the brain's reliance on probabilistic inference to resolve ambiguities in sensory data.\n\nFeature detection begins in primary sensory cortices, where neurons respond selectively to specific stimulus properties. In the primary visual cortex (V1), neurons exhibit orientation selectivity, preferentially firing to edges at particular angles, as demonstrated by electrophysiological recordings in cats and primates. These simple and complex cells, identified through single-unit recordings, integrate inputs from the lateral geniculate nucleus to detect oriented bars or contours, forming the building blocks of visual scene analysis. Further along the ventral visual stream, the inferotemporal cortex processes more abstract object features, with neurons responding to complex shapes like faces or tools regardless of exact position or size, enabling invariant object recognition essential for identifying entities in varied contexts.\n\nA central challenge in perception is the binding problem: how disparate features, such as color, shape, and motion from different neural populations, are unified into a single object representation. One influential theory posits that synchronous firing of neurons encodes these associations, with stimulus-specific oscillations in the gamma frequency range (30-80 Hz) synchronizing activity across cortical columns when features belong to the same object. This mechanism, observed in cat visual cortex during presentations of aligned gratings, facilitates feature integration by temporally linking relevant signals while desynchronizing unrelated ones, supporting the perceptual coherence of complex scenes.\n\nMultisensory convergence enhances perceptual robustness by integrating signals from vision, audition, and other modalities in association areas. The superior temporal sulcus (STS) plays a key role in this process, where neurons respond to combined audiovisual cues, such as the sight and sound of actions like hand movements, with enhanced firing rates compared to unisensory inputs. A classic demonstration is the McGurk effect, an illusion where conflicting visual lip movements alter the perceived auditory syllable—for instance, dubbing a video of /ga/ onto an audio /ba/ results in hearing /da/—revealing automatic cross-modal fusion in speech perception.\n\nPerceptual illusions further illustrate sensory integration's vulnerability to temporal and spatial congruency. The rubber hand illusion induces a sense of ownership over a visible fake hand when it and the hidden real hand are stroked synchronously, shifting proprioceptive awareness toward the rubber hand and demonstrating how visuoproprioceptive conflicts are resolved in favor of visual dominance. This effect, measured via subjective reports and proprioceptive drift tasks, underscores the brain's multisensory Bayesian-like weighting of cues to maintain body schema integrity.\n\n### Learning, Memory, and Plasticity\n\nLearning and memory in neuroscience refer to the brain's capacity to acquire, store, and retrieve information through experience-dependent changes in neural circuits. These processes rely on underlying neural plasticity, which enables adaptive modifications in synaptic strength and connectivity across brain regions. Key memory systems distinguish between declarative memory, which involves conscious recollection of facts and events, and procedural memory, which governs unconscious skills and habits. Declarative memory, particularly episodic memory for personal experiences, depends heavily on the hippocampus for encoding and retrieval. In contrast, procedural memory formation and execution primarily engage the basal ganglia, including the striatum, which facilitates the automatization of motor sequences and cognitive routines.\n\nA central concept in memory storage is the engram, defined as the physical trace of a memory encoded by ensembles of neurons. Seminal optogenetic studies in mice have identified engram cells in the hippocampus that are activated during fear conditioning and can be reactivated to elicit memory recall. For instance, light stimulation of these engram cells sufficient to induce freezing behavior demonstrates their causal role in retrieving context-specific fear memories. This approach has revealed that engrams are sparse, distributed populations of neurons whose activity patterns represent specific experiences.\n\nMemory consolidation stabilizes initially labile traces into enduring forms through distinct temporal phases. Synaptic consolidation occurs rapidly, within hours, involving local strengthening of connections at the site of encoding to prevent decay. Systems consolidation, unfolding over days or longer, reorganizes memories across brain networks, gradually reducing hippocampal dependence as cortical representations strengthen. Sleep plays a critical role in this process via replay of learning-related neural activity, where hippocampal sharp-wave ripples during non-rapid eye movement sleep reactivate engram ensembles to facilitate transfer to neocortical storage.\n\nForgetting is not merely passive decay but an active neural process that promotes behavioral flexibility by selectively eliminating irrelevant information. Active forgetting mechanisms include targeted degradation of synaptic traces, such as through microglia-mediated pruning that removes unused connections via complement-dependent pathways. Brain-derived neurotrophic factor (BDNF) modulates this pruning by regulating dendritic spine elimination and synaptic maturation, contributing to the refinement of memory circuits during development and learning. Disruptions in these processes can lead to pathological retention of maladaptive memories, as seen in neuropsychiatric disorders.\n\n### Emotion, Motivation, and Social Behavior\n\nThe limbic system plays a central role in processing emotions, with key interactions between the amygdala and medial prefrontal cortex (mPFC) facilitating fear conditioning. The amygdala detects potential threats and initiates rapid defensive responses, while the mPFC modulates these reactions through inhibitory projections, enabling the extinction of fear memories and contextual regulation of emotional responses. Seminal studies have demonstrated that lesions or disruptions in the amygdala-prefrontal circuit impair the acquisition and extinction of conditioned fear, highlighting their partnership in adaptive emotional learning.\n\nReward processing within the limbic circuit involves the nucleus accumbens (NAc), a key hub for encoding reward prediction errors (RPEs), which signal discrepancies between expected and actual rewards to guide motivational behavior. Dopaminergic inputs from the ventral tegmental area to the NAc compute these RPEs, driving reinforcement learning and approach behaviors toward appetitive stimuli. Classic electrophysiological recordings in primates revealed that NAc dopamine responses shift from unpredicted rewards to reward-predicting cues, underscoring the circuit's role in updating value representations.\n\nPhasic bursts of dopamine in midbrain neurons, as identified in the 1990s, are critical for motivating goal-directed actions by invigorating effort and sustaining pursuit of rewards. These transient dopamine signals, elicited by unexpected rewards or salient cues, enhance neural plasticity in downstream targets like the NAc and prefrontal cortex, thereby linking emotional valence to behavioral drive. In parallel, oxytocin modulates social bonding by promoting affiliative behaviors and pair formation, particularly through interactions with the mesolimbic dopamine system in monogamous species like prairie voles. Intracerebral oxytocin administration facilitates partner preference formation post-mating, revealing its role in stabilizing long-term social attachments.\n\nMirror neurons, discovered in the premotor cortex of macaque monkeys during the 1990s, fire both during action execution and observation of similar actions in others, providing a neural basis for empathy and social imitation. These neurons in area F5 encode goal-directed motor acts, allowing observers to map others' intentions onto their own motor repertoire, which supports interpersonal understanding and emotional contagion.\n\nEmotional experiences often integrate with memory formation, where affective valence from limbic circuits enhances consolidation of salient events, as seen in amygdala-modulated hippocampal plasticity.\n\n## Computational and Theoretical Approaches\n\n### Neural Modeling and Simulation\n\nNeural modeling and simulation in neuroscience involve the development of mathematical and computational frameworks to replicate the dynamics of individual neurons and neural networks, enabling predictions about brain function without direct experimentation. These models abstract biological processes into equations that capture key mechanisms such as membrane potential changes and synaptic interactions, facilitating the study of emergent behaviors in complex systems. By simulating neural activity at various scales, researchers can test hypotheses on how neural circuits—such as those underlying sensory processing or motor control—give rise to cognitive phenomena.\n\nA foundational approach to single-neuron modeling is the integrate-and-fire (IF) framework, which simplifies the Hodgkin-Huxley equations by focusing on subthreshold voltage dynamics and instantaneous spiking. The leaky integrate-and-fire (LIF) variant incorporates passive membrane properties, governed by the differential equation:\n\n\\[\n\\frac{dV}{dt} = -\\frac{g_L (V - E_L)}{C} + I\n\\]\n\nwhere \\(V\\) is the membrane potential, \\(g_L\\) is the leak conductance, \\(E_L\\) the leak reversal potential, \\(C\\) the membrane capacitance, and \\(I\\) the input current; a spike occurs when \\(V\\) reaches a threshold, after which it resets. This model, tracing back to early excitability studies, efficiently simulates spiking patterns in response to synaptic inputs while capturing temporal integration.\n\nFor network-level simulations, mean-field models like the Wilson-Cowan equations describe the population dynamics of excitatory (E) and inhibitory (I) neurons, balancing activity through recurrent connections. The core equations are:\n\n\\[\n\\frac{dE}{dt} = -E + f(I_E - w_{EE} E + w_{IE} I)\n\\]\n\n\\[\n\\frac{dI}{dt} = -I + f(I_I + w_{EI} E - w_{II} I)\n\\]\n\nwhere \\(f\\) is a nonlinear firing-rate function (often sigmoidal), \\(I_E\\) and \\(I_I\\) are external inputs, and \\(w_{ij}\\) are connection strengths; these capture oscillations and stability in cortical networks. Originally formulated to model localized neural populations, they remain influential for analyzing rhythmicity and synchronization.86139-6.pdf)\n\nAdvanced simulation tools enable detailed multicompartment modeling of neuron morphology and biophysical properties. The NEURON software, a widely adopted platform, supports declarative specification of ionic channels, cable properties, and network topologies, allowing simulations from single cells to large-scale circuits on standard hardware. Complementary efforts, such as the Blue Brain Project's digital reconstructions in the 2020s, have produced morphologically and biophysically accurate models of neocortical columns, integrating thousands of neurons with validated synaptic rules to simulate microcircuit function.01145-3)\n\nModel validation is crucial and often achieved by comparing simulated responses to empirical data, such as patch-clamp recordings that measure voltage dynamics and ionic currents in isolated neurons. For instance, parameter fitting ensures that LIF or multicompartment models replicate observed firing rates and adaptation under current injection, with discrepancies minimized through optimization techniques; this process confirms the models' fidelity to biological reality across cell types.\n\n### Information Processing in the Brain\n\nThe brain processes information through neural coding schemes that transform sensory inputs and internal states into patterns of neuronal activity, enabling the encoding, transmission, and decoding of signals across neural circuits. These schemes operate at multiple scales, from individual neurons to populations, and are shaped by the biophysical constraints of spiking activity. Fundamental to this process is the idea that neurons do not merely relay signals but actively represent information in ways that optimize efficiency and reliability.\n\nOne prevalent coding scheme is **rate coding**, where the intensity of a stimulus is represented by the frequency of action potentials (spikes) fired by a neuron over a given time window, typically averaging activity to smooth out variability. For instance, in sensory systems like the auditory nerve, higher sound intensities correlate with increased firing rates, allowing the brain to gauge stimulus strength. This approach is computationally simple and robust to timing jitter but may lose fine temporal details. In contrast, **temporal coding** relies on the precise timing of individual spikes relative to an external event or internal rhythm, such as the phase of an oscillatory signal, to convey information. Evidence from the gustatory and visual systems shows that spike latencies or intervals can encode stimulus features like taste concentration or motion direction with higher resolution than rates alone, particularly for rapidly changing inputs. Complementing these single-neuron mechanisms, **population coding** integrates activity across groups of neurons, where the collective pattern represents complex variables; a classic example is the population vector model in motor cortex, in which the direction of arm movement is decoded from the weighted sum of preferred directions encoded by individual neurons' firing rates. This distributed representation enhances precision and robustness, as seen in primate studies where population vectors accurately predict three-dimensional reaching trajectories.\n\nThe efficient coding hypothesis posits that neural systems evolve to minimize redundancy in sensory inputs, transmitting only essential information to conserve metabolic resources and bandwidth. Proposed by Horace Barlow in 1961, this principle suggests that early sensory stages, such as the retina, perform decorrelation to reduce statistical dependencies in natural signals, thereby maximizing information per spike. For example, retinal ganglion cells achieve redundancy reduction by whitening spatial correlations in visual scenes, aligning their responses with the statistics of natural images to efficiently encode edges and contrasts without wasteful repetition. This hypothesis has been validated through models showing that such adaptations improve signal reconstruction fidelity while limiting neural firing rates.\n\nBuilding on efficient coding, the Bayesian brain framework views information processing as probabilistic inference, where the brain maintains generative models to predict sensory data and updates beliefs to minimize prediction errors. Central to this is Karl Friston's free energy principle from the 2010s, which formalizes the brain's drive to minimize variational free energy—a bound on surprise—as an approximation to Bayesian updating. Mathematically, free energy \\( F \\) is expressed as:\n\n$$\nF = \\mathrm{KL}[Q \\parallel P] - \\ln P(\\mathrm{data})\n$$\n\nwhere \\( \\mathrm{KL}[Q \\parallel P] \\) is the Kullback-Leibler divergence between the approximate posterior \\( Q \\) and the true posterior \\( P \\), and \\( -\\ln P(\\mathrm{data}) \\) captures model evidence; minimizing \\( F \\) enables predictive processing by adjusting internal models to better anticipate inputs, as evidenced in perceptual tasks where hierarchical cortical layers refine predictions layer by layer. This approach unifies perception, action, and learning under a single imperative: reducing uncertainty about the environment.\n\nNeural information processing must also contend with inherent noise from synaptic variability, ion channel fluctuations, and external perturbations, yet this noise can paradoxically enhance reliability through phenomena like stochastic resonance. In stochastic resonance, moderate noise levels amplify weak subthreshold signals by increasing the probability of spiking, optimizing signal-to-noise ratios in nonlinear neural systems; for instance, in sensory neurons, added noise improves detection of faint auditory or visual stimuli, as demonstrated in psychophysical experiments where performance peaks at intermediate noise intensities. This mechanism contributes to the brain's adaptability, allowing noisy environments to facilitate rather than hinder information transmission across scales.\n\n### Brain-Inspired Algorithms\n\nBrain-inspired algorithms draw from principles of neural computation to develop efficient, adaptive systems in artificial intelligence and computing. These algorithms mimic aspects of biological neural processing, such as learning through synaptic adjustments and sparse, event-driven activity, to address challenges in machine learning where traditional von Neumann architectures fall short in energy efficiency and scalability.\n\nArtificial neural networks (ANNs) form the foundational class of brain-inspired algorithms, simulating interconnected neurons to process information in layers. The perceptron, introduced by Frank Rosenblatt in 1958, represents an early model of a single-layer neural unit capable of binary classification by weighting inputs and applying a threshold function, inspired by the brain's sensory processing. This simple architecture laid the groundwork for supervised learning but was limited to linearly separable problems. To overcome these limitations, the backpropagation algorithm, developed by David Rumelhart, Geoffrey Hinton, and Ronald Williams in 1986, enabled training of multi-layer networks by propagating errors backward through layers using gradient descent, allowing complex pattern recognition akin to hierarchical processing in the visual cortex. Backpropagation revolutionized machine learning, powering applications from image recognition to natural language processing.\n\nSpiking neural networks (SNNs) extend ANNs by incorporating temporal dynamics and energy-efficient spike-based communication, more closely emulating biological neurons that transmit discrete action potentials rather than continuous activations. The Izhikevich model, proposed by Eugene Izhikevich in 2003, provides a computationally simple yet biologically plausible framework for simulating diverse neuronal firing patterns, including regular spiking, bursting, and adaptation, using just two differential equations. The model's dynamics are governed by:\n\n\\[\nC \\dot{v} = k (v - v_r)(v - v_t) - u + I\n\\]\n\n\\[\n\\dot{u} = a (b (v - v_r) - u)\n\\]\n\nwhere \\(v\\) is the membrane potential, \\(u\\) represents recovery current, \\(I\\) is synaptic input, and parameters \\(a\\), \\(b\\), \\(C\\), \\(v_r\\), \\(v_t\\) tune the firing behavior; upon reaching a spike threshold (\\(v \\geq 30\\) mV), \\(v\\) resets and \\(u\\) updates. This quadratic integrate-and-fire variant balances accuracy and efficiency, enabling real-time simulation of large-scale networks on standard hardware.\n\nNeuromorphic hardware implements these algorithms in specialized chips that replicate neural architecture for low-power, parallel processing. IBM's TrueNorth chip, unveiled in 2014, integrates 1 million digital neurons and 256 million programmable synapses across 4096 cores, operating at 70 mW while handling asynchronous spike events in a scalable, brain-like manner. Building on this, Intel's Loihi 2 processor, released in 2021, advances on-chip learning with 128 neuromorphic cores supporting stateful neuron models and microcode-programmable plasticity rules, achieving up to 10x improvements in energy efficiency for tasks like optimization and robotics.\n\nRecent advances as of 2025 incorporate hybrid AI-neuroscience models that leverage synaptic pruning analogs—biological processes eliminating weak connections during development—to enhance model efficiency in specialized domains. For instance, synaptic pruning-inspired regularization techniques prune redundant weights in deep networks, reducing overfitting and computational demands while improving generalization, as demonstrated in biologically motivated dropout variants. In drug discovery, brain-inspired algorithms like the BiFDR (Brain-Inspired Federated Diffusion Transformer) model integrate neural generative processes with federated learning to design novel molecules for drug discovery, accelerating hit identification by mimicking sparse connectivity and adaptive refinement in neural circuits. These hybrids promise to streamline therapeutic development by combining neuromorphic sparsity with AI-driven prediction, potentially cutting discovery timelines by orders of magnitude.\n\n## Research Methods and Techniques\n\n### Neuroimaging and Mapping\n\nNeuroimaging encompasses a suite of non-invasive techniques that allow visualization of brain structure, function, and connectivity, providing critical insights into neural organization and activity patterns in living subjects. These methods rely on physical properties of tissues, such as magnetic resonance or radioactive tracers, to generate images without requiring direct intervention. Structural neuroimaging focuses on anatomical details, while functional approaches capture dynamic processes, and connectivity analyses reveal networked interactions across brain regions. Limitations include spatial and temporal resolutions constrained by the underlying physiology and instrumentation, typically operating at millimeter scales for macroscopic mapping.\n\nStructural magnetic resonance imaging (MRI) employs T1- and T2-weighting to delineate brain anatomy with high fidelity. T1-weighted images, acquired using short repetition and echo times, provide excellent gray-white matter contrast due to differences in longitudinal relaxation times, making them ideal for volumetric segmentation and cortical surface reconstruction. T2-weighted images, with longer repetition and echo times, emphasize transverse relaxation, highlighting cerebrospinal fluid and pathological changes like inflammation or demyelination by accentuating water-rich tissues. These contrasts enable precise mapping of brain morphology, supporting studies of development, aging, and disorders. Diffusion tensor imaging (DTI), a specialized MRI variant, quantifies water diffusion anisotropy to trace white matter tracts; the fractional anisotropy (FA) metric, ranging from 0 (isotropic) to 1 (highly directional), serves as a biomarker of fiber integrity and organization, with values typically 0.4-0.8 in healthy tracts.\n\nFunctional neuroimaging techniques infer neural activity through indirect physiological proxies. Functional MRI (fMRI) detects blood-oxygen-level-dependent (BOLD) signals arising from deoxyhemoglobin's paramagnetic effects on local magnetic fields; task-evoked or spontaneous fluctuations in oxygenation reflect heightened metabolic demands. The BOLD response follows a hemodynamic function peaking 4-6 seconds post-stimulus with a 2-5 second lag, limiting temporal resolution but offering whole-brain coverage at 1-3 mm voxels. Positron emission tomography (PET) measures regional cerebral metabolism via tracers like 18F-fluorodeoxyglucose (FDG), whose uptake reflects glucose utilization proportional to synaptic activity; FDG-PET thus maps energy consumption hotspots, with uptake rates calibrated against lumped constants derived from kinetic modeling.\n\nConnectivity mapping extends these modalities to elucidate large-scale networks. Resting-state fMRI exploits low-frequency BOLD correlations (\\u003c0.1 Hz) during unconstrained cognition to define intrinsic networks, such as the default mode network spanning medial prefrontal and posterior cingulate cortices; this approach reveals synchronized activity without tasks, though millimeter resolution (e.g., 2-4 mm voxels) precludes subcellular detail and confounds from motion or physiology persist. Such analyses have mapped canonical circuits, including sensorimotor and salience networks, informing models of brain-wide integration. Recent advancements as of 2025 include methods to track brain-wide synaptic protein changes, integrating PET and advanced MRI for higher-resolution mapping of synaptic dynamics.\n\nRecent advancements in 2025 leverage ultra-high-field 7T MRI for enhanced signal-to-noise ratios, enabling layer-specific structural and functional imaging at sub-millimeter resolutions. At 7T, T1/T2 contrasts resolve laminar cortical architecture, distinguishing superficial from deep layers in regions like primary visual cortex, and support high-resolution tractography with improved FA sensitivity. These capabilities, demonstrated in human studies of sensory processing, promise refined mapping of microcircuitry while mitigating distortions through advanced shimming and sequences.\n\n### Electrophysiological Recordings\n\nElectrophysiological recordings provide high temporal precision for measuring electrical activity in neural tissues, enabling the study of ion channel function, synaptic transmission, and network dynamics at the cellular level. These invasive techniques involve direct electrode insertion into brain tissue or cell cultures to capture voltage changes associated with neuronal signaling, contrasting with non-invasive methods by offering sub-millisecond resolution of events like action potentials. Developed in the late 20th century, such recordings have revolutionized neuroscience by allowing real-time observation of single neurons and populations in vivo and in vitro.\n\nThe patch-clamp technique, pioneered by Neher and Sakmann, uses a glass micropipette to form a high-resistance seal with the cell membrane, isolating ionic currents for precise measurement. In whole-cell mode, the pipette interior dialyzes the cell's cytoplasm, permitting recording of total membrane currents under current-clamp for membrane potential changes or voltage-clamp for controlled voltage steps to study channel kinetics. This method has been instrumental in elucidating voltage-gated sodium and potassium currents underlying action potentials, with resolutions down to picoampere levels. Voltage-clamp configurations, including cell-attached patches, further enable single-channel recordings without disrupting cellular homeostasis.\n\nExtracellular multi-electrode arrays (MEAs) consist of planar or 3D grids of microelectrodes that detect field potentials from multiple neurons simultaneously without penetrating cell membranes, facilitating long-term monitoring of network activity in cultured slices or organoids. These arrays, with electrode densities up to thousands per square millimeter, capture extracellular spikes and local oscillations, providing insights into synchronized firing patterns across populations. Advances in CMOS-based MEAs have scaled recordings to over 10,000 channels, enhancing throughput for drug screening and circuit mapping.\n\nIn vivo applications often employ tetrode recordings, bundles of four fine wires that improve single-unit isolation by comparing waveforms across channels to localize neuron positions in 3D space. Tetrodes yield higher isolation rates—up to several units per shank—compared to single electrodes, enabling chronic implantation in freely moving animals to track place cells or motor neurons over extended periods. Complementing this, local field potentials (LFPs) derived from low-pass filtered tetrode signals reflect population-level synaptic currents and subthreshold membrane fluctuations, indexing oscillatory rhythms like theta or gamma waves that coordinate neural ensembles. These recordings capture action potentials as brief extracellular voltage transients generated by rapid ion fluxes during depolarization and repolarization.\n\nOptrode hybrids integrate optical fibers or LEDs with recording electrodes, merging optogenetics for targeted neuronal control with electrophysiology for readout. By delivering light to activate channelrhodopsin-expressing cells while simultaneously recording evoked spikes, optrodes enable causal inference of circuit motifs, such as excitatory-inhibitory balance in the cortex. Devices like silicon-based optrodes minimize tissue damage and heat artifacts, supporting multisite stimulation in behaving rodents.\n\nRecordings are prone to artifacts from movement, electromagnetic noise, or overlapping spikes, necessitating robust analysis pipelines. Spike sorting disentangles multi-unit signals by extracting features like waveform principal components via PCA, which reduces dimensionality while preserving variance for clustering into putative units based on shape similarity. Traditional PCA-based methods, effective for tetrode data, achieve isolation accuracies above 90% in low-noise conditions but struggle with drifts. In the 2020s, AI-driven approaches, including deep neural networks like convolutional autoencoders, have advanced real-time decoding by automating detection and sorting on high-density arrays, reducing processing time to milliseconds and improving yield in dense recordings. As of 2025, NeuroAI integrations further enhance analysis of large-scale datasets from these arrays.\n\n### Genetic and Molecular Tools\n\nGenetic and molecular tools have revolutionized neuroscience by enabling precise manipulation of genes and molecules in living neurons, allowing researchers to dissect causal relationships in neural circuits and functions. These techniques facilitate targeted gene delivery, conditional genetic modifications, and activity control through light or chemical actuators, providing spatiotemporal specificity that traditional methods lack. By integrating genetic engineering with molecular biology, scientists can express or silence specific proteins in defined neuronal populations, advancing understanding of brain development, plasticity, and disorders.\n\nViral vectors, particularly adeno-associated viruses (AAVs), serve as efficient vehicles for gene delivery in the nervous system due to their low immunogenicity, long-term expression, and ability to transduce both dividing and non-dividing cells like neurons. AAVs can carry transgenes up to 4.7 kb, with serotypes such as AAV9 crossing the blood-brain barrier for systemic delivery, enabling widespread or region-specific expression in rodent and primate models. The Cre-lox recombination system complements AAV delivery by allowing conditional knockouts, where loxP-flanked DNA segments are excised only in cells expressing Cre recombinase, driven by neuron-specific promoters like CaMKIIα for precise spatiotemporal control of gene ablation in the brain. This approach has been instrumental in studying gene functions without embryonic lethality, as demonstrated in models of synaptic plasticity and neurodegeneration.\n\nOptogenetics employs light-sensitive proteins to control neuronal activity with millisecond precision, pioneered by the introduction of Channelrhodopsin-2 (ChR2) in 2005, a algal-derived cation channel that depolarizes neurons upon blue light illumination, enabling reliable spiking in targeted cells. For inhibition, halorhodopsin (NpHR), a light-driven chloride pump from archaea, hyperpolarizes neurons under yellow light, suppressing action potentials and synaptic transmission without altering endogenous signaling pathways. These tools, expressed via viral vectors, have mapped neural circuits by activating or silencing specific populations, such as dopaminergic neurons in reward pathways.\n\nChemogenetics uses designer receptors exclusively activated by designer drugs (DREADDs), engineered G-protein-coupled receptors unresponsive to natural ligands but activated by inert compounds like clozapine-N-oxide, allowing remote modulation of neuronal excitability or signaling. First developed in 2007 from muscarinic acetylcholine receptors, DREADDs enable excitation (via Gq-coupled hM3Dq) or inhibition (via Gi-coupled hM4Di) of targeted neurons, with applications in probing behavioral circuits like anxiety and addiction. Their chemical activation provides longer timescales than optogenetics, suitable for chronic studies.\n\nRecent advances in CRISPR-based base editing, as of 2025, offer precise neural mutations without double-strand breaks (DSBs), reducing off-target effects and genomic instability compared to traditional CRISPR-Cas9. Base editors fuse deaminases to catalytically dead Cas9, converting C-to-T or A-to-G in DNA, enabling single-nucleotide corrections in neuronal genes linked to disorders like epilepsy. In neuroscience, these tools have facilitated in vivo editing of synaptic proteins in mouse models, enhancing precision for studying mutation-specific phenotypes without indels, with applications demonstrated in rare neurodevelopmental disorders.\n\n## Clinical Neuroscience and Disorders\n\n### Neurodegenerative Diseases\n\nNeurodegenerative diseases encompass a group of progressive neurological disorders characterized by the gradual loss of neurons and synaptic connections in the brain, leading to cognitive, motor, and functional impairments. These conditions, including Alzheimer's disease (AD) and Parkinson's disease (PD), arise from complex interactions between genetic, environmental, and aging-related factors, resulting in protein misfolding, aggregation, and cellular toxicity. Unlike acute injuries, neurodegeneration unfolds over years or decades, often beginning with subtle pathological changes before manifesting clinically.\n\nAlzheimer's disease, the most common neurodegenerative disorder, is defined by the accumulation of extracellular amyloid-beta (Aβ) plaques and intracellular neurofibrillary tangles composed of hyperphosphorylated tau protein, which disrupt neuronal function and promote cell death. These hallmarks primarily affect the hippocampus and cortex, impairing memory and cognition. Additionally, AD involves a significant cholinergic deficit due to degeneration of neurons in the basal forebrain, reducing acetylcholine signaling essential for learning and attention.\n\nParkinson's disease features the selective death of dopaminergic neurons in the substantia nigra pars compacta, leading to dopamine depletion in the striatum and motor circuit dysfunction. Pathologically, it is marked by intraneuronal inclusions known as Lewy bodies, primarily consisting of aggregated alpha-synuclein protein, which spreads prion-like through neural networks and exacerbates neuronal vulnerability. This alpha-synuclein pathology extends beyond the substantia nigra to other brainstem and cortical regions in advanced stages.\n\nEpidemiologically, aging is the primary risk factor for neurodegenerative diseases, with AD prevalence reaching approximately 11% among individuals over 65 in the United States, affecting an estimated 7.2 million people aged 65 and older in 2025. For PD, prevalence is about 1% in those over 60, with nearly 1.1 million cases in the U.S. and around 90,000 new diagnoses annually. Genetic factors significantly modulate risk; the APOE ε4 allele is the strongest known genetic contributor to late-onset AD, present in 15-25% of the population and increasing disease odds by 3- to 15-fold depending on copy number.\n\nBy 2025, blood-based biomarkers have advanced diagnostics for neurodegenerative diseases, particularly through assays detecting phosphorylated tau species like p-tau217, which correlate strongly with brain tau tangle burden in AD and enable early, non-invasive detection with high specificity. These plasma markers distinguish AD pathology from other dementias and show promise in PD for identifying comorbid tauopathy, facilitating presymptomatic screening in at-risk populations.\n\n### Neuropsychiatric Conditions\n\nNeuropsychiatric conditions encompass a range of disorders characterized by disruptions in mood, thought processes, and behavior, arising from complex interactions within neural circuits rather than primary neuronal loss. These conditions often involve imbalances in neurotransmitter systems and altered stress responses, leading to symptoms such as hallucinations, persistent sadness, or social withdrawal. Research highlights how genetic, environmental, and developmental factors contribute to these dysfunctions, with implications for understanding brain plasticity and resilience.\n\nSchizophrenia is a prototypical neuropsychiatric disorder marked by positive symptoms (e.g., delusions, hallucinations), negative symptoms (e.g., apathy, social isolation), and cognitive deficits. The dopamine hypothesis posits that hyperactivity in the mesolimbic pathway contributes to positive symptoms, while hypoactivity in the mesocortical pathway underlies negative and cognitive symptoms, supported by evidence from positron emission tomography studies showing elevated dopamine synthesis in the striatum of affected individuals. Additionally, hypofunction of NMDA glutamate receptors disrupts cortical excitatory-inhibitory balance, leading to widespread circuit dysconnectivity; this model is evidenced by the ability of NMDA antagonists like ketamine to induce schizophrenia-like symptoms in healthy volunteers.\n\nMajor depressive disorder involves pervasive low mood, anhedonia, and psychomotor changes, linked to monoamine neurotransmitter deficiencies. The monoamine depletion hypothesis suggests reduced serotonin, norepinephrine, and dopamine levels impair mood regulation, as demonstrated by rapid mood worsening following acute depletion of these transmitters in remitted patients. Chronic stress exacerbates this through dysregulation of the hypothalamic-pituitary-adrenal (HPA) axis, resulting in sustained cortisol hypersecretion that atrophies hippocampal neurons and prefrontal circuits, with postmortem studies revealing elevated glucocorticoid receptor resistance in depressed brains.\n\nAutism spectrum disorder (ASD) features challenges in social communication and repetitive behaviors, rooted in early neurodevelopmental anomalies. Deficits in synaptic pruning during adolescence fail to refine cortical connectivity, leading to excessive local circuits and impaired long-range integration, as shown in neuroimaging of adolescents with ASD displaying enlarged cortical surface areas.00613-5) Genetic variants in the oxytocin pathway, such as single nucleotide polymorphisms in the OXTR gene, diminish social bonding and empathy, with intranasal oxytocin administration improving eye gaze and trust behaviors in ASD individuals during functional MRI tasks.\n\nEmerging insights as of 2025 underscore the gut-brain axis's role in anxiety disorders, where microbiota dysbiosis modulates vagus nerve signaling to amplify amygdala hyperactivity and prefrontal hypoactivation. Clinical trials demonstrate that fecal microbiota transplantation from healthy donors reduces anxiety symptoms by restoring vagal anti-inflammatory pathways, with vagotomy abolishing these effects in rodent models. These conditions often intersect with emotional circuits, influencing motivation and social behavior through dysregulated limbic-prefrontal networks.\n\n### Diagnosis and Treatment Strategies\n\nDiagnosis in clinical neuroscience relies on a combination of clinical evaluation, imaging, and specialized laboratory tests to identify neurological and psychiatric disorders such as epilepsy, multiple sclerosis (MS), Huntington's disease, and schizophrenia. Electroencephalography (EEG) is a cornerstone for diagnosing epilepsy, capturing abnormal electrical activity in the brain that manifests as interictal epileptiform discharges or ictal patterns during seizures. For MS, lumbar puncture to analyze cerebrospinal fluid (CSF) for oligoclonal bands provides evidence of intrathecal immunoglobulin synthesis, supporting the diagnosis when combined with MRI findings of demyelination. Genetic testing plays a pivotal role in confirming hereditary conditions like Huntington's disease, where expansion of CAG repeats in the HTT gene beyond 36 repeats confirms the diagnosis and predicts disease onset.\n\nSymptomatic treatments target core manifestations of these disorders to improve quality of life and reduce symptom severity. In epilepsy, antiepileptic drugs like valproate are widely used for their broad-spectrum efficacy against both generalized and focal seizures, modulating neuronal excitability through enhancement of GABAergic transmission and sodium channel blockade. For schizophrenia, particularly treatment-resistant cases, clozapine stands out as the most effective antipsychotic, reducing positive and negative symptoms via multi-receptor antagonism, including strong D4 dopamine and 5-HT2A serotonin blockade, with superior outcomes in reducing relapse rates compared to other agents.\n\nOngoing monitoring enhances management by enabling proactive interventions. In the 2020s, wearable devices integrated with machine learning algorithms have advanced seizure prediction in epilepsy by analyzing physiological signals like heart rate variability and electrodermal activity from wrist-based sensors, achieving sensitivity rates up to 80% in prospective studies for forecasting seizures hours in advance.\n\nKey challenges in diagnosis and treatment include overcoming the blood-brain barrier (BBB), which restricts over 98% of small-molecule drugs from reaching therapeutic concentrations in the central nervous system due to tight endothelial junctions and efflux transporters like P-glycoprotein. Additionally, personalized medicine approaches via pharmacogenomics address inter-individual variability in drug response; for instance, polymorphisms in genes like CYP2D6 influence metabolism of antipsychotics in schizophrenia, guiding dosing to minimize adverse effects and optimize efficacy in neurodegenerative disorders.\n\n## Translational and Applied Neuroscience\n\n### Drug Development and Pharmacology\n\nDrug development in neuroscience focuses on identifying and validating molecular targets within the central nervous system (CNS) to address disorders such as Alzheimer's disease (AD) and amyotrophic lateral sclerosis (ALS), while overcoming barriers like the blood-brain barrier (BBB). The process typically spans 12 to 15 years from discovery to regulatory approval, emphasizing rigorous validation to mitigate high failure rates in CNS therapeutics. Key stages include target identification, preclinical testing, and phased clinical trials, with innovations in delivery systems and pharmacodynamics enhancing efficacy.\n\nTarget identification begins with elucidating disease mechanisms, such as hyperphosphorylated tau protein in AD, which forms neurofibrillary tangles disrupting neuronal function. Kinase inhibitors targeting tau phosphorylation, like those inhibiting glycogen synthase kinase-3 (GSK-3), have emerged as promising candidates by reducing tau aggregation in preclinical models. For instance, small-molecule inhibitors of tau kinases have demonstrated reduced cytotoxicity in cellular assays of AD pathology. These efforts prioritize high-impact targets like tau aggregation initiators, informed by genetic and proteomic studies.\n\nPreclinical testing relies heavily on rodent models to evaluate safety, efficacy, and pharmacokinetics before human trials. Transgenic mouse models expressing mutant human tau or amyloid-beta mimic AD pathology, allowing assessment of drug effects on plaque formation and cognitive deficits. Similarly, SOD1 mutant rat models replicate ALS motor neuron degeneration, testing compounds for neuroprotection. These models, while not perfect predictors of human outcomes, validate target engagement and dosing, with recent advancements incorporating multi-organoid systems for better translational relevance. Despite limitations in replicating complex human CNS environments, translation from preclinical rodent models to human efficacy in neuropsychiatric drugs remains low, with overall success rates around 9%.\n\nClinical development proceeds through Phase I trials, which assess safety and pharmacokinetics in 20-100 healthy volunteers or patients, focusing on CNS penetration and tolerability for neurodrugs. Phase II trials evaluate efficacy in 100-300 patients with specific disorders, using biomarkers like neuroimaging to measure target engagement, such as reduced tau levels in AD. Phase III confirmatory trials, involving hundreds to thousands, confirm therapeutic benefits against placebo, powering for subtle cognitive endpoints common in neuroscience. Challenges include high placebo responses and patient heterogeneity, contributing to only 53% success from Phase III to approval in neurology. Innovations like adaptive trial designs have accelerated CNS drug evaluation.\n\nAdvancing drug delivery is critical due to the BBB's restriction of 98% of small molecules from the CNS. Nanoparticles, such as lipid-based or polymeric carriers (1-200 nm), enhance BBB crossing via receptor-mediated transcytosis, delivering therapeutics like anti-amyloid agents directly to neurons with minimal systemic exposure. For AD, intranasal routes bypass the BBB via olfactory pathways, enabling rapid brain uptake; insulin nasal sprays, for example, reach memory-associated regions like the hippocampus, improving cognition in early trials. These strategies reduce off-target effects and improve bioavailability for biologics.\n\nPharmacodynamics in neuroscience examines how drugs interact with CNS targets, particularly neurotransmitter receptors. Receptor affinity, quantified by the dissociation constant \\( K_d \\), measures binding strength; low \\( K_d \\) values (e.g., nanomolar range) indicate high affinity, as seen in dopamine D2 receptor antagonists for Parkinson's, ensuring potent modulation at therapeutic doses. Allosteric modulation provides subtype selectivity by binding sites distinct from orthosteric ligands, altering receptor conformation to enhance or inhibit agonist efficacy without direct competition. For NMDA receptors in neuroprotection, positive allosteric modulators like D-cycloserine boost glycine affinity, prolonging channel opening for synaptic plasticity. This approach preserves physiological signaling, reducing side effects compared to orthosteric drugs.\n\nAs of 2025, the neuroscience pipeline features advanced gene therapies, notably antisense oligonucleotides (ASOs) targeting SOD1 mutations in ALS, which account for 2% of cases and cause toxic protein aggregation. Tofersen (Qalsody), an intrathecal ASO, reduces SOD1 mRNA by over 70% in cerebrospinal fluid, slowing disease progression in Phase III trials and gaining approvals in the US (2023) and UK (July 2025) for SOD1-ALS patients. Ongoing trials, including presymptomatic gene carriers (NCT04856982, estimated completion 2027), aim to enable early intervention, marking a shift toward precision pharmacotherapeutics. Other candidates, like AAV-based gene silences, complement ASOs in the pipeline.\n\n### Neurorehabilitation and Therapies\n\nNeurorehabilitation encompasses a range of non-pharmacological interventions aimed at restoring function and promoting recovery following neurological injury or disease, leveraging the brain's inherent capacity for neural plasticity. These therapies target motor, cognitive, and behavioral impairments by facilitating adaptive changes in neural circuits through repetitive practice, environmental modifications, and targeted stimulation.\n\nPhysical therapies form a cornerstone of neurorehabilitation, particularly for motor deficits resulting from conditions like stroke. Constraint-induced movement therapy (CIMT) involves restricting the unaffected limb to force intensive use of the impaired one, typically over 2-6 weeks of daily sessions, which has been shown to improve upper extremity function in chronic stroke survivors. A seminal randomized controlled trial demonstrated that CIMT leads to sustained gains in motor performance and activities of daily living, with effects persisting up to a year post-treatment. Complementing CIMT, transcranial direct current stimulation (tDCS) applies low-intensity electrical currents to the scalp to modulate cortical excitability, enhancing motor learning during rehabilitation exercises. Meta-analyses indicate that anodal tDCS over the primary motor cortex improves motor skill acquisition by 10-20% in healthy individuals and stroke patients, with optimal effects when combined with physical practice.\n\nCognitive rehabilitation addresses deficits in attention, memory, and executive function, often following traumatic brain injury (TBI). Computerized cognitive training programs, such as those using adaptive tasks to target selective attention, have proven effective in mitigating post-TBI attentional impairments. Randomized trials show improvements in sustained attention on standardized tests like the Test of Everyday Attention following 8-12 weeks of training, with benefits transferring to real-world tasks such as driving safety. These interventions exploit neural plasticity by promoting synaptic strengthening and network reorganization in frontoparietal attention circuits.\n\nEmerging cellular therapies, including stem cell implants, offer promise for structural repair in neurodegenerative diseases. Induced pluripotent stem cell (iPSC)-derived neurons, generated from patient-specific cells and differentiated into dopaminergic neurons, have entered clinical trials for Parkinson's disease in the 2020s. A phase I/II trial initiated in 2021 demonstrated safe transplantation of iPSC-derived neurons into the putamen, with 2025 results confirming graft survival, dopamine production, and no tumor formation, alongside modest improvements in motor symptoms as measured by the Unified Parkinson's Disease Rating Scale up to 18 months post-implantation. These approaches aim to replace lost neurons and restore circuit integrity, though long-term efficacy and scalability remain under investigation in ongoing multicenter studies.\n\nNeurofeedback techniques enable patients to self-regulate brain activity, providing a behavioral tool for managing neuropsychiatric symptoms. EEG-based neurofeedback trains individuals to modulate specific frequency bands, such as theta/beta ratios, through real-time visual or auditory feedback during sessions. In attention-deficit/hyperactivity disorder (ADHD), meta-analyses of randomized trials show that 20-40 sessions of neurofeedback reduce core symptoms by 0.5-0.8 standard deviations on ADHD rating scales, comparable to stimulant medications in short-term effects, with gains in attention and impulsivity sustained for 6-12 months. This method fosters volitional control over dysregulated neural oscillations, particularly in prefrontal regions, without invasive procedures.\n\n### Brain-Computer Interfaces\n\nBrain-computer interfaces (BCIs) enable direct communication between the brain and external devices, allowing individuals to control computers, prosthetics, or other systems through neural signals alone. These interfaces translate brain activity—often measured via electrophysiological recordings—into actionable commands, bypassing traditional motor pathways. BCIs have evolved from experimental tools to therapeutic applications, particularly for restoring function in patients with paralysis, locked-in syndrome, or neurological disorders. Early developments focused on decoding motor intentions, while recent advances emphasize high-resolution, implantable systems for real-time interaction.\n\nInvasive BCIs involve surgical implantation of electrodes into the brain to record or stimulate neural activity with high precision. A seminal example is the use of Utah electrode arrays in the motor cortex of rhesus monkeys during the early 2000s, led by Miguel Nicolelis and colleagues. In these experiments, ensembles of cortical neurons were recorded to predict and control robotic arm movements, enabling monkeys to grasp objects or navigate virtual environments solely through thought. For instance, in a 2000 study, real-time decoding of neural signals allowed a monkey to operate a robotic arm to retrieve food rewards, demonstrating the feasibility of multi-neuron population recordings for prosthetic control. Subsequent work in 2003 extended this to bimanual reaching and grasping, where monkeys learned to use brain signals to manipulate two robotic arms simultaneously, achieving accuracies comparable to natural movements. These Utah array-based systems, with up to 100 electrodes penetrating the cortex, provided the foundational proof-of-concept for translating animal models to human applications in motor restoration.\n\nNon-invasive BCIs rely on external sensors to detect brain signals without surgery, prioritizing safety and accessibility despite lower signal resolution. Electroencephalography (EEG)-based spellers, such as the P300 paradigm, exemplify this approach by eliciting event-related potentials from visual stimuli. Introduced by Farwell and Donchin in 1988, the P300 speller presents a matrix of characters on a screen, flashing rows and columns to provoke a P300 response—a positive voltage peak around 300 milliseconds post-stimulus—when the target letter is highlighted. Users focus on desired characters, and machine learning algorithms classify the EEG signals to spell words at rates of 5-10 characters per minute with accuracies exceeding 90% in able-bodied individuals. This system has empowered communication for those with severe motor impairments, like amyotrophic lateral sclerosis patients, who can select letters independently. Complementing EEG, functional magnetic resonance imaging (fMRI) neurofeedback BCIs allow voluntary modulation of brain activity through real-time visualization of hemodynamic responses. Pioneered in the early 2000s, these interfaces train users to regulate regional activation, such as in the anterior cingulate cortex for pain control, by providing feedback on blood-oxygen-level-dependent signals; studies have shown participants achieving up to 40% modulation of target activity after short sessions, aiding in rehabilitation for conditions like stroke.\n\nClosed-loop BCIs integrate sensing and stimulation in a feedback cycle, adapting interventions based on detected neural patterns to treat disorders like epilepsy. The Responsive Neurostimulation (RNS) System, developed by NeuroPace, exemplifies this by detecting abnormal brain activity via implanted depth or cortical strip electrodes and delivering targeted electrical pulses to interrupt seizures. Approved by the FDA in November 2013 as an adjunctive therapy for adults with drug-resistant focal epilepsy originating from one or two foci, the device reduced seizure frequency by a median of 37.9% after one year and over 50% by the seventh year in long-term trials involving 191 patients. Unlike continuous stimulation, RNS operates responsively, delivering over 100,000 personalized detections annually per patient, with safety profiles showing low complication rates (e.g., 3.2% serious device-related adverse events). This closed-loop paradigm has transformed epilepsy management by minimizing side effects and optimizing therapy through stored electrocorticography data for clinician review.\n\nBy 2025, progress in high-channel invasive BCIs has accelerated, particularly with Neuralink's fully implantable, wireless systems designed for paralysis restoration. Neuralink's N1 implant, featuring over 1,000 electrodes on 64 flexible threads inserted by a robotic surgeon, records and stimulates up to 1,024 channels simultaneously from the motor cortex. As of September 2025, 12 individuals with conditions including quadriplegia from spinal cord injuries have received implants, enabling cursor control on computers at speeds rivaling able-bodied users (e.g., up to 8 bits per second in thought-to-text tasks for some patients). These advancements build on prior decoding techniques, with ongoing clinical trials aiming for broader applications in speech and mobility restoration.\n\n## Interdisciplinary Extensions\n\n### Neuroengineering and Devices\n\nNeuroengineering integrates principles of electrical, mechanical, and materials engineering with neuroscience to develop devices that interface with neural tissue, aiming to restore or enhance neurological function in cases of impairment. These devices typically employ electrodes, sensors, or actuators to stimulate or record from neurons, mimicking natural neural signaling pathways while minimizing tissue damage. Key advancements have focused on biocompatibility, miniaturization, and wireless operation to enable long-term implantation.\n\nProsthetic devices represent a cornerstone of neuroengineering, particularly for sensory restoration. Cochlear implants, for instance, bypass damaged hair cells in the inner ear by using multi-electrode arrays to deliver patterned electrical pulses directly to the auditory nerve, enabling speech perception in profoundly deaf individuals. Introduced clinically in the 1980s, these implants process sound via external microphones and speech processors, converting acoustic signals into biphasic current pulses that activate surviving spiral ganglion neurons. More than 1 million devices have been implanted worldwide as of 2022, with outcomes enabling open-set speech recognition in over 75% of adult recipients.\n\nRetinal prostheses similarly target sensory deficits, addressing outer retinal degeneration in conditions like retinitis pigmentosa or age-related macular degeneration. These epiretinal or subretinal implants use microelectrode arrays to stimulate surviving inner retinal cells, such as bipolar or ganglion cells, in response to light patterns captured by an external camera. The Argus II system, approved by the FDA in 2013, features 60 electrodes delivering phosphene-based vision, allowing users to detect large objects and navigate obstacles with 20/1260 acuity equivalent. Engineering challenges include achieving high electrode density for improved resolution, with recent designs incorporating flexible polymers to conform to the curved retina.\n\nNeuromodulation devices modulate neural activity through chronic electrical stimulation, offering reversible alternatives to ablative surgeries. Deep brain stimulation (DBS) for Parkinson's disease, with origins in the 1970s, targets the subthalamic nucleus or globus pallidus to suppress tremor and bradykinesia by delivering high-frequency pulses (typically 130 Hz) via implanted leads connected to a chest pacemaker. Early experiments in the late 1970s, such as those by Brice and McLellan for tremor control, demonstrated that stimulation could mimic lesion effects without permanent damage, paving the way for modern systems approved in 1997. DBS reduces motor symptoms by 40-60% in advanced Parkinson's patients, with over 200,000 procedures performed globally as of 2024.\n\nBiohybrid systems combine synthetic electronics with biological tissues to create minimally invasive neural interfaces. Neural dust, developed in the 2010s, consists of millimeter-scale, wireless sensors powered by ultrasound that record and stimulate peripheral or central neurons without tethers. These piezoelectric devices, first prototyped in 2013, use backscattered ultrasound for data transmission, enabling dense arrays for distributed monitoring in organs like the brain or sciatic nerve. In rodent studies, neural dust motes have achieved single-neuron resolution recordings with power consumption under 1 μW, facilitating chronic implantation without foreign body reactions.\n\nAs of 2025, innovations in soft robotics have advanced spinal cord interfaces, integrating flexible actuators with neuromodulation to restore locomotion after injury. These bioinspired devices use hydrogel-based or elastomer soft robots to deliver targeted epidural stimulation while conforming to the spinal cord's contours, reducing inflammation and improving signal fidelity. A March 2025 proof-of-concept study demonstrated that combining soft robotic exoskeletons with spinal neuromodulation in humans with incomplete injuries enhanced voluntary control of leg muscles and improved gait symmetry compared to traditional rigid interfaces. Such systems prioritize tissue-safe materials like silicone composites, enabling closed-loop feedback for adaptive therapy.\n\n### Neuroethics and Societal Implications\n\nNeuroenhancement, the use of pharmacological or technological interventions to augment cognitive abilities in healthy individuals, has ignited intense ethical debates within neuroethics, particularly around the concept of \"cognitive doping.\" Modafinil, a wakefulness-promoting agent initially approved for treating narcolepsy, exemplifies this issue, as its off-label use among students and professionals to enhance focus, memory, and executive function raises questions of fairness in competitive environments like academics and workplaces. Critics argue that such enhancements create an uneven playing field, pressuring non-users to adopt similar measures or face disadvantages, while proponents highlight potential societal benefits like increased productivity. Equity concerns further complicate the discourse, as access to these enhancers remains stratified by socioeconomic status, potentially widening gaps in educational and professional opportunities and reinforcing existing inequalities.\n\nPrivacy challenges in neuroscience have escalated with the proliferation of wearable devices that capture neural signals, transforming brain activity into quantifiable data vulnerable to surveillance and exploitation. These technologies, including consumer-grade EEG headsets, can infer emotions, intentions, and cognitive states, blurring the line between mental privacy and external accessibility. In the 2020s, regulatory frameworks have evolved to address this, with extensions to the EU's General Data Protection Regulation (GDPR) classifying neural data as a special category of sensitive information, mandating explicit consent and robust security measures for its collection and processing. Similar protections have emerged globally, emphasizing the need for \"neurorights\" to prevent unauthorized decoding of brain signals that could reveal deeply personal information.\n\nNeuroscience's exploration of decision-making has profound implications for moral responsibility, most notably through Benjamin Libet's seminal 1980s experiments, which revealed that a brain's readiness potential precedes conscious awareness of voluntary actions by several hundred milliseconds. This temporal dissociation suggests unconscious neural processes may initiate behavior, challenging traditional views of free will and raising questions about individual accountability in ethical and legal domains. In legal contexts, these findings have influenced debates on criminal responsibility, with some jurisdictions considering neuroscientific evidence to argue for reduced culpability in cases of impulsivity or neurological impairment, though interpretations remain contested and have not universally altered doctrines of mens rea.\n\nAs of 2025, emerging concerns in neuroethics center on AI biases in neurodiagnostics and the dual-use risks of advanced techniques like optogenetics. AI-driven tools for analyzing brain scans and predicting disorders often perpetuate biases from underrepresented datasets, leading to disparate diagnostic accuracy across racial and ethnic groups and exacerbating health inequities in neurology. Initiatives promoting inclusive AI development seek to counteract these issues by prioritizing diverse training data and algorithmic transparency. Meanwhile, optogenetics—enabling light-based control of genetically modified neurons—presents dual-use dilemmas, as its therapeutic precision could be repurposed for non-consensual applications in warfare, such as modulating soldier cognition or enemy behavior, necessitating international ethical guidelines to mitigate misuse.\n\n### Neuroinformatics and Data Science\n\nNeuroinformatics encompasses the development of computational tools, databases, and analytical methods to manage, integrate, and analyze vast neuroscience datasets, bridging empirical observations with quantitative insights. This discipline addresses the exponential growth of data from techniques like electrophysiology, imaging, and genomics, enabling researchers to uncover patterns in brain structure and function that would be intractable through manual analysis alone. Data science in neuroscience extends these efforts by applying statistical modeling and algorithms to extract meaningful information, fostering reproducibility and interdisciplinary collaboration.\n\nKey databases exemplify neuroinformatics infrastructure. The Allen Brain Atlas, maintained by the Allen Institute for Brain Science, offers high-resolution maps of gene expression in the human and mouse brain, integrating in situ hybridization and microarray data to reveal spatial and temporal patterns of neural transcripts. Launched in 2010, the Human Connectome Project provides diffusion magnetic resonance imaging (dMRI) datasets from over 1,200 healthy adults, facilitating the reconstruction of white matter fiber tracts and connectivity profiles through high-angular resolution diffusion imaging protocols. These resources support downstream analyses, such as correlating genetic markers with anatomical variations.\n\nBig data tools have transformed neural data processing. Machine learning approaches, particularly deep neural networks, automate spike sorting by classifying action potentials from multi-electrode array recordings, achieving higher accuracy and scalability than traditional clustering methods on dense datasets. Graph theory underpins network analysis, where adjacency matrices encode binary or weighted connections between brain regions derived from imaging or electrophysiological data, enabling quantification of network properties like small-world topology and modularity.\n\nStandardization efforts enhance data usability. The Brain Imaging Data Structure (BIDS) organizes raw and derived neuroimaging files in a consistent, self-describing format, promoting interoperability across software pipelines and facilitating large-scale meta-analyses. Complementing this, the FAIR principles—emphasizing findability, accessibility, interoperability, and reusability—guide neuroscience data curation to maximize scientific impact while minimizing silos.\n\nAs of 2025, challenges in handling distributed brain data have spotlighted federated learning, a privacy-preserving framework that trains models across multiple sites without centralizing sensitive raw data, such as multi-institutional neuroimaging or electrophysiological records. This approach mitigates privacy risks under regulations like GDPR, allowing collaborative insights into population-level neural variations while keeping data localized.\n\n## Education, Careers, and Recognition\n\n### Academic Training Pathways\n\nUndergraduate programs in neuroscience typically offer bachelor's degrees such as a Bachelor of Science (BS) in Neuroscience or Neurobiology, providing foundational training in brain structure, function, and related biological principles. Core coursework emphasizes disciplines like biology, chemistry, psychology, and mathematics, with specific courses covering neuroanatomy, cellular neurophysiology, biopsychology, and molecular biology of the nervous system. For instance, programs often require studies in anatomy and physiology to build understanding of neural systems, alongside quantitative skills for data analysis in neuroscience experiments.\n\nHands-on laboratory research is a key component of undergraduate training, allowing students to apply classroom knowledge through experiments in neural circuits, behavioral analysis, or imaging techniques. Many programs integrate research opportunities via summer internships or capstone projects, fostering skills in experimental design and data interpretation. A prominent pathway is the National Science Foundation's Research Experiences for Undergraduates (REU) program, which funds intensive 8-10 week research projects in neuroscience labs, often focusing on topics like synaptic plasticity or neuroimaging, and is available to students from diverse institutions.\n\nGraduate training in neuroscience primarily occurs through PhD programs, which span 5-7 years and emphasize original research leading to a dissertation. These programs typically include 1-2 years of coursework and laboratory rotations to identify a thesis topic, such as neural circuit mechanisms in learning or disease models, followed by 3-5 years of independent research under faculty mentorship. Students complete a thesis defending novel contributions to the field, often involving techniques like electrophysiology or optogenetics, with an average completion time of about 5.5 years.\n\nInterdisciplinary tracks within PhD programs increasingly incorporate computational neuroscience or neuroengineering, blending biology with computer science or engineering to address complex questions in brain modeling and AI-inspired neural analysis. During graduate studies, trainees acquire proficiency in research methods, including ethical experimental practices and statistical analysis, essential for advancing neuroscience inquiries. Programs often provide stipends and tuition support to enable full-time focus on training.\n\nPostdoctoral training serves as a bridge from graduate research to independent academic careers, typically lasting 2-5 years in neuroscience labs where fellows conduct advanced studies to build expertise and publication records. This period involves leading projects on specialized topics, such as neurodegenerative diseases or sensory processing, while mentoring junior researchers and applying for grants. Funding often comes through fellowships like the NIH Ruth L. Kirschstein National Research Service Award (F32), which supports up to three years of mentored research for promising postdocs, providing stipends around $61,000–$76,000 annually depending on experience as of fiscal year 2025.\n\nAs of 2025, neuroscience education trends include expanded access to online Massive Open Online Courses (MOOCs) for introductory topics like neural signaling and brain imaging, offered by platforms such as Coursera and edX in partnership with universities, enabling global learners to build foundational knowledge flexibly. Additionally, diversity, equity, and inclusion (DEI) initiatives are prominent in training programs, with efforts like workshops and targeted recruitment to support underrepresented groups, as highlighted by National Academies reports and advocacy groups addressing systemic barriers in neuroscience. These trends aim to broaden participation and adapt to evolving research demands.\n\n### Professional Roles and Industries\n\nIn the pharmaceutical research and development sector, neuroscientists often serve as clinical trial designers and coordinators, where they apply expertise in brain function to structure studies evaluating novel therapeutics for neurological disorders. For instance, professionals in this role at companies like Bristol-Myers Squibb lead global program teams to design and execute integrated strategies for neuroscience drug candidates, from preclinical testing to regulatory submission. In biotech startups focused on neurotech, roles emphasize innovation in areas such as gene therapy and precision medicine; employees at firms like Alzheon develop oral drugs like ALZ-801 for Alzheimer's disease, involving clinical trial oversight and funding acquisition through series investments.\n\nGovernment and policy positions provide neuroscientists with opportunities to influence national research agendas and regulatory frameworks. At the National Institute of Neurological Disorders and Stroke (NINDS), program officers administer scientific programs, oversee grant portfolios, and guide applicants on funding mechanisms while contributing to research priority setting. These roles involve pre- and post-award management, including policy clarification on data sharing and human subjects research. In the Food and Drug Administration's (FDA) Office of Neuroscience, drug reviewers in divisions such as Neurology I and Psychiatry evaluate applications for neuroscience products, assessing safety, efficacy, and toxicology for biologics and small molecules targeting conditions like epilepsy and depression.\n\nBeyond core research sectors, neuroscientists engage in science communication and consulting. In science communication, roles include editing and writing for high-impact journals like *Neuron*, where professionals translate complex findings into accessible formats for broad audiences, often drawing on skills from academic training in experimental design and data interpretation. Neuroethics consulting involves advising on ethical implications of neuroscience advancements, such as risk management in brain-computer interfaces or policy for neurotechnology deployment, with consultants providing expertise on judgment and societal impacts.\n\nAs of 2025, the neuroscience job market shows strong demand for specialists integrating artificial intelligence (AI) with neural data analysis, particularly in remote roles focused on bioinformatics and machine learning for drug discovery. AI adoption in biopharma is increasing, fueling needs for computational neuroscientists who analyze large datasets from fMRI or EEG to accelerate diagnostics and personalized therapies. This trend, amid a U.S. life sciences workforce of approximately 2.1 million, highlights a persistent skills gap in AI-neuro expertise, with hubs like San Diego driving growth in neurotech startups.\n\n### Awards, Prizes, and Milestones\n\nNeuroscience has been recognized through prestigious awards that honor groundbreaking discoveries in understanding the brain and nervous system. The Nobel Prize in Physiology or Medicine has frequently acknowledged neuroscientific achievements, beginning with the 1906 award to Camillo Golgi and Santiago Ramón y Cajal for their work on the neuron doctrine and the structure of the nervous system. A pivotal early recognition came in 1963, when Alan Hodgkin, Andrew Huxley, and John Eccles received the prize for their discoveries concerning the ionic mechanisms involved in excitation and inhibition in the peripheral and central portions of the nerve cell membrane, laying the foundation for modern understanding of neuronal signaling.\n\nSubsequent Nobel Prizes have continued to highlight key advances, such as the 1986 award to Rita Levi-Montalcini and Stanley Cohen for their discoveries of growth factors, including nerve growth factor (NGF), which demonstrated critical roles in neural development and maintenance; Levi-Montalcini's work exemplifies the contributions of women pioneers in the field. Other notable laureates include Eric Kandel in 2000 for signal transduction in the nervous system, and Edvard and May-Britt Moser in 2014 for their discoveries of cells that constitute a positioning system in the brain, further advancing spatial navigation research.\n\nBeyond the Nobel, the Brain Prize, awarded annually since 2011 by the Lundbeck Foundation, recognizes outstanding contributions to neuroscience with a €1.3 million award; for instance, in 2025, it was given to Michelle Monje and Frank Winkler for establishing the field of cancer neuroscience through their discovery of functional synapses between neurons and glioma cells. The Kavli Prize in Neuroscience, awarded biennially since 2008 by the Kavli Foundation with a $1 million purse, honors advances in brain function; the 2024 recipients, Nancy Kanwisher, Winrich Freiwald, and Doris Tsao, were recognized for discovering a specialized brain system for face recognition using functional brain imaging.\n\nKey milestones have also marked the field's progress. The Decade of the Brain, proclaimed by the U.S. Congress from 1990 to 2000, significantly increased federal funding and public awareness of brain research, leading to advances in neuroimaging and treatment of neurological disorders. Launched in 2013, the BRAIN Initiative has driven innovations in neurotechnologies, with the 2023 BRAIN 2.0 report outlining priorities for human neuroscience and integration of data across scales; as of 2025, Phase I goals are complete, with transitions to Phase II focusing on broader therapeutic applications.",
  "external_references": [
    {
      "text": "Conditioninfo",
      "url": "https://www.nichd.nih.gov/health/topics/neuro/conditioninfo",
      "domain": "nichd.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk10799",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK10799/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Neuro",
      "url": "https://www.nichd.nih.gov/health/topics/factsheets/neuro",
      "domain": "nichd.nih.gov",
      "type": "citation"
    },
    {
      "text": "Hist.html",
      "url": "https://faculty.washington.edu/chudler/hist.html",
      "domain": "faculty.washington.edu",
      "type": "citation"
    },
    {
      "text": "Areas",
      "url": "https://www.nichd.nih.gov/health/topics/neuro/conditioninfo/areas",
      "domain": "nichd.nih.gov",
      "type": "citation"
    },
    {
      "text": "14 10 2025 11 Million Lives Lost Each Year Urgent Action Needed On Neurological Care",
      "url": "https://www.who.int/news/item/14-10-2025-11-million-lives-lost-each-year-urgent-action-needed-on-neurological-care",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Study",
      "url": "https://www.nichd.nih.gov/health/topics/neuro/conditioninfo/study",
      "domain": "nichd.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8051941",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8051941/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gjidd.ms.id.555771.php",
      "url": "https://juniperpublishers.com/gjidd/GJIDD.MS.ID.555771.php",
      "domain": "juniperpublishers.com",
      "type": "citation"
    },
    {
      "text": "Brain.html",
      "url": "https://web.stanford.edu/class/history13/earlysciencelab/body/brainpages/brain.html",
      "domain": "web.stanford.edu",
      "type": "citation"
    },
    {
      "text": "S2214854x25000597",
      "url": "https://www.sciencedirect.com/science/article/pii/S2214854X25000597",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Html",
      "url": "https://www.redalyc.org/journal/5763/576364413015/html/",
      "domain": "redalyc.org",
      "type": "citation"
    },
    {
      "text": "312495116 The Structure And Function Of The Central Nervous System And Sense Organs In The Canon Of Medicine By Avicenna",
      "url": "https://www.researchgate.net/publication/312495116_The_Structure_and_Function_of_the_Central_Nervous_System_and_Sense_Organs_in_the_Canon_of_Medicine_by_Avicenna",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Pmc11368478",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11368478/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nerves.html",
      "url": "https://web.stanford.edu/class/history13/earlysciencelab/body/nervespages/nerves.html",
      "domain": "web.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Ar.24764",
      "url": "https://anatomypubs.onlinelibrary.wiley.com/doi/10.1002/ar.24764",
      "domain": "anatomypubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Through The Keyhole Analysing The Contribution Of Islam To The Development Of Anatomical Dissection",
      "url": "https://www.jbima.com/article/through-the-keyhole-analysing-the-contribution-of-islam-to-the-development-of-anatomical-dissection/",
      "domain": "jbima.com",
      "type": "citation"
    },
    {
      "text": "Pmc4119151",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4119151/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "358129",
      "url": "https://www.metmuseum.org/art/collection/search/358129",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Vesalius.htm",
      "url": "http://web.stanford.edu/class/history13/Readings/vesalius.htm",
      "domain": "web.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Pineal Gland",
      "url": "https://plato.stanford.edu/entries/pineal-gland/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Discovery Mind Body Problem",
      "url": "https://thereader.mitpress.mit.edu/discovery-mind-body-problem/",
      "domain": "thereader.mitpress.mit.edu",
      "type": "citation"
    },
    {
      "text": "168",
      "url": "https://pn.bmj.com/content/22/2/168",
      "domain": "pn.bmj.com",
      "type": "citation"
    },
    {
      "text": "Speedread",
      "url": "https://www.nobelprize.org/prizes/medicine/1906/speedread/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "11624298",
      "url": "https://pubmed.ncbi.nlm.nih.gov/11624298/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Neuron Doctrine 1860 1895",
      "url": "https://embryo.asu.edu/pages/neuron-doctrine-1860-1895",
      "domain": "embryo.asu.edu",
      "type": "citation"
    },
    {
      "text": "Luigi Galvani And The Debate On Animal Electricity 1791 1800.pdf",
      "url": "http://www.elch.chem.msu.ru/rus/wp/wp-content/uploads/2020/07/Luigi-Galvani-and-the-debate-on-animal-electricity-1791-1800.pdf",
      "domain": "elch.chem.msu.ru",
      "type": "citation"
    },
    {
      "text": "Lecture",
      "url": "https://www.nobelprize.org/prizes/medicine/1932/adrian/lecture/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Pmc6659403",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6659403/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Article Pe4.xml",
      "url": "https://thejns.org/focus/view/journals/neurosurg-focus/48/2/article-pE4.xml",
      "domain": "thejns.org",
      "type": "citation"
    },
    {
      "text": "278000",
      "url": "https://academic.oup.com/brain/article/130/4/887/278000",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Pmc2982747",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2982747/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Genomemental.pdf",
      "url": "https://www.genome.gov/Pages/News/Documents/GenomeMental.pdf",
      "domain": "genome.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4899966",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4899966/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7406588",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7406588/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0896627323003069",
      "url": "https://www.sciencedirect.com/science/article/pii/S0896627323003069",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc6063995",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6063995/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Science.adk4858",
      "url": "https://www.science.org/doi/10.1126/science.adk4858",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S41592 025 02784 2",
      "url": "https://www.nature.com/articles/s41592-025-02784-2",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Brain2025 508c 2.pdf",
      "url": "https://braininitiative.nih.gov/sites/default/files/documents/brain2025_508c_2.pdf",
      "domain": "braininitiative.nih.gov",
      "type": "citation"
    },
    {
      "text": "Multiscale Modelling",
      "url": "https://www.humanbrainproject.eu/en/brain-simulation/multiscale-modelling/",
      "domain": "humanbrainproject.eu",
      "type": "citation"
    },
    {
      "text": "Hbp 10 Year Assessment.pdf",
      "url": "https://files.ebrains.eu/file/b8c49d66-ce42-4405-b8dc-88105e35d784/hbp-10-year-assessment.pdf",
      "domain": "files.ebrains.eu",
      "type": "citation"
    },
    {
      "text": "Google Deepmind Isomorphic Alphafold 3 Ai Model",
      "url": "https://blog.google/technology/ai/google-deepmind-isomorphic-alphafold-3-ai-model/",
      "domain": "blog.google",
      "type": "citation"
    },
    {
      "text": "S13534 025 00512 5",
      "url": "https://link.springer.com/article/10.1007/s13534-025-00512-5",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "Pmc12027460",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12027460/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk441977",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK441977/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk554388",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK554388/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pyramidal Cell",
      "url": "https://www.sciencedirect.com/topics/neuroscience/pyramidal-cell",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Nbk28209",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK28209/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk538338",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK538338/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5063692",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5063692/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10294192",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10294192/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4691794",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4691794/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8364152",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8364152/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk11104",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK11104/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nrn3708",
      "url": "https://www.nature.com/articles/nrn3708",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc3249630",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3249630/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Sudhof Lecture.pdf",
      "url": "https://www.nobelprize.org/uploads/2018/06/sudhof-lecture.pdf",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Pmc2151334",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2151334/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Physrev.00032.2016",
      "url": "https://journals.physiology.org/doi/abs/10.1152/physrev.00032.2016",
      "domain": "journals.physiology.org",
      "type": "citation"
    },
    {
      "text": "Nbk11117",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK11117/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2003 01537 001",
      "url": "https://psycnet.apa.org/record/2003-01537-001",
      "domain": "psycnet.apa.org",
      "type": "citation"
    },
    {
      "text": "S0006899325002021",
      "url": "https://www.sciencedirect.com/science/article/pii/S0006899325002021",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc3021747",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3021747/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "4727084",
      "url": "https://pubmed.ncbi.nlm.nih.gov/4727084/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3367554",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3367554/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/neurology/articles/10.3389/fneur.2020.554089/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pmc9665925",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9665925/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk538143",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK538143/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "6270629",
      "url": "https://pubmed.ncbi.nlm.nih.gov/6270629/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk10921",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK10921/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1392413",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1392413/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "20831750",
      "url": "https://pubmed.ncbi.nlm.nih.gov/20831750/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Scn1a",
      "url": "https://medlineplus.gov/genetics/gene/scn1a/",
      "domain": "medlineplus.gov",
      "type": "citation"
    },
    {
      "text": "Nbk539894",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK539894/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk10802",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK10802/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk519495",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK519495/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk28090",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK28090/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "1.02%253a Neurotransmitters Ach Glutamate Gaba And Glycine",
      "url": "https://med.libretexts.org/Courses/Virginia_Tech_Carilion_School_of_Medicine/Neuroscience_for_Pre-Clinical_Students_%28LeClair%29/01%253A_Chapters/1.02%253A_Neurotransmitters__ACh_glutamate_GABA_and_glycine",
      "domain": "med.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Nbk538242",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK538242/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/neural-circuits/articles/10.3389/fncir.2013.00152/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Nbk545168",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK545168/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S13041 017 0306 Y",
      "url": "https://molecularbrain.biomedcentral.com/articles/10.1186/s13041-017-0306-y",
      "domain": "molecularbrain.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Nbk557825",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK557825/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk10855",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK10855/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "10.5j%253a Ionotropic And Metabotropic Receptors",
      "url": "https://med.libretexts.org/Bookshelves/Anatomy_and_Physiology/Anatomy_and_Physiology_%28Boundless%29/10%253A_Overview_of_the_Nervous_System/10.5%253A_Neurophysiology/10.5J%253A_Ionotropic_and_Metabotropic_Receptors",
      "domain": "med.libretexts.org",
      "type": "citation"
    },
    {
      "text": "C6b1a6ea00f8d44950b8be103fa0a4c7",
      "url": "https://www.cambridge.org/core/books/cambridge-textbook-of-neuroscience-for-psychiatrists/classification-of-receptors-metabotropic-and-ionotropic-receptors/C6B1A6EA00F8D44950B8BE103FA0A4C7",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Nbk6271",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK6271/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S40035 023 00378 6",
      "url": "https://translationalneurodegeneration.biomedcentral.com/articles/10.1186/s40035-023-00378-6",
      "domain": "translationalneurodegeneration.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc12507892",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12507892/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/microbiology/articles/10.3389/fmicb.2025.1664800/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "S41392 024 01743 1",
      "url": "https://www.nature.com/articles/s41392-024-01743-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pnas.051634198",
      "url": "https://www.pnas.org/doi/10.1073/pnas.051634198",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S0092 8674%2805%2900285 0",
      "url": "https://www.cell.com/fulltext/S0092-8674%2805%2900285-0",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Physiol.00032.2024",
      "url": "https://journals.physiology.org/doi/10.1152/physiol.00032.2024",
      "domain": "journals.physiology.org",
      "type": "citation"
    },
    {
      "text": "Npp201286",
      "url": "https://www.nature.com/articles/npp201286",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc3207967",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3207967/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "10800",
      "url": "https://www.jneurosci.org/content/23/34/10800",
      "domain": "jneurosci.org",
      "type": "citation"
    },
    {
      "text": "Pmc4700275",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4700275/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41586 023 06812 Z",
      "url": "https://www.nature.com/articles/s41586-023-06812-z",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Chapter04.html",
      "url": "https://nba.uth.tmc.edu/neuroscience/m/s2/chapter04.html",
      "domain": "nba.uth.tmc.edu",
      "type": "citation"
    },
    {
      "text": "Chapter15.html",
      "url": "https://nba.uth.tmc.edu/neuroscience/m/s2/chapter15.html",
      "domain": "nba.uth.tmc.edu",
      "type": "citation"
    },
    {
      "text": "Nbk507824",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK507824/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk542184",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK542184/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/integrative-neuroscience/articles/10.3389/fnint.2010.00006/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Chapter03.html",
      "url": "https://nba.uth.tmc.edu/neuroscience/m/s3/chapter03.html",
      "domain": "nba.uth.tmc.edu",
      "type": "citation"
    },
    {
      "text": "Pmc3923298",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3923298/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4347949",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4347949/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0896 6273%2811%2900879 8",
      "url": "https://www.cell.com/neuron/fulltext/S0896-6273%2811%2900879-8",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Ncomms12815",
      "url": "https://www.nature.com/articles/ncomms12815",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc6599531",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6599531/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0896627323003082",
      "url": "https://www.sciencedirect.com/science/article/pii/S0896627323003082",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Annurev Neuro 071013 014030",
      "url": "https://www.annualreviews.org/content/journals/10.1146/annurev-neuro-071013-014030",
      "domain": "annualreviews.org",
      "type": "citation"
    },
    {
      "text": "9878",
      "url": "https://www.jneurosci.org/content/39/50/9878",
      "domain": "jneurosci.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/human-neuroscience/articles/10.3389/fnhum.2023.1133367/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/cellular-neuroscience/articles/10.3389/fncel.2021.649262/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pnas.97.2.919",
      "url": "https://www.pnas.org/doi/10.1073/pnas.97.2.919",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "S0896 6273%2823%2900130 7",
      "url": "https://www.cell.com/neuron/fulltext/S0896-6273%2823%2900130-7",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "10489",
      "url": "https://www.jneurosci.org/content/36/41/10489",
      "domain": "jneurosci.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002939",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "S41586 025 08790 W",
      "url": "https://www.nature.com/articles/s41586-025-08790-w",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Nbk234157",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK234157/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Chapter04.html",
      "url": "https://nba.uth.tmc.edu/neuroscience/m/s3/chapter04.html",
      "domain": "nba.uth.tmc.edu",
      "type": "citation"
    },
    {
      "text": "Chapter01.html",
      "url": "https://nba.uth.tmc.edu/neuroscience/m/s4/chapter01.html",
      "domain": "nba.uth.tmc.edu",
      "type": "citation"
    },
    {
      "text": "Nbk544297",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK544297/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1359523",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1359523/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pnas.86.5.1698",
      "url": "https://www.pnas.org/doi/10.1073/pnas.86.5.1698",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "15003179",
      "url": "https://pubmed.ncbi.nlm.nih.gov/15003179/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "264746a0",
      "url": "https://www.nature.com/articles/264746a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Npp2009126",
      "url": "https://www.nature.com/articles/npp2009126",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0960 9822%2800%2900593 5",
      "url": "https://www.cell.com/current-biology/fulltext/S0960-9822%2800%2900593-5",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Nature11028",
      "url": "https://www.nature.com/articles/nature11028",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0896 6273%2815%2900761 8",
      "url": "https://www.cell.com/neuron/fulltext/S0896-6273%2815%2900761-8",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "S41467 021 21471 2",
      "url": "https://www.nature.com/articles/s41467-021-21471-2",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0896 6273%2817%2930498 1",
      "url": "https://www.cell.com/neuron/fulltext/S0896-6273%2817%2930498-1",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Pmc2893579",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2893579/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41380 024 02521 9",
      "url": "https://www.nature.com/articles/s41380-024-02521-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "14514027",
      "url": "https://pubmed.ncbi.nlm.nih.gov/14514027/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3678031",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3678031/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Jn.1998.80.1.1",
      "url": "https://journals.physiology.org/doi/abs/10.1152/jn.1998.80.1.1",
      "domain": "journals.physiology.org",
      "type": "citation"
    },
    {
      "text": "1626829",
      "url": "https://pubmed.ncbi.nlm.nih.gov/1626829/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "15217330",
      "url": "https://pubmed.ncbi.nlm.nih.gov/15217330/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7444921",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7444921/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "5876908 Lapicque%27s 1907 Paper From Frogs To Integrate And Fire",
      "url": "https://www.researchgate.net/publication/5876908_Lapicque%27s_1907_paper_From_frogs_to_integrate-and-fire",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "S0006 3495(72",
      "url": "https://www.cell.com/biophysj/pdf/S0006-3495(72",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Neuron",
      "url": "https://www.neuron.yale.edu/neuron/",
      "domain": "neuron.yale.edu",
      "type": "citation"
    },
    {
      "text": "bluebrain.epfl.ch",
      "url": "https://bluebrain.epfl.ch/",
      "domain": "bluebrain.epfl.ch",
      "type": "citation"
    },
    {
      "text": "S2666389923002398",
      "url": "https://www.sciencedirect.com/science/article/pii/S2666389923002398",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "A Multimodal Fitting Approach To Construct Single",
      "url": "https://direct.mit.edu/neco/article/36/7/1286/121124/A-Multimodal-Fitting-Approach-to-Construct-Single",
      "domain": "direct.mit.edu",
      "type": "citation"
    },
    {
      "text": "S0168010225000513",
      "url": "https://www.sciencedirect.com/science/article/pii/S0168010225000513",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc34168",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC34168/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/computational-neuroscience/articles/10.3389/fncom.2025.1571109/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Science.3749885",
      "url": "https://www.science.org/doi/10.1126/science.3749885",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Barlow Sensorycommunication 1961.pdf",
      "url": "https://www.cnbc.cmu.edu/~tai/microns_papers/Barlow-SensoryCommunication-1961.pdf",
      "domain": "cnbc.cmu.edu",
      "type": "citation"
    },
    {
      "text": "Nrn2787",
      "url": "https://www.nature.com/articles/nrn2787",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Rsta.2020.0236",
      "url": "https://royalsocietypublishing.org/doi/10.1098/rsta.2020.0236",
      "domain": "royalsocietypublishing.org",
      "type": "citation"
    },
    {
      "text": "Rosenblatt1958.pdf",
      "url": "https://www.ling.upenn.edu/courses/cogs501/Rosenblatt1958.pdf",
      "domain": "ling.upenn.edu",
      "type": "citation"
    },
    {
      "text": "323533a0",
      "url": "https://www.nature.com/articles/323533a0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Spikes.pdf",
      "url": "https://www.izhikevich.org/publications/spikes.pdf",
      "domain": "izhikevich.org",
      "type": "citation"
    },
    {
      "text": "Truenorth Design And Tool Flow Of A 65 Mw 1 Million Neuron Programmable Neurosynaptic Chip",
      "url": "https://research.ibm.com/publications/truenorth-design-and-tool-flow-of-a-65-mw-1-million-neuron-programmable-neurosynaptic-chip",
      "domain": "research.ibm.com",
      "type": "citation"
    },
    {
      "text": "Neuromorphic Computing Loihi 2 Brief.pdf",
      "url": "https://download.intel.com/newsroom/2021/new-technologies/neuromorphic-computing-loihi-2-brief.pdf",
      "domain": "download.intel.com",
      "type": "citation"
    },
    {
      "text": "2508.09330",
      "url": "https://arxiv.org/abs/2508.09330",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "S153204642500139x",
      "url": "https://www.sciencedirect.com/science/article/pii/S153204642500139X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Developing New Methods To Map Brain Wide Synaptic Changes",
      "url": "https://news.feinberg.northwestern.edu/2025/06/11/developing-new-methods-to-map-brain-wide-synaptic-changes/",
      "domain": "news.feinberg.northwestern.edu",
      "type": "citation"
    },
    {
      "text": "Mac 20580568",
      "url": "https://www.mayoclinic.org/medical-professionals/neurology-neurosurgery/news/upgraded-scanner-unleashes-7t-mris-potential/mac-20580568",
      "domain": "mayoclinic.org",
      "type": "citation"
    },
    {
      "text": "Pmc12394932",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12394932/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "0165027095000852",
      "url": "https://www.sciencedirect.com/science/article/pii/0165027095000852",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Ad8b6c",
      "url": "https://iopscience.iop.org/article/10.1088/1741-2552/ad8b6c",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Brain Director Brain 2025 Seeking And Sustaining Innovation",
      "url": "http://braininitiative.nih.gov/news-events/blog/brain-director-brain-2025-seeking-and-sustaining-innovation",
      "domain": "braininitiative.nih.gov",
      "type": "citation"
    },
    {
      "text": "Successful Gene Editing Demonstrated For A Rare Neurodevelopmental Disorder",
      "url": "https://news.feinberg.northwestern.edu/2025/08/05/successful-gene-editing-demonstrated-for-a-rare-neurodevelopmental-disorder/",
      "domain": "news.feinberg.northwestern.edu",
      "type": "citation"
    },
    {
      "text": "Nbk499922",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK499922/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5793225",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5793225/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "17039298",
      "url": "https://pubmed.ncbi.nlm.nih.gov/17039298/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "12122208",
      "url": "https://pubmed.ncbi.nlm.nih.gov/12122208/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7191035",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7191035/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7014913",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7014913/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Facts Figures",
      "url": "https://www.alz.org/alzheimers-dementia/facts-figures",
      "domain": "alz.org",
      "type": "citation"
    },
    {
      "text": "Statistics",
      "url": "https://www.parkinson.org/understanding-parkinsons/statistics",
      "domain": "parkinson.org",
      "type": "citation"
    },
    {
      "text": "Alzheimers Disease Genetics Fact Sheet",
      "url": "https://www.nia.nih.gov/health/alzheimers-causes-and-risk-factors/alzheimers-disease-genetics-fact-sheet",
      "domain": "nia.nih.gov",
      "type": "citation"
    },
    {
      "text": "S43587 025 00951 W",
      "url": "https://www.nature.com/articles/s43587-025-00951-w",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "39468767",
      "url": "https://pubmed.ncbi.nlm.nih.gov/39468767/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12395377",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12395377/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12190198",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12190198/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6630948",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6630948/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk1305",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK1305/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7052829",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7052829/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8301879",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8301879/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12578435",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12578435/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41392 023 01481 W",
      "url": "https://www.nature.com/articles/s41392-023-01481-w",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc11695131",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11695131/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0896 6273%2814%2900905 2",
      "url": "https://www.cell.com/neuron/fulltext/S0896-6273%2814%2900905-2",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/molecular-neuroscience/articles/10.3389/fnmol.2020.590896/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Insights Into Kinase Inhibitors Therapeutic Potential In Neurodegenerative Diseases.aspx",
      "url": "https://www.news-medical.net/whitepaper/20250428/Insights-into-kinase-inhibitors-therapeutic-potential-in-neurodegenerative-diseases.aspx",
      "domain": "news-medical.net",
      "type": "citation"
    },
    {
      "text": "Pmc6463489",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6463489/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8163022",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8163022/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Neuroscience",
      "url": "https://www.taconic.com/resources/therapeutic-areas/neuroscience",
      "domain": "taconic.com",
      "type": "citation"
    },
    {
      "text": "Laban.1236",
      "url": "https://www.nature.com/articles/laban.1236",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Trial Phases 1 2 3 Defined",
      "url": "https://med.uc.edu/depart/psychiatry/research/clinical-research/crm/trial-phases-1-2-3-defined",
      "domain": "med.uc.edu",
      "type": "citation"
    },
    {
      "text": "Another Phase Iii Trial Failure In Neuroscience What Are We Doing Wrong",
      "url": "https://www.genengnews.com/topics/drug-discovery/another-phase-iii-trial-failure-in-neuroscience-what-are-we-doing-wrong/",
      "domain": "genengnews.com",
      "type": "citation"
    },
    {
      "text": "Cns Whitepaper 32024.pdf",
      "url": "https://www.iqvia.com/-/media/iqvia/pdfs/library/white-papers/cns-whitepaper-32024.pdf",
      "domain": "iqvia.com",
      "type": "citation"
    },
    {
      "text": "39829237",
      "url": "https://pubmed.ncbi.nlm.nih.gov/39829237/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "New Study Validates Insulin Nasal Spray To Deliver Alzheimers Drug Directly To The Brain",
      "url": "https://newsroom.wakehealth.edu/news-releases/2025/07/new-study-validates-insulin-nasal-spray-to-deliver-alzheimers-drug-directly-to-the-brain",
      "domain": "newsroom.wakehealth.edu",
      "type": "citation"
    },
    {
      "text": "Receptor Affinity",
      "url": "https://www.sciencedirect.com/topics/neuroscience/receptor-affinity",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Acschemneuro.7b00185",
      "url": "https://pubs.acs.org/doi/10.1021/acschemneuro.7b00185",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "Structure Function And Allosteric Modulation Of",
      "url": "https://rupress.org/jgp/article/150/8/1081/43759/Structure-function-and-allosteric-modulation-of",
      "domain": "rupress.org",
      "type": "citation"
    },
    {
      "text": "Als Companies",
      "url": "https://www.labiotech.eu/best-biotech/als-companies/",
      "domain": "labiotech.eu",
      "type": "citation"
    },
    {
      "text": "Als News Breakthrough Drug Shows Promising Results In Clinical Trials",
      "url": "https://globalrph.com/2025/10/als-news-breakthrough-drug-shows-promising-results-in-clinical-trials/",
      "domain": "globalrph.com",
      "type": "citation"
    },
    {
      "text": "2025 02 News.html",
      "url": "https://www.biogen.ca/en-ca/news/2025-02-news.html",
      "domain": "biogen.ca",
      "type": "citation"
    },
    {
      "text": "Nct04856982",
      "url": "https://clinicaltrials.gov/study/NCT04856982",
      "domain": "clinicaltrials.gov",
      "type": "citation"
    },
    {
      "text": "S41586 025 08700 0",
      "url": "https://www.nature.com/articles/s41586-025-08700-0",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/human-neuroscience/articles/10.3389/fnhum.2022.1077717/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pma.cfm",
      "url": "https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfpma/pma.cfm?id=P100026",
      "domain": "accessdata.fda.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4598207",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4598207/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "A Year Of Telepathy",
      "url": "https://neuralink.com/updates/a-year-of-telepathy/",
      "domain": "neuralink.com",
      "type": "citation"
    },
    {
      "text": "Musks Neuralink Says 12 People Have Received Its Implants 2025 09 09",
      "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/musks-neuralink-says-12-people-have-received-its-implants-2025-09-09/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Paralyzed Veteran Implanted With Neuralink Device",
      "url": "https://www.themiamiproject.org/paralyzed-veteran-implanted-with-neuralink-device/",
      "domain": "themiamiproject.org",
      "type": "citation"
    },
    {
      "text": "Pmc10347280",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10347280/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6438790",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6438790/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1609401",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1609401/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "691836628",
      "url": "https://www.swedish.org/news/uf/691836628?streamid=3129980",
      "domain": "swedish.org",
      "type": "citation"
    },
    {
      "text": "Pmc9208577",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9208577/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3785222",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3785222/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3157831",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3157831/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "A Deep Dive Into Deep Brain Stimulation",
      "url": "https://consultqd.clevelandclinic.org/a-deep-dive-into-deep-brain-stimulation",
      "domain": "consultqd.clevelandclinic.org",
      "type": "citation"
    },
    {
      "text": "Pmc5461950",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5461950/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8666678",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8666678/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Scirobotics.adn5564",
      "url": "https://www.science.org/doi/10.1126/scirobotics.adn5564",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S41528 025 00480 X",
      "url": "https://www.nature.com/articles/s41528-025-00480-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc7058249",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7058249/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4052735",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4052735/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12287510",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12287510/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Neurotechnology Privacy Safeguarding The Next Frontier Of Data",
      "url": "https://trustarc.com/resource/neurotechnology-privacy-safeguarding-the-next-frontier-of-data/",
      "domain": "trustarc.com",
      "type": "citation"
    },
    {
      "text": "Pmc4887467",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4887467/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "148338808",
      "url": "https://academic.oup.com/book/5458/chapter/148338808",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Pmc12461116",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12461116/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10730653",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10730653/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "What Is Neuroinformatics",
      "url": "https://www.incf.org/about/what-is-neuroinformatics",
      "domain": "incf.org",
      "type": "citation"
    },
    {
      "text": "Pmc3662267",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3662267/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Gene Expression",
      "url": "https://portal.brain-map.org/gene-expression",
      "domain": "portal.brain-map.org",
      "type": "citation"
    },
    {
      "text": "Overview",
      "url": "https://www.humanconnectome.org/study/hcp-young-adult/overview",
      "domain": "humanconnectome.org",
      "type": "citation"
    },
    {
      "text": "39454590",
      "url": "https://pubmed.ncbi.nlm.nih.gov/39454590/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://bids.neuroimaging.io/index.html",
      "domain": "bids.neuroimaging.io",
      "type": "citation"
    },
    {
      "text": "Sdata201618",
      "url": "https://www.nature.com/articles/sdata201618",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc11368680",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11368680/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/neuroinformatics/articles/10.3389/fninf.2024.1430987/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Major Requirements",
      "url": "https://naturalsciences.uoregon.edu/neuroscience/undergraduate-programs/major-requirements",
      "domain": "naturalsciences.uoregon.edu",
      "type": "citation"
    },
    {
      "text": "Courses",
      "url": "https://krieger.jhu.edu/neuroscience/bs-program/courses/",
      "domain": "krieger.jhu.edu",
      "type": "citation"
    },
    {
      "text": "Undergraduate Research In Psychology And Neuroscience",
      "url": "https://psychology.unc.edu/undergraduate-research-in-psychology-and-neuroscience/",
      "domain": "psychology.unc.edu",
      "type": "citation"
    },
    {
      "text": "Reu",
      "url": "https://www.nsf.gov/funding/initiatives/reu",
      "domain": "nsf.gov",
      "type": "citation"
    },
    {
      "text": "Neuroscience",
      "url": "https://gsbs.tufts.edu/academics/basic-science-phd-programs/neuroscience",
      "domain": "gsbs.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Program Overview",
      "url": "https://inp.neuroscience.utexas.edu/program-overview",
      "domain": "inp.neuroscience.utexas.edu",
      "type": "citation"
    },
    {
      "text": "Neuroscience Phd",
      "url": "https://e-catalogue.jhu.edu/medicine/graduate-programs/neuroscience-phd/",
      "domain": "e-catalogue.jhu.edu",
      "type": "citation"
    },
    {
      "text": "Neuroscience",
      "url": "https://college.mayo.edu/academics/biomedical-research-training/phd-program/tracks/neuroscience/",
      "domain": "college.mayo.edu",
      "type": "citation"
    },
    {
      "text": "Sciadv.abj2604",
      "url": "https://www.science.org/doi/10.1126/sciadv.abj2604",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Not Od 25 105.html",
      "url": "https://grants.nih.gov/grants/guide/notice-files/NOT-OD-25-105.html",
      "domain": "grants.nih.gov",
      "type": "citation"
    },
    {
      "text": "Free Neuroscience Moocs",
      "url": "https://neurosciencenews.com/free-neuroscience-moocs/",
      "domain": "neurosciencenews.com",
      "type": "citation"
    },
    {
      "text": "Nbk569516",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK569516/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "We Still Exist How Four Neuroscience Advocacy Groups Are Navigating Federal Dei Funding Cuts",
      "url": "https://www.thetransmitter.org/dei/we-still-exist-how-four-neuroscience-advocacy-groups-are-navigating-federal-dei-funding-cuts/",
      "domain": "thetransmitter.org",
      "type": "citation"
    },
    {
      "text": "Bristol Myers Squibb Vice President Global Program Lead Neuroscience",
      "url": "https://career.clemson.edu/jobs/bristol-myers-squibb-vice-president-global-program-lead-neuroscience/",
      "domain": "career.clemson.edu",
      "type": "citation"
    },
    {
      "text": "Neuroscience Biotech Companies",
      "url": "https://www.labiotech.eu/best-biotech/neuroscience-biotech-companies/",
      "domain": "labiotech.eu",
      "type": "citation"
    },
    {
      "text": "Topline Results From Pivotal Apolloe4 Phase 3 Trial Of Oral Valiltramiprosate Alz 801 In Patients With Early Alzheimers Disease Carrying Two Copies Of Apoe4 Gene",
      "url": "https://alzheon.com/topline-results-from-pivotal-apolloe4-phase-3-trial-of-oral-valiltramiprosate-alz-801-in-patients-with-early-alzheimers-disease-carrying-two-copies-of-apoe4-gene/",
      "domain": "alzheon.com",
      "type": "citation"
    },
    {
      "text": "Find Your Ninds Program Officer",
      "url": "https://www.ninds.nih.gov/funding/about-funding/find-your-ninds-program-officer",
      "domain": "ninds.nih.gov",
      "type": "citation"
    },
    {
      "text": "Office Neuroscience",
      "url": "https://www.fda.gov/about-fda/cder-offices-and-divisions/office-neuroscience",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Neuroethics",
      "url": "https://neuroxcareers.org/neuroethics/",
      "domain": "neuroxcareers.org",
      "type": "citation"
    },
    {
      "text": "2025 The State Of Ai In Healthcare",
      "url": "https://menlovc.com/perspective/2025-the-state-of-ai-in-healthcare/",
      "domain": "menlovc.com",
      "type": "citation"
    },
    {
      "text": "Us Life Sciences Talent Trends 2025",
      "url": "https://www.cbre.com/insights/reports/us-life-sciences-talent-trends-2025",
      "domain": "cbre.com",
      "type": "citation"
    },
    {
      "text": "brainprize.org",
      "url": "https://brainprize.org/",
      "domain": "brainprize.org",
      "type": "citation"
    },
    {
      "text": "Pioneering Research Into Brain Cancer Is Awarded The Worlds Largest Brain Research Prize The",
      "url": "https://lundbeckfonden.com/news/pioneering-research-into-brain-cancer-is-awarded-the-worlds-largest-brain-research-prize-the",
      "domain": "lundbeckfonden.com",
      "type": "citation"
    },
    {
      "text": "2024",
      "url": "https://www.kavliprize.org/prizes/neuroscience/2024",
      "domain": "kavliprize.org",
      "type": "citation"
    },
    {
      "text": "About",
      "url": "https://www.kavliprize.org/about",
      "domain": "kavliprize.org",
      "type": "citation"
    },
    {
      "text": "Milestones Timeline",
      "url": "https://www.ninds.nih.gov/about-ninds/75th-anniversary/milestones-timeline",
      "domain": "ninds.nih.gov",
      "type": "citation"
    },
    {
      "text": "Brain 20 Report Cells Circuits Toward Cures",
      "url": "https://braininitiative.nih.gov/vision/nih-brain-initiative-reports/brain-20-report-cells-circuits-toward-cures",
      "domain": "braininitiative.nih.gov",
      "type": "citation"
    },
    {
      "text": "2025 Life Sciences Executive Outlook.html",
      "url": "https://www.deloitte.com/us/en/insights/industry/health-care/life-sciences-and-health-care-industry-outlooks/2025-life-sciences-executive-outlook.html",
      "domain": "deloitte.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "nervous system",
      "page": "Nervous_system"
    },
    {
      "text": "brain",
      "page": "Brain"
    },
    {
      "text": "spinal cord",
      "page": "Spinal_cord"
    },
    {
      "text": "biology",
      "page": "Biology"
    },
    {
      "text": "psychology",
      "page": "Psychology"
    },
    {
      "text": "medicine",
      "page": "Medicine"
    },
    {
      "text": "genetics",
      "page": "Genetics"
    },
    {
      "text": "physiology",
      "page": "Physiology"
    },
    {
      "text": "pharmacology",
      "page": "Pharmacology"
    },
    {
      "text": "pathology",
      "page": "Pathology"
    },
    {
      "text": "perception",
      "page": "Perception"
    },
    {
      "text": "movement",
      "page": "Movement"
    },
    {
      "text": "memory",
      "page": "Memory"
    },
    {
      "text": "Alzheimer's disease",
      "page": "Alzheimer's_disease"
    },
    {
      "text": "Parkinson's disease",
      "page": "Parkinson's_disease"
    },
    {
      "text": "epilepsy",
      "page": "Epilepsy"
    },
    {
      "text": "mental health",
      "page": "Mental_health"
    },
    {
      "text": "ancient Greece",
      "page": "Ancient_Greece"
    },
    {
      "text": "Hippocrates",
      "page": "Hippocrates"
    },
    {
      "text": "Renaissance",
      "page": "Renaissance"
    },
    {
      "text": "neurology",
      "page": "Neurology"
    },
    {
      "text": "Luigi Galvani",
      "page": "Luigi_Galvani"
    },
    {
      "text": "Santiago Ramón y Cajal",
      "page": "Santiago_Ramón_y_Cajal"
    },
    {
      "text": "Hans Berger",
      "page": "Hans_Berger"
    },
    {
      "text": "functional magnetic resonance imaging",
      "page": "Functional_magnetic_resonance_imaging"
    },
    {
      "text": "language",
      "page": "Language"
    },
    {
      "text": "decision-making",
      "page": "Decision-making"
    },
    {
      "text": "neuron",
      "page": "Neuron"
    },
    {
      "text": "systems neuroscience",
      "page": "Systems_neuroscience"
    },
    {
      "text": "clinical neuroscience",
      "page": "Clinical_neuroscience"
    },
    {
      "text": "stroke",
      "page": "Stroke"
    },
    {
      "text": "multiple sclerosis",
      "page": "Multiple_sclerosis"
    },
    {
      "text": "deep brain stimulation",
      "page": "Deep_brain_stimulation"
    },
    {
      "text": "BRAIN Initiative",
      "page": "BRAIN_Initiative"
    },
    {
      "text": "brain mapping",
      "page": "Brain_mapping"
    },
    {
      "text": "consciousness",
      "page": "Consciousness"
    },
    {
      "text": "behavior",
      "page": "Behavior"
    },
    {
      "text": "artificial intelligence",
      "page": "Artificial_intelligence"
    },
    {
      "text": "neuroethics",
      "page": "Neuroethics"
    },
    {
      "text": "On the Sacred Disease",
      "page": "On_the_Sacred_Disease"
    },
    {
      "text": "Hippocratic Corpus",
      "page": "Hippocratic_Corpus"
    },
    {
      "text": "CE",
      "page": "CE"
    },
    {
      "text": "human",
      "page": "Human"
    },
    {
      "text": "nerves",
      "page": "The_Nerves"
    },
    {
      "text": "Islamic Golden Age",
      "page": "Islamic_Golden_Age"
    },
    {
      "text": "Avicenna",
      "page": "Avicenna"
    },
    {
      "text": "Canon of Medicine",
      "page": "The_Canon_of_Medicine"
    },
    {
      "text": "neural tube",
      "page": "Neural_tube"
    },
    {
      "text": "central nervous system",
      "page": "Central_nervous_system"
    },
    {
      "text": "Al-Andalus",
      "page": "Al-Andalus"
    },
    {
      "text": "Andreas Vesalius",
      "page": "Andreas_Vesalius"
    },
    {
      "text": "17th century",
      "page": "17th_century"
    },
    {
      "text": "René Descartes",
      "page": "René_Descartes"
    },
    {
      "text": "dualism",
      "page": "Dualism"
    },
    {
      "text": "Meditations on First Philosophy",
      "page": "Meditations_on_First_Philosophy"
    },
    {
      "text": "Passions of the Soul",
      "page": "Passions_of_the_Soul"
    },
    {
      "text": "pineal gland",
      "page": "Pineal_gland"
    },
    {
      "text": "anatomy",
      "page": "Anatomy"
    },
    {
      "text": "microscopy",
      "page": "Microscopy"
    },
    {
      "text": "Camillo Golgi",
      "page": "Camillo_Golgi"
    },
    {
      "text": "1880s",
      "page": "1880s"
    },
    {
      "text": "1890s",
      "page": "1890s"
    },
    {
      "text": "cerebellum",
      "page": "Cerebellum"
    },
    {
      "text": "nerve",
      "page": "Nerve"
    },
    {
      "text": "Alessandro Volta",
      "page": "Alessandro_Volta"
    },
    {
      "text": "Edgar Douglas Adrian",
      "page": "Adrian"
    },
    {
      "text": "amplitude",
      "page": "Amplitude"
    },
    {
      "text": "Nobel Prize",
      "page": "Nobel_Prize"
    },
    {
      "text": "Paul Broca",
      "page": "Paul_Broca"
    },
    {
      "text": "inferior frontal gyrus",
      "page": "Inferior_frontal_gyrus"
    },
    {
      "text": "expressive aphasia",
      "page": "Expressive_aphasia"
    },
    {
      "text": "Broca's area",
      "page": "Broca's_area"
    },
    {
      "text": "speech production",
      "page": "Speech_production"
    },
    {
      "text": "Wilder Penfield",
      "page": "Wilder_Penfield"
    },
    {
      "text": "primary motor cortex",
      "page": "Primary_motor_cortex"
    },
    {
      "text": "homunculus",
      "page": "Homunculus"
    },
    {
      "text": "synapse",
      "page": "Synapse"
    },
    {
      "text": "reflex",
      "page": "Reflex"
    },
    {
      "text": "summation",
      "page": "Summation"
    },
    {
      "text": "synapsis",
      "page": "Synapsis"
    },
    {
      "text": "plasticity",
      "page": "Plasticity"
    },
    {
      "text": "action potential",
      "page": "Action_potential"
    },
    {
      "text": "computational neuroscience",
      "page": "Computational_neuroscience"
    },
    {
      "text": "Human Genome Project",
      "page": "Human_Genome_Project"
    },
    {
      "text": "human genome",
      "page": "Human_genome"
    },
    {
      "text": "schizophrenia",
      "page": "Schizophrenia"
    },
    {
      "text": "neurogenetics",
      "page": "Neurogenetics"
    },
    {
      "text": "CRISPR-Cas9",
      "page": "CRISPR"
    },
    {
      "text": "Rett syndrome",
      "page": "Rett_syndrome"
    },
    {
      "text": "Cas9",
      "page": "Cas9"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "mapping",
      "page": "Mapping"
    },
    {
      "text": "electrode",
      "page": "Electrode"
    },
    {
      "text": "monitoring",
      "page": "Monitoring"
    },
    {
      "text": "European",
      "page": "European"
    },
    {
      "text": "Human Brain Project",
      "page": "Human_Brain_Project"
    },
    {
      "text": "rodent",
      "page": "Rodent"
    },
    {
      "text": "neurotransmitter receptor",
      "page": "Neurotransmitter_receptor"
    },
    {
      "text": "AMPA",
      "page": "AMPA"
    },
    {
      "text": "structural biology",
      "page": "Structural_biology"
    },
    {
      "text": "connectomics",
      "page": "Connectomics"
    },
    {
      "text": "drug design",
      "page": "Drug_design"
    },
    {
      "text": "cell",
      "page": "Cell"
    },
    {
      "text": "soma",
      "page": "Soma"
    },
    {
      "text": "nucleus",
      "page": "Nucleus"
    },
    {
      "text": "axon",
      "page": "Axon"
    },
    {
      "text": "myelin",
      "page": "Myelin"
    },
    {
      "text": "capacitance",
      "page": "Capacitance"
    },
    {
      "text": "resistance",
      "page": "Resistance"
    },
    {
      "text": "cerebral cortex",
      "page": "Cerebral_cortex"
    },
    {
      "text": "hippocampus",
      "page": "Hippocampus"
    },
    {
      "text": "dendrite",
      "page": "Dendrite"
    },
    {
      "text": "cortex",
      "page": "Cortex"
    },
    {
      "text": "motor coordination",
      "page": "Motor_coordination"
    },
    {
      "text": "membrane potential",
      "page": "Membrane_potential"
    },
    {
      "text": "mV",
      "page": "MV"
    },
    {
      "text": "extracellular space",
      "page": "Extracellular_space"
    },
    {
      "text": "potassium",
      "page": "Potassium"
    },
    {
      "text": "chloride",
      "page": "Chloride"
    },
    {
      "text": "semipermeable membrane",
      "page": "Semipermeable_membrane"
    },
    {
      "text": "resting potential",
      "page": "Resting_potential"
    },
    {
      "text": "ATPase",
      "page": "ATPase"
    },
    {
      "text": "equilibrium",
      "page": "Equilibrium"
    },
    {
      "text": "ion",
      "page": "Ion"
    },
    {
      "text": "Nernst equation",
      "page": "Nernst_equation"
    },
    {
      "text": "Astrocytes",
      "page": "Astrocyte"
    },
    {
      "text": "glia",
      "page": "Glia"
    },
    {
      "text": "Oligodendrocytes",
      "page": "Oligodendrocyte"
    },
    {
      "text": "energy",
      "page": "Energy"
    },
    {
      "text": "resource allocation",
      "page": "Resource_allocation"
    },
    {
      "text": "connexin",
      "page": "Connexin"
    },
    {
      "text": "neurotransmission",
      "page": "Neurotransmission"
    },
    {
      "text": "exocytosis",
      "page": "Exocytosis"
    },
    {
      "text": "neurotransmitter",
      "page": "Neurotransmitter"
    },
    {
      "text": "quanta",
      "page": "Quanta"
    },
    {
      "text": "Poisson",
      "page": "Poisson"
    },
    {
      "text": "active site",
      "page": "Active_site"
    },
    {
      "text": "reuptake",
      "page": "Reuptake"
    },
    {
      "text": "degradation",
      "page": "Degradation"
    },
    {
      "text": "serotonin transporter",
      "page": "Serotonin_transporter"
    },
    {
      "text": "SERT",
      "page": "SERT"
    },
    {
      "text": "cloning",
      "page": "Cloning"
    },
    {
      "text": "homeostasis",
      "page": "Homeostasis"
    },
    {
      "text": "serotonergic",
      "page": "Serotonergic"
    },
    {
      "text": "neuroplasticity",
      "page": "Neuroplasticity"
    },
    {
      "text": "adaptation",
      "page": "Adaptation"
    },
    {
      "text": "recovery",
      "page": "Recovery"
    },
    {
      "text": "Synaptic plasticity",
      "page": "Synaptic_plasticity"
    },
    {
      "text": "long-term potentiation",
      "page": "Long-term_potentiation"
    },
    {
      "text": "LTD",
      "page": "LTD"
    },
    {
      "text": "NMDA) receptor",
      "page": "NMDA_receptor"
    },
    {
      "text": "depolarization",
      "page": "Depolarization"
    },
    {
      "text": "membrane",
      "page": "Membrane"
    },
    {
      "text": "critical period",
      "page": "Critical_period"
    },
    {
      "text": "visual system",
      "page": "Visual_system"
    },
    {
      "text": "monocular",
      "page": "Monocular"
    },
    {
      "text": "ocular dominance",
      "page": "Ocular_dominance"
    },
    {
      "text": "experience",
      "page": "Experience"
    },
    {
      "text": "sprouting",
      "page": "Sprouting"
    },
    {
      "text": "motor control",
      "page": "Motor_control"
    },
    {
      "text": "rehabilitation",
      "page": "Rehabilitation"
    },
    {
      "text": "psilocybin",
      "page": "Psilocybin"
    },
    {
      "text": "synaptogenesis",
      "page": "Synaptogenesis"
    },
    {
      "text": "prefrontal cortex",
      "page": "Prefrontal_cortex"
    },
    {
      "text": "gene expression",
      "page": "Gene_expression"
    },
    {
      "text": "repolarization",
      "page": "Repolarization"
    },
    {
      "text": "threshold",
      "page": "Threshold"
    },
    {
      "text": "phase",
      "page": "Phase"
    },
    {
      "text": "saltatory conduction",
      "page": "Saltatory_conduction"
    },
    {
      "text": "insulation",
      "page": "Insulation"
    },
    {
      "text": "squid",
      "page": "SQUID"
    },
    {
      "text": "propagation",
      "page": "Propagation"
    },
    {
      "text": "mutations",
      "page": "The_Mutations"
    },
    {
      "text": "Dravet syndrome",
      "page": "Dravet_syndrome"
    },
    {
      "text": "interneurons",
      "page": "Interneuron"
    },
    {
      "text": "striatum",
      "page": "Striatum"
    },
    {
      "text": "mood",
      "page": "Mood"
    },
    {
      "text": "sleep",
      "page": "Sleep"
    },
    {
      "text": "neuromuscular junction",
      "page": "Neuromuscular_junction"
    },
    {
      "text": "skeletal muscle",
      "page": "Skeletal_muscle"
    },
    {
      "text": "cAMP",
      "page": "Cyclic_adenosine_monophosphate"
    },
    {
      "text": "sensory processing",
      "page": "Sensory_processing"
    },
    {
      "text": "adaptive learning",
      "page": "Adaptive_learning"
    },
    {
      "text": "dopaminergic",
      "page": "Dopaminergic"
    },
    {
      "text": "substantia nigra",
      "page": "Substantia_nigra"
    },
    {
      "text": "pars compacta",
      "page": "Pars_compacta"
    },
    {
      "text": "dopamine",
      "page": "Dopamine"
    },
    {
      "text": "tremor",
      "page": "Tremor"
    },
    {
      "text": "gut microbiota",
      "page": "Gut_microbiota"
    },
    {
      "text": "Lactobacillus",
      "page": "Lactobacillus"
    },
    {
      "text": "Bifidobacterium",
      "page": "Bifidobacterium"
    },
    {
      "text": "depression",
      "page": "Depression"
    },
    {
      "text": "cellular differentiation",
      "page": "Cellular_differentiation"
    },
    {
      "text": "genes",
      "page": "Gene"
    },
    {
      "text": "chromatin",
      "page": "Chromatin"
    },
    {
      "text": "long-term memory",
      "page": "Long-term_memory"
    },
    {
      "text": "methylation",
      "page": "DNA_methylation"
    },
    {
      "text": "cytosine",
      "page": "Cytosine"
    },
    {
      "text": "memory consolidation",
      "page": "Memory_consolidation"
    },
    {
      "text": "CREB-binding protein",
      "page": "CREB-binding_protein"
    },
    {
      "text": "long-term potentiation",
      "page": "Long-term_potentiaion"
    },
    {
      "text": "spatial memory",
      "page": "Spatial_memory"
    },
    {
      "text": "histone deacetylase",
      "page": "Histone_deacetylase"
    },
    {
      "text": "Arc",
      "page": "Arc"
    },
    {
      "text": "brain-derived neurotrophic factor",
      "page": "Brain-derived_neurotrophic_factor"
    },
    {
      "text": "AMPA receptor",
      "page": "AMPA_receptor"
    },
    {
      "text": "neurotransmitter transporters",
      "page": "Neurotransmitter_transporter"
    },
    {
      "text": "spatial transcriptomics",
      "page": "Spatial_transcriptomics"
    },
    {
      "text": "pain",
      "page": "P.A.I.N."
    },
    {
      "text": "temperature",
      "page": "Temperature"
    },
    {
      "text": "spinothalamic tract",
      "page": "Spinothalamic_tract"
    },
    {
      "text": "commissure",
      "page": "White_matter"
    },
    {
      "text": "brainstem",
      "page": "Brainstem"
    },
    {
      "text": "ventral posterolateral nucleus",
      "page": "Ventral_posterolateral_nucleus"
    },
    {
      "text": "thalamus",
      "page": "Thalamus"
    },
    {
      "text": "primary somatosensory cortex",
      "page": "Primary_somatosensory_cortex"
    },
    {
      "text": "postcentral gyrus",
      "page": "Postcentral_gyrus"
    },
    {
      "text": "vision",
      "page": "Vision"
    },
    {
      "text": "V1",
      "page": "V1"
    },
    {
      "text": "feedback",
      "page": "Feedback"
    },
    {
      "text": "awareness",
      "page": "Awareness"
    },
    {
      "text": "superior colliculus",
      "page": "Superior_colliculus"
    },
    {
      "text": "audiovisual",
      "page": "Audiovisual"
    },
    {
      "text": "hierarchical organization",
      "page": "Hierarchical_organization"
    },
    {
      "text": "precentral gyrus",
      "page": "Precentral_gyrus"
    },
    {
      "text": "basal ganglia",
      "page": "Basal_ganglia"
    },
    {
      "text": "globus pallidus",
      "page": "Globus_pallidus"
    },
    {
      "text": "action",
      "page": "Action"
    },
    {
      "text": "initiation",
      "page": "Initiation"
    },
    {
      "text": "inverse",
      "page": "Inverse"
    },
    {
      "text": "motor cortex",
      "page": "Motor_cortex"
    },
    {
      "text": "ataxia",
      "page": "Ataxia"
    },
    {
      "text": "dysmetria",
      "page": "Dysmetria"
    },
    {
      "text": "feedforward",
      "page": "Feedforward"
    },
    {
      "text": "disinhibition",
      "page": "Disinhibition"
    },
    {
      "text": "vasoactive intestinal peptide",
      "page": "Vasoactive_intestinal_peptide"
    },
    {
      "text": "default mode network",
      "page": "Default_mode_network"
    },
    {
      "text": "posterior cingulate cortex",
      "page": "Posterior_cingulate_cortex"
    },
    {
      "text": "angular gyrus",
      "page": "Angular_gyrus"
    },
    {
      "text": "introspection",
      "page": "Introspection"
    },
    {
      "text": "mind-wandering",
      "page": "Mind-wandering"
    },
    {
      "text": "salience network",
      "page": "Salience_network"
    },
    {
      "text": "navigation",
      "page": "Navigation"
    },
    {
      "text": "GABAergic",
      "page": "GABAergic"
    },
    {
      "text": "integration",
      "page": "Integration"
    },
    {
      "text": "attention",
      "page": "Attention"
    },
    {
      "text": "nematode",
      "page": "Nematode"
    },
    {
      "text": "connectome",
      "page": "Connectome"
    },
    {
      "text": "foraging",
      "page": "Foraging"
    },
    {
      "text": "human brain",
      "page": "Human_brain"
    },
    {
      "text": "forebrain",
      "page": "Forebrain"
    },
    {
      "text": "midbrain",
      "page": "Midbrain"
    },
    {
      "text": "hindbrain",
      "page": "Hindbrain"
    },
    {
      "text": "cognition",
      "page": "Cognition"
    },
    {
      "text": "emotion",
      "page": "Emotion"
    },
    {
      "text": "planning",
      "page": "Planning"
    },
    {
      "text": "limbic system",
      "page": "Limbic_system"
    },
    {
      "text": "amygdala",
      "page": "Amygdala"
    },
    {
      "text": "temporal lobe",
      "page": "Temporal_lobe"
    },
    {
      "text": "frontal lobe",
      "page": "Frontal_lobe"
    },
    {
      "text": "Wernicke's area",
      "page": "Wernicke's_area"
    },
    {
      "text": "pattern recognition",
      "page": "Pattern_recognition"
    },
    {
      "text": "face perception",
      "page": "Face_perception"
    },
    {
      "text": "hypothalamus",
      "page": "Hypothalamus"
    },
    {
      "text": "preoptic area",
      "page": "Preoptic_area"
    },
    {
      "text": "thermoregulation",
      "page": "Thermoregulation"
    },
    {
      "text": "hormone",
      "page": "Hormone"
    },
    {
      "text": "pituitary gland",
      "page": "Pituitary_gland"
    },
    {
      "text": "motivational salience",
      "page": "Motivational_salience"
    },
    {
      "text": "medulla oblongata",
      "page": "Medulla_oblongata"
    },
    {
      "text": "pons",
      "page": "Pons"
    },
    {
      "text": "respiration",
      "page": "Respiration"
    },
    {
      "text": "reticular formation",
      "page": "Reticular_formation"
    },
    {
      "text": "inhalation",
      "page": "Inhalation"
    },
    {
      "text": "exhalation",
      "page": "Exhalation"
    },
    {
      "text": "heart rate",
      "page": "Heart_rate"
    },
    {
      "text": "sensory integration",
      "page": "sensory_processing"
    },
    {
      "text": "synthesis",
      "page": "Synthesis"
    },
    {
      "text": "fusion",
      "page": "Fusion"
    },
    {
      "text": "orientation",
      "page": "Orientation"
    },
    {
      "text": "cats",
      "page": "The_Cats"
    },
    {
      "text": "primates",
      "page": "List_of_primates"
    },
    {
      "text": "lateral geniculate nucleus",
      "page": "Lateral_geniculate_nucleus"
    },
    {
      "text": "object recognition",
      "page": "Outline_of_object_recognition"
    },
    {
      "text": "binding problem",
      "page": "Binding_problem"
    },
    {
      "text": "cat",
      "page": "Cat"
    },
    {
      "text": "sense",
      "page": "Sense"
    },
    {
      "text": "ownership",
      "page": "Ownership"
    },
    {
      "text": "body schema",
      "page": "Body_schema"
    },
    {
      "text": "fear conditioning",
      "page": "Fear_conditioning"
    },
    {
      "text": "freezing behavior",
      "page": "Freezing_behavior"
    },
    {
      "text": "decay",
      "page": "Decay"
    },
    {
      "text": "critical role",
      "page": "Critical_Role"
    },
    {
      "text": "non-rapid eye movement sleep",
      "page": "Non-rapid_eye_movement_sleep"
    },
    {
      "text": "pruning",
      "page": "Pruning"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "extinction",
      "page": "Extinction"
    },
    {
      "text": "fear",
      "page": "Fear"
    },
    {
      "text": "nucleus accumbens",
      "page": "Nucleus_accumbens"
    },
    {
      "text": "NAc",
      "page": "NAC"
    },
    {
      "text": "ventral tegmental area",
      "page": "Ventral_tegmental_area"
    },
    {
      "text": "reinforcement learning",
      "page": "Reinforcement_learning"
    },
    {
      "text": "1990s",
      "page": "1990s"
    },
    {
      "text": "salient",
      "page": "Salient"
    },
    {
      "text": "premotor cortex",
      "page": "Premotor_cortex"
    },
    {
      "text": "macaque",
      "page": "Macaque"
    },
    {
      "text": "empathy",
      "page": "Empathy"
    },
    {
      "text": "emotional contagion",
      "page": "Emotional_contagion"
    },
    {
      "text": "valence",
      "page": "Valence"
    },
    {
      "text": "consolidation",
      "page": "Consolidation"
    },
    {
      "text": "dynamics",
      "page": "Dynamics"
    },
    {
      "text": "networks",
      "page": "List_of_television_stations_in_Brazil"
    },
    {
      "text": "differential equation",
      "page": "Differential_equation"
    },
    {
      "text": "spike",
      "page": "Spike"
    },
    {
      "text": "population dynamics",
      "page": "Population_dynamics"
    },
    {
      "text": "connections",
      "page": "Connections"
    },
    {
      "text": "synchronization",
      "page": "Synchronization"
    },
    {
      "text": "neuron morphology",
      "page": "Morphology"
    },
    {
      "text": "data",
      "page": "Data"
    },
    {
      "text": "currents",
      "page": "Current"
    },
    {
      "text": "fidelity",
      "page": "Fidelity"
    },
    {
      "text": "information",
      "page": "Information"
    },
    {
      "text": "neural coding",
      "page": "Neural_coding"
    },
    {
      "text": "efficiency",
      "page": "Efficiency"
    },
    {
      "text": "bandwidth",
      "page": "Bandwidth"
    },
    {
      "text": "Horace",
      "page": "Horace"
    },
    {
      "text": "principle",
      "page": "Principle"
    },
    {
      "text": "retina",
      "page": "Retina"
    },
    {
      "text": "ganglion",
      "page": "Ganglion"
    },
    {
      "text": "free energy principle",
      "page": "Free_energy_principle"
    },
    {
      "text": "free energy",
      "page": "Free_energy"
    },
    {
      "text": "KL",
      "page": "KL"
    },
    {
      "text": "uncertainty",
      "page": "Uncertainty"
    },
    {
      "text": "environment",
      "page": "Environment"
    },
    {
      "text": "stochastic resonance",
      "page": "Stochastic_resonance"
    },
    {
      "text": "computing",
      "page": "Computing"
    },
    {
      "text": "processing",
      "page": "Processing"
    },
    {
      "text": "machine learning",
      "page": "Machine_learning"
    },
    {
      "text": "von Neumann",
      "page": "Von_Neumann"
    },
    {
      "text": "perceptron",
      "page": "Perceptron"
    },
    {
      "text": "Frank Rosenblatt",
      "page": "Frank_Rosenblatt"
    },
    {
      "text": "binary classification",
      "page": "Binary_classification"
    },
    {
      "text": "function",
      "page": "Function"
    },
    {
      "text": "supervised learning",
      "page": "Supervised_learning"
    },
    {
      "text": "backpropagation",
      "page": "Backpropagation"
    },
    {
      "text": "Geoffrey Hinton",
      "page": "Geoffrey_Hinton"
    },
    {
      "text": "gradient descent",
      "page": "Gradient_descent"
    },
    {
      "text": "visual cortex",
      "page": "Visual_cortex"
    },
    {
      "text": "natural language processing",
      "page": "Natural_language_processing"
    },
    {
      "text": "bursting",
      "page": "Bursting"
    },
    {
      "text": "differential",
      "page": "Differential"
    },
    {
      "text": "parallel processing",
      "page": "Parallel_processing"
    },
    {
      "text": "2014",
      "page": "2014"
    },
    {
      "text": "processor",
      "page": "Processor"
    },
    {
      "text": "robotics",
      "page": "Robotics"
    },
    {
      "text": "synaptic pruning",
      "page": "Synaptic_pruning"
    },
    {
      "text": "overfitting",
      "page": "Overfitting"
    },
    {
      "text": "generalization",
      "page": "Generalization"
    },
    {
      "text": "Transformer",
      "page": "Transformer"
    },
    {
      "text": "federated learning",
      "page": "Federated_learning"
    },
    {
      "text": "drug discovery",
      "page": "Drug_discovery"
    },
    {
      "text": "connectivity",
      "page": "Connectivity"
    },
    {
      "text": "magnetic resonance imaging",
      "page": "Magnetic_resonance_imaging"
    },
    {
      "text": "surface reconstruction",
      "page": "Surface_reconstruction"
    },
    {
      "text": "cerebrospinal fluid",
      "page": "Cerebrospinal_fluid"
    },
    {
      "text": "inflammation",
      "page": "Inflammation"
    },
    {
      "text": "Diffusion",
      "page": "Diffusion"
    },
    {
      "text": "anisotropy",
      "page": "Anisotropy"
    },
    {
      "text": "fractional anisotropy",
      "page": "Fractional_anisotropy"
    },
    {
      "text": "biomarker",
      "page": "Biomarker"
    },
    {
      "text": "PET",
      "page": "PET"
    },
    {
      "text": "functional imaging",
      "page": "Functional_imaging"
    },
    {
      "text": "tractography",
      "page": "Tractography"
    },
    {
      "text": "FA",
      "page": "FA"
    },
    {
      "text": "cell membrane",
      "page": "Cell_membrane"
    },
    {
      "text": "cytoplasm",
      "page": "Cytoplasm"
    },
    {
      "text": "3D",
      "page": "3D"
    },
    {
      "text": "spikes",
      "page": "SPIKES"
    },
    {
      "text": "10,000",
      "page": "10,000"
    },
    {
      "text": "optogenetics",
      "page": "Optogenetics"
    },
    {
      "text": "electrophysiology",
      "page": "Electrophysiology"
    },
    {
      "text": "causal inference",
      "page": "Causal_inference"
    },
    {
      "text": "noise",
      "page": "Noise"
    },
    {
      "text": "sorting",
      "page": "Sorting"
    },
    {
      "text": "PCA",
      "page": "PCA"
    },
    {
      "text": "tetrode",
      "page": "Tetrode"
    },
    {
      "text": "2020s",
      "page": "2020s"
    },
    {
      "text": "real-time",
      "page": "Real-time"
    },
    {
      "text": "gene delivery",
      "page": "Gene_delivery"
    },
    {
      "text": "genetic engineering",
      "page": "Genetic_engineering"
    },
    {
      "text": "molecular biology",
      "page": "Molecular_biology"
    },
    {
      "text": "immunogenicity",
      "page": "Immunogenicity"
    },
    {
      "text": "kb",
      "page": "KB"
    },
    {
      "text": "primate",
      "page": "Primate"
    },
    {
      "text": "Cre-lox recombination",
      "page": "Cre-Lox_recombination"
    },
    {
      "text": "Cre recombinase",
      "page": "Cre_recombinase"
    },
    {
      "text": "lethality",
      "page": "Lethality"
    },
    {
      "text": "halorhodopsin (NpHR)",
      "page": "halorhodopsin"
    },
    {
      "text": "archaea",
      "page": "Archaea"
    },
    {
      "text": "acetylcholine",
      "page": "Acetylcholine"
    },
    {
      "text": "addiction",
      "page": "Addiction"
    },
    {
      "text": "in vivo",
      "page": "In_vivo"
    },
    {
      "text": "mouse",
      "page": "Mouse"
    },
    {
      "text": "tau protein",
      "page": "Tau_protein"
    },
    {
      "text": "basal forebrain",
      "page": "Basal_forebrain"
    },
    {
      "text": "alpha-synuclein",
      "page": "Alpha-synuclein"
    },
    {
      "text": "AD",
      "page": "PD"
    },
    {
      "text": "tau",
      "page": "Tau"
    },
    {
      "text": "AD",
      "page": ".ad"
    },
    {
      "text": "plasma",
      "page": "Plasma"
    },
    {
      "text": "tauopathy",
      "page": "Tauopathy"
    },
    {
      "text": "sadness",
      "page": "Sadness"
    },
    {
      "text": "social",
      "page": "Social"
    },
    {
      "text": "withdrawal",
      "page": "Withdrawal"
    },
    {
      "text": "resilience",
      "page": "Resilience"
    },
    {
      "text": "mesolimbic pathway",
      "page": "Mesolimbic_pathway"
    },
    {
      "text": "mesocortical pathway",
      "page": "Mesocortical_pathway"
    },
    {
      "text": "positron emission tomography",
      "page": "Positron_emission_tomography"
    },
    {
      "text": "ketamine",
      "page": "Ketamine"
    },
    {
      "text": "monoamine neurotransmitter",
      "page": "Monoamine_neurotransmitter"
    },
    {
      "text": "Chronic stress",
      "page": "Chronic_stress"
    },
    {
      "text": "HPA",
      "page": "HPA"
    },
    {
      "text": "cortisol",
      "page": "Cortisol"
    },
    {
      "text": "glucocorticoid receptor",
      "page": "Glucocorticoid_receptor"
    },
    {
      "text": "adolescence",
      "page": "Adolescence"
    },
    {
      "text": "neuroimaging",
      "page": "Neuroimaging"
    },
    {
      "text": "ASD",
      "page": "ASD"
    },
    {
      "text": "nucleotide",
      "page": "Nucleotide"
    },
    {
      "text": "microbiota",
      "page": "Microbiota"
    },
    {
      "text": "vagus nerve",
      "page": "Vagus_nerve"
    },
    {
      "text": "vagotomy",
      "page": "Vagotomy"
    },
    {
      "text": "motivation",
      "page": "Motivation"
    },
    {
      "text": "social behavior",
      "page": "Social_behavior"
    },
    {
      "text": "Huntington's disease",
      "page": "Huntington's_disease"
    },
    {
      "text": "Electroencephalography",
      "page": "Electroencephalography"
    },
    {
      "text": "MS",
      "page": "MS"
    },
    {
      "text": "lumbar puncture",
      "page": "Lumbar_puncture"
    },
    {
      "text": "oligoclonal bands",
      "page": "Oligoclonal_band"
    },
    {
      "text": "Genetic testing",
      "page": "Genetic_testing"
    },
    {
      "text": "quality of life",
      "page": "Quality_of_life"
    },
    {
      "text": "valproate",
      "page": "Valproate"
    },
    {
      "text": "sodium channel",
      "page": "Sodium_channel"
    },
    {
      "text": "clozapine",
      "page": "Clozapine"
    },
    {
      "text": "antipsychotic",
      "page": "Antipsychotic"
    },
    {
      "text": "seizure",
      "page": "Seizure"
    },
    {
      "text": "heart rate variability",
      "page": "Heart_rate_variability"
    },
    {
      "text": "electrodermal activity",
      "page": "Electrodermal_activity"
    },
    {
      "text": "blood-brain barrier",
      "page": "BBB"
    },
    {
      "text": "P-glycoprotein",
      "page": "P-glycoprotein"
    },
    {
      "text": "personalized medicine",
      "page": "Personalized_medicine"
    },
    {
      "text": "pharmacogenomics",
      "page": "Pharmacogenomics"
    },
    {
      "text": "CYP2D6",
      "page": "CYP2D6"
    },
    {
      "text": "amyotrophic lateral sclerosis",
      "page": "ALS"
    },
    {
      "text": "AD",
      "page": "List_of_species_used_in_bonsai"
    },
    {
      "text": "phosphorylation",
      "page": "Phosphorylation"
    },
    {
      "text": "glycogen synthase",
      "page": "Glycogen_synthase"
    },
    {
      "text": "cytotoxicity",
      "page": "Cytotoxicity"
    },
    {
      "text": "safety",
      "page": "Safety"
    },
    {
      "text": "efficacy",
      "page": "Efficacy"
    },
    {
      "text": "pharmacokinetics",
      "page": "Pharmacokinetics"
    },
    {
      "text": "rat",
      "page": "Rat"
    },
    {
      "text": "motor neuron",
      "page": "Motor_neuron"
    },
    {
      "text": "neuroprotection",
      "page": "Neuroprotection"
    },
    {
      "text": "placebo",
      "page": "Placebo"
    },
    {
      "text": "drug delivery",
      "page": "Drug_delivery"
    },
    {
      "text": "transcytosis",
      "page": "Transcytosis"
    },
    {
      "text": "bioavailability",
      "page": "Bioavailability"
    },
    {
      "text": "affinity",
      "page": "Affinity"
    },
    {
      "text": "dissociation constant",
      "page": "Dissociation_constant"
    },
    {
      "text": "modulation",
      "page": "Modulation"
    },
    {
      "text": "agonist",
      "page": "Agonist"
    },
    {
      "text": "glycine",
      "page": "Glycine"
    },
    {
      "text": "pipeline",
      "page": "Pipeline"
    },
    {
      "text": "ASOs",
      "page": "ASOs"
    },
    {
      "text": "SOD1",
      "page": "SOD1"
    },
    {
      "text": "protein aggregation",
      "page": "Protein_aggregation"
    },
    {
      "text": "Tofersen",
      "page": "Tofersen"
    },
    {
      "text": "ASO",
      "page": "ASO"
    },
    {
      "text": "US",
      "page": "United_States"
    },
    {
      "text": "UK",
      "page": "United_Kingdom"
    },
    {
      "text": "intervention",
      "page": "Intervention"
    },
    {
      "text": "Constraint-induced movement therapy",
      "page": "Constraint-induced_movement_therapy"
    },
    {
      "text": "randomized controlled trial",
      "page": "Randomized_controlled_trial"
    },
    {
      "text": "activities of daily living",
      "page": "Activities_of_daily_living"
    },
    {
      "text": "transcranial direct current stimulation",
      "page": "Transcranial_direct-current_stimulation"
    },
    {
      "text": "traumatic brain injury",
      "page": "Traumatic_brain_injury"
    },
    {
      "text": "stem cell",
      "page": "Stem_cell"
    },
    {
      "text": "Induced pluripotent stem cell",
      "page": "Induced_pluripotent_stem_cell"
    },
    {
      "text": "putamen",
      "page": "Putamen"
    },
    {
      "text": "neurofeedback",
      "page": "Neurofeedback"
    },
    {
      "text": "stimulant",
      "page": "Stimulant"
    },
    {
      "text": "impulsivity",
      "page": "Impulsivity"
    },
    {
      "text": "paralysis",
      "page": "Paralysis"
    },
    {
      "text": "locked-in syndrome",
      "page": "Locked-in_syndrome"
    },
    {
      "text": "surgery",
      "page": "Surgery"
    },
    {
      "text": "peak",
      "page": "Peak"
    },
    {
      "text": "anterior cingulate cortex",
      "page": "Anterior_cingulate_cortex"
    },
    {
      "text": "therapy",
      "page": "Therapy"
    },
    {
      "text": "median",
      "page": "Median"
    },
    {
      "text": "electrocorticography",
      "page": "Electrocorticography"
    },
    {
      "text": "clinician",
      "page": "Clinician"
    },
    {
      "text": "robotic surgeon",
      "page": "Surgeon"
    },
    {
      "text": "impairment",
      "page": "Impairment"
    },
    {
      "text": "record",
      "page": "Record"
    },
    {
      "text": "biocompatibility",
      "page": "Biocompatibility"
    },
    {
      "text": "miniaturization",
      "page": "Miniaturization"
    },
    {
      "text": "wireless",
      "page": "Wireless"
    },
    {
      "text": "inner ear",
      "page": "Inner_ear"
    },
    {
      "text": "speech perception",
      "page": "Speech_perception"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "spiral ganglion",
      "page": "Spiral_ganglion"
    },
    {
      "text": "speech recognition",
      "page": "Speech_recognition"
    },
    {
      "text": "retinitis pigmentosa",
      "page": "Retinitis_pigmentosa"
    },
    {
      "text": "macular degeneration",
      "page": "Macular_degeneration"
    },
    {
      "text": "bipolar",
      "page": "Bipolar"
    },
    {
      "text": "light",
      "page": "Light"
    },
    {
      "text": "stimulation",
      "page": "Stimulation"
    },
    {
      "text": "pacemaker",
      "page": "Artificial_cardiac_pacemaker"
    },
    {
      "text": "lesion",
      "page": "Lesion"
    },
    {
      "text": "electronics",
      "page": "Electronics"
    },
    {
      "text": "dust",
      "page": "Neural_dust"
    },
    {
      "text": "ultrasound",
      "page": "Ultrasound"
    },
    {
      "text": "sciatic nerve",
      "page": "Sciatic_nerve"
    },
    {
      "text": "soft robotics",
      "page": "Soft_robotics"
    },
    {
      "text": "neuromodulation",
      "page": "Neuromodulation"
    },
    {
      "text": "injury",
      "page": "Injury"
    },
    {
      "text": "elastomer",
      "page": "Elastomer"
    },
    {
      "text": "gait",
      "page": "Gait"
    },
    {
      "text": "silicone",
      "page": "Silicone"
    },
    {
      "text": "Modafinil",
      "page": "Modafinil"
    },
    {
      "text": "narcolepsy",
      "page": "Narcolepsy"
    },
    {
      "text": "off-label use",
      "page": "Off-label_use"
    },
    {
      "text": "productivity",
      "page": "Productivity"
    },
    {
      "text": "Equity",
      "page": "Equity"
    },
    {
      "text": "socioeconomic status",
      "page": "Socioeconomic_status"
    },
    {
      "text": "surveillance",
      "page": "Surveillance"
    },
    {
      "text": "emotions",
      "page": "The_Emotions"
    },
    {
      "text": "privacy",
      "page": "Privacy"
    },
    {
      "text": "General Data Protection Regulation",
      "page": "General_Data_Protection_Regulation"
    },
    {
      "text": "2025",
      "page": "2025"
    },
    {
      "text": "AI",
      "page": "Ai"
    },
    {
      "text": "international",
      "page": "International"
    },
    {
      "text": "exponential growth",
      "page": "Exponential_growth"
    },
    {
      "text": "imaging",
      "page": "Imaging"
    },
    {
      "text": "genomics",
      "page": "Genomics"
    },
    {
      "text": "Data science",
      "page": "Data_science"
    },
    {
      "text": "reproducibility",
      "page": "Reproducibility"
    },
    {
      "text": "Allen Institute",
      "page": "Allen_Institute"
    },
    {
      "text": "in situ hybridization",
      "page": "In_situ_hybridization"
    },
    {
      "text": "microarray",
      "page": "Microarray"
    },
    {
      "text": "Human Connectome Project",
      "page": "Human_Connectome_Project"
    },
    {
      "text": "interoperability",
      "page": "Interoperability"
    },
    {
      "text": "capstone",
      "page": "Capstone"
    },
    {
      "text": "PhD",
      "page": "PHD"
    },
    {
      "text": "coursework",
      "page": "Coursework"
    },
    {
      "text": "thesis",
      "page": "Thesis"
    },
    {
      "text": "neural circuit",
      "page": "Neural_circuit"
    },
    {
      "text": "disease",
      "page": "Disease"
    },
    {
      "text": "neuroengineering",
      "page": "Neuroengineering"
    },
    {
      "text": "computer science",
      "page": "Computer_science"
    },
    {
      "text": "engineering",
      "page": "Engineering"
    },
    {
      "text": "analysis",
      "page": "Analysis"
    },
    {
      "text": "research",
      "page": "Research"
    },
    {
      "text": "training",
      "page": "Training"
    },
    {
      "text": "Coursera",
      "page": "Coursera"
    },
    {
      "text": "edX",
      "page": "EdX"
    },
    {
      "text": "diversity, equity, and inclusion",
      "page": "Diversity,_equity,_and_inclusion"
    },
    {
      "text": "research and development",
      "page": "Research_and_development"
    },
    {
      "text": "clinical trial",
      "page": "Clinical_trial"
    },
    {
      "text": "gene therapy",
      "page": "Gene_therapy"
    },
    {
      "text": "data sharing",
      "page": "Data_sharing"
    },
    {
      "text": "Psychiatry",
      "page": "Psychiatry"
    },
    {
      "text": "neurotechnology",
      "page": "Neurotechnology"
    },
    {
      "text": "data analysis",
      "page": "Data_analysis"
    },
    {
      "text": "workforce",
      "page": "Workforce"
    },
    {
      "text": "San Diego",
      "page": "San_Diego"
    },
    {
      "text": "1906",
      "page": "1906"
    },
    {
      "text": "Alan Hodgkin",
      "page": "Alan_Hodgkin"
    },
    {
      "text": "Andrew Huxley",
      "page": "Andrew_Huxley"
    },
    {
      "text": "Rita Levi-Montalcini",
      "page": "Rita_Levi-Montalcini"
    },
    {
      "text": "nerve growth factor",
      "page": "Nerve_growth_factor"
    },
    {
      "text": "Eric Kandel",
      "page": "Eric_Kandel"
    },
    {
      "text": "signal transduction",
      "page": "Signal_transduction"
    },
    {
      "text": "May-Britt Moser",
      "page": "May-Britt_Moser"
    },
    {
      "text": "positioning system",
      "page": "Positioning_system"
    },
    {
      "text": "glioma",
      "page": "Glioma"
    },
    {
      "text": "Kavli Prize",
      "page": "Kavli_Prize"
    },
    {
      "text": "Nancy Kanwisher",
      "page": "Nancy_Kanwisher"
    },
    {
      "text": "treatment",
      "page": "Treatment"
    }
  ],
  "fetched_at": "2025-12-07T07:28:36.768778",
  "elapsed_ms": 869705
}