{
  "topic": "New York Yankees",
  "title": "New York Yankees",
  "slug": "new-york-yankees",
  "grokipedia_slug": "New_York_Yankees",
  "grokipedia_url": "https://grokipedia.com/page/New_York_Yankees",
  "source": "grokipedia",
  "content": "# New York Yankees\n\nThe New York Yankees are an American professional baseball team based in the Bronx borough of New York City, competing in Major League Baseball (MLB) as a member club of the American League (AL) East division. They play their home games at Yankee Stadium, a venue that opened in 2009 and replaced the original stadium used from 1923 to 2008. Founded in 1903 as one of the AL's original expansion franchises (initially as the New York Highlanders), the team relocated from Baltimore, where it had played as the Orioles in 1901–1902, and officially adopted the \"Yankees\" name in 1913 following popular usage by fans and media.\n\nThe Yankees' early history was marked by moderate success, but the franchise transformed into a dynasty beginning in the 1920s under owners Jacob Ruppert and later the Steinbrenner family, with general manager Ed Barrow acquiring key talents like Babe Ruth from the Boston Red Sox in 1920 for $125,000 plus a loan. This era introduced the team's signature pinstriped uniforms and established Yankee Stadium—nicknamed \"The House That Ruth Built\"—as their home in 1923. Over the decades, the Yankees have been owned by the New York Yankees Partnership since 1973, led prominently by George Steinbrenner from 1973 until his death in 2010, emphasizing a winning culture that has made them the most valuable MLB franchise, valued at over $7 billion as of recent estimates.\n\nRenowned for their unparalleled success, the Yankees hold the MLB record with **27 World Series championships**, achieved in 1923, 1927, 1928, 1932, 1936–1939, 1941, 1943, 1947, 1949–1953, 1956, 1958, 1961, 1962, 1977, 1978, 1996, 1998–2000, and 2009, along with 40 American League pennants. Iconic players have defined the franchise, including **Babe Ruth** (1920–1934), who revolutionized hitting with 714 career home runs; **Lou Gehrig** (1923–1939), known for his 2,130 consecutive games played; **Joe DiMaggio** (1936–1951), a three-time MVP with a 56-game hitting streak; **Mickey Mantle** (1951–1968), a seven-time champion with 536 home runs; **Yogi Berra** (1946–1963), a 10-time World Series champion; and modern stars like **Derek Jeter** (1995–2014), captain of five championship teams, and current outfielder **Aaron Judge**, the 2022 AL MVP who hit 62 home runs that year to set the AL single-season record. The team's fierce rivalry with the Boston Red Sox, dating back to the 1919 Ruth trade, remains one of sports' most intense.\n\nIn recent years, the Yankees have maintained elite contention, securing the 2009 World Series—their last title to date—and posting a 94–68 regular-season record in 2025, finishing second in the AL East to qualify as the top American League Wild Card team, defeating the Boston Red Sox in the Wild Card Series before falling to the Toronto Blue Jays in the AL Division Series. Under manager Aaron Boone since 2018, the team continues to blend veteran leadership with young talent, drawing massive fan support at Yankee Stadium, which seats over 46,000 and hosts annual events like Old-Timers' Day to honor their legacy. The Yankees' influence extends beyond the field, contributing to New York City's cultural fabric through philanthropy and community initiatives via the Yankees Foundation.\n\n## History\n\n### 1901–1902: Origins in Baltimore\n\nThe American League was established in 1901 as a rival major league to the National League, with Ban Johnson serving as its president and driving the transformation of the former Western League into a competitive entity. Johnson strategically placed franchises in cities abandoned or underserved by the National League, including Baltimore, where a new team was formed to capitalize on the city's baseball enthusiasm following the departure of its previous National League club. The Baltimore Orioles were incorporated on January 4, 1901, as the Baltimore Baseball and Athletic Company, with initial ownership shares held by a group including John McGraw, Wilbert Robinson, Harry Goldman, James P. Shannon, John D. Boland, Conway W. Sams, S. Miles Brinkley, and Moses N. Frank. McGraw, a star third baseman and aggressive tactician, was appointed player-manager, bringing with him a roster bolstered by high-profile signings from the National League, such as pitcher Joe McGinnity and outfielder Mike Donlin, amid Johnson's policy of waiving the National League's $2,400 salary cap to attract talent.\n\nIn their inaugural 1901 season, the Orioles compiled a 68-65 record, finishing fifth in the eight-team American League, 13.5 games behind the pennant-winning Chicago White Sox. The team showcased a potent offense, leading the league with a .294 batting average and .353 on-base percentage, while scoring 761 runs (third in the AL) and collecting 1,348 hits; their pitching staff posted a 3.73 ERA, ranking fourth. Key highlights included an Opening Day victory over Boston (10-6 on April 26), an 11-game winning streak in June, and a late surge of eight straight wins after a slump, though internal tensions arose from McGraw's combative style, which involved frequent arguments with umpires and opponents, contributing to the broader AL-NL player revolts and disputes over contracts. McGinnity anchored the rotation with 26 wins and a 3.56 ERA, while Donlin hit .340, underscoring the team's role in legitimizing the American League through competitive play and star power that drew crowds to Oriole Park.\n\nThe 1902 season proved disastrous for the Orioles, who finished last in the AL with a 50-88 record, 34 games behind the Philadelphia Athletics, amid escalating financial difficulties and roster upheaval. McGraw's abrasive tactics, including physical altercations and defiance of league authority, led to his resignation in July and defection to the National League's New York Giants, taking key players like McGinnity, Joe Kelley, and Roger Bresnahan with him; Wilbert Robinson assumed managerial duties, but the depleted squad struggled, relying on loans from other AL teams to complete the schedule. The Orioles' aggressive, roughhouse play style—emphasizing hit-and-run tactics, inside baseball, and intimidation—had initially helped establish the league's credibility against the established National League but now exacerbated conflicts, culminating in player revolts that pressured the leagues toward a 1903 peace agreement recognizing the AL's major-league status. Financial woes, including poor attendance and inability to retain talent, sealed the franchise's fate in Baltimore, prompting its relocation after the season.\n\n### 1903–1912: Establishment in New York and the Highlanders years\n\nIn early 1903, the American League franchise formerly known as the Baltimore Orioles was purchased for $18,000 by New York City businessmen Frank J. Farrell, a real estate investor and sporting promoter, and William S. Devery, a former police chief, who relocated the team to Manhattan to challenge the established National League's New York Giants. The owners hastily constructed a wooden ballpark called American League Park—soon nicknamed Hilltop Park due to its location on a ridge in Washington Heights, one of Manhattan's highest elevations—at the corner of Broadway and 165th Street, with a capacity of around 13,000 that expanded to 16,000 over time. This move marked the American League's expansion into New York, providing fans in the nation's largest city with a second major league team and fostering early competition between the leagues.\n\nUnder player-manager Clark Griffith, the newly dubbed New York Highlanders—reflecting the park's elevated site—debuted in 1903 with a respectable but unspectacular 72-62-2 record, finishing fourth in the eight-team American League, 17 games behind the pennant-winning Boston Americans. The squad featured strong pitching from Jack Chesbro, who won 28 games, and a solid lineup including outfielder Wee Willie Keeler, but the team struggled offensively and was overshadowed by the Giants' dominance in the city. Attendance was modest at 211,808 for the home season, reflecting the challenge of building a fan base in a market loyal to the National League club.\n\nThe 1904 season brought the Highlanders' first taste of contention, as they surged to a 92-59-4 mark and second place, just 1½ games behind Boston in a tight pennant race that came down to the final weekend at Hilltop Park. Chesbro's extraordinary performance anchored the staff, as he set a modern record with 41 wins, including a crucial victory on October 7 that briefly put New York in first before a wild pitch by Chesbro in the season finale allowed Boston to clinch the flag. This near-miss boosted local interest, with attendance rising to 321,000 and helping cultivate a dedicated Manhattan following among uptown residents. Griffith's steady leadership continued through 1908, though the team endured inconsistency, including a strong 90-61 second-place finish in 1906 (three games out) amid pitching excellence from Chesbro and others.\n\nManagerial changes followed Griffith's departure after a dismal 51-103 season in 1908, with Kid Elberfeld taking over briefly before George Stallings led the 1910 squad to another second-place finish at 88-63-1, 14½ games behind Philadelphia but showing improved depth with first baseman Hal Chase's emergence as a star. Subsequent years saw further shifts, including Stallings' firing mid-1910 and interim stints by Chase and others, culminating in a last-place 50-102-1 campaign under Harry Wolverton in 1912. Despite the ups and downs at the rudimentary Hilltop Park—which featured deep center-field dimensions over 500 feet and frequent windy conditions—the Highlanders' fan base gradually expanded, with attendance peaking above 400,000 in competitive years like 1904 and 1910, drawing crowds from Manhattan's growing urban population. Over the decade, the franchise posted an overall record of 734 wins against 758 losses (with 13 ties), establishing a foothold in New York baseball without a championship.\n\n### 1913–1922: New owners, a new home, and the Polo Grounds era\n\nIn January 1915, brewery magnate Jacob Ruppert and engineer Tillinghast L'Hommedieu Huston purchased the New York Americans franchise from Frank J. Farrell and William S. Devery for $460,000, marking a shift toward more stable ownership and management.[https://sabr.org/bioproj/person/jacob-ruppert] The new owners inherited a team that had relocated to the Polo Grounds in 1913 after its lease expired at Hilltop Park, becoming tenants of the New York Giants in the Coogan's Bluff stadium.[https://www.ballparksofbaseball.com/ballparks/polo-grounds/] This move to the more spacious and accessible venue, shared with their National League counterparts, fostered early tensions and a budding rivalry, as the Giants' management, led by John McGraw, viewed the American League interlopers with suspicion and limited their scheduling flexibility.[https://sabr.org/journal/article/yankee-stadium-the-giants-greatest-mistake/]\n\nThe franchise officially adopted the \"New York Yankees\" name in 1913, reflecting fan usage and the team's new urban identity at the Polo Grounds, though no formal announcement was made.[https://www.mlb.com/news/new-york-yankees-team-name-origin] Under manager Frank Chance in 1913 and 1914, the Yankees posted mediocre results, finishing seventh with a 57-94-1 record in 1913 and sixth at 70-84 the following year, hampered by inconsistent pitching and hitting.[https://www.baseball-reference.com/teams/NYY/1913.shtml] [https://www.baseball-reference.com/teams/NYY/1914.shtml] The 1915 arrival of first baseman Wally Pipp provided a spark, as he batted .263 with power potential in his debut season and became a steady lineup presence, hitting over .300 multiple times through the decade.[https://sabr.org/bioproj/person/wally-pipp/] World War I further disrupted rosters from 1917 to 1919, with key players like pitchers Ray Caldwell and Slim Love enlisting or facing draft pressures, leading to a shortened 1918 schedule of 126 games and a fourth-place finish at 60-63 amid league-wide talent shortages and salary reductions.[https://thisgreatgame.com/1918-baseball-history/]\n\nBy 1919, with Miller Huggins as manager, the Yankees improved to 80-59-2, securing third place in the American League, seven and a half games behind the Chicago White Sox, as Pipp led the offense with a .309 average and 8 home runs.[https://www.baseball-reference.com/teams/NYY/1919.shtml] Over the full 1913–1922 period at the Polo Grounds, the team compiled a 734-772-8 record, reflecting gradual progress under Ruppert and Huston's investments in scouting and facilities, which stabilized finances and attendance despite the shared-stadium constraints.[https://www.mlb.com/yankees/history/year-by-year-results] This era's foundations set the stage for the 1920 acquisition of Babe Ruth from the Boston Red Sox for $125,000 plus a loan, injecting star power into the franchise.[https://www.mlb.com/yankees/history/timeline-1920s]\n\n### 1923–1935: Ruth, Gehrig, and the original Yankee Stadium\n\nThe acquisition of Babe Ruth from the Boston Red Sox in January 1920 for $100,000 marked a turning point for the New York Yankees, transforming them into a powerhouse. Under owner Jacob Ruppert's direction, the purchase from Red Sox owner Harry Frazee provided Ruth with the platform to redefine offensive baseball, as he transitioned fully to outfield duties and shattered home run records. Ruth led the American League in home runs in 1921, 1923, 1924, 1926, and 1927, culminating in his legendary 60-home-run campaign in 1927, which surpassed his own previous mark of 59 set in 1921. His prowess drew massive crowds and elevated the franchise's profile, setting the stage for sustained success in the decade.\n\nThe opening of the original Yankee Stadium on April 18, 1923, in the Bronx neighborhood of Woodlawn Heights, ushered in a new era for the team, often dubbed the \"House That Ruth Built\" by sportswriter Fred Lieb due to Ruth's star power filling the 58,000-seat venue. Ruth christened the stadium with a home run in its inaugural game, a 4-1 victory over the Boston Red Sox. That season, the Yankees secured their first American League pennant with a 98-54 record under manager Miller Huggins and went on to win their inaugural World Series, defeating the New York Giants 4 games to 2. The stadium's spacious dimensions initially favored pitchers but soon accommodated Ruth's prodigious power, symbolizing the team's rising dominance.\n\nThe mid-1920s saw the emergence of the famed \"Murderer's Row\" lineup, anchored by Ruth and first baseman Lou Gehrig, whose ironman streak of 2,130 consecutive games began in 1925 and defined his career. This potent offense propelled the Yankees to additional pennants in 1926, 1927, and 1928, with World Series triumphs in 1927 (a 4-0 sweep of the Pittsburgh Pirates) and 1928 (another 4-0 sweep of the St. Louis Cardinals). Huggins's strategic acumen, including his handling of star egos and emphasis on disciplined play, was instrumental in these victories, leading the team to six pennants overall during his 1918-1929 tenure. However, Ruth's off-field antics, including frequent late-night escapades, public disputes with umpires—such as his 1922 ejection and fine for throwing dirt—and clashes with Huggins over discipline, often strained team dynamics.\n\nBy 1934, as Ruth's production waned at age 39 (22 home runs that year), tensions peaked over his contract demands. The Yankees reduced his salary from $52,000 in 1933 to $35,000 for 1934 amid the Great Depression, sparking a holdout where Ruth sought either a raise or a managerial role, which ownership denied in favor of grooming successor Joe McCarthy. Unable to secure favorable terms, Ruth requested his unconditional release after the season, ending his Yankees career after 15 years and 659 home runs in pinstripes. Over the 1923-1935 span, the Yankees posted a 1,236-751 record (.622 winning percentage), capturing five pennants and three championships, establishing the foundation of their dynasty.\n\n### 1936–1951: DiMaggio and post-war dominance\n\nThe New York Yankees entered a dominant phase in 1936 with the arrival of center fielder Joe DiMaggio, whom the team acquired from the San Francisco Seals of the Pacific Coast League for $25,000, marking one of the highest prices paid for a minor league prospect at the time. DiMaggio made his major league debut on May 3, 1936, collecting three hits in a 14-5 victory over the St. Louis Browns, and quickly became a cornerstone of the lineup under manager Joe McCarthy, who had taken over the Yankees in 1931 following the death of Miller Huggins. McCarthy's disciplined approach, emphasizing fundamentals and strategic pitching rotations, propelled the team to its first pennant of the era with a 102-51 record, culminating in a World Series victory over the New York Giants in six games. This success marked the beginning of an unprecedented streak, as the Yankees won three more consecutive World Series titles from 1937 to 1939, defeating the Giants (4-1), Chicago Cubs (4-0), and Cincinnati Reds (4-0), respectively, while compiling league-best records each year under McCarthy's steady leadership. DiMaggio's consistent excellence, including a .323 batting average and 29 home runs in 1937, solidified his role as the team's offensive anchor during this run.\n\nThe Yankees' dominance continued into the early 1940s, securing another pennant in 1941 with a 101-53 record and defeating the Brooklyn Dodgers in five games for the World Series title, highlighted by DiMaggio's iconic 56-game hitting streak from May 15 to July 16, a record that remains unbroken. However, World War II profoundly disrupted the roster, as numerous stars enlisted in the military, including DiMaggio, shortstop Phil Rizzuto, outfielder Tommy Henrich, and pitchers like Marius Russo. Despite these losses, the Yankees clinched the 1943 pennant with a 98-56 record and won the World Series over the St. Louis Cardinals in five games, relying on a depleted but resilient pitching staff led by Spud Chandler, who posted a 16-5 record and series MVP honors. Veterans Lefty Gomez and Red Ruffing, both Hall of Famers, provided crucial stability before their own service obligations; Gomez made his final All-Star appearance in 1942 with a career 189-102 record for the Yankees, while Ruffing, who missed the 1943 and 1944 seasons due to military duty, had anchored the rotation with 231 wins during his tenure. McCarthy retired after the 1946 season with 1,460 career wins, including eight pennants and seven World Series titles with New York.\n\nPost-war, the Yankees rebounded strongly, winning pennants in 1947 (97-57 record, World Series win over Dodgers 4-3), 1949 (97-57, World Series win over Dodgers 4-1), 1950 (98-56, World Series sweep of Philadelphia Phillies 4-0), and 1951 (98-56, World Series win over Giants 4-2). The 1949-1951 seasons featured intense American League pennant races against the Boston Red Sox, including a dramatic one-game playoff on October 2, 1949, where the Yankees prevailed 5-4 at Yankee Stadium to secure the flag. DiMaggio, battling injuries but still elite with a .346 average in limited 1949 action, contributed key hits in these battles before announcing his retirement on December 11, 1951, at age 37 after 13 seasons, a .325 career average, and nine World Series rings. Over the 1936-1951 span, the Yankees amassed a 1,614-897 record (.643 winning percentage), captured 11 American League pennants, and secured 10 World Series championships, establishing an era of unparalleled success. As DiMaggio departed, rookie outfielder Mickey Mantle made his debut in 1951, signaling the next generation's arrival with a .267 average in 95 games.\n\n### 1951–1964: Stengel, Mantle, and the early dynasty's end\n\nThe New York Yankees' dynasty continued unabated under manager Casey Stengel, who had been hired in October 1948 following Bucky Harris's departure after the 1948 season. By 1951, Stengel's innovative strategies and platoon system had solidified the team's dominance, culminating in a World Series victory over the New York Giants in six games, marking the third consecutive championship for the franchise. The Yankees repeated as champions in 1952 against the Brooklyn Dodgers and again in 1953 versus the same opponent, extending their streak to five straight titles from 1949 to 1953—a feat unmatched in modern baseball history.\n\nMickey Mantle's arrival in 1951 injected youthful power into the lineup, with the 19-year-old outfielder making his major league debut on April 17 against the Boston Red Sox, going 1-for-4 in a 5-3 Yankees win. Mantle quickly emerged as a superstar, blending speed, switch-hitting prowess, and prodigious home run power; by 1956, he captured the American League Triple Crown with a .353 batting average, 52 home runs, and 130 RBIs, leading the Yankees to another World Series triumph over the Dodgers in seven games. Catcher Yogi Berra provided steady leadership and offensive punch, earning three MVP awards between 1951 and 1955 while driving in over 100 runs in four seasons during the decade, anchoring the lineup alongside Mantle and serving as a defensive cornerstone in 10 World Series appearances. Pitcher Whitey Ford, the ace of the staff, dominated with pinpoint control and endurance, posting a 2.47 ERA from 1950 to 1959 and earning World Series MVP honors in 1950 while contributing to six championships with his 236 career wins, the most in franchise history.\n\nThe 1950s featured intense rivalries, particularly with the Brooklyn Dodgers in seven World Series matchups from 1947 to 1957, where the Yankees prevailed six times, and the Milwaukee Braves in consecutive Fall Classics in 1957 and 1958, splitting the outcomes amid high-stakes battles featuring stars like Jackie Robinson and Hank Aaron. After a brief third-place finish in 1959—the team's worst standing since 1925—the Yankees rebounded under Stengel, winning the 1960 pennant but falling to the Pittsburgh Pirates in a stunning seven-game World Series upset, prompting the 70-year-old manager's dismissal on October 18, 1960.\n\nStengel's successors, Ralph Houk and Yogi Berra, maintained the momentum into the early 1960s. Roger Maris joined Mantle in the outfield and shattered Babe Ruth's single-season home run record with 61 in 1961 over a 162-game schedule, powering the Yankees to a World Series sweep of the Cincinnati Reds. The team repeated as champions in 1962 against the San Francisco Giants in seven games, but lost the 1963 Fall Classic to the Los Angeles Dodgers in four straight. In 1964, under Berra's management, the Yankees clinched another pennant with a 99-63 record but were defeated by the St. Louis Cardinals in seven games, signaling the dynasty's fade as aging stars like Mantle battled injuries. Berra was fired days after the loss, and the franchise was sold to CBS later that year, ushering in a period of transition.\n\nFrom 1951 to 1964, the Yankees compiled a 1,262-752-7 record, securing 10 American League pennants and eight World Series titles, a testament to their sustained excellence before the competitive landscape shifted.\n\n### 1965–1972: Decline under new ownership\n\nFollowing the New York Yankees' loss in the 1964 World Series, the team's longtime owners, Dan Topping and Del Webb, sold a controlling 80% stake to the Columbia Broadcasting System (CBS) for $13.2 million in August 1964, marking the end of their 20-year stewardship and ushering in corporate ownership. This transaction, completed just before the 1965 season, reflected CBS's interest in diversifying into sports entertainment, but it quickly coincided with on-field struggles as the Yankees transitioned from their dynasty era.\n\nManagerial instability compounded the challenges under CBS. After Yogi Berra was fired following the 1964 World Series defeat, the Yankees hired Johnny Keane from the rival St. Louis Cardinals as manager for 1965; however, Keane lasted only through the 1966 season, posting a combined record of 147-174 before being dismissed amid mounting losses. Ralph Houk, who had managed the team to American League pennants from 1961 to 1963, returned to the dugout in May 1966 after serving as general manager and helmed the club through 1973, compiling a 521-539 record during this period but failing to restore contending form. Houk's tenure featured efforts to rebuild around emerging talent, but persistent injuries to aging stars like Mickey Mantle and Roger Maris hindered progress.\n\nThe Yankees' performance deteriorated sharply, with no postseason appearances from 1965 to 1972—their longest drought since the early 1920s. The 1965 season ended at 77-85 (.475), sixth in the American League and 25 games behind the pennant-winning Minnesota Twins, marking the team's first losing record in 40 years. Losses mounted further in 1966 with a 70-89 (.440) finish, last place in the AL and a franchise-low 29 wins at home, exacerbated by a midseason slump that dropped them 17 games under .500 by August. Subsequent years offered modest improvement—89-73 in 1967 (fourth place), 83-79 in 1968 (fifth), 88-74 in 1969 (fourth), 83-79 in 1970 (third), and 82-80 in 1971 (fourth)—but none approached contention, as the team averaged 84 wins annually while grappling with a thinning roster. Pitcher Mel Stottlemyre emerged as a bright spot, debuting in 1964 and anchoring the rotation with four All-Star selections from 1965 to 1970, compiling a 109-88 record and 2.87 ERA over the era while leading the AL in complete games three times.\n\nCBS's corporate approach contributed to the decline through perceived financial conservatism and limited investment in player development. The broadcasting giant prioritized short-term profitability over aggressive rebuilding, leading to criticism that it treated the franchise as a \"cash cow\" without sufficient scouting or farm system enhancements, which stalled talent replenishment after the retirement of icons like Whitey Ford in 1967. Attendance at Yankee Stadium plummeted from 1.3 million in 1964 to between 1 and 1.3 million annually from 1965 to 1971, dipping below 1 million (599,273) in 1972—the lowest since 1945—reflecting fan disillusionment with the subpar product. Stadium maintenance suffered neglect, with deteriorating facilities like crumbling concrete and obstructed views alienating patrons further, as CBS deferred major upgrades amid the team's irrelevance.\n\nThe era culminated in the 1972 season, a 79-76 (.510) finish in fourth place in the AL East—shortened to 155 games by a players' strike—signaling the close of eight years without a pennant or playoff berth. Over 1965–1972, the Yankees posted an overall record of 651–635 (.506 winning percentage) across 1,286 games, a stark contrast to their prior dominance of 26 pennants and 19 World Series titles from 1921 to 1964. This futility prompted CBS to sell the team in January 1973 to a group led by George Steinbrenner for $10 million, $3.2 million less than their purchase price.\n\n### 1973–1981: The Bronx Zoo and Steinbrenner era\n\nIn January 1973, a syndicate led by George Steinbrenner purchased the New York Yankees from the Columbia Broadcasting System for $10 million, marking the beginning of Steinbrenner's transformative and tumultuous ownership. Steinbrenner, a shipping executive from Cleveland, quickly asserted control, emphasizing winning at all costs and injecting significant financial resources into player acquisitions and facilities upgrades. Under his direction, the team hired Billy Martin as manager on August 2, 1975, replacing Bill Virdon amid a midseason slump, with Martin bringing his intense, fiery style that had previously succeeded with the Minnesota Twins. The following year, on November 29, 1976, the Yankees signed free-agent outfielder Reggie Jackson to a five-year, $3.5 million contract, adding a powerful bat but also a larger-than-life personality that would fuel internal tensions.\n\nThe era saw renewed success, with the Yankees capturing American League pennants in 1976, 1977, and 1978, culminating in World Series victories over the Los Angeles Dodgers in 1977 (4-2) and 1978 (4-3). In the 1977 Series, Jackson earned the nickname \"Mr. October\" by hitting three home runs on three consecutive pitches from three different pitchers in Game 6, securing a 4-2 victory and the championship. The 1978 triumph followed a dramatic regular-season comeback from 14 games behind Boston, highlighted by Bucky Dent's playoff home run, and featured strong contributions from Jackson and third baseman Graig Nettles in the Fall Classic. Catcher Thurman Munson, the team's captain since 1976, was central to this resurgence, earning American League Most Valuable Player honors in 1976, three Gold Gloves, and seven All-Star selections over his 11-year career, while anchoring the lineup that reached three consecutive World Series from 1976 to 1978. Tragically, Munson's life ended on August 2, 1979, when he died at age 32 in a plane crash while practicing takeoffs and landings near his hometown of Canton, Ohio, deeply affecting the organization.\n\nAmid these achievements, the period became known as the \"Bronx Zoo\" for its chaotic interpersonal conflicts, exacerbated by Steinbrenner's hands-on meddling, frequent managerial changes, and high-pressure environment. Tensions peaked between Martin and Jackson, culminating in a nationally televised dugout confrontation on June 18, 1977, at Fenway Park, where Martin pulled Jackson mid-game for lackluster effort, nearly leading to a brawl that required intervention from owner Steinbrenner and players. The term \"Bronx Zoo\" originated from a 1979 book by reliever Sparky Lyle and author Peter Golenbock, capturing the era's dysfunction, including Martin's five stints as manager (1975–1978, with interruptions) and clashes involving Munson, Jackson, and Steinbrenner himself. Steinbrenner's interference drew scrutiny; he was suspended for two years in 1974 by Commissioner Bowie Kuhn for illegal campaign contributions to President Richard Nixon's 1972 reelection effort, though he retained ownership and influenced operations indirectly during the ban.\n\nThe 1981 season was disrupted by a players' strike from June 12 to August 9, canceling 713 games and dividing the year into first- and second-half schedules with an expanded playoff format. The Yankees dominated the first half at 34-22 to claim the AL East title but faltered in the second half at 25-25, finishing third; they advanced by defeating the Milwaukee Brewers 3-2 in the division series before losing the AL Championship Series to the Oakland Athletics 3-0. Over the full 1973–1981 span, the Yankees compiled a regular-season record of 805 wins and 596 losses, securing two World Series titles amid the volatility.\n\n### 1982–1995: Mattingly years and lean times\n\nFollowing the death of catcher Thurman Munson in 1979, the New York Yankees entered a prolonged period of underachievement, marked by the absence of playoff appearances from 1982 to 1994 and no World Series titles throughout the 1980s and early 1990s. This era, often characterized by internal turmoil under owner George Steinbrenner, saw the team compile a .520 winning percentage over 14 seasons, with 1,143 wins and 1,055 losses, reflecting a balance of competitive moments and frustrating mediocrity. Despite assembling talented rosters, the Yankees struggled with consistency, exacerbated by Steinbrenner's frequent interventions, including fining players and firing personnel, which created a volatile atmosphere.\n\nThe arrival of first baseman Don Mattingly in 1982 provided a beacon of hope amid the decline. Debuting on September 10 against the Baltimore Orioles, Mattingly quickly emerged as a cornerstone, earning the American League Most Valuable Player Award in 1985 after batting .324 with 35 home runs, 145 RBIs, and a league-leading 48 doubles, leading the Yankees to a 97-64 record and a second-place finish just two games behind the Toronto Blue Jays. His defensive prowess also shone, securing ten consecutive Gold Glove Awards from 1985 to 1994. Complementing Mattingly were outfielders Dave Winfield, who delivered consistent power with 223 home runs during his 1981-1990 tenure, and Rickey Henderson, acquired in December 1984, who led the league in stolen bases five times between 1985 and 1989 while scoring a career-high 146 runs in his debut Yankees season. However, interpersonal conflicts, such as Steinbrenner's public fines against Winfield for charitable donation disputes, underscored the era's tensions.\n\nManagerial instability defined the period, with Steinbrenner overseeing 10 changes from 1982 to 1995, including multiple hirings and firings of Billy Martin—his fifth and final stint ending in 1988 after a 40-28 start—and the abrupt dismissal of Yogi Berra just 16 games into the 1985 season despite the team's early promise. Other skippers like Dick Howser, Lou Piniella, Bucky Dent, and Stump Merrill cycled through, contributing to a lack of continuity; Buck Showalter provided relative stability from 1992 to 1995, guiding the team to a first-place finish in the strike-shortened 1994 season at 70-43. Near-misses plagued the 1980s, such as the 1986 squad's 90-72 mark and second-place finish 5.5 games back, while labor disputes compounded the frustration: the 1994 MLB strike canceled the postseason after the Yankees' strong start, and the 1995 lockout delayed the season, though New York earned the first wild card berth at 79-65 before losing the ALDS to Seattle in five games.\n\nThe renovated Yankee Stadium, which had undergone major upgrades from 1974 to 1976—including the removal of obstructive columns in the lower decks and the addition of luxury suites—served as a symbol of ongoing maintenance efforts during this lean era, though the facility's aging infrastructure required continual repairs to sustain play. As the period closed, the Yankees selected shortstop Derek Jeter sixth overall in the 1995 MLB Draft, signaling potential renewal. Despite individual brilliance from stars like Mattingly, the absence of championships fueled fan discontent and highlighted the organization's transitional struggles.\n\n### 1996–2009: Core Four and late-2000s success\n\nThe New York Yankees marked a new era in 1995 by hiring Joe Torre as manager on November 2, following the firing of Buck Showalter after a first-round playoff loss. Torre, a Brooklyn native with a .500 managerial record across stints with the Mets, Braves, and Cardinals, faced skepticism from the New York media, who dubbed him \"Clueless Joe\" due to his lack of postseason success at the time. Under Torre's steady leadership, the team integrated its emerging homegrown talent, known as the Core Four—Derek Jeter, Jorge Posada, Andy Pettitte, and Mariano Rivera—all of whom made their major league debuts in 1995. Jeter debuted on May 29 as a shortstop, Rivera on May 23 as a reliever, Pettitte on June 22 as a starter, and Posada in September as a catcher with limited action before becoming a full-time starter in 1996. This group formed the backbone of the Yankees' pitching and defense, contributing to a franchise-record five consecutive World Series appearances from 1996 to 2000.\n\nIn 1996, the Yankees finished the regular season with a 92-70 record and advanced through the playoffs by defeating the Texas Rangers 3-1 in the ALDS and the Baltimore Orioles 4-1 in the ALCS, before clinching their 23rd World Series title with a 4-2 victory over the Atlanta Braves. The series featured dramatic comebacks, including Jim Leyritz's game-tying home run in Game 4 and a 3-2 win in Game 6 sealed by Rivera's relief pitching. The dynasty continued in 1998 with a league-best 114-48 regular-season mark, sweeping the San Diego Padres 4-0 in the World Series for their 24th championship, highlighted by Rivera's 36 saves and Jeter's ALCS MVP performance. In 1999, despite injuries, the team posted a 98-64 record and swept the Atlanta Braves 4-0 in the World Series, becoming the first team since the 1972 Oakland Athletics to win consecutive titles without a previous-year loss in the Fall Classic. The 2000 season brought a 87-74 regular-season finish and a 4-1 World Series win over the New York Mets in the inaugural Subway Series, a matchup enabled by interleague play's introduction in 1997, which first pitted AL and NL teams against each other during the regular season, including early Mets-Yankees games that year.\n\nThe Yankees reached the World Series again in 2001 after a 95-65 regular season and AL pennant, but lost 4-3 to the Arizona Diamondbacks, with the decisive Game 7 featuring Luis Gonzalez's walk-off single off Rivera in the ninth inning. In 2003, following a 101-61 season and another AL pennant, they fell 4-2 to the Florida Marlins in the World Series, capped by Josh Beckett's complete-game shutout in Game 6. A low point came in the 2004 ALCS, where the Yankees blew a 3-0 series lead to the Boston Red Sox, losing 4-3 amid a historic collapse that included a 14-inning Game 5 defeat and a Game 7 loss at Yankee Stadium, ending their 26-game postseason winning streak from prior years. Amid these highs and lows, Derek Jeter was named the 11th captain in franchise history on June 3, 2003, by owner George Steinbrenner, recognizing his leadership since his rookie year.\n\nFrom 1996 to 2009, the Yankees compiled a 1,265-899 regular-season record under primarily Torre's guidance, achieving 14 consecutive playoff appearances from 1995 to 2008 and securing four World Series titles in five years (1996, 1998-2000). Tensions between Torre and Steinbrenner escalated over roster decisions and playoff shortcomings, leading to a one-year contract extension for 2007 laden with performance incentives; after the Yankees' ALDS loss that year, Torre rejected a subsequent offer for 2008 that included a pay cut and bonuses tied to postseason advancement, effectively ending his tenure as manager after 1,173 wins. Joe Girardi assumed the role in 2008, guiding the team to a 103-59 record in 2009 and a 4-2 World Series victory over the Philadelphia Phillies for their 27th championship, with key contributions from an aging Core Four in their final title together.\n\n### 2010–2016: Post-championship transition\n\nFollowing the 2009 World Series victory, the New York Yankees transitioned into a new era marked by the opening of the modern Yankee Stadium in 2009, which became their home starting that season and continued through the period. The new ballpark, costing $1.5 billion, featured updated amenities but drew criticism from fans and analysts for its dimensions, particularly the short right-field porch at 314 feet, which was seen as favoring right-handed power hitters and inflating home run totals compared to the original stadium's deeper alleys. Under manager Joe Girardi, who had been hired in 2008 and led the team to the title in his second year, the Yankees maintained competitiveness through high-profile acquisitions like pitcher CC Sabathia, signed to a seven-year, $161 million contract in December 2008, and first baseman Mark Teixeira, who joined on an eight-year, $180 million deal the same month, bolstering the lineup and rotation for sustained contention.\n\nThe team posted a strong overall record of 627 wins against 507 losses from 2010 to 2016, reflecting consistent regular-season performance with no losing seasons, though they failed to advance past the American League Championship Series or secure another pennant. They reached the playoffs in 2010 (ALCS loss to Texas, 4-2), 2011 (ALDS loss to Detroit, 3-2), 2012 (ALCS sweep by Detroit, 4-0), and 2015 (Wild Card loss to Houston, 1-0), but missed the postseason in 2013, 2014, and 2016 despite winning at least 84 games each year. Key highlights included Derek Jeter's 3,000th hit in 2011 and Alex Rodriguez's milestone achievements, but the aging roster struggled in October, with no series wins beyond the division round. Girardi's steady leadership emphasized veteran experience, yet the lack of deep playoff runs fueled discussions about the end of the \"Core Four\" dynasty.\n\nThis period saw the gradual retirement of iconic players, signaling the close of a championship chapter. Catcher Jorge Posada retired after the 2011 season, concluding a 17-year career with the Yankees that included five World Series titles. Pitcher Andy Pettitte, who had returned to the team in 2012 after a brief retirement, pitched one final year in 2013 before retiring again, finishing with 219 career wins, 156 of them in pinstripes. Closer Mariano Rivera, the all-time saves leader with 652, retired after 2013 following an emotional final season, while shortstop Derek Jeter, the team captain, played his last game in 2014, ending his 20-year tenure with 3,465 hits and five championships. In 2016, the Yankees finished 84-78 and missed the playoffs, culminating in a late-season trade of veterans like Andrew Miller to rebuild prospects, though outfielder Aaron Judge made his major league debut on August 13, offering a glimpse of emerging talent.\n\n### 2017–2025: Judge era, 2024 World Series, and recent playoffs\n\nThe 2017 season marked the emergence of the \"Baby Bombers,\" a young core of talents including Aaron Judge, Gary Sánchez, and Greg Bird, who propelled the New York Yankees to a 91–71 record and a Wild Card berth. Judge, in his rookie year, set a major league record with 52 home runs, leading the American League in runs scored (128) and walks (127), while earning the AL Rookie of the Year award. This youthful infusion helped the team defeat the Minnesota Twins in the Wild Card Game before falling to the Houston Astros 4–3 in the AL Championship Series.\n\nIn December 2017, the Yankees hired Aaron Boone as manager on a three-year contract, transitioning from broadcaster and former player to helm the team starting in 2018. Under Boone, the Yankees made the playoffs in 2018 (100–62 record, ALDS win over Oakland 3–2, ALCS loss to Boston 1–4), 2019 (103–59, ALDS win over Minnesota 3–0, ALCS sweep loss to Houston 0–4), and the COVID-19-shortened 2020 season (33–27, ALDS loss to Tampa Bay 2–3). The team missed the postseason in 2021 (92–70) but returned in 2022 (99–63, Wild Card loss to Cleveland 1–2) and 2023 (82–80, no playoffs). Judge solidified his leadership with a unanimous 2022 AL MVP award after hitting an AL-record 62 home runs, and he was named team captain in December 2023, becoming the 16th in franchise history.\n\nThe Yankees captured their first pennant since 2009 in 2024, finishing 94–68 and first in the AL East behind Judge's 58 home runs and MVP-caliber play. They advanced by defeating the Kansas City Royals 3–1 in the ALDS, then the Cleveland Guardians 4–1 in the ALCS, with Giancarlo Stanton earning ALCS MVP honors for his three home runs. However, the team fell to the Los Angeles Dodgers 4–1 in the World Series, marked by a controversial Game 5 where umpires ruled a fan interference non-reviewable. In 2025, the Yankees again posted a 94–68 record but finished second in the East; they won the Wild Card Series over the Boston Red Sox 2–1 before losing the ALDS to the Toronto Blue Jays 3–1, hampered by an 8.47 team ERA in the series—the worst in franchise postseason history. Through 2025, the Judge era yielded eight playoff appearances, one pennant, and no championships, with an overall record of approximately 850–600 under Boone.\n\n## Achievements and records\n\n### World Series championships\n\nThe New York Yankees possess the most World Series championships in Major League Baseball history, with 27 titles achieved between 1923 and 2009. This unparalleled success includes dynastic stretches, such as four championships in five years from 1936 to 1939 and a record five consecutive titles from 1949 to 1953, underscoring their sustained excellence across multiple eras. The franchise has completed eight sweeps of their opponents, more than any other team, demonstrating overwhelming dominance in those matchups. While the World Series adopted a best-of-9 format for select early editions like 1921, all Yankees championship series from their inaugural win onward followed the standard best-of-7 structure.\n\nThe championships are detailed in the table below, listing the year, opponent, series outcome, and Most Valuable Player (MVP award introduced in 1955).\n\n| Year | Opponent              | Result | MVP             |\n|------|-----------------------|--------|-----------------|\n| 1923 | New York Giants      | 4–2   | —               |\n| 1927 | Pittsburgh Pirates   | 4–0   | —               |\n| 1928 | St. Louis Cardinals  | 4–0   | —               |\n| 1932 | Chicago Cubs         | 4–0   | —               |\n| 1936 | New York Giants      | 4–2   | —               |\n| 1937 | New York Giants      | 4–1   | —               |\n| 1938 | Chicago Cubs         | 4–0   | —               |\n| 1939 | Cincinnati Reds      | 4–0   | —               |\n| 1941 | Brooklyn Dodgers     | 4–1   | —               |\n| 1943 | St. Louis Cardinals  | 4–1   | —               |\n| 1947 | Brooklyn Dodgers     | 4–3   | —               |\n| 1949 | Brooklyn Dodgers     | 4–1   | —               |\n| 1950 | Philadelphia Phillies| 4–0   | —               |\n| 1951 | New York Giants      | 4–2   | —               |\n| 1952 | Brooklyn Dodgers     | 4–3   | —               |\n| 1953 | Brooklyn Dodgers     | 4–2   | —               |\n| 1956 | Brooklyn Dodgers     | 4–3   | Don Larsen       |\n| 1958 | Milwaukee Braves     | 4–3   | Bob Turley       |\n| 1961 | Cincinnati Reds      | 4–1   | Whitey Ford      |\n| 1962 | San Francisco Giants | 4–3   | Ralph Terry      |\n| 1977 | Los Angeles Dodgers  | 4–2   | Reggie Jackson   |\n| 1978 | Los Angeles Dodgers  | 4–2   | Bucky Dent       |\n| 1996 | Atlanta Braves       | 4–2   | John Wetteland   |\n| 1998 | San Diego Padres     | 4–0   | Scott Brosius    |\n| 1999 | Atlanta Braves       | 4–0   | Mariano Rivera   |\n| 2000 | New York Mets        | 4–1   | Derek Jeter      |\n| 2009 | Philadelphia Phillies| 4–2   | Hideki Matsui    |\n\nThe Yankees' inaugural World Series victory in 1923 against the New York Giants established the franchise as a powerhouse, with Babe Ruth delivering two solo home runs in Game 2 to secure a 4-2 win and tie the series. Four years later, in 1927, the legendary \"Murderers' Row\" lineup swept the Pittsburgh Pirates 4-0, clinching the title in Game 4 on a wild pitch that allowed Earle Combs to score the decisive run amid a 4-3 victory. The 1928 sweep of the St. Louis Cardinals continued this momentum, powered by Ruth and Lou Gehrig's combined offensive prowess. The 1932 sweep over the Chicago Cubs remains iconic for Ruth's alleged \"called shot\" home run in Game 3, where he reportedly pointed to center field before hitting a go-ahead solo shot off Charlie Root in a 7-5 win, fueling enduring debate about the gesture's intent.\n\nFrom 1936 to 1939, the Yankees captured four titles, defeating the Giants twice (1936: 4-2; 1937: 4-1) and sweeping the Cubs (1938) and Reds (1939), with Joe DiMaggio emerging as a key figure in the late 1930s dominance. The 1941 win over the Brooklyn Dodgers (4-1) featured Tommy Henrich's critical hit in Game 4 to extend a rally, while the 1943 triumph against the Cardinals (4-1) highlighted wartime resilience with Spurgeon Chandler's complete-game shutout in Game 5. In 1947, New York edged the Dodgers 4-3 in a tense seven-game series, sealed by Bill Bevens' near-no-hitter in Game 6 before Cookie Lavagetto's walk-off double forced Game 7, which the Yankees won 2-1.\n\nThe postwar dynasty peaked with five straight championships from 1949 to 1953, all against the Dodgers except 1950 (Phillies sweep) and 1951 (Giants, 4-2). The 1949 (4-1) and 1953 (4-2) series against Brooklyn were particularly rivalry-fueled, with the latter decided by Mickey Mantle's go-ahead homer in Game 6. The 1952 seven-game battle with the Dodgers ended 4-3 on a Allie Reynolds relief appearance in the clincher. In 1956, the Yankees overcame the Dodgers 4-3, immortalized by Don Larsen's perfect game in Game 5, a 2-0 no-hitter that remains the only one in World Series history. The 1958 comeback against the Milwaukee Braves (4-3) saw New York rally from a 3-1 deficit, with Moose Skowron's three-run homer in Game 6 forcing a decisive Game 7 victory at Yankee Stadium.\n\nThe early 1960s titles included 1961's 4-1 win over the Reds, driven by Whitey Ford's two shutouts, and the 1962 seven-game thriller against the Giants (4-3), where Ralph Terry's Game 7 shutout on two days' rest clinched it with a Willie McCovey lineout to second. After a 14-year drought, the 1977 (4-2 over Dodgers) featured Reggie Jackson's three home runs in Game 6 on three consecutive pitches, earning him MVP honors and the \"Mr. October\" moniker. The 1978 rematch with the Dodgers (4-2) was capped by Bucky Dent's key contributions, including a home run in the decisive Game 6.\n\nThe late-1990s revival under manager Joe Torre produced three straight titles from 1996 to 1998 and a fourth in 2000. In 1996, despite dropping the first two games to the Braves, the Yankees mounted a stunning series comeback (4-2), highlighted by a Game 4 rally from a 6-0 deficit behind Bernie Williams' go-ahead homer and Jim Leyritz's tying blast in the eighth. The 1998 sweep of the Padres (4-0) followed a record 114 regular-season wins, with Scott Brosius earning MVP for his offensive surge. Mariano Rivera's relief mastery defined the 1999 sweep of the Braves (4-0), securing his MVP award. The 2000 Subway Series against the Mets (4-1) saw Derek Jeter named MVP for his clutch hits, including a Game 4 homer. The most recent title, in 2009, came against the defending champion Phillies (4-2), with Hideki Matsui's six-RBI Game 6 performance earning him MVP honors in a 7-3 clincher.\n\n### Other league and postseason distinctions\n\nThe New York Yankees hold the record for the most American League pennants with 41, achieved most recently in 2024 after defeating the Cleveland Guardians in the ALCS. These pennants represent the team's league championships, granting them entry into the World Series, where they have appeared 41 times overall. Notable streaks include four consecutive pennants from 1936 to 1939 and eight over a 10-year span from 1949 to 1958, underscoring their historical dominance in capturing the AL title. In the 2024 World Series, they faced the Los Angeles Dodgers, ultimately losing 4-1, but their pennant secured a 59th postseason appearance, the most in MLB history.\n\nYankees players have earned 23 American League Most Valuable Player Awards, the highest total for any franchise, highlighting individual excellence that has fueled postseason success. Key winners include Babe Ruth (1923), Lou Gehrig (1927, 1936), Joe DiMaggio (1939, 1941, 1947), Mickey Mantle (1956, 1957, 1962), and more recently Aaron Judge (2022, 2025). The team has also produced six Cy Young Award winners, recognizing top pitchers: Bob Turley (1958), Whitey Ford (1961), Sparky Lyle (1977), Ron Guidry (1978), Roger Clemens (2001), and Gerrit Cole (2023). Additionally, nine players have claimed AL Rookie of the Year honors, including Gil McDougald (1951), Bob Grim (1954), Tony Kubek (1957), Tom Tresh (1962), Stan Bahnsen (1968), Thurman Munson (1970), Dave Righetti (1981), Derek Jeter (1996), and Aaron Judge (2017).\n\nIn postseason play, the Yankees boast the highest number of appearances at 60, with a winning percentage of .576 (255 wins, 188 losses) across those games. They hold the MLB record for 27 World Series championships, tied to their 41 pennant wins, and have secured 21 seasons with 100 or more regular-season victories, more than any other team—a foundation for their playoff prowess. Iconic moments include Don Larsen's perfect game in Game 5 of the 1956 World Series against the Brooklyn Dodgers, the only no-hitter in World Series history. These distinctions reflect the franchise's unparalleled legacy in league and playoff achievements.\n\n### Regular season records and awards\n\nThe New York Yankees possess the most successful regular season record in Major League Baseball history, compiling 10,872 wins against 8,216 losses through the 2025 season for a .570 winning percentage. This dominance is underscored by their league-leading 21 seasons of 100 or more victories, including franchise highs like the 114 wins in 1998 that set an American League record at the time. These achievements reflect the team's consistent excellence across eras, driven by star power and strategic depth rather than reliance on any single formula.\n\nIconic single-season performances have defined Yankees lore, such as the 1927 \"Murderers' Row\" lineup, which batted a collective .307 while powering the team to a 110-44 record. In 1961, outfielder Roger Maris shattered Babe Ruth's single-season home run mark with 61 long balls, contributing to 109 victories and an American League pennant. On the mound, Jack Chesbro's 41 wins in 1904 remain the modern-era single-season record for a pitcher, anchoring the Highlanders—precursors to the Yankees—to a strong debut campaign in the American League.\n\nIndividually, Yankees players have claimed 20 American League batting titles, with Lou Gehrig's .361 average in 1934 exemplifying the club's offensive prowess during its early dynasties. Defensively, the franchise ranks among the leaders with 63 Gold Glove Awards as of 2025, highlighted by first baseman Don Mattingly's team-record nine honors from 1985 to 1995. Offensively, New York holds the most Silver Slugger Awards with 32, recognizing top performers at their positions since the award's inception in 1980, including multiple wins by Derek Jeter, Robinson Canó, and Aaron Judge.\n\nAt the team level, the Yankees have earned three Manager of the Year honors, with Buck Showalter (1994) and Joe Torre (1996, 1998) recognized for their leadership amid successful campaigns. These accolades, alongside streaks like the 1998 squad's 114 regular-season triumphs, illustrate how sustained regular-season superiority has positioned the Yankees for repeated contention.\n\n## Team identity\n\n### Nicknames\n\nThe New York Yankees franchise began as the New York Highlanders in 1903 upon relocating from Baltimore, where they had been known as the Orioles, with the Highlanders moniker derived from the elevated location of their home field, Hilltop Park, in Manhattan's Washington Heights neighborhood. Early alternative names included the New York Americans, reflecting their American League affiliation, as well as the Invaders and Greater New Yorks, used sporadically in media coverage. The shift to \"Yankees\" occurred gradually around 1913, coinciding with the team's move to the Polo Grounds, and was popularized by sportswriters like Jim Price of the New York Press, who favored the shorter \"Yanks\" for headlines over the lengthier \"Highlanders.\" The first recorded use of \"Yankees\" appeared in the New York Evening Journal on April 7, 1904, during spring training, though no formal announcement marked the change; by 1923, with the opening of Yankee Stadium, the name was firmly established.\n\nUnofficial team nicknames emerged to capture the Yankees' dominant play and geographic identity, often coined by the press during eras of power hitting. The \"Bronx Bombers\" moniker, referencing the team's relocation to Yankee Stadium in the Bronx in 1923 and their prolific home run output starting with Babe Ruth's arrival in 1920, dates to the 1920s but gained prominence in the 1930s, inspired by boxer Joe Louis's nickname \"Brown Bomber\" during a 1936 match at the stadium. \"Murderer's Row\" described the fearsome 1927 lineup featuring Ruth, Lou Gehrig, Earle Combs, Bob Meusel, and Tony Lazzeri, which won 110 games; the term, borrowed from a notorious cellblock in New York City's Tombs prison, had earlier baseball uses but became indelibly linked to this squad through sportswriter coverage.\n\nPlayer-specific nicknames have also defined Yankees lore, highlighting individual prowess and contributing to the team's mythic status. Lou Gehrig earned \"Iron Horse\" for his endurance, playing in 2,130 consecutive games from 1925 to 1939, a streak that symbolized reliability amid the team's success. Joe DiMaggio was dubbed the \"Yankee Clipper\" for his graceful, swift play in center field, evoking the speed of clipper ships during his 1936–1951 tenure that included three MVP awards and nine World Series titles. In the modern era, \"Baby Bombers\" referred to the 2017 roster of young sluggers like Aaron Judge, Gary Sánchez, and Gleyber Torres, who powered a 91-win season and AL wild-card appearance, signaling a new generation of power hitters.\n\nThese nicknames hold cultural significance as shorthand for the Yankees' legacy of excellence, often amplified by media to embody American ideals of grit and dominance, from the post-World War I patriotism in \"Yankees\" to the Ruth-era spectacle of \"Bronx Bombers.\" Their adoption in newspapers and broadcasts has embedded them in popular culture, influencing fan chants and merchandise while reinforcing the franchise's identity as a symbol of New York resilience. Uniform elements like the interlocking \"NY\" on pinstripes have occasionally echoed these monikers in design motifs.\n\n### Logos and uniforms\n\nThe New York Yankees' primary colors of navy blue and white were established in 1912, coinciding with the team's adoption of pinstripes on their uniforms, a design element that has defined their visual identity ever since. The pinstripes were first introduced on April 11, 1912, for the then-New York Highlanders, creating one of the most recognizable uniform styles in professional sports. Although briefly experimented with earlier, the pinstripes became a permanent feature starting in 1915, applied to both home and road uniforms during that season.\n\nThe team's iconic interlocking \"NY\" logo traces its origins to 1877, when it was designed by Louis B. Tiffany of Tiffany \\u0026 Co. for the New York Police Department's Medal of Valor, honoring patrolman John McDowell. The design first appeared in baseball on the uniforms of the New York Giants in the late 19th century before being adopted by the Yankees' predecessor, the New York Highlanders, in 1909 on caps and sleeves. It was placed on the left breast of home uniforms from 1912 to 1915, removed until 1936, and reintroduced on caps in 1922 in a solid navy blue with white lettering, a style worn by legends such as Lou Gehrig and Joe DiMaggio. An alternate \"top hat and bat\" logo, featuring a baseball bat protruding from a Uncle Sam-style top hat, served as a secondary cap emblem from the late 1940s through 1973, complementing the primary interlocking \"NY.\"\n\nEarly Yankees uniforms in the 1920s were made from wool flannel, emphasizing durability and a classic fit during the team's rise under owners like Jacob Ruppert. By the 1970s, the team transitioned to polyester fabrics for improved comfort and moisture-wicking properties, aligning with broader MLB trends toward synthetic materials. Road uniforms have consistently featured gray fabric since the team's early years, initially with white sleeves by 1908 and later scripted \"New York\" in navy blue, evolving to include white outlines in the 1990s. In the 2000s, the Yankees reverted to more traditional button-down styles, moving away from pullover designs used in prior decades to honor their historical aesthetic.\n\nSpecial edition uniforms have occasionally deviated from the core design, such as the 1995 black armband and sleeve patch honoring Mickey Mantle following his death, marking an early use of black accents as a tribute. Uniform manufacturing shifted to Nike in 2020 as part of a league-wide 10-year deal valued at over $1 billion, replacing Majestic and introducing the prominent Nike swoosh on jerseys while maintaining the Yankees' traditional look.\n\n## Stadiums and facilities\n\n### Historical ballparks\n\nThe New York Highlanders, the franchise that became the Yankees, began play in 1903 at Hilltop Park in Manhattan's Washington Heights neighborhood, where they remained until 1912. Constructed of wood at a cost of about $75,000 (part of a total project cost of approximately $275,000), the ballpark featured a seating capacity of approximately 16,000, expandable with standing room for thousands more.\n\nFrom 1913 to 1922, the Yankees shared the Polo Grounds in Coogan's Bluff with the New York Giants, marking a period of growing attendance and success for the team. The horseshoe-shaped stadium, rebuilt after a 1911 fire, had a capacity of around 34,000 during the Yankees' tenancy, drawing large crowds for the emerging rivalry between the tenants. It was during this era that the Yankees acquired Babe Ruth from the Boston Red Sox in January 1920, a transaction announced publicly that transformed the franchise, with Ruth making his debut for New York at the Polo Grounds that April.\n\nThe team moved to the newly built Yankee Stadium in the Bronx in 1923, which served as their home until 2008 and earned the nickname \"The House That Ruth Built\" due to the slugger's star power driving its construction. With an initial capacity of 58,000—the largest in MLB history at the time—the triple-decked steel-and-concrete structure hosted Ruth's first home run on opening day, April 18, 1923, a three-run shot against the Boston Red Sox in a 4-1 Yankees victory before an overflow crowd of about 74,000. Over the decades, the stadium became the site of iconic moments, including the start of Joe DiMaggio's record 56-game hitting streak on May 15, 1941, with a single off Chicago White Sox pitcher Eddie Smith, and Roger Maris's 61st home run of 1961 on October 1, breaking Ruth's single-season mark against Boston Red Sox reliever Tracy Stallard in the season finale.\n\nMajor renovations from 1974 to 1975 rebuilt the upper deck, removed obstructing columns, and modernized facilities at a direct cost of $48 million—escalating to over $160 million including debt service—while the Yankees temporarily played home games at Shea Stadium, missing the 1974 and 1975 seasons at their venue. These upgrades increased capacity to more than 57,000 and preserved the ballpark's role as a Yankees stronghold until the team's transition to a new stadium in 2009.\n\n### Yankee Stadium (current)\n\nYankee Stadium, the current home of the New York Yankees, opened on April 16, 2009, with an initial seating capacity of 50,287, making it one of the largest ballparks in Major League Baseball at the time. The construction cost approximately $1.1 billion in private funding from the Yankees, as part of a total project expense of $2.3 billion that included about $1.2 billion in public subsidies, positioning it among the most expensive sports venues ever built. Designed with a retro aesthetic inspired by the original 1923 Yankee Stadium, the ballpark features a limestone and copper exterior, arched windows, and frieze elements to evoke the historic charm of its predecessor while incorporating contemporary infrastructure for fan comfort and safety.\n\nThe stadium's field dimensions emphasize its hitter-friendly reputation, with a right-field foul pole at 314 feet—among the shortest in MLB—creating a \"short porch\" that facilitates home runs for right-handed pull hitters, often drawing criticism for turning the venue into a \"bandbox\" that inflates offensive statistics. Fans enter primarily through the Great Hall, a 31,000-square-foot concourse resembling a grand hall with towering 35-foot-high banners honoring Yankees icons like Babe Ruth and Joe DiMaggio, blending historical reverence with modern retail and dining options. Additional amenities include 56 luxury suites offering premium views and amenities, as well as the relocated Monument Park in the center-field batter's eye area, a landscaped museum dedicated to the team's retired numbers and Hall of Famers, accessible to ticketed fans before games.\n\nSince its opening, Yankee Stadium has been the site of significant records and events, including a single-season attendance high of 3,482,855 in 2018 (the highest in MLB that year and the franchise record as of 2025, when attendance was 3,392,659). Notable baseball milestones include Aaron Judge tying Roger Maris's American League single-season home run record with his 61st homer on September 28, 2022, a 394-foot shot to right field that electrified the home crowd during a pivotal late-season game. In 2024, the stadium hosted World Series Games 3, 4, and 5 against the Los Angeles Dodgers, drawing massive crowds for the high-stakes matchups, with Game 4 seeing the Yankees' 11-4 victory amid a charged atmosphere.\n\n### Spring training facilities\n\nThe Yankees conduct spring training at George M. Steinbrenner Field in Tampa, Florida, which opened in 1996 with a capacity of 11,000. In 2025, the facility underwent renovations including upgrades to clubhouses, dining areas, and player amenities, costing approximately $40 million combined public-private funding, in preparation for hosting the Tampa Bay Rays' temporary 2025 home games due to Tropicana Field damage.\n\n## Culture and fanbase\n\n### Popularity and attendance\n\nThe New York Yankees maintain one of the largest and most consistent attendance figures in Major League Baseball, reflecting their enduring popularity. As of the 2025 season, the franchise has accumulated a total home attendance exceeding 218 million fans across its history since 1903, far surpassing other MLB teams. In 2025, the Yankees drew 3,392,659 fans for 81 home games, averaging 41,885 attendees per game and ranking first in the league. This marks the 25th consecutive full season (excluding the pandemic-shortened 2020) in which the team has topped 3 million in home attendance, a MLB record.\n\nThe Yankees' appeal extends globally, bolstered by historical tours such as the 1955 goodwill series in Japan that drew massive crowds and fostered long-term interest in the team among international audiences. Their iconic \"NY\" logo has become a worldwide symbol, recognized in markets from Europe to Asia, contributing to robust global merchandise sales that rose 30% in international markets during the early 2000s and continue to drive revenue. In a 2021 survey across 28 countries, 13% of MLB fans identified as Yankees supporters, the highest share for any team, underscoring their status as a cultural export. This international draw has positioned the Yankees as MLB's most valuable franchise, valued at $8.2 billion in 2025 by Forbes, outpacing the Los Angeles Dodgers ($6.8 billion) and ranking among the top three most valuable sports teams in North America, behind only the NFL's Dallas Cowboys and the NBA's Golden State Warriors.\n\nThe team's media presence amplifies its reach, particularly through the Yankee Entertainment and Sports Network (YES), launched in 2002 as the first regional sports network owned by a MLB team. YES broadcasts have consistently delivered top ratings in the New York market, averaging 291,628 total viewers per Yankees game in 2025—a 5% increase from 2024 and 12% higher than the New York Mets' network—while primetime games often exceed 300,000 viewers. This media empire, combined with high attendance, generates substantial economic benefits for New York City, with Yankees home games projected to contribute $594 million in local economic activity during the 2025 season through spending on tickets, concessions, and nearby businesses. The franchise also boosts Bronx tourism via partnerships like the 2023 \"I LOVE NY\" campaign, which promotes the borough's attractions to visiting fans and enhances regional visibility.\n\n### Fan traditions and sections\n\nThe Bleacher Creatures are a dedicated group of New York Yankees fans occupying Section 203 in the right-field bleachers of Yankee Stadium, known for their raucous chants and unwavering support since the group's formation in the 1990s at the original Yankee Stadium. This tradition persisted after the stadium's 2009 relocation, where the Creatures relocated to the new Section 203 and continued their signature roll call—a pre-game ritual in which they systematically chant the names of Yankees defenders, starting from right field and moving across the infield, to acknowledge and energize the players. The roll call, often led by prominent voices such as Bald Vinny Milano, who guided the chants for nearly two decades beginning in the early 2000s, fosters an electric atmosphere and has become one of the most distinctive elements of the Yankee Stadium experience.\n\nIn 2017, the Yankees introduced The Judge's Chambers, a themed fan section in Section 104 along the first-base line dedicated to supporters of outfielder Aaron Judge, featuring 18 seats designed to resemble a courtroom jury box with faux wood paneling. Fans are randomly selected from other areas of the stadium to occupy these seats during games, where they don black robes and wield foam gavels to cheer Judge, emphasizing his nickname \"The Judge\" and creating a focused hub of enthusiasm for the star player.\n\nYankees fans maintain distinct rituals during games, notably avoiding \"Sweet Caroline\"—a song synonymous with Boston Red Sox traditions at Fenway Park—opting instead for \"God Bless America\" during the seventh-inning stretch, a practice intensified after the September 11, 2001, attacks to honor national unity. This aversion was highlighted in August 2025 when the Miami Marlins played \"Sweet Caroline\" in the ninth inning of a game against the Yankees, prompting many fans to exit early in a sweeping loss, underscoring the song's role as a rival taunt rather than a Yankee custom. Following victories, fans often engage in celebratory dances to \"Y.M.C.A.\" by the Village People, a longstanding stadium tradition amplified by the ground crew's choreographed performance during select innings, which energizes the crowd and reinforces post-win camaraderie.\n\nYankees fans, dubbed \"boo birds\" for their vocal criticism, frequently jeer their own players for errors or subpar play, a practice with roots in the team's high-expectation culture dating back decades, as seen in instances like the sustained disapproval of pitcher Carl Pavano in the mid-2000s. In 2025, this tendency persisted, with fans booing shortstop Anthony Volpe after his MLB-leading 16th error in late July, reflecting their demand for precision amid the team's competitive standing. During the 2025 American League Division Series against the Toronto Blue Jays, rival interactions escalated as Yankee Stadium crowds drowned out the Canadian national anthem \"O Canada\" with boos and \"U.S.A.\" chants before Game 3, drawing widespread criticism for the display while highlighting the intense, nationalistic fervor in playoff atmospheres.\n\n### Music and anthems\n\nThe official fight song of the New York Yankees is \"Here Come the Yankees,\" composed in 1967 by Bob Bundin and Les Brown and performed by the Les Brown Orchestra. It has been played during team entrances and introductions at Yankee Stadium since the late 1960s, serving as an energetic rally for players and fans alike.\n\nThe Yankees' post-game anthem is Frank Sinatra's rendition of \"Theme from New York, New York,\" originally recorded in 1979 and adopted by the team in 1980 under owner George Steinbrenner, initially after home victories to celebrate wins with its uplifting lyrics about opportunity in the city. Over time, the tradition expanded to include playings after losses using Liza Minnelli's version before standardizing on Sinatra's for all games in the 1990s. The song took on profound emotional significance in 2001, following the September 11 attacks, when fans spontaneously sang along during postseason games, symbolizing resilience and unity in a time of national grief. In a 2025 update, the team reverted to playing Sinatra's version exclusively after home wins, while rotating other Sinatra tracks like \"My Way\" and \"The Lady Is a Tramp\" after defeats to maintain morale.\n\nLive organ music has been a staple at Yankee Stadium since 1965, enhancing the in-stadium atmosphere with improvisational performances during innings, breaks, and special moments. Eddie Layton, a pioneer in the pop-organ style, held the role from 1967 to 2003, entertaining crowds for 37 seasons with classics and custom riffs, including renditions of \"Here Come the Yankees\" on the organ. His successor, Ed Alstrom, has served as the weekend organist since 2004, now in his 21st season, where he mixes timeless baseball tunes with contemporary hits like Taylor Swift's \"Anti-Hero\" to engage modern audiences while preserving the instrument's nostalgic role.\n\nIndividual players select walk-up songs to accompany their at-bats, creating personal rituals that energize the crowd. Former captain Derek Jeter frequently used \"Hypnotize\" by The Notorious B.I.G. during his career, reflecting his New York roots and cool demeanor. Current outfielder Aaron Judge's 2025 selections include \"Swag Surfin'\" by F.L.Y. (Fast Life Yungstaz) and \"Hello\" by Pop Smoke featuring A Boogie Wit da Hoodie, blending hip-hop swagger with high-energy beats to match his power-hitting presence. These choices evolve seasonally, allowing players to update based on personal or cultural influences. Fans often sing along to the anthems and walk-ups, amplifying the communal spirit at games.\n\n### Media and broadcasting\n\nThe New York Yankees' radio broadcasts have a storied history dating back to the team's early days in Major League Baseball. In the mid-20th century, announcers Mel Allen and Red Barber formed one of the most iconic broadcasting duos, with Allen serving as the primary voice from 1940 to 1964 and Barber joining the team in 1954 until 1966, calling games during a golden era of 14 World Series championships. Their coverage aired on stations like WINS and later WMCA, capturing the excitement of Yankee Stadium for a nationwide audience. Following this period, Phil Rizzuto transitioned from shortstop to broadcaster in 1955, continuing until 1996 and becoming famous for his signature exclamation \"Holy Cow!\" during home runs and big plays.\n\nIn more recent decades, the Yankees' radio rights shifted among New York stations, including WCBS-AM from 1987 to 2013, before moving to WFAN in 2014 as the flagship station, where games continue to be broadcast today. John Sterling served as the lead play-by-play announcer from 1989 until his retirement in April 2024 after calling over 5,600 games, often paired with color analyst Suzyn Waldman; he returned briefly for the 2024 postseason before stepping away permanently. For the 2025 season, Dave Sims assumed the primary radio play-by-play role on WFAN, marking a new chapter in the team's audio coverage.\n\nOn television, the Yankees' broadcasts evolved from early local coverage on WPIX starting in 1947 to a long partnership with the MSG Network from 1979 to 2001, which aired the team's games amid growing cable viewership. The launch of the Yankees Entertainment and Sports Network (YES) in 2002 marked a pivotal shift, as the team took control of its regional sports network following a dispute with Cablevision, valuing the initial rights arrangement in the hundreds of millions and setting a precedent for team-owned RSNs. YES has since become a cornerstone of Yankees media, producing over 150 regular-season games annually and earning 118 Emmy Awards for its coverage through 2023.\n\nNationally, Yankees games receive extensive exposure on ESPN and Fox Sports, with key matchups like Sunday Night Baseball on ESPN averaging millions of viewers and contributing to MLB's overall viewership gains in 2025, up double-digits across these networks. For the 2025 season, select Yankees games are available via streaming on MLB.TV for out-of-market viewers and integrated platforms like Prime Video, which carries 21 exclusive regular-season contests at no extra cost to subscribers. Internationally, the team's broadcasts reach Japan through partners like NHK-BS and J Sports, where Yankees stars such as Hideki Matsui and Masahiro Tanaka have boosted popularity. This global reach underscores the Yankees' media footprint, amplifying their status as baseball's most followed franchise.\n\n## Organization and personnel\n\n### Ownership and front office\n\nThe New York Yankees' ownership has evolved through several key eras, beginning with brewery magnate Jacob Ruppert, who purchased the franchise in 1915 for $460,000 and transformed it into a powerhouse by acquiring Babe Ruth in 1919 and building Yankee Stadium in 1923. Following Ruppert's death in 1939, a group including Larry MacPhail, Dan Topping, and Del Webb acquired the team in 1945 for $2.8 million, maintaining its dominance through the mid-20th century. In 1964, the Columbia Broadcasting System (CBS) bought the Yankees for $11.2 million, marking the team's first corporate ownership, but financial struggles and a lack of postseason success prompted CBS to sell to a group headed by George Steinbrenner in 1973 for $10 million.\n\nUnder the Steinbrenner family, the Yankees experienced a revival, with George Steinbrenner serving as principal owner from 1973 until his death in 2010, during which the team won seven World Series titles and established a reputation for aggressive spending and involvement in operations. Today, the franchise is owned by Yankee Global Enterprises, a limited liability company controlled by the Steinbrenner family, with Hal Steinbrenner as managing general partner since 2008, overseeing business decisions while emphasizing fiscal discipline compared to his father's more hands-on approach. Other family members, including Jennifer Steinbrenner Swindal as vice chair, hold significant roles in the ownership structure.\n\nThe front office is led by general manager Brian Cashman, who has held the position since February 1998 and is credited with assembling multiple championship rosters through savvy trades and international scouting. Assisting Cashman is senior vice president and assistant general manager Jean Afterman, who joined in 1998 as the first woman to hold such a senior role in MLB and has been instrumental in contract negotiations and player acquisitions. Additional key executives include president Randy Levine, who manages business operations, and chief operating officer Lonn Trost, focusing on stadium and legal affairs.\n\nFinancially, the Yankees maintain one of MLB's highest payrolls, with a 2025 competitive balance tax payroll of approximately $300 million, ranking second in the league and reflecting their commitment to contending annually. This approach has resulted in substantial luxury tax payments over the years; for instance, the team paid $9.7 million in 2022 alone and has contributed hundreds of millions since the tax's inception in 2003, funding revenue sharing for smaller-market clubs.\n\nOwnership has not been without controversies, notably George Steinbrenner's 1989 involvement with gambler Howard Spira, whom he paid $40,000 to uncover damaging information on player Dave Winfield amid a contract dispute, leading to Steinbrenner's permanent ban from baseball operations by Commissioner Fay Vincent in 1990 (later reduced). In 2025, the Yankees reaffirmed their dedication to diversity and inclusion initiatives amid broader rollbacks in MLB and corporate America, with the Diversity and Inclusion Committee committing to programs supporting underrepresented communities, education, and socioeconomic equity in New York City.\n\n### Coaching staff and key players\n\nThe New York Yankees' coaching staff for the 2025 season was headed by manager Aaron Boone, who entered his eighth year with the team after being hired in December 2017. Bench coach Brad Ausmus, a former MLB catcher and manager, provided strategic support, while pitching coach Matt Blake continued in his role, focusing on pitcher development amid a season marked by injuries to key arms. The staff underwent some postseason adjustments, including the departure of bullpen coach Mike Harkey and infield coach Travis Chapman, with replacements including Dan Fiorito as infield coach (hired November 2025); however, core members like Blake were retained to maintain continuity in player preparation and in-game decisions.\n\nProminent among the Yankees' active players in 2025 was captain Aaron Judge, the right fielder who anchored the offense with a .331 batting average, 53 home runs, 114 RBIs, and a 1.145 OPS over 541 at-bats, earning him another All-Star selection and MVP consideration. Ace pitcher Gerrit Cole, sidelined for most of the year following Tommy John surgery in spring training, did not record significant stats but remained a foundational leader in the rotation when healthy in prior seasons. Shortstop Anthony Volpe solidified his role in the infield core, batting .212 with 19 home runs and 18 stolen bases in 539 at-bats, showcasing defensive prowess despite offensive inconsistencies.\n\nRoster highlights included second baseman Jazz Chisholm Jr., acquired in a mid-2024 trade from the Miami Marlins, who delivered a breakout campaign with a .242 average, 31 home runs, 80 RBIs, and 31 stolen bases in 130 games, earning his first Silver Slugger Award. The infield core, featuring Volpe at shortstop and Chisholm at second base, provided versatility and speed, complemented by deadline acquisition Ryan McMahon from the Colorado Rockies for third base depth.\n\nThe 2025 trade deadline saw the Yankees make several moves to address pitching needs, including acquiring relievers David Bednar from the Pittsburgh Pirates, Camilo Doval from the San Francisco Giants, and Jake Bird in a multi-player deal, as well as utility infielder Amed Rosario from the Washington Nationals. Injuries impacted the roster significantly, with Cole's season-ending elbow surgery, Volpe's left shoulder labrum tear requiring offseason repair, and other absences like starting pitcher Carlos Rodón dealing with loose bodies in his elbow. Under Boone's guidance, the development of young talents like Volpe and Chisholm contributed to a 94-68 regular season record, though the team fell in the AL Division Series.\n\n### Hall of Famers and retired numbers\n\nThe New York Yankees are associated with 54 members of the National Baseball Hall of Fame, the highest total of any Major League Baseball franchise, encompassing players, managers, and executives who spent significant portions of their careers with the team. Notable inductees include Babe Ruth, elected in 1936 for his transformative role as a power-hitting outfielder from 1920 to 1934; Lou Gehrig, inducted in 1939 as the iconic first baseman who played 2,130 consecutive games from 1923 to 1939; Mickey Mantle, honored in 1974 for his switch-hitting prowess and three MVP awards during his 1951–1968 tenure; and Derek Jeter, selected in 2020 for his shortstop leadership and five World Series titles across 1995–2014. These figures, among others like Yogi Berra (1972), Whitey Ford (1974), and Mariano Rivera (2019), exemplify the Yankees' legacy of excellence, with many earning plaques in Monument Park at Yankee Stadium that detail their statistical achievements and contributions to the franchise.\n\nThe Yankees have retired 22 uniform numbers in honor of 23 individuals—the most in MLB history—recognizing players and managers whose extraordinary contributions to the team warrant permanent removal from circulation. The franchise retires numbers at its discretion, typically for those with Hall of Fame-caliber impact or iconic tenure, though exceptions exist for non-inductees who embodied team spirit, such as Paul O'Neill, whose No. 21 was retired on August 21, 2022, for his clutch performances in five World Series from 1992 to 2001. Additionally, No. 42 is retired league-wide since 1997 in tribute to Jackie Robinson's barrier-breaking role with the Brooklyn Dodgers, though the Yankees honor it alongside Mariano Rivera's use of the number until his 2013 retirement ceremony.\n\nThe following table lists the Yankees' retired numbers, honorees, and retirement dates:\n\n| Number | Honoree(s)              | Date Retired       |\n|--------|-------------------------|--------------------|\n| 1      | Billy Martin (manager)  | August 10, 1986   |\n| 2      | Derek Jeter (SS)        | May 14, 2017      |\n| 3      | Babe Ruth (OF)          | June 13, 1948     |\n| 4      | Lou Gehrig (1B)         | July 4, 1939      |\n| 5      | Joe DiMaggio (OF)       | April 18, 1952    |\n| 6      | Joe Torre (manager)     | August 23, 2014   |\n| 7      | Mickey Mantle (OF)      | June 8, 1969      |\n| 8      | Yogi Berra (C) \\u0026 Bill Dickey (C) | July 22, 1972 |\n| 9      | Roger Maris (OF)        | July 22, 1984     |\n| 10     | Phil Rizzuto (SS)       | August 4, 1985    |\n| 15     | Thurman Munson (C)      | September 20, 1980|\n| 16     | Whitey Ford (P)         | August 3, 1974    |\n| 20     | Jorge Posada (C)        | August 22, 2015   |\n| 21     | Paul O'Neill (OF)       | August 21, 2022   |\n| 23     | Don Mattingly (1B)      | August 31, 1997   |\n| 32     | Elston Howard (C)       | July 22, 1984     |\n| 37     | Casey Stengel (manager) | August 8, 1970    |\n| 42     | Mariano Rivera (P)      | September 22, 2013|\n| 44     | Reggie Jackson (OF)     | August 14, 1993   |\n| 46     | Andy Pettitte (P)       | August 23, 2015   |\n| 49     | Ron Guidry (P)          | August 23, 2003   |\n| 51     | Bernie Williams (OF)    | May 24, 2015      |\n\nAmong the honorees without retired numbers are Hall of Famers Miller Huggins (inducted 1964 as manager, 1918–1929) and Joe McCarthy (inducted 1976 as manager, 1931–1946), both of whom receive dedicated monuments or plaques in Monument Park highlighting their roles in building championship dynasties, including eight pennants for Huggins and seven for McCarthy. These tributes, relocated from the field to Monument Park during the 1976–1977 stadium renovation and again to the current Yankee Stadium in 2009, preserve the team's historical reverence beyond uniform numbers.\n\n### Minor league affiliates\n\nThe New York Yankees maintain a comprehensive minor league system aligned with Major League Baseball's structure, comprising five levels from Triple-A to Rookie leagues as of the 2025 season. At the Triple-A level, the Scranton/Wilkes-Barre RailRiders compete in the International League, serving as the highest developmental affiliate for players nearing major league readiness. The Double-A Somerset Patriots, based in the Eastern League, focus on refining advanced skills for rising talents. High-A is represented by the Hudson Valley Renegades in the South Atlantic League, while the Single-A Tampa Tarpons play in the Florida State League, emphasizing foundational professional experience. The Rookie-level Florida Complex League (FCL) Yankees operate out of Tampa, providing introductory gameplay and instruction for recent draftees and international signees.\n\nPlayer development within the Yankees' farm system highlights promising prospects such as outfielder Jasson Domínguez, a top-ranked international signee who has progressed through multiple levels and is noted for his elite hitting potential and speed. The 2025 MLB Draft bolstered the pipeline with selections like shortstop Dax Kilby, taken in the Competitive Balance Round A (39th overall), who brings strong defensive tools and contact skills to the organization. These prospects undergo structured training programs designed to accelerate their growth, with occasional promotions to the major league roster providing pathways for rapid advancement.\n\nThe Yankees' infrastructure supports this development through key facilities, including the George M. Steinbrenner Field complex in Tampa, Florida, which houses the Player Development and Scouting Complex for year-round training, batting cages, fitness centers, and instructional leagues. In the Dominican Republic, the Boca Chica academy serves as a vital hub for Latin American talent, featuring advanced coaching and scouting operations to nurture international prospects from an early age. The organization's extensive scouting network, spanning domestic and global operations, identifies and recruits high-potential players to sustain the farm system's depth and competitiveness.\n\n## Rivalries\n\n### Boston Red Sox\n\nThe rivalry between the New York Yankees and the Boston Red Sox, one of the most intense in American sports, originated with the sale of Babe Ruth from the Red Sox to the Yankees on December 26, 1919, for $100,000 plus a $300,000 loan, which owner Harry Frazee used to finance a Broadway show. This transaction, which deprived Boston of its star pitcher and emerging slugger, ushered in the \"Curse of the Bambino,\" a superstitious hex blamed for the Red Sox's 86-year World Series drought from 1918 to 2004. The move not only propelled the Yankees to their first dynasty but also sowed seeds of deep animosity, as Boston fans viewed it as a betrayal that shifted power in the American League East.\n\nFrom 1949 to 1961, the Red Sox endured a series of heartbreaking pennant near-misses against the Yankees, epitomized by the 1949 season when Boston entered the final day with a one-game lead but lost 5-4 in a winner-take-all contest at Yankee Stadium, allowing New York to claim the American League flag on the last day of the regular season. This era highlighted Boston's persistent frustration, with the team finishing second in 1948 and 1949, often trailing the Yankees by slim margins in tight divisional races that reinforced the curse's narrative.\n\nIconic moments have defined the feud, including Bucky Dent's unexpected three-run home run in the seventh inning of the 1978 American League East tiebreaker game at Fenway Park, which propelled the Yankees to a 5-4 victory and dashed Boston's playoff hopes in a short-porch shot that became legendary for its improbability. The rivalry peaked again in the 2003-2004 ALCS, where the Yankees defeated the Red Sox 4-3 in 2003 amid controversy, only for Boston to stage the greatest postseason comeback in MLB history in 2004, rallying from a 3-0 deficit to win 4-3, highlighted by Curt Schilling's \"Bloody Sock\" performance in Game 6, where he pitched seven innings despite a severe ankle injury stabilized by a bloody surgical procedure.\n\nIn 2025, the Yankees defeated the Red Sox 2-1 in the AL Wild Card Series, clinching the series with a 4-0 shutout in Game 3 at Yankee Stadium to advance, adding a fresh chapter to their postseason edge. All-time, the Yankees hold a commanding head-to-head record of 1,265-1,051-14 over the Red Sox through the 2025 season, including the AL Wild Card Series, underscoring New York's historical dominance.\n\nOff the field, the rivalry manifests in stark contrasts between Fenway Park's intimate, 1912-era charm with its Green Monster wall and the Yankees' modern, cavernous Yankee Stadium, opened in 2009, which amplifies the cultural clash between Boston's scrappy underdog ethos and New York's imperial legacy. Fan violence has occasionally erupted, including a 2021 bleacher brawl at Yankee Stadium where Yankees supporters outnumbered and assaulted Red Sox fans, and historical on-field altercations like the 1976 brawl that injured Boston pitcher Bill Lee, reflecting the deep-seated passions that sometimes spill into aggression.\n\n### New York Mets (Subway Series)\n\nThe New York Mets entered Major League Baseball as an expansion franchise in 1962, filling the National League void left by the relocation of the Brooklyn Dodgers and New York Giants to California after the 1957 season. This expansion reintroduced intra-city competition in New York, though the teams did not face each other in official games until interleague play began in 1997. The rivalry, dubbed the \"Subway Series\" in homage to the city's extensive subway system connecting Yankee Stadium and Citi Field, symbolizes the divide between American League (Yankees) and National League (Mets) allegiances among New York fans.\n\nThe pinnacle of the rivalry occurred in the 2000 World Series, the first postseason matchup between the two teams and the first \"Subway Series\" since the 1956 Yankees-Dodgers clash. The Yankees defeated the Mets 4-1, with Derek Jeter earning MVP honors after batting .409 with two home runs; the series evoked the spirit of past New York World Series, as the Mets drew from the Dodgers' and Giants' fanbases. No further World Series meetings have happened, though the 2000 contest remains a cultural touchstone for its high stakes and local drama.\n\nIn regular-season interleague play since 1997, the Yankees hold a 86-72 edge over the Mets as of the end of the 2025 regular season, including a 3-3 split in their 2025 series played in June and July at Citi Field and Yankee Stadium. These annual matchups, often scheduled around holidays like the Fourth of July, intensify the competition without the divisional implications of other rivalries. The shared New York media market amplifies coverage, fostering citywide banter, including fans' transit-based taunts on subways where supporters in Yankees pinstripes and Mets blue-oranges clash verbally en route to games.\n\nA defining moment came in Game 2 of the 2000 World Series, when Yankees pitcher Roger Clemens shattered Mets catcher Mike Piazza's bat with a fastball in the first inning; Clemens then picked up the loose barrel and hurled it toward Piazza as he ran to first base, narrowly missing him and sparking a near-brawl. Umpire Joe Brinkman ruled it accidental, issuing no ejection despite protests, but the incident fueled ongoing tension between the players and epitomized the rivalry's raw emotion. Piazza later described it as intentional, highlighting the personal stakes in New York's fiercest baseball feud.",
  "external_references": [
    {
      "text": "Information",
      "url": "https://www.mlb.com/yankees/ballpark/information",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Ballpark",
      "url": "https://www.mlb.com/yankees/ballpark",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees Team History And Facts",
      "url": "https://www.mlb.com/news/new-york-yankees-team-history-and-facts",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Front Office",
      "url": "https://www.mlb.com/yankees/team/front-office",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Postseason Results",
      "url": "https://www.mlb.com/yankees/history/postseason-results",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Community",
      "url": "https://www.mlb.com/yankees/community",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Ban Johnson",
      "url": "https://sabr.org/bioproj/person/ban-johnson",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "The American Leagues First Baltimore Orioles John Mcgraw Wilbert Robinson And Rivalries Created",
      "url": "https://sabr.org/journal/article/the-american-leagues-first-baltimore-orioles-john-mcgraw-wilbert-robinson-and-rivalries-created/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "1902.shtml",
      "url": "https://www.baseball-reference.com/teams/BLA/1902.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Hilltop Park New York",
      "url": "https://sabr.org/bioproj/park/hilltop-park-new-york/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Hilltop Park",
      "url": "https://www.ballparksofbaseball.com/ballparks/hilltop-park/",
      "domain": "ballparksofbaseball.com",
      "type": "citation"
    },
    {
      "text": "1903.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/1903.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "April 23 1903 New York Records Its First Victory In American League Play",
      "url": "https://sabr.org/gamesproj/game/april-23-1903-new-york-records-its-first-victory-in-american-league-play/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "When The Bronx Bombers Were The Highlanders A Brief History Of The Yankees",
      "url": "https://www.6sqft.com/when-the-bronx-bombers-were-the-highlanders-a-brief-history-of-the-yankees/",
      "domain": "6sqft.com",
      "type": "citation"
    },
    {
      "text": "1904.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/1904.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "October 7 1904 Jack Chesbro Wins 41st Game Of Season For New York Highlanders",
      "url": "https://sabr.org/gamesproj/game/october-7-1904-jack-chesbro-wins-41st-game-of-season-for-new-york-highlanders/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Clark Griffith",
      "url": "https://sabr.org/bioproj/person/clark-griffith/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Griffcl01.shtml",
      "url": "https://www.baseball-reference.com/managers/griffcl01.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "1912.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/1912.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "New York Highlanders Wins 1903 To 1912",
      "url": "https://www.statmuse.com/mlb/ask/new-york-highlanders-wins-1903-to-1912",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Jacob Ruppert",
      "url": "https://sabr.org/bioproj/person/jacob-ruppert",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Polo Grounds",
      "url": "https://www.ballparksofbaseball.com/ballparks/polo-grounds/",
      "domain": "ballparksofbaseball.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium The Giants Greatest Mistake",
      "url": "https://sabr.org/journal/article/yankee-stadium-the-giants-greatest-mistake/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "New York Yankees Team Name Origin",
      "url": "https://www.mlb.com/news/new-york-yankees-team-name-origin",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Wally Pipp",
      "url": "https://sabr.org/bioproj/person/wally-pipp/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "1918 Baseball History",
      "url": "https://thisgreatgame.com/1918-baseball-history/",
      "domain": "thisgreatgame.com",
      "type": "citation"
    },
    {
      "text": "1919.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/1919.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Year By Year Results",
      "url": "https://www.mlb.com/yankees/history/year-by-year-results",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Timeline 1920s",
      "url": "https://www.mlb.com/yankees/history/timeline-1920s",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Faq Yankees Past And Present",
      "url": "https://www.mlb.com/news/faq-yankees-past-and-present",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Ruthba01.shtml",
      "url": "https://www.baseball-reference.com/players/r/ruthba01.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium Was Unveiled 100 Years Ago",
      "url": "https://www.mlb.com/news/yankee-stadium-was-unveiled-100-years-ago",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "1923",
      "url": "https://www.mlb.com/postseason/history/1923",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Huggins Miller",
      "url": "https://baseballhall.org/hall-of-famers/huggins-miller",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "Babe Ruth And Ownership Not A Match Made In Heaven",
      "url": "https://sabr.org/journal/article/babe-ruth-and-ownership-not-a-match-made-in-heaven/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Ruths Salary Cut 17000 For 1934 Babes Contract Calls For 35000.html",
      "url": "https://www.nytimes.com/1934/01/16/archives/ruths-salary-cut-17000-for-1934-babes-contract-calls-for-35000.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Babe Ruth Ends Career With Boston Braves",
      "url": "https://www.mlb.com/news/babe-ruth-ends-career-with-boston-braves",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Index.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/index.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Joe Dimaggio",
      "url": "https://sabr.org/bioproj/person/joe-dimaggio/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Joe Dimaggio Major League Debut",
      "url": "https://baseballhall.org/discover-more/stories/inside-pitch/joe-dimaggio-major-league-debut",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "The New York Yankees In Wartime",
      "url": "https://sabr.org/journal/article/the-new-york-yankees-in-wartime/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Mccarjo99.shtml",
      "url": "https://www.baseball-reference.com/managers/mccarjo99.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "October 2 1949 Yankees Come Out On Top In Winner Take All Contest",
      "url": "https://sabr.org/gamesproj/game/october-2-1949-yankees-come-out-on-top-in-winner-take-all-contest/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Mickey Mantles Arizona Spring",
      "url": "https://sabr.org/journal/article/mickey-mantles-arizona-spring/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Casey Stengel",
      "url": "https://sabr.org/bioproj/person/casey-stengel/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Yankees Five Year Title Stretch Still Unmatched",
      "url": "https://baseballhall.org/discover/yankees-five-year-title-stretch-still-unmatched",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "Back To Back World Series Champions C297636124",
      "url": "https://www.mlb.com/news/back-to-back-world-series-champions-c297636124",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "A Look At Baseball Triple Crown Winners",
      "url": "https://www.mlb.com/news/a-look-at-baseball-triple-crown-winners",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yogi Berra Passed Away Was Unforgettable Figure",
      "url": "https://www.espn.com/mlb/story/_/id/9307863/yogi-berra-passed-away-was-unforgettable-figure",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Whitey Ford",
      "url": "https://sabr.org/bioproj/person/whitey-ford/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Goodby Casey Goodby",
      "url": "https://vault.si.com/vault/1960/10/31/goodby-casey-goodby",
      "domain": "vault.si.com",
      "type": "citation"
    },
    {
      "text": "How Newspapers Covered Roger Maris 61st Homer",
      "url": "https://www.mlb.com/news/how-newspapers-covered-roger-maris-61st-homer",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "C B S Sells The Yankees For 1 Omillion Cbs Sells The Yankees To.html",
      "url": "https://www.nytimes.com/1973/01/04/archives/c-b-s-sells-the-yankees-for-1-omillion-cbs-sells-the-yankees-to.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Managers.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/managers.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Ralph Houk",
      "url": "https://sabr.org/bioproj/person/ralph-houk/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Mel Stottlemyre",
      "url": "https://sabr.org/bioproj/person/mel-stottlemyre/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "The Cbs Era Yankees",
      "url": "https://marklaurencearmour.wordpress.com/2018/06/07/the-cbs-era-yankees/",
      "domain": "marklaurencearmour.wordpress.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium And The Renovation Of 76",
      "url": "https://sabr.org/journal/article/yankee-stadium-and-the-renovation-of-76/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "1972.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/1972.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Cbs Sells The Yankees For 10million Cb S Sells The Yankees To.html",
      "url": "https://www.nytimes.com/1973/01/04/archives/cbs-sells-the-yankees-for-10million-cb-s-sells-the-yankees-to.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Billy Martin Had A Rollercoaster Ride Of A Relationship With The Yankees",
      "url": "https://www.nydailynews.com/2020/11/29/billy-martin-had-a-rollercoaster-ride-of-a-relationship-with-the-yankees/",
      "domain": "nydailynews.com",
      "type": "citation"
    },
    {
      "text": "2119731",
      "url": "https://www.nbcnewyork.com/news/local/timeline-the-boss-yankee-career/2119731/",
      "domain": "nbcnewyork.com",
      "type": "citation"
    },
    {
      "text": "Reggie Jackson Game Six Hr Lifts Yankees To Ws Champ",
      "url": "https://baseballhall.org/discover/inside-pitch/reggie-jackson-game-six-hr-lifts-yankees-to-ws-champ",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "Thurman Munson",
      "url": "https://sabr.org/bioproj/person/thurman-munson/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Thurman Munson Plane Crash Yankees.html",
      "url": "https://www.nytimes.com/2018/08/01/sports/thurman-munson-plane-crash-yankees.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "G2yz28ldc4121tv1ev1cevg2p",
      "url": "https://www.sportingnews.com/us/mlb/news/reggie-jackson-billy-martin-dugout-fight-fenway-park-june-18-1977-yankees-red-sox/g2yz28ldc4121tv1ev1cevg2p",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "George Steinbrenner",
      "url": "https://sabr.org/bioproj/person/george-steinbrenner/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Mlb 1981 Year In Review",
      "url": "https://www.mlb.com/news/mlb-1981-year-in-review",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankees Record 1982 To 1995",
      "url": "https://www.statmuse.com/mlb/ask/yankees-record-1982-to-1995",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Mattido01.shtml",
      "url": "https://www.baseball-reference.com/players/m/mattido01.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://www.espn.com/mlb/news/story?id=1856626",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Yankees No World Series Appearance 2010s Decade",
      "url": "https://www.mlb.com/news/yankees-no-world-series-appearance-2010s-decade",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankees 1996 World Series Championship Revisited",
      "url": "https://www.mlb.com/news/yankees-1996-world-series-championship-revisited",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "1292691",
      "url": "https://thescore.com/mlb/news/1292691",
      "domain": "thescore.com",
      "type": "citation"
    },
    {
      "text": "Yankees Core Four Andy Pettitte Mariano Rivera Jorge Posada And Derek Jeter Had A Humble Begin",
      "url": "https://www.nydailynews.com/2010/10/03/yankees-core-four-andy-pettitte-mariano-rivera-jorge-posada-and-derek-jeter-had-a-humble-begin/",
      "domain": "nydailynews.com",
      "type": "citation"
    },
    {
      "text": "1998",
      "url": "https://www.mlb.com/postseason/history/1998",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "1999",
      "url": "https://www.mlb.com/postseason/history/1999",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2000 World Series Recap",
      "url": "https://www.mlb.com/news/2000-world-series-recap",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Mlb Interleague Play Approval 1996",
      "url": "https://www.history.com/this-day-in-history/january-18/mlb-interleague-play-approval-1996",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "2001 World Series Recap",
      "url": "https://www.mlb.com/news/2001-world-series-recap",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2003 World Series Recap",
      "url": "https://www.mlb.com/news/2003-world-series-recap",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2004 Alcs.shtml",
      "url": "https://www.baseball-reference.com/postseason/2004_ALCS.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "How Derek Jeter Became The Captain",
      "url": "https://www.mlb.com/news/how-derek-jeter-became-the-captain",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Nyy",
      "url": "https://www.baseball-reference.com/teams/NYY/",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://www.espn.com/new-york/mlb/columns/story?columnist=oconnor_ian\\u0026id=5598262",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Cc Sabathia Deal Key At Yankees 2008 Meetings C263069510",
      "url": "https://www.mlb.com/news/cc-sabathia-deal-key-at-yankees-2008-meetings-c263069510",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "24yankees.html",
      "url": "https://www.nytimes.com/2008/12/24/sports/baseball/24yankees.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Timeline 2010s",
      "url": "https://www.mlb.com/yankees/history/timeline-2010s",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankees Rise In 2017 Behind Judge Sanchez C259462240",
      "url": "https://www.mlb.com/news/yankees-rise-in-2017-behind-judge-sanchez-c259462240",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Best Rookie Season Ever Looking Back Yankees Slugger Aaron Judge Greatest Hits",
      "url": "https://www.espn.com/mlb/story/_/id/21327380/best-rookie-season-ever-looking-back-yankees-slugger-aaron-judge-greatest-hits",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Aaron Boone Hiring Finalized New York Yankees",
      "url": "https://www.espn.com/mlb/story/_/id/21668272/aaron-boone-hiring-finalized-new-york-yankees",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Aaron Judge Wins 2022 Al Mvp Award",
      "url": "https://www.mlb.com/news/aaron-judge-wins-2022-al-mvp-award",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2024.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/2024.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "2025.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/2025.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "World Series.shtml",
      "url": "https://www.baseball-reference.com/postseason/world-series.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "World Series",
      "url": "https://www.mlb.com/postseason/history/world-series",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "How Many Sweeps There World Series",
      "url": "https://www.espn.com/mlb/story/_/id/42065268/how-many-sweeps-there-world-series",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Ranking Every World Series Mlb History",
      "url": "https://www.espn.com/mlb/story/_/id/29104085/ranking-every-world-series-mlb-history",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "1923 World Series Recap",
      "url": "https://www.mlb.com/news/1923-world-series-recap",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "October 8 1927 New York Yankees Win World Series On A Wild Pitch",
      "url": "https://sabr.org/gamesproj/game/october-8-1927-new-york-yankees-win-world-series-on-a-wild-pitch/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Called Shot",
      "url": "https://baseballhall.org/discover-more/stories/baseball-history/called-shot",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "Craziest Finishes In World Series History",
      "url": "https://www.mlb.com/news/craziest-finishes-in-world-series-history",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Dodgers Yankees Legends Discuss Classic World Series Matchups",
      "url": "https://www.mlb.com/news/dodgers-yankees-legends-discuss-classic-world-series-matchups",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "1996 Yankees Reunion World Series",
      "url": "https://www.si.com/mlb/2016/08/12/1996-yankees-reunion-world-series",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "2009 World Series Recap",
      "url": "https://www.mlb.com/news/2009-world-series-recap",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2025 Mlb Mvp Award Winners",
      "url": "https://www.mlb.com/news/2025-mlb-mvp-award-winners",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Cy Young",
      "url": "https://www.mlb.com/awards/cy-young",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Rookie Of The Year",
      "url": "https://www.mlb.com/awards/rookie-of-the-year",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "How Many 100 Win Seasons Has The Yankees Had",
      "url": "https://www.statmuse.com/mlb/ask/how-many-100-win-seasons-has-the-yankees-had",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "1998.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/1998.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "What Was The Batting Average Of The 1927 Yankees",
      "url": "https://www.statmuse.com/mlb/ask/what-was-the-batting-average-of-the-1927-yankees",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Feats12b.shtml",
      "url": "https://www.baseball-almanac.com/feats/feats12b.shtml",
      "domain": "baseball-almanac.com",
      "type": "citation"
    },
    {
      "text": "Jack Chesbro",
      "url": "https://en.wikipedia.org/wiki/Jack_Chesbro",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Yankees History Batting Titles Ruth Dimaggio Mantle Mattingly Bernie Williams",
      "url": "https://www.pinstripealley.com/2015/2/22/8073701/yankees-history-batting-titles-ruth-dimaggio-mantle-mattingly-bernie-williams",
      "domain": "pinstripealley.com",
      "type": "citation"
    },
    {
      "text": "Most Career Gold Gloves By A New York Yankee",
      "url": "https://www.statmuse.com/mlb/ask/most-career-gold-gloves-by-a-new-york-yankee",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "What Mlb Team Has Most Silver Sluggers",
      "url": "https://www.statmuse.com/mlb/ask/what-mlb-team-has-most-silver-sluggers",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Manage.shtml",
      "url": "https://www.baseball-reference.com/awards/manage.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "How The Highlanders Became The Yankees",
      "url": "https://www.yesnetwork.com/nfl/news/how-the-highlanders-became-the-yankees",
      "domain": "yesnetwork.com",
      "type": "citation"
    },
    {
      "text": "Bronx Bombers",
      "url": "https://www.baseball-reference.com/bullpen/Bronx_Bombers",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Why Were They Called Murderers Row 47cfd21c3be4",
      "url": "https://1927-the-diary-of-myles-thomas.espn.com/why-were-they-called-murderers-row-47cfd21c3be4",
      "domain": "1927-the-diary-of-myles-thomas.espn.com",
      "type": "citation"
    },
    {
      "text": "Yankees History Nicknames Sanchez Matsui Mantle Jackson Jeter Ford",
      "url": "https://www.pinstripealley.com/2020/5/29/21273558/yankees-history-nicknames-sanchez-matsui-mantle-jackson-jeter-ford",
      "domain": "pinstripealley.com",
      "type": "citation"
    },
    {
      "text": "Yankees Depending On Baby Bombers In 2017 C211993702",
      "url": "https://www.mlb.com/news/yankees-depending-on-baby-bombers-in-2017-c211993702",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankees New York Revolutionary War Damn Yankees History",
      "url": "https://www.pinstripealley.com/2020/5/28/21272454/yankees-new-york-revolutionary-war-damn-yankees-history",
      "domain": "pinstripealley.com",
      "type": "citation"
    },
    {
      "text": "Timeline 1910s",
      "url": "https://www.mlb.com/yankees/history/timeline-1910s",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees Uniforms",
      "url": "https://www.baseball-reference.com/bullpen/New_York_Yankees_uniforms",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Yankees New York Logo Origin",
      "url": "https://www.mlb.com/news/yankees-new-york-logo-origin",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "The New York Yankees Top Hat And Bat Logo By Dave Grob",
      "url": "https://mearsonline.com/the-new-york-yankees-top-hat-and-bat-logo-by-dave-grob/",
      "domain": "mearsonline.com",
      "type": "citation"
    },
    {
      "text": "Evolution New York Yankees Uniform",
      "url": "https://dlifmgmt.elementor.cloud/04/08/2017/evolution-new-york-yankees-uniform/",
      "domain": "dlifmgmt.elementor.cloud",
      "type": "citation"
    },
    {
      "text": "Nike Take Mlb Uniform Supplier Beginning 2020",
      "url": "https://www.espn.com/mlb/story/_/id/25849955/nike-take-mlb-uniform-supplier-beginning-2020",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Hilltp.htm",
      "url": "https://ballparks.com/baseball/american/hilltp.htm",
      "domain": "ballparks.com",
      "type": "citation"
    },
    {
      "text": "Ballparks Polo Grounds",
      "url": "https://thisgreatgame.com/ballparks-polo-grounds/",
      "domain": "thisgreatgame.com",
      "type": "citation"
    },
    {
      "text": "Sale Of Ruth To Yankees Shook Baseball World",
      "url": "https://baseballhall.org/discover/sale-of-ruth-to-yankees-shook-baseball-world",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "Sale Of The Century The Yankees Bought Babe Ruth For Nothing",
      "url": "https://sabr.org/journal/article/sale-of-the-century-the-yankees-bought-babe-ruth-for-nothing/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Old Yankee Stadiums Rise And Fall Complete Story Of The House That Ruth Built 100 Years After Its Opening",
      "url": "https://www.cbssports.com/mlb/news/old-yankee-stadiums-rise-and-fall-complete-story-of-the-house-that-ruth-built-100-years-after-its-opening/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Dimaggio Begins Hitting Streak With Single",
      "url": "https://baseballhall.org/discover/inside-pitch/dimaggio-begins-hitting-streak-with-single",
      "domain": "baseballhall.org",
      "type": "citation"
    },
    {
      "text": "Nyy Gid Maris 61.html",
      "url": "https://www.nytimes.com/specials/baseball/yankees/nyy-gid-maris-61.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium",
      "url": "https://baseball-reference.com/bullpen/Yankee_Stadium",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium",
      "url": "https://www.ballparksofbaseball.com/ballparks/yankee-stadium/",
      "domain": "ballparksofbaseball.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium",
      "url": "https://en.wikipedia.org/wiki/Yankee_Stadium",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Nyynew",
      "url": "https://baseballparks.com/indepth/nyynew/",
      "domain": "baseballparks.com",
      "type": "citation"
    },
    {
      "text": "Why Does Yankee Stadium Have A Short Porch In Right Field C303279930",
      "url": "https://www.mlb.com/cut4/why-does-yankee-stadium-have-a-short-porch-in-right-field-c303279930",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium Vs Fenway Park Breaking Down The Short Porch And Pesky Pole",
      "url": "https://fansided.com/yankee-stadium-vs-fenway-park-breaking-down-the-short-porch-and-pesky-pole",
      "domain": "fansided.com",
      "type": "citation"
    },
    {
      "text": "Great Hall",
      "url": "https://www.mlb.com/yankees/ballpark/events/spaces/great-hall",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees Suites",
      "url": "https://suitehop.com/mlb/new-york-yankees-suites",
      "domain": "suitehop.com",
      "type": "citation"
    },
    {
      "text": "2018",
      "url": "https://www.espn.com/mlb/attendance/_/year/2018",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Aaron Judge Roger Maris Home Run History",
      "url": "https://www.mlb.com/news/aaron-judge-roger-maris-home-run-history",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "County Approves 17 9m In Steinbrenner Field Renovations",
      "url": "https://ballparkdigest.com/2025/10/16/county-approves-17-9m-in-steinbrenner-field-renovations/",
      "domain": "ballparkdigest.com",
      "type": "citation"
    },
    {
      "text": "Attend.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/attend.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "2025",
      "url": "https://www.espn.com/mlb/attendance/_/year/2025",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Attendance",
      "url": "https://www.espn.com/mlb/attendance",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Good Optics The 1955 Yankees Tour Of Japan",
      "url": "https://sabr.org/journal/article/good-optics-the-1955-yankees-tour-of-japan/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "New York Yankees Japan",
      "url": "https://ryanferguson.co.uk/blogs/blog/new-york-yankees-japan",
      "domain": "ryanferguson.co.uk",
      "type": "citation"
    },
    {
      "text": "47123 Team Profile The Worldwide Phenomenon Of The New York Yankees",
      "url": "https://yougov.com/en-gb/articles/47123-team-profile-the-worldwide-phenomenon-of-the-new-york-yankees",
      "domain": "yougov.com",
      "type": "citation"
    },
    {
      "text": "Baseballs Most Valuable Teams 2025",
      "url": "https://www.forbes.com/sites/justinteitelbaum/2025/03/26/baseballs-most-valuable-teams-2025/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Cnbcs Official Mlb Team Valuations 2025.html",
      "url": "https://www.cnbc.com/2025/04/11/cnbcs-official-mlb-team-valuations-2025.html",
      "domain": "cnbc.com",
      "type": "citation"
    },
    {
      "text": "Yes Network",
      "url": "https://en.wikipedia.org/wiki/YES_Network",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Yankees Tv Ratings Swing Up 5 From 2024 12 Higher Than Mets",
      "url": "https://frontofficesports.com/yankees-tv-ratings-swing-up-5-from-2024-12-higher-than-mets/",
      "domain": "frontofficesports.com",
      "type": "citation"
    },
    {
      "text": "2025 Yankees And Mets Economic Impact",
      "url": "https://www.bxtimes.com/2025-yankees-and-mets-economic-impact/",
      "domain": "bxtimes.com",
      "type": "citation"
    },
    {
      "text": "Governor Hochul Announces New I Love Ny Tourism Partnership New York Yankees And New York Mets",
      "url": "https://www.governor.ny.gov/news/governor-hochul-announces-new-i-love-ny-tourism-partnership-new-york-yankees-and-new-york-mets",
      "domain": "governor.ny.gov",
      "type": "citation"
    },
    {
      "text": "Bleacher Creatures Roll Call A Yankee Stadium Tradition",
      "url": "https://www.mlb.com/news/bleacher-creatures-roll-call-a-yankee-stadium-tradition",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Bald Vinny Milano Giving Up His Tickets.html",
      "url": "https://nymag.com/daily/sports/2011/10/-bald-vinny-milano-giving-up-his-tickets.html",
      "domain": "nymag.com",
      "type": "citation"
    },
    {
      "text": "Rookie Slugger Aaron Judge Gets Own Rooting Section Yankee Stadium",
      "url": "https://www.espn.com/mlb/story/_/id/19440366/rookie-slugger-aaron-judge-gets-own-rooting-section-yankee-stadium",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "3510295002",
      "url": "https://www.usatoday.com/story/sports/mlb/yankees/2019/04/18/yankees-drop-kate-smith-god-bless-america-7th-inning-stretch/3510295002/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "How Marlins Trolled Yankees Just Before Sweeping Them",
      "url": "https://nypost.com/2025/08/04/sports/how-marlins-trolled-yankees-just-before-sweeping-them/",
      "domain": "nypost.com",
      "type": "citation"
    },
    {
      "text": "Yankees Clint Frazier Hair Tradition Stadium Ymca",
      "url": "https://www.pinstripealley.com/2017/3/12/14893042/yankees-clint-frazier-hair-tradition-stadium-ymca",
      "domain": "pinstripealley.com",
      "type": "citation"
    },
    {
      "text": "A Brief History Of Booing In The Bronx",
      "url": "https://tht.fangraphs.com/a-brief-history-of-booing-in-the-bronx/",
      "domain": "tht.fangraphs.com",
      "type": "citation"
    },
    {
      "text": "Yankees Anthony Volpe Leads League 142133830.html",
      "url": "https://sports.yahoo.com/article/yankees-anthony-volpe-leads-league-142133830.html",
      "domain": "sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Bronx Zoo Loud Boos For O Canada Before Game 3",
      "url": "https://globalnews.ca/news/11468966/bronx-zoo-loud-boos-for-o-canada-before-game-3/",
      "domain": "globalnews.ca",
      "type": "citation"
    },
    {
      "text": "Omg Mets Latest Team In Long Line To Adopt A Catchy Fan Favorite Tune",
      "url": "https://nypost.com/2024/07/06/sports/omg-mets-latest-team-in-long-line-to-adopt-a-catchy-fan-favorite-tune/",
      "domain": "nypost.com",
      "type": "citation"
    },
    {
      "text": "122807",
      "url": "https://www.artofthemix.org/mix/122807",
      "domain": "artofthemix.org",
      "type": "citation"
    },
    {
      "text": "Yankees Long History With New York New York",
      "url": "https://www.mlb.com/news/yankees-long-history-with-new-york-new-york",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium New York",
      "url": "https://sabr.org/bioproj/park/yankee-stadium-new-york/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Yankees 2001 World Series September 11th Remembered Tino Martinez Derek Jeter",
      "url": "https://www.pinstripealley.com/2024/9/11/24241348/yankees-2001-world-series-september-11th-remembered-tino-martinez-derek-jeter",
      "domain": "pinstripealley.com",
      "type": "citation"
    },
    {
      "text": "Yankees Sinatra New York New York",
      "url": "https://secretnyc.co/yankees-sinatra-new-york-new-york/",
      "domain": "secretnyc.co",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium Organist Music In Stadium Live Ed Alstrom Bob Sheppard Eddie Layton Jane Jarvis",
      "url": "https://www.pinstripealley.com/2024/5/25/24164395/yankee-stadium-organist-music-in-stadium-live-ed-alstrom-bob-sheppard-eddie-layton-jane-jarvis",
      "domain": "pinstripealley.com",
      "type": "citation"
    },
    {
      "text": "Yankee Stadium Organ Player Ed Alstrom",
      "url": "https://www.cbsnews.com/newyork/news/yankee-stadium-organ-player-ed-alstrom/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Derek Jeter Walkup Songs",
      "url": "https://ftw.usatoday.com/2014/09/derek-jeter-walkup-songs",
      "domain": "ftw.usatoday.com",
      "type": "citation"
    },
    {
      "text": "Music",
      "url": "https://www.mlb.com/yankees/ballpark/music",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Live From Yankee Stadium A Brief History Of The Yankees On Radio",
      "url": "https://sabr.org/journal/article/live-from-yankee-stadium-a-brief-history-of-the-yankees-on-radio/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Red Barber And Mel Allen First Two Honored Hof Broadcast Greats But Not The Best Of Buddies",
      "url": "https://www.sportsbroadcastjournal.com/red-barber-and-mel-allen-first-two-honored-hof-broadcast-greats-but-not-the-best-of-buddies/",
      "domain": "sportsbroadcastjournal.com",
      "type": "citation"
    },
    {
      "text": "Dave Sims John Sterling Yankees Radio Play By Play",
      "url": "https://www.mlb.com/news/dave-sims-john-sterling-yankees-radio-play-by-play",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "John Sterling Yankees Announcer.html",
      "url": "https://www.nytimes.com/2024/04/16/nyregion/john-sterling-yankees-announcer.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Yes Launch",
      "url": "https://www.sportsbusinessjournal.com/Journal/Issues/2012/04/30/Media/YES-launch/",
      "domain": "sportsbusinessjournal.com",
      "type": "citation"
    },
    {
      "text": "On This Date In Yankees History Yes Network On Air",
      "url": "https://bronxpinstripes.com/p/on-this-date-in-yankees-history-yes-network-on-air",
      "domain": "bronxpinstripes.com",
      "type": "citation"
    },
    {
      "text": "Yankees Deal For Yes Network",
      "url": "https://www.mlb.com/news/yankees-deal-for-yes-network",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Mlb Viewership Increases Usa Japan Streaming 2025",
      "url": "https://www.mlb.com/news/mlb-viewership-increases-usa-japan-streaming-2025",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees Games Return To Prime Video In 2025",
      "url": "https://www.yesnetwork.com/news/new-york-yankees-games-return-to-prime-video-in-2025",
      "domain": "yesnetwork.com",
      "type": "citation"
    },
    {
      "text": "2025 World Series Reaching Large Global Audience",
      "url": "https://www.mlb.com/news/2025-world-series-reaching-large-global-audience",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees Team Ownership History",
      "url": "https://sabr.org/bioproj/topic/new-york-yankees-team-ownership-history/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Former Yankees Owner Jacob Ruppert Elected To Baseball Hall Of Fame",
      "url": "https://www.cbsnews.com/newyork/news/former-yankees-owner-jacob-ruppert-elected-to-baseball-hall-of-fame/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees",
      "url": "https://www.forbes.com/teams/new-york-yankees/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Where New York Yankees Ownership Situation Ranks Against Cross Town Rival 01jkgxqk6wy6",
      "url": "https://www.si.com/mlb/yankees/news/where-new-york-yankees-ownership-situation-ranks-against-cross-town-rival-01jkgxqk6wy6",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "86667489007",
      "url": "https://www.usatoday.com/story/sports/mlb/2025/10/13/mlb-teams-payroll-2025-highest-lowest/86667489007/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Year By Year Luxury Tax Payments In Major League Baseball",
      "url": "https://www.statista.com/statistics/219716/year-by-year-luxury-tax-payments-in-major-league-baseball/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Steinbrenner George.html",
      "url": "https://www.espn.com/classic/biography/s/Steinbrenner_George.html",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Yankees Affirm Stance To Continue Diversity Initiatives",
      "url": "https://www.sportsbusinessjournal.com/Articles/2025/04/16/yankees-affirm-stance-to-continue-diversity-initiatives/",
      "domain": "sportsbusinessjournal.com",
      "type": "citation"
    },
    {
      "text": "Yankees 2025 Coaching Staff",
      "url": "https://www.mlb.com/news/yankees-2025-coaching-staff",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankees Make Two Coaching Changes To Aaron Boones Staff Source",
      "url": "https://www.nytimes.com/athletic/6717408/2025/10/14/yankees-make-two-coaching-changes-to-aaron-boones-staff-source/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Yankees Coaching Staff Undergoes Offseason Overhaul",
      "url": "https://nypost.com/2025/10/14/sports/yankees-coaching-staff-undergoes-offseason-overhaul/",
      "domain": "nypost.com",
      "type": "citation"
    },
    {
      "text": "Ar Aa1qeblh",
      "url": "https://www.msn.com/en-us/sports/mlb/yankees-announce-major-change-to-aaron-boone-s-coaching-staff/ar-AA1QeBLh",
      "domain": "msn.com",
      "type": "citation"
    },
    {
      "text": "Aaron Judge 592450",
      "url": "https://www.mlb.com/player/aaron-judge-592450",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Gerrit Cole 543037",
      "url": "https://baseballsavant.mlb.com/savant-player/gerrit-cole-543037",
      "domain": "baseballsavant.mlb.com",
      "type": "citation"
    },
    {
      "text": "Anthony Volpe",
      "url": "https://www.espn.com/mlb/player/gamelog/_/id/42547/anthony-volpe",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Jazz Chisholm Jr",
      "url": "https://www.espn.com/mlb/player/_/id/41433/jazz-chisholm-jr",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Yankees 2025 Mlb Trade Deadline Overview",
      "url": "https://www.justbaseball.com/mlb/yankees-2025-mlb-trade-deadline-overview/",
      "domain": "justbaseball.com",
      "type": "citation"
    },
    {
      "text": "David Bednar Yankees Pirates Trade",
      "url": "https://www.mlb.com/news/david-bednar-yankees-pirates-trade",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees",
      "url": "https://www.espn.com/mlb/team/injuries/_/name/nyy/new-york-yankees",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Hof.shtml",
      "url": "https://www.baseball-reference.com/teams/NYY/hof.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Gehrilo01.shtml",
      "url": "https://www.baseball-reference.com/players/g/gehrilo01.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Mantlmi01.shtml",
      "url": "https://www.baseball-reference.com/players/m/mantlmi01.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "History Of Monument Park C263612104",
      "url": "https://www.mlb.com/news/history-of-monument-park-c263612104",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Retired Numbers",
      "url": "https://www.mlb.com/yankees/history/retired-numbers",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees Retire Paul Oneill No 21 Hal Steinbrenner Booed Fans",
      "url": "https://www.espn.com/mlb/story/_/id/34436545/new-york-yankees-retire-paul-oneill-no-21-hal-steinbrenner-booed-fans",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Yankees Retired Numbers C300027600",
      "url": "https://www.mlb.com/news/yankees-retired-numbers-c300027600",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Of Monuments And Men The Story Of Monument Park At Yankee Stadium",
      "url": "https://sabr.org/journal/article/of-monuments-and-men-the-story-of-monument-park-at-yankee-stadium/",
      "domain": "sabr.org",
      "type": "citation"
    },
    {
      "text": "Yankees",
      "url": "https://www.milb.com/fans/affiliates/yankees",
      "domain": "milb.com",
      "type": "citation"
    },
    {
      "text": "Affiliate.cgi",
      "url": "https://www.baseball-reference.com/register/affiliate.cgi?id=NYY\\u0026year=2025",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Affiliates",
      "url": "https://www.mlb.com/yankees/prospects/stats/affiliates",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "New York Yankees 2025 Mlb Draft Full Picks Analysis",
      "url": "https://www.espn.com/mlb/story/_/id/45708665/new-york-yankees-2025-mlb-draft-full-picks-analysis",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "The Road To Major League Baseball Begins At Player Development 290286630",
      "url": "https://www.milb.com/news/the-road-to-major-league-baseball-begins-at-player-development-290286630",
      "domain": "milb.com",
      "type": "citation"
    },
    {
      "text": "Yankees Magazine Latin Beisbol Academy",
      "url": "https://www.mlb.com/news/yankees-magazine-latin-beisbol-academy",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Curse Of The Bambino",
      "url": "https://www.mlb.com/news/curse-of-the-bambino",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Rewatch Bucky Dent 1978 Game 163 Home Run",
      "url": "https://www.mlb.com/news/rewatch-bucky-dent-1978-game-163-home-run",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "C 98978666",
      "url": "https://www.mlb.com/news/curt-schillings-bloody-sock-the-bridge-to-history/c-98978666",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Yankees Win Al Wild Card Series 2025",
      "url": "https://www.mlb.com/news/yankees-win-al-wild-card-series-2025",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Boston Red Sox",
      "url": "https://champsorchumps.us/team/mlb/new-york-yankees/head-to-head/boston-red-sox",
      "domain": "champsorchumps.us",
      "type": "citation"
    },
    {
      "text": "Yankees And Red Sox Fans Brawl In Bleachers In Viral Video",
      "url": "https://nypost.com/2021/07/19/yankees-and-red-sox-fans-brawl-in-bleachers-in-viral-video/",
      "domain": "nypost.com",
      "type": "citation"
    },
    {
      "text": "9645020007",
      "url": "https://www.recordonline.com/story/sports/mlb/2018/10/05/yankees-sox-have-history-violence/9645020007/",
      "domain": "recordonline.com",
      "type": "citation"
    },
    {
      "text": "Expansion Of 1962",
      "url": "https://www.baseball-reference.com/bullpen/Expansion_of_1962",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Subway Series Most Memorable Moments",
      "url": "https://www.mlb.com/news/subway-series-most-memorable-moments",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Oppteams.php",
      "url": "https://ultimatemets.com/oppteams.php?ThisTeam=19",
      "domain": "ultimatemets.com",
      "type": "citation"
    },
    {
      "text": "Mlb 2025 New York Yankees Mets Subway Series Hal Steinbrenner Steve Cohen",
      "url": "https://www.espn.com/mlb/story/_/id/45618193/mlb-2025-new-york-yankees-mets-subway-series-hal-steinbrenner-steve-cohen",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Roger Clemens Speaks About Incident With Mike Piazza",
      "url": "https://www.mlb.com/news/roger-clemens-speaks-about-incident-with-mike-piazza",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Roger Clemens Weighs In On Famous Mike Piazza World Series Broken Bat Drama",
      "url": "https://nypost.com/2025/08/08/sports/roger-clemens-weighs-in-on-famous-mike-piazza-world-series-broken-bat-drama/",
      "domain": "nypost.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "Bronx",
      "page": "The_Bronx"
    },
    {
      "text": "New York City",
      "page": "New_York_City"
    },
    {
      "text": "Major League Baseball",
      "page": "Major_League_Baseball"
    },
    {
      "text": "American League",
      "page": "American_League"
    },
    {
      "text": "AL",
      "page": "AL"
    },
    {
      "text": "Yankee Stadium",
      "page": "Yankee_Stadium"
    },
    {
      "text": "2009",
      "page": "2009"
    },
    {
      "text": "Baltimore",
      "page": "Baltimore"
    },
    {
      "text": "the Orioles",
      "page": "The_Orioles"
    },
    {
      "text": "dynasty",
      "page": "Dynasty"
    },
    {
      "text": "Jacob Ruppert",
      "page": "Jacob_Ruppert"
    },
    {
      "text": "Steinbrenner family",
      "page": "Steinbrenner_family"
    },
    {
      "text": "Ed Barrow",
      "page": "Ed_Barrow"
    },
    {
      "text": "Babe Ruth",
      "page": "Babe_Ruth"
    },
    {
      "text": "George Steinbrenner",
      "page": "George_Steinbrenner"
    },
    {
      "text": "World Series",
      "page": "World_Series"
    },
    {
      "text": "MVP",
      "page": "MVP"
    },
    {
      "text": "hitting streak",
      "page": "Hitting_streak"
    },
    {
      "text": "outfielder",
      "page": "Outfielder"
    },
    {
      "text": "2009 World Series",
      "page": "2009_World_Series"
    },
    {
      "text": "Boston",
      "page": "Boston"
    },
    {
      "text": "Toronto Blue Jays",
      "page": "TO"
    },
    {
      "text": "Aaron Boone",
      "page": "Aaron_Boone"
    },
    {
      "text": "legacy",
      "page": "Legacy"
    },
    {
      "text": "influence",
      "page": "Influence"
    },
    {
      "text": "philanthropy",
      "page": "Philanthropy"
    },
    {
      "text": "National League",
      "page": "National_League"
    },
    {
      "text": "Ban Johnson",
      "page": "Ban_Johnson"
    },
    {
      "text": "Baltimore Orioles",
      "page": "Baltimore_Orioles"
    },
    {
      "text": "John McGraw",
      "page": "John_McGraw"
    },
    {
      "text": "Wilbert Robinson",
      "page": "Wilbert_Robinson"
    },
    {
      "text": "third baseman",
      "page": "Third_baseman"
    },
    {
      "text": "Joe McGinnity",
      "page": "Joe_McGinnity"
    },
    {
      "text": "Mike Donlin",
      "page": "Mike_Donlin"
    },
    {
      "text": "salary cap",
      "page": "Salary_cap"
    },
    {
      "text": "Chicago White Sox",
      "page": "Chicago_White_Sox"
    },
    {
      "text": "batting average",
      "page": "Batting_average"
    },
    {
      "text": "on-base percentage",
      "page": "On-base_percentage"
    },
    {
      "text": "ERA",
      "page": "Era"
    },
    {
      "text": "Opening Day",
      "page": "Opening_Day"
    },
    {
      "text": "June",
      "page": "June"
    },
    {
      "text": "Oriole Park",
      "page": "Oriole_Park"
    },
    {
      "text": "Philadelphia Athletics",
      "page": "Philadelphia_Athletics"
    },
    {
      "text": "league",
      "page": "League"
    },
    {
      "text": "July",
      "page": "July"
    },
    {
      "text": "New York Giants",
      "page": "New_York_Giants"
    },
    {
      "text": "Joe Kelley",
      "page": "Joe_Kelley"
    },
    {
      "text": "Roger Bresnahan",
      "page": "Roger_Bresnahan"
    },
    {
      "text": "hit-and-run tactics",
      "page": "Hit-and-run_tactics"
    },
    {
      "text": "Manhattan",
      "page": "Manhattan"
    },
    {
      "text": "ballpark",
      "page": "Ballpark"
    },
    {
      "text": "Hilltop Park",
      "page": "Hilltop_Park"
    },
    {
      "text": "Broadway",
      "page": "Broadway"
    },
    {
      "text": "New York",
      "page": "New_York"
    },
    {
      "text": "Clark Griffith",
      "page": "Clark_Griffith"
    },
    {
      "text": "Americans",
      "page": "Americans"
    },
    {
      "text": "Jack Chesbro",
      "page": "Jack_Chesbro"
    },
    {
      "text": "Wee Willie Keeler",
      "page": "Willie_Keeler"
    },
    {
      "text": "pennant",
      "page": "Pennant"
    },
    {
      "text": "modern",
      "page": "Modern"
    },
    {
      "text": "October 7",
      "page": "October_7"
    },
    {
      "text": "Philadelphia",
      "page": "Philadelphia"
    },
    {
      "text": "first baseman",
      "page": "First_baseman"
    },
    {
      "text": "Wolverton",
      "page": "Wolverton"
    },
    {
      "text": "baseball",
      "page": "Baseball"
    },
    {
      "text": "Tillinghast L'Hommedieu Huston",
      "page": "Tillinghast_L'Hommedieu_Huston"
    },
    {
      "text": "Polo Grounds",
      "page": "Polo_Grounds"
    },
    {
      "text": "Frank Chance",
      "page": "Frank_Chance"
    },
    {
      "text": "Wally Pipp",
      "page": "Wally_Pipp"
    },
    {
      "text": "World War I",
      "page": "World_War_I"
    },
    {
      "text": "Ray Caldwell",
      "page": "Ray_Caldwell"
    },
    {
      "text": "Miller Huggins",
      "page": "Miller_Huggins"
    },
    {
      "text": "loan",
      "page": "Loan"
    },
    {
      "text": "Harry Frazee",
      "page": "Harry_Frazee"
    },
    {
      "text": "Ruth",
      "page": "Ruth"
    },
    {
      "text": "Lou Gehrig",
      "page": "Lou_Gehrig"
    },
    {
      "text": "Pittsburgh Pirates",
      "page": "Pittsburgh_Pirates"
    },
    {
      "text": "1933",
      "page": "1933"
    },
    {
      "text": "Great Depression",
      "page": "Great_Depression"
    },
    {
      "text": "pinstripes",
      "page": "Pinstripes"
    },
    {
      "text": "Joe DiMaggio",
      "page": "Joe_DiMaggio"
    },
    {
      "text": "Pacific Coast League",
      "page": "Pacific_Coast_League"
    },
    {
      "text": "St. Louis Browns",
      "page": "St._Louis_Browns"
    },
    {
      "text": "Cincinnati Reds",
      "page": "Cincinnati_Reds"
    },
    {
      "text": "one-game playoff",
      "page": "One-game_playoff"
    },
    {
      "text": "Mickey Mantle",
      "page": "Mickey_Mantle"
    },
    {
      "text": "Casey Stengel",
      "page": "Casey_Stengel"
    },
    {
      "text": "platoon system",
      "page": "Platoon_system"
    },
    {
      "text": "Brooklyn Dodgers",
      "page": "Brooklyn_Dodgers"
    },
    {
      "text": "Mantle",
      "page": "Mantle"
    },
    {
      "text": "home run",
      "page": "Home_run"
    },
    {
      "text": "Triple Crown",
      "page": "Triple_Crown"
    },
    {
      "text": "Whitey Ford",
      "page": "Whitey_Ford"
    },
    {
      "text": "Milwaukee",
      "page": "Milwaukee"
    },
    {
      "text": "Jackie Robinson",
      "page": "Jackie_Robinson"
    },
    {
      "text": "Hank Aaron",
      "page": "Hank_Aaron"
    },
    {
      "text": "Roger Maris",
      "page": "Roger_Maris"
    },
    {
      "text": "San Francisco",
      "page": "San_Francisco"
    },
    {
      "text": "Los Angeles Dodgers",
      "page": "Los Angeles_Dodgers"
    },
    {
      "text": "St. Louis",
      "page": "St._Louis"
    },
    {
      "text": "CBS",
      "page": "CBS"
    },
    {
      "text": "1964 World Series",
      "page": "1964_World_Series"
    },
    {
      "text": "Johnny Keane",
      "page": "Johnny_Keane"
    },
    {
      "text": "Ralph Houk",
      "page": "Ralph_Houk"
    },
    {
      "text": "1920s",
      "page": "1920s"
    },
    {
      "text": "Minnesota Twins",
      "page": "Minnesota_Twins"
    },
    {
      "text": "cash cow",
      "page": "Cash_cow"
    },
    {
      "text": "scouting",
      "page": "Scouting"
    },
    {
      "text": "winning percentage",
      "page": "Winning_percentage"
    },
    {
      "text": "Cleveland",
      "page": "Cleveland"
    },
    {
      "text": "Billy Martin",
      "page": "Billy_Martin"
    },
    {
      "text": "Bill Virdon",
      "page": "Bill_Virdon"
    },
    {
      "text": "Reggie Jackson",
      "page": "Reggie_Jackson"
    },
    {
      "text": "Los Angeles Dodgers",
      "page": "Los_Angeles_Dodgers"
    },
    {
      "text": "Game 6",
      "page": "Game_6"
    },
    {
      "text": "Graig Nettles",
      "page": "Graig_Nettles"
    },
    {
      "text": "Thurman Munson",
      "page": "Thurman_Munson"
    },
    {
      "text": "All-Star",
      "page": "All-star"
    },
    {
      "text": "Canton, Ohio",
      "page": "Canton,_Ohio"
    },
    {
      "text": "Bronx Zoo",
      "page": "Bronx_Zoo"
    },
    {
      "text": "Martin",
      "page": "Martin"
    },
    {
      "text": "confrontation",
      "page": "Confrontation"
    },
    {
      "text": "Fenway Park",
      "page": "Fenway_Park"
    },
    {
      "text": "Sparky Lyle",
      "page": "Sparky_Lyle"
    },
    {
      "text": "Bowie Kuhn",
      "page": "Bowie_Kuhn"
    },
    {
      "text": "Oakland Athletics",
      "page": "Oakland_Athletics"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "1990s",
      "page": "1990s"
    },
    {
      "text": "Don Mattingly",
      "page": "Don_Mattingly"
    },
    {
      "text": "Most Valuable Player",
      "page": "Most_valuable_player"
    },
    {
      "text": "Toronto",
      "page": "Toronto"
    },
    {
      "text": "Dave Winfield",
      "page": "Dave_Winfield"
    },
    {
      "text": "Rickey Henderson",
      "page": "Rickey_Henderson"
    },
    {
      "text": "Yogi",
      "page": "Yogi"
    },
    {
      "text": "Dick Howser",
      "page": "Dick_Howser"
    },
    {
      "text": "Lou Piniella",
      "page": "Lou_Piniella"
    },
    {
      "text": "Bucky Dent",
      "page": "Bucky_Dent"
    },
    {
      "text": "Stump Merrill",
      "page": "Stump_Merrill"
    },
    {
      "text": "Buck Showalter",
      "page": "Buck_Showalter"
    },
    {
      "text": "wild card",
      "page": "Wild_card"
    },
    {
      "text": "Seattle",
      "page": "Seattle"
    },
    {
      "text": "shortstop",
      "page": "Shortstop"
    },
    {
      "text": "Jeter",
      "page": "Derek_Jeter"
    },
    {
      "text": "Mattingly",
      "page": "Jérôme_d'Ambrosio"
    },
    {
      "text": "Texas Rangers",
      "page": "Texas_Rangers"
    },
    {
      "text": "Atlanta Braves",
      "page": "Atlanta_Braves"
    },
    {
      "text": "San Diego",
      "page": "San_Diego"
    },
    {
      "text": "New York Mets",
      "page": "New_York_Mets_all-time_roster"
    },
    {
      "text": "Subway Series",
      "page": "Subway_Series"
    },
    {
      "text": "1997",
      "page": "1997"
    },
    {
      "text": "NL",
      "page": "NL"
    },
    {
      "text": "Rivera",
      "page": "Rivera"
    },
    {
      "text": "Red",
      "page": "Red"
    },
    {
      "text": "contract",
      "page": "Contract"
    },
    {
      "text": "2007",
      "page": "2007"
    },
    {
      "text": "Girardi",
      "page": "Joe_Girardi"
    },
    {
      "text": "Core Four",
      "page": "Core_Four"
    },
    {
      "text": "CC Sabathia",
      "page": "CC_Sabathia"
    },
    {
      "text": "Mark Teixeira",
      "page": "Mark Teixeira"
    },
    {
      "text": "2010",
      "page": "2010"
    },
    {
      "text": "2016",
      "page": "2016"
    },
    {
      "text": "American League Championship Series",
      "page": "American_League_Championship_Series"
    },
    {
      "text": "playoffs",
      "page": "Playoffs"
    },
    {
      "text": "Texas",
      "page": "Texas"
    },
    {
      "text": "Detroit",
      "page": "Detroit"
    },
    {
      "text": "Houston",
      "page": "Houston"
    },
    {
      "text": "Jorge Posada",
      "page": "Jorge_Posada"
    },
    {
      "text": "Andy Pettitte",
      "page": "Andy_Pettitte"
    },
    {
      "text": "Mariano Rivera",
      "page": "Mariano_Rivera"
    },
    {
      "text": "Aaron Judge",
      "page": "Aaron_Judge"
    },
    {
      "text": "major league",
      "page": "Major_League"
    },
    {
      "text": "Gary Sánchez",
      "page": "Gary_Sánchez"
    },
    {
      "text": "Minnesota",
      "page": "Minnesota"
    },
    {
      "text": "Tampa Bay",
      "page": "Tampa_Bay"
    },
    {
      "text": "Judge",
      "page": "Judge"
    },
    {
      "text": "Kansas City Royals",
      "page": "Kansas_City_Royals"
    },
    {
      "text": "Cleveland Guardians",
      "page": "Cleveland_Guardians"
    },
    {
      "text": "Giancarlo Stanton",
      "page": "Giancarlo_Stanton"
    },
    {
      "text": "franchise",
      "page": "Franchise"
    },
    {
      "text": "1923",
      "page": "1923"
    },
    {
      "text": "1936",
      "page": "1936"
    },
    {
      "text": "Don Larsen",
      "page": "Don_Larsen"
    },
    {
      "text": "Ralph Terry",
      "page": "Ralph_Terry"
    },
    {
      "text": "John Wetteland",
      "page": "John_Wetteland"
    },
    {
      "text": "Scott Brosius",
      "page": "Scott_Brosius"
    },
    {
      "text": "Hideki Matsui",
      "page": "Hideki_Matsui"
    },
    {
      "text": "Murderers' Row",
      "page": "Murderers'_Row"
    },
    {
      "text": "Earle Combs",
      "page": "Earle_Combs"
    },
    {
      "text": "Reds",
      "page": "Reds"
    },
    {
      "text": "1930s",
      "page": "1930s"
    },
    {
      "text": "shutout",
      "page": "Shutout"
    },
    {
      "text": "Willie McCovey",
      "page": "Willie_McCovey"
    },
    {
      "text": "Joe Torre",
      "page": "Joe_Torre"
    },
    {
      "text": "Bernie Williams",
      "page": "Bernie_Williams"
    },
    {
      "text": "Cy Young Award",
      "page": "Cy_Young_Award"
    },
    {
      "text": "Ron Guidry",
      "page": "Ron_Guidry"
    },
    {
      "text": "Roger Clemens",
      "page": "Roger_Clemens"
    },
    {
      "text": "Gerrit Cole",
      "page": "Gerrit_Cole"
    },
    {
      "text": "Gil McDougald",
      "page": "Gil_McDougald"
    },
    {
      "text": "Tony Kubek",
      "page": "Tony_Kubek"
    },
    {
      "text": "Tom Tresh",
      "page": "Tom_Tresh"
    },
    {
      "text": "Dave Righetti",
      "page": "Dave_Righetti"
    },
    {
      "text": "60",
      "page": "60"
    },
    {
      "text": "1956 World Series",
      "page": "1956_World_Series"
    },
    {
      "text": "no-hitter",
      "page": "No-hitter"
    },
    {
      "text": "Babe",
      "page": "Babe"
    },
    {
      "text": "pitcher",
      "page": "Pitcher"
    },
    {
      "text": "Robinson Canó",
      "page": "Robinson_Canó"
    },
    {
      "text": "New York Americans",
      "page": "New_York_Americans"
    },
    {
      "text": "spring training",
      "page": "Spring_training"
    },
    {
      "text": "the 1930s",
      "page": "The_1930s"
    },
    {
      "text": "Bob Meusel",
      "page": "Bob_Meusel"
    },
    {
      "text": "Tony Lazzeri",
      "page": "Tony_Lazzeri"
    },
    {
      "text": "Tombs",
      "page": "The_Tombs"
    },
    {
      "text": "Iron Horse",
      "page": "Iron_horse"
    },
    {
      "text": "Yankee Clipper",
      "page": "Yankee_Clipper"
    },
    {
      "text": "Gleyber Torres",
      "page": "Gleyber_Torres"
    },
    {
      "text": "media",
      "page": "Media"
    },
    {
      "text": "American",
      "page": "American"
    },
    {
      "text": "patriotism",
      "page": "Patriotism"
    },
    {
      "text": "spectacle",
      "page": "Spectacle"
    },
    {
      "text": "popular culture",
      "page": "Popular_culture"
    },
    {
      "text": "navy blue",
      "page": "Navy_blue"
    },
    {
      "text": "1912",
      "page": "1912"
    },
    {
      "text": "April 11",
      "page": "April_11"
    },
    {
      "text": "professional sports",
      "page": "Professional_sports"
    },
    {
      "text": "Nike",
      "page": "Nike"
    },
    {
      "text": "Majestic",
      "page": "Majestic"
    },
    {
      "text": "Coogan's Bluff",
      "page": "Coogan's_Bluff"
    },
    {
      "text": "Shea Stadium",
      "page": "Shea_Stadium"
    },
    {
      "text": "Yankees",
      "page": "New_York_Yankees"
    },
    {
      "text": "limestone",
      "page": "Limestone"
    },
    {
      "text": "copper",
      "page": "Copper"
    },
    {
      "text": "frieze",
      "page": "Frieze"
    },
    {
      "text": "Great Hall",
      "page": "Great_hall"
    },
    {
      "text": "concourse",
      "page": "Concourse"
    },
    {
      "text": "batter's eye",
      "page": "Batter's_eye"
    },
    {
      "text": "museum",
      "page": "Museum"
    },
    {
      "text": "2018",
      "page": "2018"
    },
    {
      "text": "George M. Steinbrenner Field",
      "page": "George_M._Steinbrenner_Field"
    },
    {
      "text": "Tampa, Florida",
      "page": "Tampa,_Florida"
    },
    {
      "text": "Tampa Bay Rays",
      "page": "Tampa_Bay_Rays"
    },
    {
      "text": "Tropicana Field",
      "page": "Tropicana_Field"
    },
    {
      "text": "1903",
      "page": "1903"
    },
    {
      "text": "1955",
      "page": "1955"
    },
    {
      "text": "Japan",
      "page": "Japan"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "2000s",
      "page": "2000s"
    },
    {
      "text": "Forbes",
      "page": "Forbes"
    },
    {
      "text": "North America",
      "page": "North_America"
    },
    {
      "text": "Dallas Cowboys",
      "page": "Dallas_Cowboys"
    },
    {
      "text": "Golden State Warriors",
      "page": "Golden_State_Warriors"
    },
    {
      "text": "YES",
      "page": "Yes"
    },
    {
      "text": "regional sports network",
      "page": "Regional_sports_network"
    },
    {
      "text": "tourism",
      "page": "Tourism"
    },
    {
      "text": "courtroom",
      "page": "Courtroom"
    },
    {
      "text": "Fans",
      "page": "Fan"
    },
    {
      "text": "Carl Pavano",
      "page": "Carl_Pavano"
    },
    {
      "text": "booing",
      "page": "Booing"
    },
    {
      "text": "Anthony Volpe",
      "page": "Anthony_Volpe"
    },
    {
      "text": "American League Division Series",
      "page": "American_League_Division_Series"
    },
    {
      "text": "O Canada",
      "page": "O_Canada"
    },
    {
      "text": "The Notorious B.I.G.",
      "page": "The_Notorious_B.I.G."
    },
    {
      "text": "Pop Smoke",
      "page": "Pop_Smoke"
    },
    {
      "text": "A Boogie Wit da Hoodie",
      "page": "A_Boogie_wit_da_Hoodie"
    },
    {
      "text": "hip-hop",
      "page": "Hip_hop_music"
    },
    {
      "text": "history",
      "page": "History"
    },
    {
      "text": "dating",
      "page": "Dating"
    },
    {
      "text": "Mel Allen",
      "page": "Mel_Allen"
    },
    {
      "text": "Red Barber",
      "page": "Red_Barber"
    },
    {
      "text": "broadcasting",
      "page": "Broadcasting"
    },
    {
      "text": "1987",
      "page": "1987"
    },
    {
      "text": "2013",
      "page": "2013"
    },
    {
      "text": "Suzyn Waldman",
      "page": "Suzyn_Waldman"
    },
    {
      "text": "Dave Sims",
      "page": "Dave_Sims"
    },
    {
      "text": "WPIX",
      "page": "WPIX"
    },
    {
      "text": "MSG Network",
      "page": "MSG_Network"
    },
    {
      "text": "2002",
      "page": "2002"
    },
    {
      "text": "Cablevision",
      "page": "Cablevision"
    },
    {
      "text": "Emmy Awards",
      "page": "Emmy_Awards"
    },
    {
      "text": "ESPN",
      "page": "ESPN"
    },
    {
      "text": "Fox Sports",
      "page": "Fox_Sports"
    },
    {
      "text": "Sunday Night Baseball",
      "page": "Sunday_Night_Baseball"
    },
    {
      "text": "J Sports",
      "page": "J_Sports"
    },
    {
      "text": "Masahiro Tanaka",
      "page": "Masahiro_Tanaka"
    },
    {
      "text": "Del Webb",
      "page": "Del_Webb"
    },
    {
      "text": "Yankee Global Enterprises",
      "page": "Yankee_Global_Enterprises"
    },
    {
      "text": "limited liability company",
      "page": "Limited_liability_company"
    },
    {
      "text": "Hal Steinbrenner",
      "page": "Hal_Steinbrenner"
    },
    {
      "text": "Brian Cashman",
      "page": "Brian_Cashman"
    },
    {
      "text": "senior",
      "page": "Senior"
    },
    {
      "text": "Randy Levine",
      "page": "Randy_Levine"
    },
    {
      "text": "payrolls",
      "page": "Payroll"
    },
    {
      "text": "tax",
      "page": "Tax"
    },
    {
      "text": "luxury tax",
      "page": "Luxury_tax"
    },
    {
      "text": "revenue sharing",
      "page": "Revenue_sharing"
    },
    {
      "text": "Fay Vincent",
      "page": "Fay_Vincent"
    },
    {
      "text": "Brad Ausmus",
      "page": "Brad_Ausmus"
    },
    {
      "text": "catcher",
      "page": "Catcher"
    },
    {
      "text": "Mike Harkey",
      "page": "Mike_Harkey"
    },
    {
      "text": "OPS",
      "page": "Ops"
    },
    {
      "text": "Tommy John",
      "page": "Tommy_John"
    },
    {
      "text": "surgery",
      "page": "Surgery"
    },
    {
      "text": "second baseman",
      "page": "Second_baseman"
    },
    {
      "text": "Miami Marlins",
      "page": "Miami_Marlins"
    },
    {
      "text": "Silver Slugger Award",
      "page": "Silver_Slugger_Award"
    },
    {
      "text": "Bill Dickey",
      "page": "Bill_Dickey"
    },
    {
      "text": "Roger Maris",
      "page": "Roger_Martin"
    },
    {
      "text": "Phil Rizzuto",
      "page": "Phil_Rizzuto"
    },
    {
      "text": "Elston Howard",
      "page": "Elston_Howard"
    },
    {
      "text": "Rookie",
      "page": "Rookie"
    },
    {
      "text": "International League",
      "page": "International_League"
    },
    {
      "text": "Somerset Patriots",
      "page": "Somerset_Patriots"
    },
    {
      "text": "High-A",
      "page": "High-A"
    },
    {
      "text": "Hudson Valley Renegades",
      "page": "Hudson_Valley_Renegades"
    },
    {
      "text": "South Atlantic League",
      "page": "South_Atlantic_League"
    },
    {
      "text": "Tampa Tarpons",
      "page": "Tampa_Tarpons"
    },
    {
      "text": "Florida State League",
      "page": "Florida_State_League"
    },
    {
      "text": "Florida Complex League",
      "page": "Florida_Complex_League"
    },
    {
      "text": "Domínguez",
      "page": "Jasson_Domínguez"
    },
    {
      "text": "Dominican Republic",
      "page": "Dominican_Republic"
    },
    {
      "text": "Boca Chica",
      "page": "Boca_Chica"
    },
    {
      "text": "American League East",
      "page": "American_League_East"
    },
    {
      "text": "tiebreaker",
      "page": "Tiebreaker"
    },
    {
      "text": "rivalry",
      "page": "Rivalry"
    },
    {
      "text": "Green Monster",
      "page": "Green_Monster"
    },
    {
      "text": "2021",
      "page": "2021"
    },
    {
      "text": "2000 World Series",
      "page": "2000_World_Series"
    },
    {
      "text": "interleague play",
      "page": "Interleague_play"
    },
    {
      "text": "Citi Field",
      "page": "Citi_Field"
    },
    {
      "text": "fastball",
      "page": "Fastball"
    },
    {
      "text": "inning",
      "page": "Inning"
    },
    {
      "text": "Joe Brinkman",
      "page": "Joe_Brinkman"
    }
  ],
  "fetched_at": "2025-12-07T07:25:35.446692",
  "elapsed_ms": 688384
}