{
  "topic": "New England Patriots",
  "title": "New England Patriots",
  "slug": "new-england-patriots",
  "grokipedia_slug": "New_England_Patriots",
  "grokipedia_url": "https://grokipedia.com/page/New_England_Patriots",
  "source": "grokipedia",
  "content": "# New England Patriots\n\nThe New England Patriots are a professional American football team based in Foxborough, Massachusetts, that competes in the National Football League (NFL) as a member of the American Football Conference (AFC) East division. Founded on November 16, 1959, as the Boston Patriots, the franchise was one of eight original teams in the American Football League (AFL) and commenced play in 1960. Following the 1970 AFL-NFL merger, the team joined the NFL and relocated to Foxborough in 1971, adopting the name New England Patriots to reflect its broader regional identity.\n\nThe Patriots have achieved remarkable success, particularly in the modern era, with an all-time regular-season record of 556–448–9 as of December 2, 2025, and a playoff record of 37–22. They hold the NFL record with 11 Super Bowl appearances and are tied for the most championships with six victories, won in Super Bowls XXXVI (2001), XXXVIII (2003), XXXIX (2004), XLIX (2014), LI (2016), and LIII (2018). This dominance is largely attributed to the 2000–2023 tenure of head coach Bill Belichick, who compiled a 297–134 regular-season record—making him the winningest coach in franchise history—and quarterback Tom Brady, who set NFL records for career passing yards (89,214) and touchdown passes (649), including 80,133 yards and 581 touchdowns during his Patriots career. The franchise, owned by Robert Kraft since 1994, plays home games at Gillette Stadium, which opened in 2002 and has a capacity of 65,878.\n\nEarly in their history, the Patriots struggled for consistency, posting a 30–61–4 record in the AFL from 1960 to 1969 and reaching only one AFL Championship Game in 1963, which they lost to the San Diego Chargers. Post-merger challenges persisted through the 1980s and 1990s, including a Super Bowl XX appearance in 1985 (a 46–10 loss to the Chicago Bears) and Super Bowl XXXI in 1996 (a 35–21 loss to the Green Bay Packers) under coach Bill Parcells. The team's fortunes transformed in the early 2000s with Belichick's defensive-minded philosophy and Brady's emergence, culminating in a dynasty that included three championships in four years (2001–2004) and back-to-back 11-win seasons multiple times. Notable achievements also include 22 division titles, the most in the NFL, and a league-record 21-game winning streak from 2003 to 2004.\n\nIn recent years, following Belichick's departure after the 2023 season and Brady's move to the Tampa Bay Buccaneers in 2020, the Patriots have undergone a rebuilding phase, finishing 4–13 in 2024 under head coach Jerod Mayo. In 2025, under new head coach Mike Vrabel, the team holds a 11–2 record as of December 2, led by rookie quarterback Drake Maye, signaling potential resurgence in the post-dynasty era. The Patriots' colors are navy blue, red, and silver, with their logo featuring a blue silhouette of a minuteman in a tricorn hat, symbolizing New England's revolutionary heritage.\n## History\n\n### AFL origins and early challenges (1960–1969)\n\nThe Boston Patriots were founded as the eighth and final franchise of the American Football League (AFL) when a group led by William \"Billy\" Sullivan Jr. was awarded the team on November 16, 1959. The franchise began play in 1960 as a charter member of the AFL, with Sullivan serving as the primary owner and general manager. The team's name, selected on February 20, 1960, from a public contest with over 74,000 entries, was chosen to evoke Boston's pivotal role in the American Revolution, symbolizing the colonists who rebelled against British rule. Home games during the decade were held at multiple venues due to the lack of a dedicated stadium, starting at Boston University's Nickerson Field from 1960 to 1962, moving to Fenway Park from 1963 to 1968, and concluding at Boston College's Alumni Stadium in 1969.\n\nLou Saban was hired as the franchise's first head coach on February 8, 1960, leading the team through its inaugural 1960 season and into 1961 before being fired midseason. Key early contributors included quarterback Babe Parilli, who joined in 1961 and became a three-time AFL All-Star while passing for over 2,000 yards in multiple seasons, and running back Larry Garron, the team's first AFL All-Star in 1961 who rushed for more than 700 yards that year and excelled as a receiving back. The 1960 season ended with a 5-9 record, placing last in the AFL Eastern Division and marking a challenging debut marked by defensive inconsistencies that allowed 349 points. The team showed improvement in 1961 with a 7-7 finish but regressed in subsequent years, posting a 9-4-1 record in 1962 under interim coach Mike Holovak—its first winning season—yet failing to qualify for the playoffs.\n\nThe Patriots' only playoff appearance in the decade came in 1963, when a 7-6-1 regular-season record secured the Eastern Division title; however, they suffered a decisive 51-10 loss to the San Diego Chargers in the AFL Championship Game on January 5, 1964, at Balboa Stadium, where Chargers running back Keith Lincoln rushed for 182 yards and two touchdowns. Subsequent seasons highlighted ongoing struggles, including a league-worst 3-10-1 mark in 1967 amid coaching instability and poor performance, with no further playoff berths through 1969's 4-10 finish. Financial difficulties plagued the franchise, exacerbated by low initial attendance averaging 16,894 per game in 1960 in the competitive Boston market, though it improved to 28,522 by 1964; Sullivan's group operated on a modest $25,000 investment, contributing to broader AFL financial strains that prompted merger talks. On June 8, 1966, the AFL and NFL announced a merger agreement, effective for the 1970 season, which would integrate the Patriots into the established NFL structure and provide economic stability.\n\n### NFL integration and struggles (1970–1989)\n\nFollowing the 1970 AFL-NFL merger, the Boston Patriots officially integrated into the National Football League as part of the American Football Conference's East Division, marking the end of their American Football League era and the beginning of a challenging transition period. In 1971, amid ongoing financial pressures and threats of relocation to cities like Memphis or Birmingham, team founder and owner William \"Billy\" Sullivan Jr. opted to rebrand the franchise as the New England Patriots to broaden its regional appeal across the six-state area and secure local support that ultimately kept the team in the Boston vicinity. The move to Foxborough, Massachusetts, that same year addressed venue instability, with home games shifting to the newly constructed Schaefer Stadium (capacity 60,764), which was later renamed Sullivan Stadium in 1983 to honor the owning family after the sponsor Anheuser-Busch opted for a familial tribute. Under Sullivan's ownership, which dated back to the team's 1960 founding, the Patriots grappled with inconsistent performance and limited resources, compiling an overall regular-season record of 148–147–1 across 296 games from 1970 to 1989, reflecting persistent struggles to establish competitiveness in the expanded NFL.\n\nThe team cycled through several head coaches during this era, including Chuck Fairbanks (1973–1978), who brought some stability with a 46–41 record but departed amid controversy for the University of Colorado, and Ron Erhardt (1979–1981), whose tenure yielded a 21–27 mark amid defensive promise but offensive inconsistencies. Standout players provided occasional highlights, such as kicker and wide receiver Gino Cappelletti, who transitioned to broadcasting after his playing career, and offensive guard John Hannah, whose dominance at the line—earning him eight Pro Bowl selections and a spot in the Pro Football Hall of Fame in 1991—anchored the offense through much of the decade. Despite these talents, the Patriots managed only five playoff appearances in the period, all ending in defeats: a 24–21 Wild Card loss to the Oakland Raiders in 1976 after an 11–3 regular season and AFC East title; a 17–14 Divisional Round defeat to the Houston Oilers in 1978; a 26–14 Wild Card loss to the New York Jets in 1982; a 31–14 Divisional Round exit against the Raiders in 1985; and a 27–7 Wild Card defeat to the Denver Broncos in 1986. These limited successes underscored broader challenges, including the 1982 players' strike that shortened the season to nine games and the 1987 strike that reduced it to 15, disrupting momentum and contributing to erratic results.\n\nA notable early controversy emerged in the 1982 \"Snowplow Game\" against the Miami Dolphins at Schaefer Stadium, where a snowplow—directed by team personnel—cleared a path for kicker John Smith's game-winning 33-yard field goal in a 3–0 victory, sparking league scrutiny over unsportsmanlike conduct and foreshadowing future integrity issues. By the late 1980s, escalating financial woes, including stadium debt and failed expansion plans, forced Sullivan to sell the franchise in October 1988 to entrepreneur Victor Kiam for $84 million, ending his 28-year stewardship and signaling a potential shift amid ongoing on-field mediocrity.\n\n### Rebuilding and initial success (1990–1999)\n\nThe New England Patriots entered the 1990s amid significant instability, following a dismal 1–15 record in 1990 under head coach Rod Rust, marking the worst season in franchise history. This poor performance led to further coaching changes, with Dick MacPherson taking over in 1991 and guiding the team to a 6–10 finish in 1991 and another 2–14 mark in 1992, highlighting ongoing struggles with talent and consistency. The arrival of Bill Parcells as head coach in 1993 initiated a turnaround, as he instilled discipline and strategic focus, building on the foundation laid by his predecessor Raymond Berry, who had coached from 1984 to 1989 and emphasized a pass-oriented offense during the late 1980s. Under Parcells, the Patriots improved to 5–11 in his debut season, setting the stage for sustained progress.\n\nA pivotal shift occurred in 1994 when James Orthwein sold the franchise to Robert Kraft for $172 million, the highest price ever paid for an NFL team at the time, ensuring the team's stability in New England after threats of relocation. Kraft's ownership brought immediate investments, including a $10 million renovation of Foxboro Stadium—where the team had played since moving there in 1971—to enhance fan experience and facilities. That year, bolstered by Parcells' leadership, the Patriots achieved a 10–6 record and earned their first playoff berth since 1986 via the wild card, though they fell 20–13 to the Cleveland Browns in the AFC Wild Card game. Key to this resurgence was the 1993 NFL Draft, where the Patriots selected quarterback Drew Bledsoe first overall, injecting youth and potential into the offense as he threw for over 4,500 yards in his rookie year of 1993 and became the face of the franchise. The 1995 draft further strengthened the defense with cornerback Ty Law selected in the first round, who quickly emerged as a shutdown player and Pro Bowl talent.\n\nThe mid-1990s marked the Patriots' most successful stretch of the decade, with the team posting an 11–5 record in 1996 to claim the AFC East division title and advance to Super Bowl XXXI, where they lost 35–21 to the Green Bay Packers despite a competitive effort led by Bledsoe and a stout defense. This appearance capped a remarkable improvement from the 1–15 low of 1990, reflecting Parcells' impact in fostering a winning culture through rigorous preparation and roster building. The Patriots followed with another AFC East title in 1997 at 10–6 under new head coach Pete Carroll, who succeeded Parcells after his abrupt resignation on January 31, 1997, following contract disputes and his desire to pursue other opportunities, ending a tenure that included 32 regular-season wins. In 1998, the team extended their playoff streak to three consecutive years with a 9–7 wild card qualification, defeating the Jacksonville Jaguars 25–10 before losing in the divisional round, solidifying the era's foundation of competitiveness despite not repeating as division champions.\n\n### Dynastic era under Belichick and Brady (2000–2019)\n\nThe New England Patriots' dynastic era commenced with the hiring of Bill Belichick as head coach on January 27, 2000, replacing Pete Carroll after a disappointing 8-8 season in 1999. Belichick, who had previously served as defensive coordinator for the team in 1996, brought a defensive-minded philosophy and meticulous preparation that would define the franchise's success. His first season resulted in a 5-11 record, but it laid the groundwork for transformation through roster evaluation and strategic planning.\n\nThe pivotal shift occurred in the 2001 season when starting quarterback Drew Bledsoe suffered a severe hemothorax injury in Week 2 against the New York Jets, sidelining him for much of the year. Sixth-round draft pick Tom Brady, selected 199th overall in 2000, entered the game in relief and assumed the starting role, leading the Patriots to an 11-5 regular-season record and their first Super Bowl victory in XXXVI against the St. Louis Rams. This unexpected quarterback transition marked the beginning of the Belichick-Brady partnership, renowned for its adaptability, film study, and emphasis on situational football. The controversial \"Tuck Rule\" call during the divisional playoff win over the Oakland Raiders—where a fumble by Brady was ruled an incomplete pass—propelled them forward and became a defining moment in the era's narrative.\n\nUnder Belichick and Brady, the Patriots amassed six Super Bowl championships—XXXVI (2001 season), XXXVIII (2003), XXXIX (2004), XLIX (2014), LI (2016), and LIII (2018)—along with nine AFC Championship appearances. They secured 17 AFC East division titles across the 19 seasons from 2000 to 2019, compiling a regular-season record of 237-83. The team's success stemmed from Belichick's drafting acumen and player development, exemplified by selections like defensive tackle Vince Wilfork in the first round of the 2004 NFL Draft, who anchored the defensive line for over a decade, and defensive end Chandler Jones in the first round of 2012, who contributed to a resurgent pass rush. Standout performances included the 2007 season's perfect 16-0 regular-season mark, setting NFL records for points scored (589) before a Super Bowl XLII loss to the New York Giants, and the 2011 campaign's 13-3 record, which featured a high-powered offense and another Super Bowl berth. In 2002, the Patriots upgraded their home venue to Gillette Stadium, a 65,878-seat facility in Foxborough, Massachusetts, which hosted their continued dominance and enhanced fan experience with modern amenities. The era's intensity was highlighted by rivalries, such as the high-stakes AFC matchups against the Indianapolis Colts led by Peyton Manning.\n\n### Transition and decline (2020–2023)\n\nThe departure of longtime quarterback Tom Brady marked the beginning of a transitional era for the New England Patriots. After 20 seasons with the team, Brady announced his exit via social media on March 17, 2020, and signed a two-year contract with the Tampa Bay Buccaneers shortly thereafter.\n\nThe 2020 season, the first without Brady since 1999, saw the Patriots struggle under veteran quarterback Cam Newton, finishing with a 7-9 record and missing the playoffs for the first time in over a decade. The team ranked near the bottom of the league in scoring offense, managing just 20.4 points per game, while the defense allowed 22.1 points per game.\n\nSeeking stability at quarterback, the Patriots selected Mac Jones from the University of Alabama with the 15th overall pick in the 2021 NFL Draft. Jones, a pocket passer with a strong college resume, quickly adapted to the NFL, leading the team to a 10-7 record in his rookie year and earning a wild card playoff berth. However, New England fell in the wild card round to the Buffalo Bills, 47-17.\n\nThe momentum from 2021 faded in 2022, as the Patriots regressed to an 8-9 finish, again missing the postseason and placing third in the AFC East. The defense provided a solid foundation, bolstered by edge rusher Matt Judon—who had been acquired as a free agent in 2021 for a four-year, $56 million deal—and finished 11th in the league by allowing 20.4 points per game. Offensively, however, inconsistencies persisted, with the unit ranking 17th in points scored at 21.4 per game.\n\nThe 2023 campaign represented the nadir of the decline, as head coach Bill Belichick entered his 24th season with the franchise but oversaw a dismal 4-13 record, the team's worst since 2000 and a last-place finish in the AFC East. While the defense held firm, ranking 17th in points allowed at 21.5 per game, the offense faltered badly, scoring a league-worst 13.9 points per game and totaling just 236 points for the season.\n\nOwnership under Robert Kraft provided continuity during this stretch, with no shifts in front-office leadership despite the on-field downturns. Attendance at Gillette Stadium remained strong but experienced a slight decline in 2023, averaging 64,628 fans per home game amid the poor performance—below the venue's capacity of approximately 65,878.\n\n### Post-dynasty rebuild (2024–present)\n\nFollowing the 2023 season, in which the Patriots finished with a 4-13 record, owner Robert Kraft decided to part ways with longtime head coach Bill Belichick after 24 years with the franchise. Kraft announced the move on January 11, 2024, citing the need for a fresh start amid the team's ongoing struggles. To succeed Belichick, the Patriots promoted linebackers coach Jerod Mayo, a former player for the team from 2008 to 2015, to the head coaching position on January 12, 2024. Mayo, aged 36 at the time, became the youngest head coach in the NFL and inherited a roster in transition.\n\nUnder Mayo, the 2024 season proved challenging, with the Patriots compiling a 4-13 record and finishing last in the AFC East for the fourth consecutive year. The team struggled offensively, ranking 30th in points scored at 17.0 per game, while defensive lapses contributed to allowing 24.5 points per contest. A highlight came in Week 18 with an upset victory over the Buffalo Bills, but it was insufficient to alter the season's trajectory or secure a higher draft position. On January 5, 2025, shortly after the finale, the Patriots fired Mayo after his lone season, matching the shortest tenure of any head coach in franchise history. In response to the poor performance and prior criticisms of team facilities in the NFL Players Association's 2024 report card, Kraft announced a $50 million investment in a new state-of-the-art workout facility adjacent to Gillette Stadium, with groundbreaking occurring in December 2024 to support the ongoing rebuild.\n\nOn January 12, 2025, the Patriots hired Mike Vrabel, a former defensive end who played for New England from 2001 to 2008 and contributed to three Super Bowl victories, as their 16th head coach. Vrabel, who had previously led the Tennessee Titans to a 56-48 record from 2018 to 2023 including two division titles, brought a proven track record of building competitive defenses. Early in his tenure, Vrabel assembled a staff featuring offensive coordinator Josh McDaniels and defensive coordinator Terrell Williams, emphasizing continuity on defense while revamping the offense. The 2025 season has shown marked improvement, with the team achieving a 7-2 record through nine games as of November 19, placing them first in the AFC East. Offensively, the Patriots have surged to seventh in the league at 26.3 points per game, driven by quarterback Drake Maye, selected third overall in the 2024 NFL Draft out of North Carolina. Maye's development has been pivotal, providing stability at the position previously plagued by inconsistency. The defense, maintaining core elements from prior years, ranks sixth in points allowed at 18.8 per game, underscoring Vrabel's influence.\n\nThe rebuild under Vrabel has centered on integrating young talent, highlighted by the 2024 draft class led by Maye and bolstered by free agency additions such as edge rusher Harold Landry on a three-year deal, reuniting him with Vrabel from their Titans days. Other key moves include signing defensive tackle Milton Williams and linebacker Robert Spillane to multi-year contracts, enhancing the front seven while prioritizing youth development over veteran acquisitions. New quarterback options, including Maye's emergence and backup depth, have addressed long-standing concerns at the position. This youth-focused approach, combined with the facility upgrades, signals a commitment to sustainable contention beyond the dynasty era.\n\n## Identity\n\n### Name, logos, and symbols\n\nThe New England Patriots originally entered the American Football League as the Boston Patriots in 1960, named through a fan contest to evoke the region's revolutionary heritage. Following the AFL-NFL merger in 1970 and a relocation from Boston to Foxborough, Massachusetts, the team rebranded as the New England Patriots in 1971 to represent a broader regional identity and appeal to fans across the six-state area.\n\nThe team's primary logo has evolved to emphasize its patriotic theme, beginning with a simple blue tricorn hat on a white background in 1960, designed by fan Walter Pingree. This was replaced in 1961 by the \"Pat Patriot\" logo, a cartoon depiction of a minuteman in Revolutionary War attire preparing to snap a football, created by Boston Globe cartoonist Phil Bissell and used until 1992. In 1993, the Patriots introduced the current primary logo, known as the \"Flying Elvis,\" a streamlined silhouette of a minuteman in a tricorn hat leaping forward with a football, designed for simplicity and modern appeal; it has remained largely unchanged, though accompanying wordmarks were refined in uniform updates in 2020. Alternate logos include the original tricorn hat and various minuteman illustrations, often used in commemorative or throwback contexts to reinforce the team's colonial symbolism.\n\nThe Patriots' official colors are nautical navy blue, victory red, new century silver, and white, adopted to reflect New England's maritime and revolutionary history; navy replaced royal blue in 2000 for a more subdued tone. These colors appear prominently in the primary logo and branding elements. The team's identity draws heavily from the American Revolution, with symbols like minutemen and tricorn hats symbolizing resilience and independence; at Gillette Stadium, the end zones feature the \"Patriots\" wordmark and logo in designs that incorporate revolutionary motifs, such as period-inspired fonts during throwback games.\n\n### Uniforms and alternate designs\n\nFrom their founding in 1960 through 1992, the New England Patriots primarily wore red jerseys with white pants, complemented by silver helmets featuring a single red stripe down the center. The design included evolving shoulder or sleeve stripes in white, blue, and red, with the \"Pat Patriot\" logo positioned on the helmets and outer shoulders starting in 1961.\n\nIn 1993, the team shifted to royal blue as the primary color, introducing blue jerseys with red and white numbers, silver pants, and matching silver helmets. White road jerseys were added in 1994, and by 1995, the uniforms incorporated italicized names and numbers, pinstripes on the jerseys, and repositioned sleeve numbers for a more streamlined look.\n\nThe 2000 season marked a transition to navy blue jerseys paired with silver pants for home games and white road jerseys with navy pants, a combination that defined the team's look through 2019. During this era, the uniforms featured bold, block-style numbering without italics, and silver pants were gradually supplemented by all-navy options.\n\nIn 2020, the Patriots adopted a simplified primary uniform design, retaining the navy home jerseys but standardizing navy pants as the default, with tweaks to the block fonts for the \"PATs\" wordmark and numbers to enhance readability. The white road jerseys received subtle updates, including color-blocked socks with red and blue stripes.\n\nFor alternate designs, the team has frequently employed throwback red jerseys inspired by the 1960s era, first introduced in 2002 and revived periodically, including from 2009 to 2012 and again starting in 2022 for select games. The all-navy Color Rush uniforms, featuring white numbers with red outlines, debuted in 2016 as part of the NFL's initiative and became the basis for the 2020 home design. In 2025, the Patriots introduced the \"Nor'easter\" alternate uniforms—a deep storm blue ensemble with matte white helmets, silver facemasks, and subtle red accents—for use in rivalry games, drawing inspiration from New England's maritime heritage and 1990s designs. The team currently does not utilize black alternate uniforms.\n\n## Facilities\n\n### Stadiums and home venues\n\nThe New England Patriots began their franchise history playing home games at several temporary venues in the Boston area during their inaugural AFL seasons. From 1960 to 1962, the team, then known as the Boston Patriots, played at Nickerson Field (also referred to as BU Field) on the Boston University campus, a modest facility originally built for baseball as Braves Field in 1915 and later repurposed for football. In 1963, the Patriots moved to Fenway Park, the iconic home of the Boston Red Sox, where they played through the 1968 season, adapting the baseball stadium for football with temporary seating and field configurations to accommodate AFL crowds. The team returned to a college venue in 1970, playing their final season as the Boston Patriots at Harvard Stadium in Cambridge, Massachusetts, a historic site completed in 1903 that seated about 30,300 for football.\n\nIn 1971, following the AFL-NFL merger and a name change to the New England Patriots, the team relocated to Foxboro Stadium in Foxborough, Massachusetts, which served as their home until 2001. Originally built in 1971 at a cost of $3.5 million and expanded multiple times, the stadium had a capacity of approximately 60,292 by the 1980s, making it one of the larger venues in the NFL at the time. Foxboro Stadium hosted significant playoff games, including the 1996 AFC Championship on January 12, 1997, where the Patriots defeated the Jacksonville Jaguars 20-6 to advance to Super Bowl XXXI. Despite its role in the team's early NFL years, the aging facility lacked modern amenities, prompting calls for replacement amid the league's stadium boom.\n\nGillette Stadium opened in 2002 adjacent to the site of the former Foxboro Stadium, marking a new era for the Patriots under owner Robert Kraft, who privately financed the $325 million construction project without public taxpayer funds. Designed by the architectural firm Populous, the open-air stadium initially seated 68,756 fans, though capacity has since been adjusted to 64,628, including 5,876 club seats and 92 luxury suites. A signature feature is the 11-story lighthouse structure at the south end zone, standing 218 feet tall and adorned with video scoreboards that evoke New England's maritime heritage, enhancing the game-day atmosphere for Patriots and New England Revolution matches.\n\nOngoing enhancements have kept Gillette Stadium at the forefront of NFL venues. Between 2018 and 2020, upgrades included expanded premium suites, improved fan circulation areas, and enhancements to video display systems for better in-game visuals. More transformative work followed, with a $250 million north end zone renovation completed in 2023, adding the largest outdoor curved-radius videoboard in North America (22,200 square feet), new premium lounges, and a revamped lighthouse with a public 360-degree observation deck. These improvements, fully funded by the Kraft family, have boosted the stadium's versatility for NFL games, concerts, and events while maintaining its core identity.\n\n### Training camps and practice facilities\n\nThe New England Patriots have utilized various locations across New England for their training camps since the franchise's inception as the Boston Patriots in 1960. The team's inaugural training camp was held at the University of Massachusetts in Amherst in 1960 and 1961, accommodating an initial roster of 350 players. From 1962 to 1968, camps shifted to Phillips Academy in Andover, Massachusetts, providing a structured academic environment for offseason preparation. Between 1969 and 1975, the Patriots returned to the University of Massachusetts in Amherst for their summer sessions, leveraging the campus's facilities during a period of franchise transition.\n\nIn 1976, the team established a long-term partnership with Bryant College (renamed Bryant University in 2004) in Smithfield, Rhode Island, hosting annual training camps there through 2002. This 27-year stint at Bryant allowed for consistent access to dedicated athletic fields and dormitories, fostering team bonding away from urban distractions. Following the opening of Gillette Stadium, the Patriots relocated their training camp to Foxborough, Massachusetts, in 2003, marking the first time the entire preseason preparation occurred on-site at their permanent home facilities. This move centralized operations and eliminated travel logistics, with all subsequent camps—including the 2025 session—held at the Gillette complex.\n\nThe current training facilities at Gillette Stadium in Foxborough feature three outdoor grass practice fields located behind the stadium, planned to be redesigned with new FieldTurf CORE surfaces as part of the new training facility project set for completion in spring 2026, to enhance durability and player safety. Adjacent to these is the Dana-Farber Field House, a 250-by-350-foot indoor practice facility that serves as a climate-controlled dome for year-round workouts, conditioning drills, and protection from inclement weather. These amenities support daily practices, special teams sessions, and joint workouts, such as the 2025 joint practices with the Washington Commanders.\n\nIn response to a poor evaluation in the NFL Players Association's 2023 facility report card, which graded the Patriots' training spaces as among the league's lowest, owner Robert Kraft committed to major enhancements. Construction began in December 2024 on a new three-level, football-exclusive training center adjacent to Gillette Stadium, set to open in spring 2026 and more than doubling the existing footprint. This $100 million-plus project includes expanded recovery areas with cold plunges and hot tubs, advanced nutrition centers, virtual reality analytics labs for film study and skill development, and upgraded rehabilitation rooms to optimize player performance and injury prevention. A ceremonial topping-off occurred in May 2025, underscoring the facility's role in modernizing the team's preparation infrastructure.\n\nThe Patriots' headquarters, operational since 2002 at 1 Patriot Place in Foxborough, is integrated into the Gillette Stadium complex and oversees key football operations including scouting, player personnel evaluations, and administrative functions. This central hub facilitates year-round coordination between coaching staff, medical teams, and executives, with the forthcoming training center incorporating dedicated administrative offices to further streamline these activities.\n\n## Culture\n\n### Fanbase and traditions\n\nThe New England Patriots boast one of the largest fanbases in the NFL, with over 11.5 million supporters in the United States as of 2019, ranking second only to the Dallas Cowboys among American fans. This dedicated following is particularly concentrated in the New England region, where the team draws strong local loyalty, but has expanded globally following their dynasty era, with the franchise amassing over 17 million followers across social media platforms as of early 2025. Fans often refer to themselves collectively as \"Pats Nation,\" a moniker embraced by the organization and used in official communications to highlight the widespread enthusiasm for the team.\n\nPatriots traditions emphasize communal rituals that foster a sense of unity among supporters. The iconic \"Let’s Go Pats\" chant echoes through Gillette Stadium and fan gatherings, serving as a rallying cry during games and events to energize the crowd. Tailgating at Gillette Stadium is a hallmark pre-game activity, with parking lots opening four hours before kickoff to allow fans to set up grills, display team flags, and share meals in a festive atmosphere that builds excitement for home games.\n\nVictory celebrations have become enduring traditions, particularly during the team's successful dynasty years, exemplified by the massive duck boat parades in Boston. Following their Super Bowl LI triumph in 2017, an estimated one million fans lined the streets despite snowy conditions to cheer the team as it rolled through the city on amphibious duck boats, a format that has been repeated for subsequent championships and symbolizes regional pride.\n\nFan loyalty is evident in consistent high attendance and viewership metrics, underscoring the fanbase's commitment even beyond peak success periods. Gillette Stadium has maintained an average home attendance exceeding 65,000 per game, with figures around 65,878 during the 2021 season, reflecting near-capacity crowds for regular-season matchups. During Super Bowl runs, Patriots games dominated television ratings; for instance, Super Bowl LI in 2017 drew an average of 111.3 million viewers, marking one of the most-watched broadcasts in U.S. history at the time.\n\nThe team's community ties further enhance fan engagement through the New England Patriots Foundation, established by owner Robert Kraft in 1994 to support local causes in Massachusetts and beyond. The foundation leverages fan involvement via donation drives and events, such as annual galas and player-led initiatives, which have raised millions for youth programs and health services, strengthening the bond between the franchise and its supporters.\n\n### Cheerleaders, mascot, and team symbols\n\nThe New England Patriots Cheerleaders serve as the official cheerleading squad for the team, performing energetic routines at home games held at Gillette Stadium to energize the crowd and support the players. The squad has a rich history, with archival photos and exhibits showcasing their presence from the 1960s onward, including uniforms and performances that have evolved alongside the franchise. Formed in 1971, the group has grown into a professional ensemble of dancers and performers who also engage in community outreach and special events beyond game days.\n\nIn addition to their on-field duties, the cheerleaders undertake annual military tours to boost morale among U.S. troops stationed overseas, visiting bases in regions such as the Persian Gulf, Afghanistan, and Europe to deliver shows and meet-and-greets. These tours, often timed around holidays, highlight the squad's commitment to honoring service members through patriotic performances. At home games, they contribute to halftime shows featuring dynamic dance numbers infused with themes inspired by American Revolutionary history, reflecting the team's New England heritage and minuteman symbolism.\n\nThe cheerleaders produce an annual calendar that captures their performances and off-field activities, with launch events held at Gillette Stadium to engage fans and support team initiatives. Philanthropy forms a core part of their role, including participation in charity fundraisers, virtual fitness classes to raise funds for community causes, and events like the Patriots Foundation's holiday programs where they interact with children and distribute gifts. Over the years, the squad has transitioned from early iterations focused on basic game support to a co-ed professional group, incorporating male performers since 2019 and emphasizing diverse talents in dance and outreach.\n\nPat Patriot, the team's longstanding mascot, is a costumed character portrayed as a Revolutionary War minuteman, complete with tricorn hat and colonial attire, embodying the franchise's historical roots. Introduced around 1978, Pat has become a fixture at games and events, entertaining fans through high-energy antics, autograph sessions, and photo opportunities that enhance the game-day atmosphere. The mascot also appears in promotional campaigns and community appearances, fostering positive interactions with supporters while tying into the team's patriotic identity.\n\n## Rivalries\n\n### Divisional opponents\n\nThe New England Patriots compete in the AFC East division alongside the Buffalo Bills, Miami Dolphins, and New York Jets, facing each opponent twice annually in a home-and-away format. These matchups, dating back to the teams' origins in the American Football League (AFL) in 1960, have fostered intense rivalries marked by competitive divisional battles and pivotal historical moments.\n\nThe rivalry with the New York Jets traces its roots to the inaugural 1960 AFL season, when both franchises entered the league as charter members—the Boston Patriots and the New York Titans (renamed Jets in 1963). This shared AFL heritage laid the foundation for a contentious relationship that intensified in the modern era, particularly with the 2007 \"Spygate\" scandal, where the NFL fined the Patriots $250,000 and stripped a first-round draft pick after discovering they had videotaped the Jets' defensive signals from an unauthorized sideline location during a Week 1 game. The all-time series stands at 76 wins, 56 losses, and 1 tie in favor of the Patriots (as of November 2025), including three playoff meetings where New England holds a 2-1 edge.\n\nAgainst the Buffalo Bills, the rivalry has featured grueling divisional clashes, highlighted by Buffalo's dominant early-1990s run of four consecutive Super Bowl appearances from 1991 to 1994, during which the Bills won the AFC East each year and the Patriots struggled with a 12-52 record over that span. The Bills' postseason success contrasted sharply with New England's rebuilding efforts, though the Patriots later asserted control, including a 37–11 record against Buffalo since 2001. Overall, the Patriots lead the all-time series 80-51-1, with two playoff victories for New England in the mix.\n\nThe Miami Dolphins rivalry underscores contrasts in team trajectories, notably Miami's undefeated 14-0 regular season in 1972—the only perfect campaign in NFL history—capped by a Super Bowl VII victory, while the Patriots finished 5-9 that year and endured lean years in the 1970s. Tensions escalated during the Dan Marino era in the 1980s and 1990s, with the Hall of Fame quarterback leading high-scoring offenses that challenged New England's defenses, including a 1994 Monday Night Football thriller where Marino threw for 473 yards and five touchdowns in a 33-27 Dolphins win. A infamous 1982 \"Snowplow Game\" added to the animosity, as a snowplow cleared a spot on the Schaefer Stadium field for Patriots kicker John Smith's game-winning field goal in a 3-0 victory amid a blizzard, prompting NFL rule changes to ban such interventions. The Dolphins hold the all-time edge at 64-56, though the teams have split their three playoff encounters 1-2 in New England's favor.\n\nSince 2000, the Patriots have established overwhelming divisional dominance with a 109-48 record against AFC East foes, securing 16 division titles in that span and frequently turning intra-division games into lopsided affairs that underscored their dynasty under head coach Bill Belichick, including seasons where they went 6–0 or 5–1 in divisional play from 2003 to 2019. This era of supremacy shifted the balance of power, with New England winning at least nine of their sixteen divisional games in eleven seasons from 2003 to 2019. In the 2025 season, the Patriots have defeated both the Bills and Jets, signaling renewed intensity in these rivalries during their resurgence.\n\n### Conference and interconference foes\n\nThe New England Patriots' rivalry with the Indianapolis Colts (formerly the Baltimore Colts until 1984) is one of the most prominent in AFC history, largely defined by the quarterback matchup between Tom Brady and Peyton Manning from 2001 to 2015. The two faced off 17 times, with Brady securing an 11–6 record, including victories in the 2003 and 2004 AFC Championships that propelled the Patriots to Super Bowl titles. Overall, the Patriots hold a 53–32 advantage in the all-time series, including five playoff meetings.\n\nThe Baltimore Ravens emerged as a fierce AFC North rival to the Patriots, particularly during the Ray Lewis era (1996–2012), characterized by hard-hitting, defense-dominated contests. The teams have met four times in the playoffs, splitting the results 2–2, with the Ravens defeating the Patriots in the 2012 and 2013 AFC Championships en route to their Super Bowl XLVII victory. Overall, the Patriots lead the series 11–5, including a 9–3 regular-season edge.\n\nAgainst the Pittsburgh Steelers, another AFC powerhouse, the Patriots have a competitive history with five playoff encounters, all in high-stakes games, where New England holds a 4–1 record—including wins in the 2001 and 2004 AFC Championships and the 2016 AFC Championship. The Steelers' lone playoff victory came in the 1997 AFC Divisional Round, a 7–6 defensive struggle. Overall, the Patriots lead the 36-game series 19–17.\n\nOther notable AFC rivalries include the Denver Broncos, against whom the Patriots are 1–4 in playoffs, suffering losses in the 1986 and 2005 AFC Championships (both Broncos wins) as well as the 2015 AFC Championship. The 1976 AFC Divisional Playoff loss to the Oakland Raiders (now Las Vegas Raiders), a 24–21 defeat marked by a controversial late-game touchdown, remains a memorable upset in Patriots history.\n\nAs their primary interconference foe from the NFC, the New York Giants hold a unique place due to two Super Bowl upsets: victories in Super Bowl XLII (2007 season, 17–14) and Super Bowl XLVI (2011 season, 21–17), denying the Patriots perfect seasons and additional championships.\n\n## Management and coaching\n\n### Ownership and executive leadership\n\nThe New England Patriots have been owned by Robert Kraft since 1994, when he acquired the franchise for $172 million in a deal that prevented its relocation to St. Louis and marked the highest price paid for an NFL team at the time. Under Kraft's leadership, the team's value has grown substantially, reaching an estimated $9 billion as of August 2025 according to Forbes valuations.\n\nKraft's ownership has provided long-term stability following the turbulent Sullivan era, during which the founding family faced severe financial difficulties and multiple ownership changes, including sales to Victor Kiam in 1988 and James Orthwein in 1992. The Kraft family maintains deep involvement in operations, with Jonathan Kraft serving as team president since 2005, overseeing strategic planning, departmental management, and league representation.\n\nIn terms of executive leadership, Bill Belichick functioned as the de facto general manager alongside his head coaching duties from 2000 until his departure in January 2024, exerting significant influence over personnel decisions. Following Belichick's exit, Eliot Wolf was elevated to executive vice president of player personnel in May 2024, leading scouting, roster construction, and salary cap management.\n\nKey ownership decisions under the Krafts include the private financing of Gillette Stadium, completed in 2002 at a cost of $325 million entirely funded by the Kraft Group without public subsidies, setting a model for NFL venue development. The family has also prioritized community initiatives, notably through longstanding partnerships with United Way, such as the Character Playbook program that promotes youth education on healthy relationships and the Hometown Huddle events fostering volunteerism.\n\n### Head coaches and coordinators\n\nThe New England Patriots have had 16 head coaches since the franchise's inception in 1960 as the Boston Patriots in the AFL. This high turnover reflects periods of instability, particularly in the early decades, with only three coaches—Mike Holovak (1961–1968), Bill Belichick (2000–2023), and Raymond Berry (1984–1989)—lasting five or more seasons. The team's coaching landscape shifted dramatically after Belichick's departure following the 2023 season, marked by the one-year tenure of Jerod Mayo in 2024 and the hiring of Mike Vrabel in 2025.\n\nBill Belichick holds the franchise record for longevity and success, serving 24 seasons with a regular-season mark of 266–121–0 and leading the Patriots to six Super Bowl victories (XXXVI, XXXVIII, XXXIX, XLIX, LI, LIII). His tenure transformed the Patriots into a dynasty, emphasizing adaptability, player development, and defensive innovation, though the team endured a late decline with consecutive sub-.500 finishes in 2022 and 2023. Earlier, Bill Parcells coached from 1993 to 1996, compiling a 32–32–0 regular-season record and guiding the team to two playoff appearances, including an AFC Championship Game loss in 1996. Parcells instilled a culture of toughness that laid groundwork for future contention.\n\nJerod Mayo, a former Patriots linebacker, succeeded Belichick in 2024 but posted a 4–13–0 record amid offensive struggles and injuries, leading to his dismissal after one season. Mike Vrabel, hired in January 2025, has started strongly with a 9–2–0 record through eleven games as of November 19, 2025, implementing defensive adjustments that have elevated the unit to top-5 rankings in points allowed per game (18.7 points/game). Vrabel's approach focuses on accountability and schematic tweaks, fostering a renewed team identity early in his tenure.\n\n| Coach | Tenure | Regular-Season Record | Playoff Record | Super Bowls |\n|-------|--------|-----------------------|----------------|-------------|\n| Bill Belichick | 2000–2023 | 266–121–0 | 30–12 | 6 |\n| Bill Parcells | 1993–1996 | 32–32–0 | 2–2 | 0 |\n| Jerod Mayo | 2024 | 4–13–0 | 0–0 | 0 |\n| Mike Vrabel | 2025–present | 9–2–0 | 0–0 | 0 |\n\nThe Patriots' coordinator history under Belichick highlighted internal promotions and stability. Josh McDaniels served as offensive coordinator in multiple stints from 2006 to 2021, contributing to eight top-10 offensive rankings and three No. 1 finishes in scoring (2007, 2010, 2012), before returning in 2025. On defense, Romeo Crennel coordinated from 2001 to 2004, overseeing three top-10 units in points allowed and earning praise from Belichick as one of his most effective collaborators. Subsequent defensive coordinators like Dean Pees (2006–2009) and Matt Patricia (2012–2017) maintained the scheme's emphasis on versatility, though Belichick often retained play-calling duties. Under Vrabel in 2025, Terrell Williams serves as defensive coordinator, contributing to the unit's improved performance.\n\n## Players\n\n### Current roster and key contributors\n\nAs of November 19, 2025, the New England Patriots maintain a standard 53-man active roster emphasizing youth and emerging talent following significant roster turnover after the 2024 season, contributing to their strong 9-2 record through eleven games and first-place standing in the AFC East. The team, under head coach Mike Vrabel, has integrated a mix of draft picks, recent free-agent acquisitions, and holdovers to build depth across positions, with an average player age around 25.4 years, reflecting a deliberate shift toward long-term development. This composition has been pivotal in their offensive output of 26.5 points per game (seventh in the NFL) and defensive allowance of 18.3 points per game (sixth in the league).\n\nAt quarterback, second-year starter Drake Maye, selected third overall in the 2024 NFL Draft, has anchored the position with his dual-threat ability, completing 71.9% of passes for 2,836 yards, 20 touchdowns, and 5 interceptions through eleven starts while adding 285 rushing yards and 2 scores. Backing him up is veteran Joshua Dobbs, signed as a free agent in March 2025, who provides experienced depth with his mobility and has appeared in two games this season, completing 12 of 18 passes for 12 yards. Another reserve, Tommy DeVito, rounds out the group on the active roster.\n\nOn offense, key contributors include wide receiver DeMario Douglas, a 2023 undrafted free agent who has emerged as a reliable slot option with 23 receptions for 332 yards and 3 touchdowns, leading the team in yards after catch. Running back Rhamondre Stevenson has been central to the ground game, rushing for 279 yards and 3 touchdowns on 83 carries in eight games before suffering a season-ending injury. Recent free-agent addition Stefon Diggs, acquired in March 2025, has bolstered the receiving corps with 59 catches for 659 yards and 5 touchdowns, providing a veteran presence opposite Douglas.\n\nDefensively, cornerback Christian Gonzalez, a 2023 first-round pick, leads the secondary with his coverage skills, recording 0 interceptions and 43 tackles (33 solo) while holding opponents to a 52.3 passer rating when targeted. The unit has been enhanced by 2025 free-agent signings such as edge rusher Harold Landry III, who has 5.5 sacks and 37 tackles in eleven games, and linebacker Robert Spillane, contributing 90 tackles and 2 interceptions as a rotational leader. Additional edge depth comes from K'Lavon Chaisson, another March signee, with 6.5 sacks. Injuries have tested the depth, including ongoing recovery for players like tight end Austin Hooper (concussion), forcing adjustments in rotations.\n\n### Pro Football Hall of Famers and retired numbers\n\nThe New England Patriots franchise has produced numerous elite talents who have been enshrined in the Pro Football Hall of Fame for their performances while with the team, spanning from the AFL era to the modern NFL. As of 2025, 11 individuals associated with the Patriots have been inducted, including players from both defensive and offensive units as well as a notable coach. These inductees were selected based on their overall career excellence, with their Patriots tenure playing a key role in their accomplishments.\n\n| Name              | Position | Years with Patriots | Induction Year |\n|-------------------|----------|---------------------|----------------|\n| Nick Buoniconti  | LB      | 1962–1968          | 2001          |\n| John Hannah      | G       | 1973–1985          | 1991          |\n| Mike Haynes      | CB      | 1976–1982          | 1997          |\n| Andre Tippett    | LB      | 1982–1993          | 2008          |\n| Curtis Martin    | RB      | 1995–1997          | 2012          |\n| Bill Parcells    | Coach   | 1993–1996          | 2013          |\n| Junior Seau      | LB      | 2006–2009          | 2015          |\n| Randy Moss       | WR      | 2007–2010          | 2018          |\n| Ty Law           | CB      | 1995–2004          | 2019          |\n| Richard Seymour  | DE/DT   | 2001–2008          | 2022          |\n| Darrelle Revis   | CB      | 2014–2016, 2019    | 2023          |\n\nThe Patriots honor their most impactful players by retiring their jersey numbers, a tradition that began in the AFL days and continues today, preventing future players from wearing them. Currently, eight numbers are officially retired, representing a mix of early franchise pioneers and later stars. These retirements recognize lifetime achievements and loyalty to the organization.\n\n| Number | Player            | Position | Years with Patriots | Retired |\n|--------|-------------------|----------|---------------------|---------|\n| 12     | Tom Brady        | QB      | 2000–2019          | 2024   |\n| 20     | Gino Cappelletti | WR/K    | 1960–1970          | 1972   |\n| 40     | Mike Haynes      | CB      | 1976–1982          | 1984   |\n| 57     | Steve Nelson     | LB      | 1974–1987          | 1988   |\n| 73     | John Hannah      | G       | 1973–1985          | 1991   |\n| 78     | Bruce Armstrong  | OT      | 1987–2000          | 2001   |\n| 79     | Jim Lee Hunt     | DT      | 1960–1971          | 1982   |\n| 89     | Bob Dee          | DE      | 1960–1967          | 1967   |\n\n### Notable alumni and draft history\n\nThe New England Patriots have produced several standout alumni beyond those enshrined in the Pro Football Hall of Fame, many of whom played pivotal roles in the franchise's success. Quarterback Drew Bledsoe, selected first overall in the 1993 NFL Draft, led the Patriots to their first Super Bowl appearance in 1996 and holds franchise records for passing yards (29,657) and attempts (4,707) during his tenure from 1993 to 2001, before being traded to the Buffalo Bills. Linebacker Tedy Bruschi, a third-round pick in 1996, anchored the defense for 13 seasons, earning three Pro Bowl nods and contributing to three Super Bowl victories with 1,110 tackles and 12 interceptions. Kicker Adam Vinatieri, originally signed as an undrafted free agent in 1996, became a clutch performer, converting game-winning field goals in Super Bowls XXXVI and XXXVIII and holding the franchise record for points scored by a kicker (1,063). Wide receiver Julian Edelman, another undrafted signee in 2009, emerged as a postseason specialist, amassing 620 receptions for 6,822 yards and earning Super Bowl MVP honors in Super Bowl LIII with 10 catches for 141 yards and a touchdown.\n\nThe Patriots' draft history dates back to their inaugural AFL selection in 1960, with the franchise accumulating over 670 total draft picks through 2024, reflecting a consistent emphasis on roster building through the annual selection process. In the first round alone, the team has made more than 50 selections since 1960, including high-profile choices like running back Jim Plunkett (first overall, 1971) and wide receiver Irving Fryar (first overall, 1984), though outcomes have varied widely. Notable successes include the 2000 draft, where sixth-round pick Tom Brady (199th overall) transformed the franchise, leading to six Super Bowl wins during his 20-year tenure. Conversely, recent drafts have included misses, such as the 2023 selection of guard Cole Strange (29th overall), who was released after underwhelming performance and injuries limited his impact.\n\nDuring Bill Belichick's tenure as head coach and de facto general manager from 2000 to 2023, the Patriots excelled at identifying value in later rounds, prioritizing versatile, high-character players over premium prospects. This approach yielded gems like tight end Rob Gronkowski (second round, 2010) and defensive end Chandler Jones (first round, 2012), contributing to the team's dynasty of six Super Bowl titles. The 2024 draft marked a shift under new leadership, with quarterback Drake Maye selected third overall to address long-term needs at the position following a 4-13 season in 2023. Overall, undrafted free agents and low-round picks have been integral to the Belichick-era success, comprising approximately 30% of key contributors on Super Bowl rosters, exemplified by players like safety Malcolm Butler and center David Andrews who earned starting roles without draft pedigrees.\n\n## Achievements\n\n### Super Bowl and AFC championships\n\nThe New England Patriots have appeared in eleven Super Bowls, winning six and tying the Pittsburgh Steelers for the most victories in NFL history. Their championship era, particularly under head coach Bill Belichick and quarterback Tom Brady from 2001 to 2019, produced all six of those titles and established the franchise as a dynasty with a 6–5 Super Bowl record. The team's first appearance came in the pre-dynasty years, marking a significant milestone for the then-upstart franchise.\n\nThe Patriots' Super Bowl victories began with Super Bowl XXXVI on February 3, 2002, defeating the St. Louis Rams 20–17 on a last-second field goal by Adam Vinatieri, with Tom Brady earning MVP honors for his efficient performance in leading a comeback. Two years later, in Super Bowl XXXVIII on February 1, 2004, they overcame the Carolina Panthers 32–29 in overtime, again with Brady as MVP after a game-tying drive in the final minute set up Vinatieri's winning kick. The following season, Super Bowl XXXIX on February 6, 2005, saw a 24–21 victory over the Philadelphia Eagles, where wide receiver Deion Branch caught 11 passes for 133 yards to secure MVP accolades. After a decade-long gap, the Patriots returned to dominance with Super Bowl XLIX on February 1, 2015, rallying from a 24–14 deficit against the Seattle Seahawks for a 28–24 win, highlighted by an interception at the goal line; Brady claimed his third MVP with 328 passing yards and four touchdowns. In Super Bowl LI on February 5, 2017, they staged the largest comeback in Super Bowl history, erasing a 28–3 deficit to beat the Atlanta Falcons 34–28 in overtime, with Brady earning his fourth MVP after throwing 466 yards and two scores. The dynasty capped with Super Bowl LIII on February 3, 2019, a defensive masterclass shutting down the Los Angeles Rams 13–3, where Julian Edelman was named MVP for 10 receptions and 141 yards.\n\nThe Patriots' five Super Bowl losses include a lopsided defeat in their debut appearance, Super Bowl XX on January 26, 1986, falling 46–10 to the Chicago Bears amid a dominant defensive performance by the opponents. In Super Bowl XXXI on January 26, 1997, they lost 35–21 to the Green Bay Packers, unable to overcome an early deficit despite a solid effort from quarterback Drew Bledsoe. The 2007 season ended in heartbreak during Super Bowl XLII on February 3, 2008, with a 17–14 upset loss to the New York Giants on a final-play helmet catch by David Tyree that derailed a perfect 18–0 campaign. Similarly, Super Bowl XLVI on February 5, 2012, resulted in a 21–17 defeat to the Giants again, capped by Eli Manning's touchdown pass to Victor Cruz. Super Bowl LII on February 4, 2018, saw a 41–33 loss to the Philadelphia Eagles, where backup quarterback Nick Foles orchestrated a late touchdown to seal the upset.\n\nTo reach these Super Bowls, the Patriots have won 11 AFC Championships, the most in conference history, all since the 1985 season. These triumphs include the 1985 overtime victory over the Los Angeles Raiders (their first conference title), the 1996 win against the Jacksonville Jaguars under coach Bill Parcells, and the 2001 defeat of the Pittsburgh Steelers that launched the Belichick-Brady era. Subsequent successes featured 2003 and 2004 routs of the Indianapolis Colts and Steelers, respectively, solidifying back-to-back Super Bowl runs; a 2007 domination of the San Diego Chargers; and a 2011 thriller over the Baltimore Ravens highlighted by Lee Evans' dropped pass and a blocked field goal. The later streak included 2014 and 2016 wins versus the Colts and Steelers, plus dramatic comebacks in 2017 against the Jaguars and 2018 over the Kansas City Chiefs in overtime. Eight of these 11 AFC title games were hosted at Gillette Stadium since its 2002 opening, contributing to a 9-2 home playoff record in championship contests.\n\n| Super Bowl | Date | Opponent | Result | Score | MVP |\n|------------|------|----------|--------|-------|-----|\n| XX | Jan 26, 1986 | Chicago Bears | Loss | 10–46 | Richard Dent (Bears) |\n| XXXI | Jan 26, 1997 | Green Bay Packers | Loss | 21–35 | Brett Favre (Packers) |\n| XXXVI | Feb 3, 2002 | St. Louis Rams | Win | 20–17 | Tom Brady |\n| XXXVIII | Feb 1, 2004 | Carolina Panthers | Win | 32–29 (OT) | Tom Brady |\n| XXXIX | Feb 6, 2005 | Philadelphia Eagles | Win | 24–21 | Deion Branch |\n| XLII | Feb 3, 2008 | New York Giants | Loss | 14–17 | Eli Manning (Giants) |\n| XLVI | Feb 5, 2012 | New York Giants | Loss | 17–21 | Eli Manning (Giants) |\n| XLIX | Feb 1, 2015 | Seattle Seahawks | Win | 28–24 | Tom Brady |\n| LI | Feb 5, 2017 | Atlanta Falcons | Win | 34–28 (OT) | Tom Brady |\n| LII | Feb 4, 2018 | Philadelphia Eagles | Loss | 33–41 | Nick Foles (Eagles) |\n| LIII | Feb 3, 2019 | Los Angeles Rams | Win | 13–3 | Julian Edelman |\n\n### Division titles and playoff records\n\nThe New England Patriots have won the AFC East division title 22 times, more than any other team in the division's history. These victories span from their inaugural AFL championship in 1963 through their most recent in 2019, establishing the franchise as a dominant force in the region.\n\nUnder head coach Bill Belichick, the Patriots achieved remarkable streaks of consecutive division titles, including an NFL-record 11 straight from 2009 to 2019 and four in a row from 2001 to 2004 (skipping 2002 due to a league-wide penalty). These runs contributed to 17 division crowns between 2001 and 2019, fueling a dynasty that included multiple Super Bowl appearances. Earlier successes, such as back-to-back titles in 1996 and 1997, highlighted the team's resurgence in the mid-1990s.\n\nAs of November 19, 2025, the Patriots hold a 9–2 record and lead the AFC East standings, positioning them to potentially secure a 23rd division title and return to the playoffs for the first time since 2021.\n\nThe Patriots have made 28 playoff appearances since their founding in 1960, including one in the AFL era, with their postseason record standing at 37–22 (.627 winning percentage) through the 2024 season. This success includes a strong 25–9 mark in home playoff games, underscoring Gillette Stadium's role as a fortress during critical matchups. In earlier rounds, they hold a 4–6 record in the Wild Card round across 10 games and a dominant 16–6 in the Divisional round over 22 contests, reflecting consistent advancement when securing byes or home-field advantage.\n\nRecent playoff history has been more sporadic, with the team qualifying as the No. 3 seed in 2021 before a 47–17 Wild Card loss to the Buffalo Bills, followed by three consecutive non-appearances in 2022–2024 amid rebuilding efforts. Prior to that, the Patriots' 11-year division streak from 2009 to 2019 yielded 10 straight playoff berths, often culminating in deep runs toward AFC championships.\n\n### Statistical leaders and team records\n\nThe New England Patriots hold numerous franchise records across offensive and defensive categories, reflecting their historical dominance in the NFL. Tom Brady established the benchmarks for passing, amassing 74,571 yards and 541 touchdowns during his tenure with the team from 2000 to 2019. These figures underscore the Patriots' air-raid efficiency in the Belichick era, particularly highlighted by the 2007 season's offensive explosion. On the ground, Sam Cunningham leads in rushing with 5,453 yards from 1973 to 1982, emphasizing the team's balanced attack in earlier decades.\n\nDefensively, Andre Tippett set the sacks standard with 100 from 1982 to 1993, a mark that highlights the Patriots' pass-rush prowess in the 1980s. Interceptions are tied between Raymond Clayborn (1977–1989) and Ty Law (1995–2004), each with 36, showcasing the secondary's ball-hawking ability. The franchise's all-time regular-season win total stands at 554 through the 2025 season.\n\n| Category | Leader | Statistic | Years |\n|----------|--------|-----------|-------|\n| Passing Yards (Career) | Tom Brady | 74,571 | 2000–2019 |\n| Passing Touchdowns (Career) | Tom Brady | 541 | 2000–2019 |\n| Rushing Yards (Career) | Sam Cunningham | 5,453 | 1973–1982 |\n| Receiving Yards (Career) | Stanley Morgan | 10,352 | 1977–1989 |\n| Receiving Touchdowns (Career) | Rob Gronkowski | 80 | 2010–2018, 2020–2021 |\n| Sacks (Career) | Andre Tippett | 100 | 1982–1993 |\n| Interceptions (Career) | Raymond Clayborn / Ty Law | 36 | 1977–1989 / 1995–2004 |\n\nSingle-season records further illustrate peak performances, such as Randy Moss's NFL-record 23 receiving touchdowns in 2007, which powered the team's record-setting offense. That year, the Patriots scored a franchise-high 589 points, the most in NFL history at the time. Tom Brady complemented Moss with 50 passing touchdowns, another team mark. Defensively, the 2003 unit, anchored by a stout secondary and front seven, recorded three shutouts in the regular season's final seven games, contributing to a 14–2 record and Super Bowl victory.\n\nThe longest winning streak in franchise history is 21 games, spanning the end of the 2003 season through the 2004 regular season, including playoffs. This run exemplifies the sustained excellence under Bill Belichick, blending offensive firepower with defensive resilience.\n\n| Category | Leader/Team | Statistic | Year |\n|----------|-------------|-----------|------|\n| Passing Touchdowns (Single-Season) | Tom Brady | 50 | 2007 |\n| Receiving Touchdowns (Single-Season) | Randy Moss | 23 | 2007 |\n| Rushing Yards (Single-Season) | Corey Dillon | 1,635 | 2004 |\n| Team Points Scored (Single-Season) | Patriots | 589 | 2007 |\n| Shutouts (Single-Season, Defensive) | 2003 Patriots Defense | 3 | 2003 |\n| Longest Winning Streak | 2003–2004 Patriots | 21 games | 2003–2004 |\n\n## Strategy and legacy\n\n### Offensive and defensive philosophies\n\nThe New England Patriots' offensive philosophy during the Bill Belichick era was rooted in the Erhardt-Perkins system, which emphasized flexible player roles and concept-based play-calling rather than rigid position-specific assignments. This approach allowed for adaptability to personnel, with route combinations designed to exploit defensive alignments through groupings like \"smash\" or \"drive\" concepts, enabling quarterbacks to read and adjust post-snap. Under coordinators such as Charlie Weis and Josh McDaniels, the system evolved to incorporate spread elements, particularly in the passing game, prioritizing quick releases and short-to-intermediate throws to maintain rhythm and efficiency.\n\nPrior to 2000, the Patriots' offense leaned heavily on a power-run scheme, utilizing a strong offensive line to control the line of scrimmage and establish short-yardage dominance, as seen in the tenures of coaches like Bill Parcells. During the dynasty years from 2001 onward, the unit demonstrated remarkable adaptability, shifting to bootleg plays and play-action passes to counter aggressive defenses, which helped sustain drives and create explosive opportunities. In recent seasons, post-Belichick from 2020 to 2024, the offense incorporated more spread concepts to stretch the field horizontally and vertically, aiding young quarterbacks like Mac Jones in building confidence through simplified protections and motion-heavy sets. The system's integration of analytics has driven these changes, focusing on data-informed decisions like optimal run-pass balances to maximize expected points added (EPA). Notably, the Belichick-era offense peaked at a 48.2% third-down conversion rate in 2007, one of the highest single-season marks in franchise history, underscoring its situational efficiency.\n\nIn 2025, under head coach Mike Vrabel and with quarterback Drake Maye at the helm, the Patriots adopted a run-heavy philosophy to complement Maye's mobility, emphasizing a physical ground attack with designed runs and gap schemes to wear down defenses and set up play-action. This approach has elevated the rushing output.\n\nDefensively, Belichick's scheme primarily utilized a 4-3 base alignment, featuring four down linemen to generate interior pressure while maintaining gap integrity, often hybridizing into nickel packages for pass protection. The \"bend-but-don't-break\" philosophy prioritized discipline over aggressive risks, allowing opponents to gain yards but forcing field goals through strong red-zone stands and third-down stops, as evidenced by the 2019 unit's league-low 24.1% opponent third-down conversion rate.\n\nBy 2025, the Patriots' defense under Vrabel transitioned to a hybrid front incorporating zone blitzes, blending 4-3 and 3-4 elements to create simulated pressures and confuse protections, with a blitz rate around 24% to disrupt rhythm passing. This evolution maintains the bend-but-don't-break core while adding versatility against mobile quarterbacks.\n\n### Influence on NFL tactics and personnel\n\nThe New England Patriots, under head coach Bill Belichick, popularized the \"Patriot Way,\" a philosophy emphasizing team-first discipline, accountability, and a culture of doing one's job without seeking individual glory, which has influenced organizational cultures across the NFL. This approach, instituted early in Belichick's tenure, included strict guidelines for player and coach conduct that fostered consistency and adaptability, extending beyond the field to business practices adopted by corporate leaders. High school programs in Massachusetts have even emulated elements of this model for building successful teams, highlighting its broader tactical ripple effects on discipline in competitive environments.\n\nIn defensive tactics, the Patriots' consistent use of versatile schemes during the 2010s contributed to league-wide adaptations in response to rule changes protecting quarterbacks, though they largely maintained a single-high safety base while others shifted toward two-high alignments to counter passing attacks. Their emphasis on personnel flexibility in base defenses influenced how teams managed hybrid roles for safeties and linebackers amid evolving rules that penalized aggressive hits.\n\nThe Patriots' personnel strategies have significantly shaped NFL executive and coaching pipelines through the \"Belichick tree,\" a network of former assistants and players who advanced to prominent roles. Josh McDaniels, who served as offensive coordinator from 2005 to 2008 and returned multiple times, became head coach of the Denver Broncos and Las Vegas Raiders, carrying forward elements of New England's offensive system. Mike Vrabel, a key linebacker for the Patriots from 2001 to 2008, later became head coach of the Tennessee Titans, drawing on his experience in Belichick's defensive schemes despite not serving on the coaching staff. This tree has produced multiple head coaches and general managers, underscoring the Patriots' role in developing league leadership.\n\nNew England's success with undrafted free agents (UDFAs) has established a model for roster building that other teams have sought to replicate, prioritizing evaluation of overlooked talent to maximize depth and value. The Patriots have integrated UDFAs into starting roles, such as center David Andrews and cornerback Jonathan Jones, demonstrating a systematic approach to scouting and development that has yielded Pro Bowl contributors. This strategy, refined over two decades, encourages league-wide focus on post-draft free agency as a low-cost avenue for talent acquisition.\n\nThe Patriots' innovative salary cap management in the 2000s set a benchmark for financial efficiency, using restructures and short-term contracts to maintain competitiveness without excessive spending. Belichick's approach, which involved converting salaries to bonuses and prioritizing affordable veterans, kept the team under the cap while winning three Super Bowls in the decade, influencing how franchises balance payroll amid rising limits. By the 2010s, this model helped them rank among the league's lowest spenders relative to the cap, yet achieve sustained success.\n\nPost-2010, the Patriots increasingly incorporated analytics into their drafting process, developing models to identify traits predictive of NFL success, such as combining film study with data on player measurables and college performance. This shift contributed to selections like safety Devin McCourty in 2010, enhancing their ability to find high-value players and influencing broader NFL adoption of data-driven evaluation.\n\nThe Patriots' six Super Bowl victories from 2001 to 2018 exemplified the value of coaching stability, with Belichick's 24-year tenure highlighting how long-term leadership correlates with playoff success and prompting teams to prioritize continuity over frequent changes. This era shifted league emphasis toward retaining proven coordinators and head coaches, as evidenced by the Ravens' similar approach yielding consistent contention.\n\nAs of November 2025, with a 9–2 record under head coach Mike Vrabel, the Patriots' resurgence serves as a contemporary model for transitional phases, leveraging cap space, draft capital, and young quarterback Drake Maye to accelerate recovery from a down period. With strategic free agency moves and UDFA integrations, this approach demonstrates methodical roster turnover while maintaining core principles, positioning New England as a blueprint for other franchises navigating post-dynasty shifts.\n\n## Broadcasting\n\n### Radio coverage\n\nThe radio broadcasts of New England Patriots games are carried by the Patriots Radio Network, with 98.5 The Sports Hub (WBZ-FM) serving as the flagship station in Boston since the station's inception in 2009. This agreement was extended in 2024 through the 2033 NFL season. The network provides comprehensive coverage of all regular season, preseason, and playoff games, including three-hour pregame and postgame shows hosted by figures such as Marc Bertrand and Chris Gasper.\n\nPlay-by-play duties have been handled by Bob Socci since 2013, when he succeeded longtime announcer Gil Santos, while former Patriots quarterback Scott Zolak has served as the color analyst since 2012, replacing Gino Cappelletti. The broadcasts are syndicated across more than 30 stations throughout New England and surrounding states, ensuring wide regional accessibility.\n\nNational games, including playoffs and the Super Bowl, are distributed by the Westwood One radio network, the NFL's official audio partner. The team's radio history traces back to its founding in 1960, with early broadcasts airing on Boston's WEEI-AM starting that inaugural AFL season. Prior to the 2009 shift to 98.5 The Sports Hub, WEEI-FM had been the flagship since 1995, following earlier affiliations with stations like WBZ-AM in the 1970s and 1980s.\n\n### Television and streaming rights\n\nThe New England Patriots' television broadcasts have evolved significantly since the team's early years, transitioning from limited local coverage to nationwide accessibility amid the NFL's broader media rights expansions. In the 1970s, games were primarily aired on local stations such as WBZ-TV in 1972 and WCVB-TV in 1973, often subject to the NFL's blackout policy that prevented local telecasts of unsold home games within a 75-mile radius until the policy's relaxation in the 1980s and full elimination in 2015. This shift ended frequent blackouts for Patriots fans, with the last local blackout occurring in 1993 during a home game against the Indianapolis Colts.\n\nLocally, the Patriots' regular season games are broadcast based on NFL conference alignments, with CBS affiliate WBZ-TV (Channel 4) carrying most home games against AFC opponents and select away games, reaching viewers across New England. Preseason games air exclusively on the Patriots Preseason Television Network, led by WBZ-TV as the flagship station, alongside affiliates like WNAC (Fox 64 in Providence) and WWLP (NBC 22 in Springfield), covering all six New England states; select preseason contests also appear on NFL Network. In 2009, WBZ-TV secured an exclusive multi-year deal for preseason and postseason programming, renewed through at least 2022 and continuing as of the 2025 season.\n\nNationally, Patriots games follow the NFL's media distribution agreements, extended through the 2033 season in a $110 billion package announced in 2021. CBS holds rights to AFC Sunday afternoon games, including many Patriots matchups, while FOX broadcasts NFC opponents; primetime slots include ESPN/ABC for Monday Night Football, NBC for Sunday Night Football, and Amazon Prime Video for Thursday Night Football starting in 2022. Playoff and Super Bowl broadcasts rotate among these networks, with the 2017 Super Bowl LI—featuring the Patriots' comeback victory over the Atlanta Falcons—drawing 111.3 million viewers, the second-most-watched telecast in U.S. history at the time.\n\nStreaming rights have expanded access, particularly for out-of-market fans, through NFL+ (formerly NFL Game Pass), which offers live local and primetime regular-season games, preseason, and replays on mobile devices. Paramount+ streams CBS-aired Patriots games, complementing traditional TV in local markets, while Amazon Prime Video exclusively handles Thursday games. These evolutions reflect the NFL's push toward digital platforms, ensuring broader reach without the constraints of past blackout eras.\n\n## Controversies\n\n### Spygate scandal\n\nThe Spygate scandal emerged during the 2007 NFL season when, on September 9, New England Patriots video assistant Matt Estrella was observed and confronted by New York Jets personnel for filming the Jets' defensive coaches' signals from an unauthorized sideline location during the teams' season-opening game at Giants Stadium, which the Patriots won 38–14. The Jets immediately reported the incident to NFL officials, prompting an investigation by league security chief Matt Lenz, who confiscated the camera and tape from Estrella shortly after the game. This event highlighted broader allegations that the Patriots, under head coach Bill Belichick, had systematically videotaped opponents' defensive signals from the sideline since at least 2000 to decode and anticipate play calls, a practice that violated NFL rules prohibiting such filming during opponents' practices or games.\n\nThe NFL's investigation, led by Commissioner Roger Goodell, revealed that the Patriots had employed this method in multiple games, including against the Jets, and that Belichick had personally overseen the operation despite being aware of the prohibitions outlined in the league's operations manual. On September 13, 2007, Goodell announced severe penalties: Belichick was fined $500,000—the maximum allowable amount for a coach—the team was fined $250,000, and the Patriots forfeited their first-round draft pick in the 2008 NFL Draft. The league determined that the videotaping provided an \"unfair advantage\" but did not retroactively vacate any prior victories or Super Bowl wins, such as the controversial 20–17 overtime victory over the St. Louis Rams in Super Bowl XXXVI, where similar signal-stealing claims had surfaced. Goodell emphasized that the punishment aimed to deter future violations, stating that the conduct was \"conduct detrimental to the integrity of the game.\"\n\nFurther details surfaced in 2008 when former Patriots video assistant Matt Walsh, who had left the team in 2003, agreed to cooperate with the NFL after threatening legal action and receiving indemnification from potential lawsuits. Walsh provided eight videotapes documenting the Patriots recording signals from five opponents in six games between 2000 and 2006, including practices and games, but the league concluded after review that these did not warrant additional penalties, as the practices were not deemed to have materially altered game outcomes or past championships. Walsh also alleged internal discussions about using the footage to gain strategic edges, though he clarified that sideline filming during live games was less effective than practice taping. Commissioner Goodell later defended his decision to destroy handwritten notes from interviews during the initial probe, citing privacy concerns for involved parties, which drew criticism for potentially obscuring the full scope of the scandal.\n\nThe scandal severely damaged the Patriots' reputation amid their pursuit of a perfect 16–0 regular season in 2007, which they achieved before losing Super Bowl XLII to the New York Giants, though the team was permitted to participate in the playoffs without further restriction. It intensified the longstanding rivalry with the Jets, who viewed the incident as emblematic of competitive impropriety. Despite the penalties, the episode underscored ongoing debates about the prevalence of signal-stealing in the NFL, with the league subsequently tightening rules on video equipment and access to enforce compliance.\n\n### Deflategate and other incidents\n\nThe Deflategate scandal arose during the AFC Championship Game on January 18, 2015, between the New England Patriots and Indianapolis Colts at Gillette Stadium, where the Patriots secured a 45–7 victory. Colts equipment staff intercepted a Patriots ball during the first quarter and measured its pressure at approximately 11 pounds per square inch (PSI), below the NFL's mandated minimum of 12.5 PSI for game balls, prompting officials to test all 12 Patriots footballs at halftime. Measurements using the non-logo gauge showed 11 of the 12 balls inflated between 10.1 and 11.8 PSI, all under the 12.5 PSI threshold, while the four tested Colts balls ranged from 12.15 to 12.95 PSI and complied with regulations.\n\nThe NFL commissioned attorney Ted Wells of Paul, Weiss, Rifkind, Wharton \\u0026 Garrison to lead an independent investigation. The resulting 243-page Wells Report, released on May 6, 2015, concluded it was \"more probable than not\" that two Patriots personnel—locker room attendant Jim McNally and equipment assistant John Jastremski—deliberately deflated the balls after pregame inspection, in violation of NFL rules requiring inflation between 12.5 and 13.5 PSI. The report further stated it was \"more probable than not\" that quarterback Tom Brady was \"at least generally aware\" of these activities, based on text messages between McNally and Jastremski referencing Brady's preference for balls at 12.5 PSI, such as one reading \"Tom likes them at 12.5,\" as well as a spike in phone calls between Brady and Jastremski after the game. Scientific analysis in the report attributed the pressure drops to intentional tampering rather than solely environmental factors like temperature, with statistical evidence showing a significantly greater deflation in Patriots balls (p-value of 0.004 compared to Colts balls).\n\nOn May 11, 2015, NFL Commissioner Roger Goodell announced penalties: a four-game suspension without pay for Brady, a $1 million fine for the Patriots, forfeiture of the team's 2016 first-round draft pick (traded to the Cleveland Browns), and a 2017 fourth-round pick. Brady's suspension was overturned by U.S. District Judge Richard Berman in September 2015 on grounds that the NFL's process violated the collective bargaining agreement, but the U.S. Court of Appeals for the Second Circuit reinstated it in April 2016, citing insufficient evidence of bias or procedural unfairness; Brady served the suspension during the first four games of the 2016 season, during which the Patriots went 3–1. The team ultimately reached Super Bowl LI and defeated the Atlanta Falcons 34–28 in overtime.\n\nThe Wells Report drew sharp criticism for alleged methodological flaws and bias. Independent studies, including one by MIT professor John Leonard in June 2015, argued the pressure discrepancies could be explained by gauge inaccuracies and weather conditions, with the Non-Logo gauge (used by Colts) overestimating by up to 0.4 PSI and the Logo gauge underestimating by 0.3 PSI, rendering the drops natural rather than intentional. Accusations surfaced that the NFL leaked false data to ESPN reporter Chris Mortensen in January 2015, claiming 11 of 12 balls were exactly 2 PSI under when actual halftime readings averaged about 1 PSI below expected levels after Ideal Gas Law adjustments for temperature (from 76°F pregame to 48°F at halftime). A 2022 analysis by former NFL personnel, including Troy Vincent, accused the league of covering up these discrepancies and selectively editing the Wells Report to inflate the scandal, while Wells' prior representation of the NFL in high-profile cases raised conflict-of-interest concerns.\n\nOther notable incidents include the 2001 divisional playoff game against the Oakland Raiders, known as the \"Tuck Rule Game,\" where a controversial call ruled Tom Brady's apparent fumble as an incomplete forward pass under the NFL's tuck rule, enabling a Patriots comeback win; though not a scandal involving team misconduct, it has long fueled accusations of officiating favoritism toward New England. In December 2019, Patriots staff were caught filming the Cincinnati Bengals' sideline during a home game against the Cleveland Browns, violating league rules on unauthorized recordings; the NFL fined the team $1.1 million and revoked its 2021 third-round draft pick in June 2020, after determining the act was intentional despite the team's claim it was for an internal video series. In 2024, under first-year head coach Jerod Mayo, sideline tensions arose during joint practices with the Philadelphia Eagles in August, where Mayo issued warnings against fights to prevent ejections, though no major altercations occurred, amid the team's subsequent 4–13 season.\n\nIn 2025, during a Week 9 game against the Atlanta Falcons on November 3, Falcons head coach Raheem Morris accused the Patriots of cheating by illegally simulating defensive signals to gain an advantage, though the NFL announced no formal investigation as of November 19, 2025, and the Patriots denied the allegations. Additionally, in Week 6 against the New Orleans Saints on October 13, 2025, a controversial offensive pass interference call nullified a touchdown pass from quarterback Drake Maye, sparking widespread debate over officiating consistency.",
  "external_references": [
    {
      "text": "New England Patriots",
      "url": "https://operations.nfl.com/learn-the-game/nfl-basics/team-histories/american-football-conference/east/new-england-patriots/",
      "domain": "operations.nfl.com",
      "type": "citation"
    },
    {
      "text": "Index.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/index.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Ranking The New England Patriots 10 Super Bowl Teams 0ap3000000909986",
      "url": "https://www.nfl.com/photos/ranking-the-new-england-patriots-10-super-bowl-teams-0ap3000000909986",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Bradto00.htm",
      "url": "https://www.pro-football-reference.com/players/B/BradTo00.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Reg",
      "url": "https://www.nfl.com/standings/league/2024/reg",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "2025.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2025.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "On This Day 46 Years Ago They Officially Became The New England Patriots",
      "url": "https://www.espn.com/blog/new-england-patriots/post/_/id/4802035/on-this-day-46-years-ago-they-officially-became-the-new-england-patriots",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Playoffs.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/playoffs.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "La Xpm 1988 10 29 Sp 311 Story.html",
      "url": "https://www.latimes.com/archives/la-xpm-1988-10-29-sp-311-story.html",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Coaches.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/coaches.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Patriots Incredible Spending Almost Matches Price To Buy Team In 1994",
      "url": "https://www.espn.com/blog/new-england-patriots/post/_/id/4822571/patriots-incredible-spending-almost-matches-price-to-buy-team-in-1994",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Foxboro Stadium",
      "url": "https://www.stadiumsofprofootball.com/stadiums/foxboro-stadium/",
      "domain": "stadiumsofprofootball.com",
      "type": "citation"
    },
    {
      "text": "1994.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/1994.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Draft.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/draft.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "199701260gnb.htm",
      "url": "https://www.pro-football-reference.com/boxscores/199701260gnb.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "48df3b26 51a2 4c45 8641 71d4c3ba0cd6",
      "url": "https://www.washingtonpost.com/archive/sports/1997/02/01/parcells-resigns-from-patriots/48df3b26-51a2-4c45-8641-71d4c3ba0cd6/",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "1998.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/1998.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Pro Football Patriots Hire Belichick And Everyone S Happy.html",
      "url": "https://www.nytimes.com/2000/01/28/sports/pro-football-patriots-hire-belichick-and-everyone-s-happy.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Before Dynasty Bill Belichick Forgotten 2000 Season New England Patriots",
      "url": "https://www.espn.com/nfl/story/_/id/30273224/before-dynasty-bill-belichick-forgotten-2000-season-new-england-patriots",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "20 Years Ago Tom Brady Replaced Drew Bledsoe Changing Patriots Franchise Forever Mo Lewis Nfl Bill Belichick",
      "url": "https://www.cbsnews.com/boston/news/20-years-ago-tom-brady-replaced-drew-bledsoe-changing-patriots-franchise-forever-mo-lewis-nfl-bill-belichick/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "2001.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2001.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Game Changers 82",
      "url": "https://www.nfl.com/100/originals/100-greatest/game-changers-82",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Vince Wilfork",
      "url": "https://www.patriotshalloffame.com/hall_of_famer/vince-wilfork/",
      "domain": "patriotshalloffame.com",
      "type": "citation"
    },
    {
      "text": "Football Memories Chandler Jones 195901",
      "url": "https://www.patriots.com/news/football-memories-chandler-jones-195901",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "2007.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2007.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Grand Opening Of Gillette Stadium 122671",
      "url": "https://www.patriots.com/news/grand-opening-of-gillette-stadium-122671",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Tom Brady Says Goodbye Patriots Social Media",
      "url": "https://www.espn.com/nfl/story/_/id/28915341/tom-brady-says-goodbye-patriots-social-media",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Tom Brady Leaving New England Patriots Truly The End Of An Era 0ap3000001106583",
      "url": "https://www.nfl.com/news/tom-brady-leaving-new-england-patriots-truly-the-end-of-an-era-0ap3000001106583",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "2020.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2020.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Patriots Select Alabama Qb Mac Jones At No 15",
      "url": "https://www.nfl.com/news/patriots-select-alabama-qb-mac-jones-at-no-15",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "2021.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2021.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "2022.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2022.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Patriots Signing Matt Judon Jalen Mills To Four Year Deals",
      "url": "https://www.nfl.com/news/patriots-signing-matt-judon-jalen-mills-to-four-year-deals",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "2023.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2023.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Bill Belichick Leaving Patriots 24 Seasons Sources Say",
      "url": "https://www.espn.com/nfl/story/_/id/39285303/bill-belichick-leaving-patriots-24-seasons-sources-say",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Attendance.htm",
      "url": "https://www.pro-football-reference.com/years/2023/attendance.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "2024.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2024.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Patriots Fire Hc Jerod Mayo Following 4 13 First Season In New England",
      "url": "https://www.nfl.com/news/patriots-fire-hc-jerod-mayo-following-4-13-first-season-in-new-england",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Mike Vrabel Agrees Become Patriots New Coach Sources Say",
      "url": "https://www.espn.com/nfl/story/_/id/43382844/mike-vrabel-agrees-become-patriots-new-coach-sources-say",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Mike Vrabel Coaching Staff Coordinators Rumors Nfl",
      "url": "https://www.cbsnews.com/boston/news/new-england-patriots-mike-vrabel-coaching-staff-coordinators-rumors-nfl/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "2025 Patriots Free Agents",
      "url": "https://www.patsfans.com/patriots/blog/2025-patriots-free-agents/",
      "domain": "patsfans.com",
      "type": "citation"
    },
    {
      "text": "Patriots Reach 30 Years In Foxboro 115751",
      "url": "https://www.patriots.com/news/patriots-reach-30-years-in-foxboro-115751",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "History Logo Uniform",
      "url": "https://www.patriots.com/press-room/history-logo-uniform",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "The Evolution Of The Patriots Logo And Uniform 255871",
      "url": "https://www.patriots.com/news/the-evolution-of-the-patriots-logo-and-uniform-255871",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Unveil New Uniforms Ahead Of 2020 Season",
      "url": "https://www.patriots.com/news/patriots-unveil-new-uniforms-ahead-of-2020-season",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Add Retro Look To Midfield Logo End Zone For Throwback Game At Gillette Stadium",
      "url": "https://www.cbsnews.com/boston/news/patriots-add-retro-look-to-midfield-logo-end-zone-for-throwback-game-at-gillette-stadium/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Check Out The 2016 Patriots Color Rush Jerseys 270621",
      "url": "https://www.patriots.com/news/check-out-the-2016-patriots-color-rush-jerseys-270621",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://www.patriots.com/press-room/history",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "How Patriots Led Push To Change Nfl Rule And Bring Red Throwback Uniform Back",
      "url": "https://www.patriots.com/news/how-patriots-led-push-to-change-nfl-rule-and-bring-red-throwback-uniform-back",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Unveil Nor Easter Uniforms For Week 11 Rivalry Game Vs Jets",
      "url": "https://www.patriots.com/news/patriots-unveil-nor-easter-uniforms-for-week-11-rivalry-game-vs-jets",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Team History",
      "url": "https://www.profootballhof.com/teams/new-england-patriots/team-history/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "Nfls Boston Patriots Spent A Year",
      "url": "https://www.thecrimson.com/article/1996/6/3/nfls-boston-patriots-spent-a-year/",
      "domain": "thecrimson.com",
      "type": "citation"
    },
    {
      "text": "Stadium Financing",
      "url": "https://www.sportsbusinessjournal.com/Journal/Issues/2022/05/09/Portfolio/Stadium-financing/",
      "domain": "sportsbusinessjournal.com",
      "type": "citation"
    },
    {
      "text": "Overview",
      "url": "https://www.gillettestadium.com/overview/",
      "domain": "gillettestadium.com",
      "type": "citation"
    },
    {
      "text": "Gillette Stadium Upgrades To Hd Video Boards 114211",
      "url": "https://www.patriots.com/news/gillette-stadium-upgrades-to-hd-video-boards-114211",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "North End Renovation Project Release",
      "url": "https://www.gillettestadium.com/north-end-renovation-project-release/",
      "domain": "gillettestadium.com",
      "type": "citation"
    },
    {
      "text": "July 4 In Pats History The First Training Camp.1155757",
      "url": "https://www.patsfans.com/new-england-patriots/messageboard/threads/july-4-in-pats-history-the-first-training-camp.1155757/",
      "domain": "patsfans.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots History Training Camp At Bryant College",
      "url": "https://www.patspulpit.com/2015/7/31/9072633/new-england-patriots-history-training-camp-at-bryant-college",
      "domain": "patspulpit.com",
      "type": "citation"
    },
    {
      "text": "History 1970s",
      "url": "https://www.patriots.com/press-room/history-1970s",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Looking Back At Bryant",
      "url": "https://www.patriots.com/news/looking-back-at-bryant",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "2025 New England Patriots Training Camp Dates Schedule Location",
      "url": "https://www.foxsports.com/stories/nfl/2025-new-england-patriots-training-camp-dates-schedule-location",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "Patriots Announce Training Facility",
      "url": "https://985thesportshub.com/2024/12/04/patriots-announce-training-facility/",
      "domain": "985thesportshub.com",
      "type": "citation"
    },
    {
      "text": "Patriots Practice Facility",
      "url": "https://www.signaturestructureshome.com/portfolio/patriots-practice-facility/",
      "domain": "signaturestructureshome.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Announce Dates For Training Camp",
      "url": "https://www.patriots.com/news/new-england-patriots-announce-dates-for-training-camp",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Investment Football Facility Nflpa Report Card Kraft",
      "url": "https://www.patspulpit.com/2024/3/27/24113334/patriots-investment-football-facility-nflpa-report-card-kraft",
      "domain": "patspulpit.com",
      "type": "citation"
    },
    {
      "text": "Patriots To Begin Construction On A New Football Training Facility",
      "url": "https://www.patriots.com/news/patriots-to-begin-construction-on-a-new-football-training-facility",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "76791896007",
      "url": "https://www.providencejournal.com/story/sports/nfl/patriots/2024/12/05/new-england-patriots-gillette-training-facility/76791896007/",
      "domain": "providencejournal.com",
      "type": "citation"
    },
    {
      "text": "Patriots Celebrate Topping Off Ceremony For New State Of The Art Training Facility",
      "url": "https://www.patriots.com/news/patriots-celebrate-topping-off-ceremony-for-new-state-of-the-art-training-facility",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots",
      "url": "https://www.linkedin.com/company/new-england-patriots",
      "domain": "linkedin.com",
      "type": "citation"
    },
    {
      "text": "Patriots Unveil Plans For All New Practice Facility Next To Gillette Stadium Set For Spring 2026 Opening",
      "url": "https://www.cbssports.com/nfl/news/patriots-unveil-plans-for-all-new-practice-facility-next-to-gillette-stadium-set-for-spring-2026-opening/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Is Bigger Better New England Patriots And Los Angeles Rams Fans Compared",
      "url": "https://www.nielsen.com/insights/2019/is-bigger-better-new-england-patriots-and-los-angeles-rams-fans-compared/",
      "domain": "nielsen.com",
      "type": "citation"
    },
    {
      "text": "Nfl Teams Ranked By Fan Support On Social Media",
      "url": "https://bolavip.com/en/nfl/nfl-teams-ranked-by-fan-support-on-social-media",
      "domain": "bolavip.com",
      "type": "citation"
    },
    {
      "text": "1546552147763920899",
      "url": "https://twitter.com/Patriots/status/1546552147763920899?lang=ig",
      "domain": "twitter.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Wreath Supplies",
      "url": "https://www.sportswreathshop.com/new-england-patriots-wreath-supplies/",
      "domain": "sportswreathshop.com",
      "type": "citation"
    },
    {
      "text": "Psm Get Ready",
      "url": "https://www.gillettestadium.com/psm-get-ready/",
      "domain": "gillettestadium.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Tailgate Guide",
      "url": "https://www.tickpick.com/blog/new-england-patriots-tailgate-guide/",
      "domain": "tickpick.com",
      "type": "citation"
    },
    {
      "text": "Patriots Victory Parade Rolling Rally Super Bowl Champions",
      "url": "https://www.cbsnews.com/boston/news/patriots-victory-parade-rolling-rally-super-bowl-champions/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Massive Crowds Celebrate Super Bowl Victory At Patriots Parade 291156",
      "url": "https://www.patriots.com/news/massive-crowds-celebrate-super-bowl-victory-at-patriots-parade-291156",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots",
      "url": "https://www.statista.com/topics/2686/new-england-patriots/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Super Bowl 2017 Television Broadcast Ratings Nielsen",
      "url": "https://time.com/4661562/super-bowl-2017-television-broadcast-ratings-nielsen/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "Community",
      "url": "https://www.patriots.com/community/",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Championing Community Reflecting On Robert Kraft S Pioneering 30 Years Of Philanthropy With Patriots",
      "url": "https://www.patriots.com/news/championing-community-reflecting-on-robert-kraft-s-pioneering-30-years-of-philanthropy-with-patriots",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Cheerleaders",
      "url": "https://www.patriots.com/cheerleaders/",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Cheers Through The Years Series Week 1",
      "url": "https://www.patriots.com/photos/cheers-through-the-years-series-week-1",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "The Hall Unveils Cheers Through The Years 146771",
      "url": "https://www.patriots.com/news/the-hall-unveils-cheers-through-the-years-146771",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Cheerleaders To Visit Troops 151121",
      "url": "https://www.patriots.com/news/patriots-cheerleaders-to-visit-troops-151121",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Cheerleaders Visiting European Bases",
      "url": "https://www.afrc.af.mil/News/Article/159427/patriots-cheerleaders-visiting-european-bases/",
      "domain": "afrc.af.mil",
      "type": "citation"
    },
    {
      "text": "Patriots Cheerleaders Tour Northern Afghanistan",
      "url": "https://www.dvidshub.net/news/63003/patriots-cheerleaders-tour-northern-afghanistan",
      "domain": "dvidshub.net",
      "type": "citation"
    },
    {
      "text": "Patriots Cheerleaders Model Squad Uniforms From The 1960 S Through Presen 307666",
      "url": "https://www.patriots.com/news/patriots-cheerleaders-model-squad-uniforms-from-the-1960-s-through-presen-307666",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Rxruupm4hjhfple3dgmlp4rsni",
      "url": "https://www.boston25news.com/sports/nfl/new-england-patriots/patriots-cheerleader-raising-money-charities-through-virtual-workouts/RXRUUPM4HJHFPLE3DGMLP4RSNI/",
      "domain": "boston25news.com",
      "type": "citation"
    },
    {
      "text": "97165",
      "url": "https://www.nbcboston.com/news/local/meet-the-1st-male-patriots-cheerleaders-in-decades/97165/",
      "domain": "nbcboston.com",
      "type": "citation"
    },
    {
      "text": "Patriots Cheerleaders 2023 Year In Review",
      "url": "https://www.patriots.com/news/patriots-cheerleaders-2023-year-in-review",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://www.patriots.com/team/history",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Pat Patriot",
      "url": "https://www.patriots.com/fans/pat-patriot",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Spygate Nfl Scandals Patriots",
      "url": "https://www.history.com/this-day-in-history/september-9/spygate-nfl-scandals-patriots",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "Teamvsteam",
      "url": "https://www.footballdb.com/teams/nfl/new-england-patriots/teamvsteam?opp=22",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Buffalo Bills Record Against New England Patriots",
      "url": "https://www.statmuse.com/nfl/ask/buffalo-bills-record-against-new-england-patriots",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "Teamvsteam",
      "url": "https://www.footballdb.com/teams/nfl/new-england-patriots/teamvsteam?opp=4",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Games 94",
      "url": "https://www.nfl.com/100/originals/100-greatest/games-94",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Manning Vs Brady The Complete History 0ap2000000313694",
      "url": "https://www.nfl.com/news/manning-vs-brady-the-complete-history-0ap2000000313694",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Game Query.cgi",
      "url": "https://www.pro-football-reference.com/boxscores/game_query.cgi?tm1=nwe\\u0026tm2=clt\\u0026yr=all",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Game Query.cgi",
      "url": "https://www.pro-football-reference.com/boxscores/game_query.cgi?tm1=nwe\\u0026tm2=rav\\u0026yr=all",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Game Query.cgi",
      "url": "https://www.pro-football-reference.com/boxscores/game_query.cgi?tm1=nwe\\u0026tm2=pit\\u0026yr=all",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Patriots Playoff Record Vs Broncos",
      "url": "https://www.statmuse.com/nfl/ask/patriots-playoff-record-vs-broncos",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "197612180rai.htm",
      "url": "https://www.pro-football-reference.com/boxscores/197612180rai.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots",
      "url": "https://www.forbes.com/teams/new-england-patriots/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "The Inside Story Of How 25 Years Ago Robert Kraft Improbably Bought The Patriots",
      "url": "https://www.nytimes.com/athletic/772125/2019/01/18/the-inside-story-of-how-25-years-ago-robert-kraft-improbably-bought-the-patriots/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Story.html",
      "url": "https://www.bostonglobe.com/sports/patriots/2019/01/18/when-robert-kraft-bought-patriots-signaled-new-beginning-for-franchise/1UlJvHB4p9TkGlAvQf4tZM/story.html",
      "domain": "bostonglobe.com",
      "type": "citation"
    },
    {
      "text": "Jonathan Kraft",
      "url": "https://www.patriots.com/team/front-office-roster/jonathan-kraft",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Moving Forward With Search For De Facto Gm Following Bill Belichicks Departure After 24 Seasons",
      "url": "https://www.cbssports.com/nfl/news/patriots-moving-forward-with-search-for-de-facto-gm-following-bill-belichicks-departure-after-24-seasons/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Latest On Patriots Organizational Structure",
      "url": "https://www.profootballrumors.com/2024/05/latest-on-patriots-organizational-structure",
      "domain": "profootballrumors.com",
      "type": "citation"
    },
    {
      "text": "Eliot Wolf Named Executive Vice President Of Player Personnel",
      "url": "https://www.patriots.com/news/eliot-wolf-named-executive-vice-president-of-player-personnel",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Officially Name Eliot Wolf As Executive Vice President Of Player Personnel",
      "url": "https://www.nfl.com/news/patriots-officially-name-eliot-wolf-as-executive-vice-president-of-player-personnel",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Gillette Stadium",
      "url": "https://www.thekraftgroup.com/gillette-stadium/",
      "domain": "thekraftgroup.com",
      "type": "citation"
    },
    {
      "text": "Patriots Charitable Foundation Teams With United Way To Help Tornado Vict 173976",
      "url": "https://www.patriots.com/news/patriots-charitable-foundation-teams-with-united-way-to-help-tornado-vict-173976",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Beyond Field New England Patriots.html",
      "url": "http://www.nepatriotslife.com/2023/11/beyond-field-new-england-patriots.html",
      "domain": "nepatriotslife.com",
      "type": "citation"
    },
    {
      "text": "681253",
      "url": "https://www.nbcsportsboston.com/nfl/new-england-patriots/head-coaches-history/681253/",
      "domain": "nbcsportsboston.com",
      "type": "citation"
    },
    {
      "text": "Patriots Fire Jerod Mayo Head Coach One Season",
      "url": "https://www.si.com/nfl/patriots-fire-jerod-mayo-head-coach-one-season",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Belibi0.htm",
      "url": "https://www.pro-football-reference.com/coaches/BeliBi0.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Bill Belichick Belicbi01",
      "url": "https://www.footballdb.com/coaches/bill-belichick-belicbi01",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Parcbi0.htm",
      "url": "https://www.pro-football-reference.com/coaches/ParcBi0.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Bill Parcells",
      "url": "https://www.patriotshalloffame.com/hall_of_famer/bill-parcells/",
      "domain": "patriotshalloffame.com",
      "type": "citation"
    },
    {
      "text": "Josh Mcdaniels",
      "url": "https://www.patriots.com/team/coaches-roster/josh-mcdaniels",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Heres Why Bill Belichick Says Romeo Crennel Is The Best Coach Hes Ever Worked With In Hall Of Fame Career",
      "url": "https://www.cbssports.com/nfl/news/heres-why-bill-belichick-says-romeo-crennel-is-the-best-coach-hes-ever-worked-with-in-hall-of-fame-career/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "The 5 Best Defensive Coordinators In The History Of The Patriots 01j1x44gaa4r",
      "url": "https://musketfire.com/posts/the-5-best-defensive-coordinators-in-the-history-of-the-patriots-01j1x44gaa4r",
      "domain": "musketfire.com",
      "type": "citation"
    },
    {
      "text": "Terrell Williams",
      "url": "https://www.patriots.com/team/coaches-roster/terrell-williams",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Roster",
      "url": "https://www.nfl.com/teams/new-england-patriots/roster",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Drake Maye",
      "url": "https://www.espn.com/nfl/player/_/id/4431452/drake-maye",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Joshua Dobbs",
      "url": "https://www.espn.com/nfl/player/_/id/3044720/joshua-dobbs",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Demario Douglas",
      "url": "https://www.espn.com/nfl/player/_/id/4427095/demario-douglas",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Keep Winning Stefon Diggs Decision",
      "url": "https://www.si.com/nfl/patriots/onsi/news/new-england-patriots-keep-winning-stefon-diggs-decision",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Gonzch00.htm",
      "url": "https://www.pro-football-reference.com/players/G/GonzCh00.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Stats",
      "url": "https://www.nfl.com/players/harold-landry/stats/",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Stats",
      "url": "https://www.nfl.com/players/robert-spillane/stats/",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Klavon Chaisson",
      "url": "https://www.espn.com/nfl/player/_/id/4242205/klavon-chaisson",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Injuries",
      "url": "https://www.cbssports.com/nfl/teams/ne/new-england-patriots/injuries/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Team Greats",
      "url": "https://www.profootballhof.com/teams/new-england-patriots/team-greats/",
      "domain": "profootballhof.com",
      "type": "citation"
    },
    {
      "text": "Tom Brady Enshrined Into Patriots Hall Of Fame Has No 12 Retired",
      "url": "https://www.nfl.com/news/tom-brady-enshrined-into-patriots-hall-of-fame-has-no-12-retired",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Draftpicks",
      "url": "https://247sports.com/nfl/new-england-patriots/Team/New-England-Patriots-665/DraftPicks/?year=alltime",
      "domain": "247sports.com",
      "type": "citation"
    },
    {
      "text": "Tom Brady Scouting Report 2000 Nfl Draft Mel Kiper Pre Draft Grade Ranking",
      "url": "https://www.espn.com/nfl/story/_/id/29040115/tom-brady-scouting-report-2000-nfl-draft-mel-kiper-pre-draft-grade-ranking",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "728133",
      "url": "https://www.nbcsportsboston.com/nfl/new-england-patriots/cole-strange-worst-draft-picks/728133/",
      "domain": "nbcsportsboston.com",
      "type": "citation"
    },
    {
      "text": "Best Bill Belichick Patriots Draft Picks Ever",
      "url": "https://www.boston.com/sports/new-england-patriots/2021/04/28/best-bill-belichick-patriots-draft-picks-ever/",
      "domain": "boston.com",
      "type": "citation"
    },
    {
      "text": "Instant Analysis Patriots Take Unc Quarterback Drake Maye Third Overall",
      "url": "https://www.patriots.com/news/instant-analysis-patriots-take-unc-quarterback-drake-maye-third-overall",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "How And Why The Patriots Roster Was Built This Way On Road To Super Bowl Lii",
      "url": "https://www.nytimes.com/athletic/786605/2019/01/28/how-and-why-the-patriots-roster-was-built-this-way-on-road-to-super-bowl-lii/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://www.nfl.com/teams/new-england-patriots/history",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "History Of The Patriots In Afc Championship Games 195531",
      "url": "https://www.patriots.com/news/history-of-the-patriots-in-afc-championship-games-195531",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Afc Championship History Notable Records Stats Know",
      "url": "https://www.espn.com/nfl/story/_/id/43527112/afc-championship-history-notable-records-stats-know",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Patriots In The Afc Championship 288471",
      "url": "https://www.patriots.com/photos/patriots-in-the-afc-championship-288471",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Nwe",
      "url": "https://www.pro-football-reference.com/teams/nwe/",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Afc East Champions Complete List Winners Year",
      "url": "https://www.foxsports.com/stories/nfl/afc-east-champions-complete-list-winners-year",
      "domain": "foxsports.com",
      "type": "citation"
    },
    {
      "text": "Photos A Look At The Patriots 11 Straight Afc East Clinching Victories Presented",
      "url": "https://www.patriots.com/photos/photos-a-look-at-the-patriots-11-straight-afc-east-clinching-victories-presented",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Standings",
      "url": "https://www.nfl.com/standings/",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Playoff Record At Home",
      "url": "https://www.statmuse.com/nfl/ask/new-england-patriots-playoff-record-at-home",
      "domain": "statmuse.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots",
      "url": "https://champsorchumps.us/team/nfl/new-england-patriots",
      "domain": "champsorchumps.us",
      "type": "citation"
    },
    {
      "text": "Career Passing.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/career-passing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Career Rushing.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/career-rushing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Career Defense Sacks",
      "url": "https://www.footballdb.com/teams/nfl/new-england-patriots/leaders/career-defense-sacks",
      "domain": "footballdb.com",
      "type": "citation"
    },
    {
      "text": "Career Defense.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/career-defense.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Mossra00.htm",
      "url": "https://www.pro-football-reference.com/players/M/MossRa00.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Single Season Passing.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/single-season-passing.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "2003.htm",
      "url": "https://www.pro-football-reference.com/teams/nwe/2003.htm",
      "domain": "pro-football-reference.com",
      "type": "citation"
    },
    {
      "text": "Teams 32",
      "url": "https://www.nfl.com/100/originals/100-greatest/teams-32",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Summer School Erhardt Perkins Offense Belichick Weis Parcells Brady Patriots",
      "url": "https://www.bigblueview.com/2016/7/15/12188564/summer-school-erhardt-perkins-offense-belichick-weis-parcells-brady-patriots",
      "domain": "bigblueview.com",
      "type": "citation"
    },
    {
      "text": "Two Concepts In One The Erhardt Perkins Playcalling Language",
      "url": "https://www.dawgsbynature.com/2020/2/24/21140555/two-concepts-in-one-the-erhardt-perkins-playcalling-language",
      "domain": "dawgsbynature.com",
      "type": "citation"
    },
    {
      "text": "How The New England Patriots Offense Has Evolved 0ap3000000463883",
      "url": "https://www.nfl.com/news/how-the-new-england-patriots-offense-has-evolved-0ap3000000463883",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Patriots Offensive Evolution Super Bowl Bill Belichick Tom Brady",
      "url": "https://theringer.com/2018/02/02/nfl/patriots-offensive-evolution-super-bowl-bill-belichick-tom-brady",
      "domain": "theringer.com",
      "type": "citation"
    },
    {
      "text": "680974",
      "url": "https://www.nbcsportsboston.com/nfl/new-england-patriots/mike-vrabel-drake-maye-offense-scheme/680974/",
      "domain": "nbcsportsboston.com",
      "type": "citation"
    },
    {
      "text": "After Further Review Breaking Down Qb Drake Maye The Run Game And The Patriots Defense In Win Over Titans",
      "url": "https://www.patriots.com/news/after-further-review-breaking-down-qb-drake-maye-the-run-game-and-the-patriots-defense-in-win-over-titans",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Belichick Talks 4 3 3 4 Defense",
      "url": "https://www.espn.com/blog/boston/new-england-patriots/post/_/id/4699213/belichick-talks-4-3-3-4-defense",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "551491 New England Patriots A Fresh Perspective On The Bend Dont Break Defense",
      "url": "https://bleacherreport.com/articles/551491-new-england-patriots-a-fresh-perspective-on-the-bend-dont-break-defense",
      "domain": "bleacherreport.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=osxhc9Ko1Bc",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "2025 Reading New Defense New England Patriots",
      "url": "https://www.footballguys.com/article/2025-reading-new-defense-new-england-patriots",
      "domain": "footballguys.com",
      "type": "citation"
    },
    {
      "text": "Scouting Report New Englands Defense Is Fun So Long As Youre A Patriots Fan",
      "url": "https://steelersdepot.com/2025/09/scouting-report-new-englands-defense-is-fun-so-long-as-youre-a-patriots-fan/",
      "domain": "steelersdepot.com",
      "type": "citation"
    },
    {
      "text": "Bill Belichick Business Icon Patriot Way Hits The Office 0ap3000000839878",
      "url": "https://www.nfl.com/news/bill-belichick-business-icon-patriot-way-hits-the-office-0ap3000000839878",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "The Belichick Rules",
      "url": "https://www.kornferry.com/insights/briefings-magazine/issue-41/the-belichick-rules",
      "domain": "kornferry.com",
      "type": "citation"
    },
    {
      "text": "The Patriot Way A Model For Success Adopted By High School Programs Throughout Massachusetts",
      "url": "https://www.espn.com/blog/boston/high-school/post/_/id/43557/the-patriot-way-a-model-for-success-adopted-by-high-school-programs-throughout-massachusetts",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "As Rules Protect Quarterbacks Nfl Defenses Are On The Defensive.html",
      "url": "https://www.nytimes.com/2015/01/18/sports/football/as-rules-protect-quarterbacks-nfl-defenses-are-on-the-defensive.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Bill Belichick Matt Judon Jc Jackson 2021",
      "url": "https://www.sharpfootballanalysis.com/analysis/bill-belichick-matt-judon-jc-jackson-2021/",
      "domain": "sharpfootballanalysis.com",
      "type": "citation"
    },
    {
      "text": "Bill Belichicks Nfl Coaching Tree Continues To Grow Heres Who Could Be Next To Take Leap As A Head Coach",
      "url": "https://www.cbssports.com/nfl/news/bill-belichicks-nfl-coaching-tree-continues-to-grow-heres-who-could-be-next-to-take-leap-as-a-head-coach/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Tennessee Titans Nfl Mike Vrabel Bill Belichick Coaching Tree",
      "url": "https://www.si.com/nfl/titans/news/tennessee-titans-nfl-mike-vrabel-bill-belichick-coaching-tree",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "News Blitz 7 18 Bb S Family Tree 301291",
      "url": "https://www.patriots.com/news/news-blitz-7-18-bb-s-family-tree-301291",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Udfa Tracker Every Undrafted Rookie Patriots Signed After 2025 Nfl Draft.html",
      "url": "https://www.masslive.com/patriots/2025/04/udfa-tracker-every-undrafted-rookie-patriots-signed-after-2025-nfl-draft.html",
      "domain": "masslive.com",
      "type": "citation"
    },
    {
      "text": "Analysis Breaking Down The Patriots Undrafted Rookie Free Agent Signings",
      "url": "https://www.patriots.com/news/analysis-breaking-down-the-patriots-undrafted-rookie-free-agent-signings",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Belichick Patriots Success.html",
      "url": "https://www.nytimes.com/2024/01/11/business/belichick-patriots-success.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Why Patriots Are One Of The Best Teams At Managing Salary Cap",
      "url": "https://patriotswire.usatoday.com/2019/05/31/why-patriots-are-one-of-the-best-teams-at-managing-salary-cap/",
      "domain": "patriotswire.usatoday.com",
      "type": "citation"
    },
    {
      "text": "Forget The 40 Yard Dash How The Patriots Incorporate Analytics Into Their Draft Process",
      "url": "https://www.bostonherald.com/2021/04/15/forget-the-40-yard-dash-how-the-patriots-incorporate-analytics-into-their-draft-process/",
      "domain": "bostonherald.com",
      "type": "citation"
    },
    {
      "text": "Bsj Analytics Patriots Draft Picks Performed Compared Rest League",
      "url": "https://www.bostonsportsjournal.com/2018/04/25/bsj-analytics-patriots-draft-picks-performed-compared-rest-league",
      "domain": "bostonsportsjournal.com",
      "type": "citation"
    },
    {
      "text": "Bill Belichick New England Patriots Legacy Nfl Greatest Dynasty Innovation Tom Brady",
      "url": "https://www.espn.co.uk/nfl/story/_/id/39260168/bill-belichick-new-england-patriots-legacy-nfl-greatest-dynasty-innovation-tom-brady",
      "domain": "espn.co.uk",
      "type": "citation"
    },
    {
      "text": "Coaching Stability Key For Patriots Ravens",
      "url": "https://www.pressherald.com/2013/01/18/coaching-stability-key-for-patriots-ravens/",
      "domain": "pressherald.com",
      "type": "citation"
    },
    {
      "text": "2025 New England Patriots Offseason Primer",
      "url": "https://www.patriots.com/news/2025-new-england-patriots-offseason-primer",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Could Nfl Most Improved Team",
      "url": "https://www.si.com/nfl/patriots/news/new-england-patriots-could-nfl-most-improved-team",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "The New England Patriots And Beasley Media Group S 98 5 The Sports Hub Announce Multi Year Broadcast Extension",
      "url": "https://www.patriots.com/news/the-new-england-patriots-and-beasley-media-group-s-98-5-the-sports-hub-announce-multi-year-broadcast-extension",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Game Broadcast Info",
      "url": "https://www.patriots.com/audio/game-broadcast-info",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Patriots Radio Network Broadcast Team",
      "url": "https://985thesportshub.com/patriots-radio-network-broadcast-team/",
      "domain": "985thesportshub.com",
      "type": "citation"
    },
    {
      "text": "Bob Socci Named Play By Play Announcer For The New England Patriots On 98 188141",
      "url": "https://www.patriots.com/news/bob-socci-named-play-by-play-announcer-for-the-new-england-patriots-on-98-188141",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Zolak Named Pats Radio Analyst",
      "url": "https://www.espn.com/blog/new-england-patriots/post/_/id/4726555/zolak-named-pats-radio-analyst",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "How To Watch Listen Jets At Patriots Wk11",
      "url": "https://www.patriots.com/news/how-to-watch-listen-jets-at-patriots-wk11",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "List Of New England Patriots Broadcasters",
      "url": "https://americanfootballdatabase.fandom.com/wiki/List_of_New_England_Patriots_broadcasters",
      "domain": "americanfootballdatabase.fandom.com",
      "type": "citation"
    },
    {
      "text": "History 1990s",
      "url": "https://www.patriots.com/press-room/history-1990s",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "List Of New England Patriots Broadcasters",
      "url": "https://en.wikipedia.org/wiki/List_of_New_England_Patriots_broadcasters",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Nfl Television Blackout Policies",
      "url": "https://en.wikipedia.org/wiki/NFL_television_blackout_policies",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "When Was The Last Time A Home Game Of Your Hometown Nfl Team Was Blacked Out.455212",
      "url": "https://radiodiscussions.com/threads/when-was-the-last-time-a-home-game-of-your-hometown-nfl-team-was-blacked-out.455212/",
      "domain": "radiodiscussions.com",
      "type": "citation"
    },
    {
      "text": "Patriots Preseason Tv Network 181266",
      "url": "https://www.patriots.com/news/patriots-preseason-tv-network-181266",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots",
      "url": "https://www.sportsmediawatch.com/tv-schedules/nfl-tv-schedule/new-england-patriots/",
      "domain": "sportsmediawatch.com",
      "type": "citation"
    },
    {
      "text": "Wbz Tv And Tv38 Score Big On Patriots Coverage 115376",
      "url": "https://www.patriots.com/news/wbz-tv-and-tv38-score-big-on-patriots-coverage-115376",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "Wbz Tv Renews Exclusive New England Patriots Deal",
      "url": "https://www.sportspro.com/news/wbz-tv-renews-exclusive-new-england-patriots-deal/",
      "domain": "sportspro.com",
      "type": "citation"
    },
    {
      "text": "Nfl Completes Long Term Media Distribution Agreements Through 2033 Season",
      "url": "https://www.nfl.com/news/nfl-completes-long-term-media-distribution-agreements-through-2033-season",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Super Bowl Li Draws 111 3 Million Tv Viewers 190 8 Million Social Media Interactions",
      "url": "https://www.nielsen.com/insights/2017/super-bowl-li-draws-111-3-million-tv-viewers-190-8-million-social-media-interactions/",
      "domain": "nielsen.com",
      "type": "citation"
    },
    {
      "text": "Ways To Watch",
      "url": "https://www.patriots.com/watch-live-games/ways-to-watch",
      "domain": "patriots.com",
      "type": "citation"
    },
    {
      "text": "How To Watch Patriots Games Live Patriots Nfl Schedule",
      "url": "https://www.paramountplus.com/shows/nfl-on-cbs/news/1010762/how-to-watch-patriots-games-live-patriots-nfl-schedule/",
      "domain": "paramountplus.com",
      "type": "citation"
    },
    {
      "text": "Timeline Of Events Surrounding Patriots Videotaping Scandal 09000d5d8084899e",
      "url": "https://www.nfl.com/news/timeline-of-events-surrounding-patriots-videotaping-scandal-09000d5d8084899e",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://www.espn.com/nfl/news/story?id=3392047",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "14patriots.html",
      "url": "https://www.nytimes.com/2007/09/14/sports/football/14patriots.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Goodell Defends Destroying Evidence In Spygate Scandal 09000d5d8066c8af",
      "url": "https://www.nfl.com/news/goodell-defends-destroying-evidence-in-spygate-scandal-09000d5d8066c8af",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "Split Nfl New England Patriots Apart",
      "url": "https://www.espn.com/espn/otl/story/_/id/13533995/split-nfl-new-england-patriots-apart",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Nfl Releases Statement On Patriots Violations 0ap3000000492190",
      "url": "https://www.nfl.com/news/nfl-releases-statement-on-patriots-violations-0ap3000000492190",
      "domain": "nfl.com",
      "type": "citation"
    },
    {
      "text": "16walsh.html",
      "url": "https://www.nytimes.com/2008/05/16/sports/football/16walsh.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Robert Kraft Spygate Patriots Convtroversy Football Hall Of Fame Bid Nfl",
      "url": "https://www.cbsnews.com/boston/news/robert-kraft-spygate-patriots-convtroversy-football-hall-of-fame-bid-nfl/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Deflategate New England Patriots Investigation Wells Report",
      "url": "https://www.si.com/nfl/2015/05/06/deflategate-new-england-patriots-investigation-wells-report",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Following Up On Wells Report Questions",
      "url": "https://www.espn.com/blog/new-england-patriots/post/_/id/4781225/following-up-on-wells-report-questions",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Deflategate.pdf",
      "url": "https://www.wsj.com/public/resources/documents/Deflategate.pdf",
      "domain": "wsj.com",
      "type": "citation"
    },
    {
      "text": "Punishments Handed Tom Brady New England Patriots Deflategate",
      "url": "https://www.espn.com/nfl/story/_/id/12867594/punishments-handed-tom-brady-new-england-patriots-deflategate",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Patriots Lose Final Pick For Deflategate Giants Get Off Light For Walkie Talkie Scandal",
      "url": "https://www.cbssports.com/nfl/news/patriots-lose-final-pick-for-deflategate-giants-get-off-light-for-walkie-talkie-scandal/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "New Independent Study Questions Wells Report Says Unlikely Patriots Deflated Footballs",
      "url": "https://www.cbsnews.com/boston/news/new-independent-study-questions-wells-report-says-unlikely-patriots-deflated-footballs/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "New Deflategate Report Negative Light On Nfl Covering Up Facts Leaking False Information",
      "url": "https://www.cbsnews.com/boston/news/new-deflategate-report-negative-light-on-nfl-covering-up-facts-leaking-false-information/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Story",
      "url": "https://abcnews.go.com/Sports/deflate-gate-england-patriots-controversies/story?id=28373420",
      "domain": "abcnews.go.com",
      "type": "citation"
    },
    {
      "text": "New England Patriots Fined 11 Million Lose Draft Pick Film Crew Fallout",
      "url": "https://www.espn.com/nfl/story/_/id/29380577/new-england-patriots-fined-11-million-lose-draft-pick-film-crew-fallout",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Patriots Heeded Jerod Mayos Warning About Fighting In Eagles Joint Practice",
      "url": "https://www.bostonherald.com/2024/08/13/patriots-heeded-jerod-mayos-warning-about-fighting-in-eagles-joint-practice/",
      "domain": "bostonherald.com",
      "type": "citation"
    },
    {
      "text": "Falcons Coach Accuses Patriots Of Cheating Breaking Down What Happened And Mike Vrabels Response",
      "url": "https://www.cbssports.com/nfl/news/falcons-coach-accuses-patriots-of-cheating-breaking-down-what-happened-and-mike-vrabels-response/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Nfl Officiating Patriots Saints Opi Diggs Maye Douglas Touchdown Week 6",
      "url": "https://www.cbsnews.com/boston/news/nfl-officiating-patriots-saints-opi-diggs-maye-douglas-touchdown-week-6/",
      "domain": "cbsnews.com",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:25:36.803765",
  "elapsed_ms": 689741
}