{
  "topic": "Paris Agreement",
  "title": "Paris Agreement",
  "slug": "paris-agreement",
  "grokipedia_slug": "Paris_Agreement",
  "grokipedia_url": "https://grokipedia.com/page/Paris_Agreement",
  "source": "grokipedia",
  "content": "# Paris Agreement\n\nThe Paris Agreement is a legally binding international treaty on climate change, adopted by consensus among 196 Parties to the United Nations Framework Convention on Climate Change (UNFCCC) on 12 December 2015 during the 21st Conference of the Parties (COP21) in Paris, France. It entered into force on 4 November 2016, following ratification by at least 55 Parties representing over 55 percent of global greenhouse gas emissions. The treaty's core objective is to limit global average temperature rise to well below 2 °C above pre-industrial levels, while pursuing efforts to restrict it to 1.5 °C, primarily through country-specific, self-determined emission reduction targets known as nationally determined contributions (NDCs), which are updated every five years. Unlike prior accords such as the Kyoto Protocol, it imposes obligations on all Parties, including developing nations, but lacks mandatory enforcement mechanisms, relying instead on transparency frameworks, periodic global stocktakes, and voluntary compliance.\n\nThe agreement also addresses adaptation to climate impacts, technology transfer, and finance, with developed countries committing to mobilize $100 billion annually by 2020 (extended to 2025) for mitigation and adaptation in developing countries, though delivery has fallen short of expectations and verification remains contentious. Notable achievements include near-universal ratification, fostering a shift toward low-carbon policies in some jurisdictions, and establishing the first comprehensive review process via the global stocktake, which in 2023 highlighted insufficient progress toward the temperature goals. However, controversies persist over its effectiveness, as current NDCs project warming of 2.5–3 °C by 2100, and global CO₂ emissions from fossil fuels have risen approximately 9 percent since 2015, reaching record highs in 2023 without clear causal reversal attributable to the accord. Major emitters like China, classified as developing under the treaty, face fewer constraints on emission growth, exacerbating disparities between developed and developing nations' responsibilities. The United States, the second-largest emitter, withdrew in 2020 under President Trump citing economic burdens, rejoined in 2021 under President Biden, and initiated withdrawal proceedings again in January 2025, underscoring domestic political volatility in implementation. Empirical assessments indicate that while the agreement has elevated awareness and facilitated some bilateral cooperation, such as under Article 6 for carbon markets, it has not demonstrably altered global emission trajectories amid ongoing economic expansion in high-emission sectors.\n\n## Historical Development\n\n### Background and Lead-Up\n\nThe United Nations Framework Convention on Climate Change (UNFCCC), adopted on May 9, 1992, at the Earth Summit in Rio de Janeiro, established a framework for international cooperation to combat climate change by stabilizing atmospheric concentrations of greenhouse gases at levels that would prevent dangerous anthropogenic interference with the climate system. The convention entered into force on March 21, 1994, and categorized countries into Annex I (developed nations with binding reporting requirements) and non-Annex I (developing nations with fewer obligations), reflecting the principle of \"common but differentiated responsibilities.\" By 2015, global greenhouse gas emissions had risen substantially since 1990, with net carbon dioxide emissions increasing by 50% and total emissions growing by approximately 40%, largely driven by economic expansion in developing economies like China and India.\n\nThe Kyoto Protocol, adopted on December 11, 1997, at the third Conference of the Parties (COP3) in Kyoto, Japan, built on the UNFCCC by imposing legally binding emission reduction targets on Annex I countries, requiring an average cut of 5.2% below 1990 levels during the 2008–2012 commitment period. It entered into force on February 16, 2005, after ratification by Russia, but faced significant limitations: non-Annex I countries, including major emitters such as China (which overtook the United States as the world's largest emitter around 2006), bore no reduction obligations; the United States signed but never ratified due to concerns over economic impacts and lack of universality; and Canada withdrew in 2011. Despite these targets, global emissions continued to climb, with the protocol's mechanisms like emissions trading and clean development proving insufficient to alter the upward trajectory, as developing nations' emissions surged amid industrialization.\n\nSubsequent COP meetings highlighted the protocol's shortcomings. The 2009 Copenhagen conference (COP15) failed to yield a binding successor, producing only the non-binding Copenhagen Accord, which acknowledged the need to limit warming to below 2°C but relied on voluntary national pledges without enforcement or comprehensive coverage, drawing criticism for its vagueness and exclusion of key developing nations from firm commitments. Negotiations stalled until the 2011 Durban conference (COP17), where parties established the Ad Hoc Working Group on the Durban Platform for Enhanced Action (ADP) via Decision 1/CP.17, mandating the development of a new protocol, legal instrument, or agreed outcome applicable to all countries by 2015 for implementation from 2020 onward. This platform marked a pivotal shift toward universality, addressing Kyoto's bifurcated structure by seeking contributions from all parties while recognizing varying national circumstances, setting the stage for the Paris negotiations amid persistent emission growth.\n\n### Negotiations and Adoption\n\nThe negotiations leading to the Paris Agreement occurred at the 21st Conference of the Parties (COP21) to the United Nations Framework Convention on Climate Change (UNFCCC), convened from November 30 to December 11, 2015, at Le Bourget north of Paris, France. The conference brought together representatives from 196 UNFCCC Parties, including heads of state during the initial high-level segment, under the French presidency of Laurent Fabius, who chaired the proceedings as COP president. Building on the 2011 Durban Platform for Enhanced Action, the talks sought a new legal instrument applicable to all Parties to succeed the Kyoto Protocol, addressing long-standing divides over differentiation between developed and developing nations, emission reduction ambition, adaptation support, and climate finance mobilization.\n\nNegotiations proceeded in two phases: the first week focused on technical discussions under the Ad Hoc Working Group on the Durban Platform (ADP), narrowing draft texts amid contentious issues such as the legal form of commitments, the treatment of \"loss and damage\" from climate impacts, and financial pledges from developed countries totaling $100 billion annually by 2020. Ministers and high-level officials intensified efforts in the second week, with informal consultations and bilateral meetings resolving sticking points, including bracketing contentious language on equity and common but differentiated responsibilities and respective capabilities (CBDR-RC). Despite resistance from vulnerable small island developing states on insufficient ambition and from major emitters like India and China on sovereignty over national plans, compromises emerged through voluntary nationally determined contributions (NDCs) rather than top-down targets, enabling progress without invoking vetoes.\n\nOn December 12, 2015, following a final plenary where Fabius presented the consolidated text, the COP adopted the Paris Agreement by consensus, with 195 Parties approving the decision incorporating the agreement's 29 articles and preamble. The adoption document, proposed by the COP president, recalled prior UNFCCC decisions and forwarded the Agreement for signature, marking the culmination of four years of preparatory work without a single formal objection, though some delegates from low-lying nations expressed reservations about the 2°C temperature goal's feasibility. This outcome reflected pragmatic diplomacy amid geopolitical pressures, including post-terrorism solidarity in Paris, but relied on interpretive flexibility rather than binding enforcement mechanisms.\n\n### Signing, Ratification, and Entry into Force\n\nThe Paris Agreement was opened for signature on 22 April 2016 (Earth Day) at the United Nations Headquarters in New York, following its adoption at the 21st Conference of the Parties (COP21) to the United Nations Framework Convention on Climate Change (UNFCCC) in Paris on 12 December 2015. The signing ceremony saw participation from representatives of UNFCCC parties, with signatures indicating intent to ratify but not constituting legal binding until ratification, acceptance, approval, or accession.\n\nUnder Article 21 of the agreement, it would enter into force on the 30th day after at least 55 parties to the UNFCCC, accounting for at least 55 percent of the total global greenhouse gas emissions (as reported in 2014 Annex I inventories), deposited their instruments of ratification or equivalent with the UN depositary. The 55-party threshold was reached on 21 September 2016, primarily through ratifications by smaller emitters. The emissions threshold was met on 5 October 2016, when Bolivia became the 55th ratifying party, pushing the cumulative emissions share over 55 percent; this followed rapid actions by major emitters including China (ratified 3 September 2016, representing about 28 percent of global emissions), India (2 October 2016), and the European Union with several member states (such as Germany and France on 4 October 2016).\n\nThe agreement entered into force on 4 November 2016, becoming legally binding for ratifying parties and triggering obligations such as submission of nationally determined contributions. By that date, over 100 parties had ratified, though major emitters like the United States (which signed on 3 September 2016 but formally accepted via executive action later) and Japan had not yet completed domestic processes. As of October 2025, 195 UNFCCC parties (194 states plus the European Union) have ratified or acceded, leaving only a handful of non-parties such as Yemen and several small island nations amid ongoing conflicts or delays.\n\n## Core Objectives and Provisions\n\n### Primary Aims and Temperature Goals\n\nThe Paris Agreement, adopted on December 12, 2015, at the 21st Conference of the Parties (COP21) to the United Nations Framework Convention on Climate Change (UNFCCC), outlines its primary aims in Article 2. These aims seek to strengthen the global response to climate change within the context of sustainable development and poverty eradication by: (a) holding the increase in global average temperature to well below 2°C above pre-industrial levels while pursuing efforts to limit it to 1.5°C; (b) enhancing adaptive capacity, strengthening resilience, and enabling low greenhouse gas emissions development without threatening food production; and (c) aligning financial flows with pathways toward low emissions and climate-resilient development.\n\nThe agreement's long-term temperature goal, specified in Article 2.1(a), establishes a threshold of \"well below 2°C\" relative to pre-industrial levels (typically defined as the 1850–1900 baseline) as the primary benchmark, with an aspirational pursuit of 1.5°C to further mitigate risks and impacts of warming. This goal is framed as a collective, long-term equilibrium objective rather than a short-term annual limit, informed by assessments like those from the Intergovernmental Panel on Climate Change (IPCC), which indicate that limiting warming to 1.5°C would require global net anthropogenic CO₂ emissions to decline by about 45% from 2010 levels by 2030 and reach net zero by around 2050, while 2°C alignment allows for roughly 25% reductions by 2030 and net zero later in the century. The 1.5°C element emerged from advocacy by vulnerable small island and least-developed states, emphasizing differential impacts at higher warming levels, though the agreement does not impose binding emission trajectories on parties.\n\nThese temperature ambitions are non-binding in terms of specific national targets but underpin the agreement's structure, including nationally determined contributions (NDCs) and periodic global stocktakes to assess progress toward the goals. Article 4 further ties the goals to achieving global peaking of greenhouse gas emissions as soon as possible, followed by rapid reductions to attain net zero in the second half of the century, consistent with scientific evidence on carbon budgets and transient warming pathways. Independent analyses, such as those evaluating initial NDCs, have projected that even full implementation would likely result in warming exceeding 2°C, highlighting the aspirational nature of the goals absent enhanced ambition.\n\n### Nationally Determined Contributions\n\nNationally Determined Contributions (NDCs) constitute the core mechanism of the Paris Agreement, whereby each participating country outlines its planned post-2020 climate actions, primarily focused on reducing greenhouse gas emissions to contribute toward the agreement's temperature goals of limiting global warming to well below 2°C above pre-industrial levels, with efforts to restrict it to 1.5°C. Unlike the top-down binding targets of the Kyoto Protocol, NDCs are bottom-up and self-determined, allowing nations to set targets based on national circumstances, capabilities, and priorities, though they must represent each party's \"highest possible ambition\" at the time of submission. These contributions encompass mitigation strategies, adaptation measures, and, for developed countries, support for developing nations in finance, technology, and capacity-building.\n\nArticle 4 of the Paris Agreement mandates that parties communicate their NDCs every five years, with initial Intended NDCs (INDCs) submitted prior to ratification and full NDCs thereafter, ensuring progressive enhancement in ambition to bridge any gaps toward collective goals. NDCs must include quantifiable information on baseline scenarios, time frames, methodologies for emissions accounting, and assumptions underlying projections, promoting transparency without imposing uniform standards. The UNFCCC maintains a public NDC Registry to record these submissions, facilitating global oversight. For the 2025 cycle, termed NDC 3.0, parties are required to submit updated contributions by early February 2025—9 to 12 months before COP30—to cover targets through 2035, informed by the first global stocktake's findings on progress.\n\nCollectively, NDCs form the aggregate effort to achieve Paris objectives, yet analyses indicate substantial shortfalls: the 2024 UNFCCC NDC Synthesis Report, drawing from 168 submissions by 195 parties, projects emissions trajectories insufficient to meet the agreement's aims, requiring emissions reductions approximately three times greater than pledged for a 2°C pathway and seven times for 1.5°C.  While successive updates have modestly lowered projected warming— from around 3.7°C under initial pledges to about 2.5-2.9°C under current ones—implementation risks and conditional elements (tied to international support) further undermine reliability, with major emitters' trajectories often falling short of even their stated goals. Long-term low-emission development strategies, encouraged alongside NDCs, aim to provide vision beyond 2050, but adherence remains voluntary.\n\n### Transparency Framework and Global Stocktakes\n\nThe Enhanced Transparency Framework, established under Article 13 of the Paris Agreement, requires parties to submit biennial transparency reports (BTRs) detailing greenhouse gas inventories, progress toward nationally determined contributions (NDCs), information on climate change impacts and adaptation, and financial, technology, and capacity-building support provided or received. These reports, with the first due by December 31, 2024, undergo technical expert review followed by a facilitative, multilateral consideration of progress to foster accountability without punitive measures. Developing countries receive flexibilities, such as simplified reporting modalities, to accommodate capacity constraints, though this has raised concerns about comparability and rigor in assessments.\n\nEmpirical analyses indicate that while the framework aims to build trust through standardized reporting, its effectiveness in driving ambition or compliance remains limited, as flexibilities dilute uniformity and non-binding reviews lack enforcement mechanisms to compel revisions to inadequate NDCs. For instance, initial BTR submissions in 2024 revealed inconsistencies in emissions accounting methodologies across parties, undermining cross-country comparisons essential for evaluating collective progress. Critics argue that the framework's design prioritizes consensus over stringency, resulting in persistent gaps between reported intentions and verifiable outcomes, as evidenced by stalled advancements in global emissions trajectories despite enhanced reporting obligations.\n\nThe Global Stocktake, mandated by Article 14, occurs every five years to evaluate collective progress toward the Paris Agreement's long-term goals, including limiting warming to well below 2°C and pursuing 1.5°C efforts. The process involves technical assessments of mitigation, adaptation, and finance, culminating in political negotiations; the first stocktake spanned 2021–2023 and concluded at COP28 in Dubai on December 13, 2023, with a decision text urging parties to accelerate emissions cuts to reach net zero by 2050, triple renewable energy capacity, and double energy efficiency improvements by 2030. \n\nOutcomes from the 2023 stocktake underscored that current NDCs, even if fully implemented, would lead to warming exceeding 2°C, highlighting insufficient ambition despite near-universal participation, yet the non-binding nature of recommendations has not translated into measurable policy shifts in major emitters. The next stocktake, set for completion in 2028, will inform updated NDCs due in 2025 and 2030, but analyses suggest persistent challenges in bridging identified gaps without stronger incentives or verification tied to the transparency framework.\n\n### Adaptation, Loss and Damage, and Finance Commitments\n\nArticle 7 of the Paris Agreement establishes a global goal on adaptation to enhance adaptive capacity, strengthen resilience, and reduce vulnerability to the adverse effects of climate change among all parties. Parties are encouraged to engage in adaptation planning and implementation, including through national adaptation plans and strategies to assess vulnerability and form resilience-focused responses. Developed countries are to provide support, including finance, technology, and capacity-building, to developing nations for effective adaptation implementation, with an emphasis on scaling up resources while balancing them against mitigation efforts. Parties must submit and periodically update adaptation communications outlining their strategies, priorities, and needs, integrated where possible into nationally determined contributions (NDCs).\n\nArticle 8 recognizes the importance of averting, minimizing, and addressing loss and damage associated with climate change impacts, such as extreme weather events and slow-onset processes like sea-level rise, particularly in vulnerable developing countries. It builds upon the Warsaw International Mechanism for Loss and Damage, established at COP19 in 2013, which operates under the Conference of the Parties (COP) to promote implementation of approaches to address loss and damage, including through risk assessment, comprehensive strategies, and enhanced cooperation. The provision explicitly states that Article 8 does not involve or provide a basis for liability or compensation obligations, distinguishing it from adaptation by focusing on residual impacts beyond mitigation or adaptation capacities. Parties are to enhance cooperative action, including through institutional arrangements, technical assistance, and non-market approaches, with the executive committee of the Warsaw Mechanism tasked with guiding efforts.\n\nArticle 9 commits developed country parties to provide financial resources to assist developing countries in low-greenhouse-gas development, adaptation, and addressing loss and damage, with resources mobilized from public and private sources on a grant-equivalent basis where possible. This reaffirms the pre-existing goal, originating from the 2009 Copenhagen Accord, for developed nations to jointly mobilize $100 billion annually by 2020 for climate action in developing countries, with a balanced allocation between mitigation and adaptation. Progress toward the $100 billion target lagged in earlier years, with shortfalls reported through 2020, though OECD data indicates developed countries surpassed it in 2022 by providing approximately $115.9 billion, marking the first exceedance after methodological adjustments for consistency. The Agreement mandates a new collective quantified goal on finance post-2020, to be set by 2025, reflecting evolving needs and priorities of developing countries, with transparency requirements for reporting provided and mobilized resources.\n\nFinance delivery includes contributions to multilateral funds like the Green Climate Fund, where pledges as of 2018 highlighted major inputs from the United States, European nations, and Japan to support projects in developing countries. Despite improvements, critiques persist regarding the quality of finance—such as reliance on loans over grants—and whether reported figures fully align with additionality beyond existing official development assistance, underscoring gaps in verifiable, concessional support for adaptation and loss minimization. Parties also commit to capacity-building and technology transfer to enable developing countries to access and utilize these resources effectively.\n\n### Mitigation Mechanisms and Carbon Markets\n\nThe Paris Agreement promotes mitigation of greenhouse gas emissions primarily through nationally determined contributions (NDCs), where Parties voluntarily outline their emission reduction targets and plans, without legally binding enforcement. These mechanisms emphasize domestic policy actions such as renewable energy deployment, energy efficiency improvements, and fossil fuel phase-downs, with the expectation that countries progressively enhance ambition in successive NDCs every five years. Article 4 requires Parties to pursue implementation of these commitments, aiming for economy-wide absolute emission reductions post-2020, though compliance relies on transparency and peer review rather than penalties.\n\nTo facilitate cost-effective mitigation, Article 6 establishes cooperative approaches enabling Parties to transfer mitigation outcomes across borders, including through market-based instruments. Under Article 6.2, countries can engage in bilateral or multilateral agreements to authorize and transfer Internationally Transferred Mitigation Outcomes (ITMOs), which represent quantified emission reductions or removals corresponding to one tonne of CO2 equivalent. These ITMOs must undergo corresponding adjustments in national inventories to prevent double-counting, where a reduction is claimed by both the originating and receiving Party. Guidance finalized at COP26 in 2021 mandates reporting on ITMO creation, transfer, and use, including promotion of sustainable development in the host country, but implementation has been slowed by uncertainties in accounting standards.\n\nArticle 6.4 creates a centralized, UN-supervised crediting mechanism as a successor to the Kyoto Protocol's Clean Development Mechanism (CDM), allowing emission reductions from projects to generate credits usable toward NDCs, provided they deliver sustainable development benefits and avoid credits from activities restricted under the Agreement, such as nuclear projects without stringent safety standards. Rules adopted at COP26 and refined at COP29 in 2024 include a supervisory body to accredit auditors and a share of proceeds for adaptation funding, but critics argue the framework lacks sufficient safeguards against over-crediting or low-integrity projects. \n\nCarbon markets under Article 6 aim to lower abatement costs by directing investments to low-cost opportunities, theoretically enhancing overall ambition as reductions occur where marginal abatement is cheapest. As of 2025, over 130 Parties have referenced Article 6 in their NDCs or strategies, with bilateral deals like Switzerland's ITMO purchases from Peru and Ghana totaling millions of tonnes, yet global transactions remain limited, representing less than 1% of potential NDC fulfillment. Empirical assessments indicate these markets have not significantly strengthened domestic carbon pricing, with post-Paris carbon tax effectiveness showing insignificant improvements due to persistent issues like non-additionality—where credits fund reductions that would occur anyway—and leakage, where emissions shift without net global decline. \n\nNon-market approaches under Article 6.8 complement markets by facilitating cooperation through technology transfer, capacity-building, and joint policies without financial exchanges, though these have seen minimal structured implementation. Overall effectiveness is constrained by governance gaps, including weak verification of baselines and permanence of removals, leading to risks of greenwashing where credits inflate perceived progress without verifiable emission cuts; peer-reviewed analyses highlight that offsets have historically failed to deliver durable reductions in 75-90% of cases due to these flaws. \n\n## Participation and Status\n\n### Ratification by Countries\n\nThe Paris Agreement, adopted on December 12, 2015, opened for signature on April 22, 2016 (Earth Day), at the United Nations headquarters in New York, attracting signatures from 175 states and the regional economic integration organization of the European Union on the opening day, with additional signatures bringing the total to 196 by the end of the signature period on April 21, 2017. Ratification, acceptance, approval, or accession—collectively termed \"ratification\" here—required each signatory to complete its domestic legal procedures, which varied widely by national constitutional requirements, ranging from executive actions to parliamentary approvals. This process enabled the agreement's entry into force under Article 21, which stipulated a \"double threshold\": ratification by at least 55 parties to the UNFCCC accounting for an estimated 55 percent of global greenhouse gas emissions.\n\nThe threshold was met on October 5, 2016, when the number of ratifying parties reached 72 (exceeding the 55-party minimum) and their collective emissions share surpassed 55 percent, triggered by key actions including joint ratification announcements by China and the United States on September 3, 2016; India's ratification on October 2, 2016; Brazil's on September 29, 2016; and the European Union's on October 5, 2016.  The agreement thus entered into force on November 4, 2016, thirty days later, binding ratifying parties to its provisions from that date. Post-entry, ratification momentum built rapidly, with over 100 additional parties joining by the end of 2017, driven by diplomatic pressures at subsequent UNFCCC conferences and alignment with national climate policies.\n\nBy October 2025, 195 parties—comprising 194 UNFCCC member states and the European Union—had ratified, accepted, approved, or acceded to the agreement, achieving near-universal adherence among the 198 UNFCCC parties and covering approximately 99 percent of global emissions.  The three non-parties are Iran, Libya, and Yemen, none of which have signed or acceded, though their exclusion has minimal impact on global emissions coverage given their relatively small shares (Iran at about 2 percent of global CO2 in recent years).  Among major emitters, notable ratification dates include China (September 3, 2016), the European Union (October 5, 2016), India (October 2, 2016), Russia (September 23, 2019), and Japan (November 7, 2016), reflecting a pattern where early ratifiers were often developing or middle-income nations with streamlined processes, while some larger economies delayed for internal policy alignment. This widespread ratification underscores the agreement's diplomatic success in securing formal commitments, though empirical assessments of compliance with subsequent nationally determined contributions remain separate from the ratification act itself.\n\n### United States Involvement, Withdrawals, and Re-Engagements\n\nThe United States participated actively in the negotiations leading to the Paris Agreement's adoption on December 12, 2015, under President Barack Obama, with Secretary of State John Kerry playing a key role at COP21 in Paris. The U.S. signed the agreement on April 22, 2016, during the ceremony at the United Nations in New York. Rather than seeking Senate ratification, which requires a two-thirds majority under Article II of the U.S. Constitution for treaties, the Obama administration treated the Paris Agreement as an executive agreement, allowing acceptance without congressional approval. On September 3, 2016, the U.S. deposited its instrument of acceptance alongside China, enabling the agreement to reach the threshold for entry into force on November 4, 2016.\n\nOn June 1, 2017, President Donald Trump announced the U.S. intention to withdraw from the Paris Agreement, citing concerns over economic burdens and unfair terms favoring developing nations. Formal notification of withdrawal was submitted to the United Nations depositary on November 4, 2019, with the exit taking effect one year later on November 4, 2020, as stipulated by Article 28 of the agreement. This marked the U.S. as the only nation to have withdrawn from the accord at that time, though domestic policies under Trump continued some emissions reductions independently of the agreement.\n\nPresident Joe Biden reversed course by signing an executive order on January 20, 2021—his first day in office—directing the U.S. to rejoin the Paris Agreement. The instrument of acceptance was deposited, making re-entry effective on February 19, 2021, after the required 30-day waiting period. Under Biden, the U.S. submitted an updated nationally determined contribution aiming for a 50-52% reduction in greenhouse gas emissions from 2005 levels by 2030.\n\nFollowing his reelection, President Trump initiated a second withdrawal process on January 20, 2025, by directing the U.S. Ambassador to the United Nations to submit formal notification of intent to withdraw. Per the agreement's terms, this withdrawal would become effective one year after notification, potentially in early 2026, unless rescinded. The absence of Senate ratification has facilitated these unilateral executive actions on U.S. participation, highlighting the agreement's non-binding nature domestically without legislative consent.\n\n### Non-Participation and Holdouts\n\nAs of October 2025, 195 of the 198 parties to the United Nations Framework Convention on Climate Change (UNFCCC) are parties to the Paris Agreement, with Iran, Libya, and Yemen remaining the sole holdouts that have neither ratified nor acceded to the treaty. Iran signed the agreement on April 22, 2016, but has withheld ratification, citing international sanctions imposed by Western nations as a barrier to accessing climate finance, technology transfers, and development aid essential for compliance. Iranian leadership has further argued that the sanctions exacerbate economic vulnerabilities, making emission reduction commitments untenable without relief, while emphasizing the agreement's insufficient differentiation in obligations between high-emitting developed states and oil-dependent economies like Iran's.\n\nLibya also signed on April 22, 2016, but ratification has stalled due to chronic political instability and factional conflict since the 2011 overthrow of Muammar Gaddafi, which has impeded the formation of a cohesive national authority required for treaty approval. This governance vacuum has extended to climate policy, with Libya failing to submit a nationally determined contribution (NDC) or engage meaningfully in UNFCCC reporting mechanisms. As an OPEC member with vast oil reserves, Libya's hesitation reflects broader reservations among hydrocarbon exporters about constraints on fossil fuel production under the agreement's mitigation framework.\n\nYemen, embroiled in civil war since 2014, has neither signed nor ratified the agreement, as fragmented control between the Houthi-led government, the internationally recognized administration, and other factions has paralyzed foreign policy decisions and resource allocation. The conflict's devastation, including infrastructure collapse and humanitarian crises, has deprioritized international environmental commitments, leaving Yemen without an NDC or adaptation plans despite its vulnerability to climate-exacerbated droughts and flooding.\n\nAmong the holdouts, Iran accounts for the most significant share of unpacted emissions, emitting approximately 2.5% of global CO2 in 2023, driven by natural gas flaring, oil production, and subsidized fossil fuel consumption—levels that rival some Annex I parties despite its non-Annex I status. Libya and Yemen contribute far less, at under 0.5% and negligible shares respectively, but their non-participation underscores enforcement challenges for states prioritizing sovereignty, economic survival, or security over voluntary pledges. This limited but persistent resistance contrasts with near-universal adoption elsewhere, highlighting the agreement's reliance on self-interest rather than binding penalties for abstention.\n\n## Implementation and Compliance\n\n### National-Level Actions and NDC Updates\n\nUnder the Paris Agreement, national-level actions to implement mitigation and adaptation commitments are primarily channeled through each Party's Nationally Determined Contributions (NDCs), which outline country-specific targets, timelines, and strategies for reducing greenhouse gas emissions and enhancing resilience. Article 4 requires Parties to pursue domestic mitigation measures aimed at achieving their NDCs, with successive contributions communicated every five years to reflect progressively higher ambition relative to prior efforts, while considering national circumstances. These NDCs serve as the core mechanism for translating international goals into enforceable national policies, such as emission caps, renewable energy mandates, efficiency standards, and forestry conservation programs.\n\nThe first round of NDCs was submitted around the Agreement's entry into force in 2016, with updates due by 2020 to cover targets through 2030. By the 2020 deadline, over 190 Parties had submitted or updated NDCs, though analyses indicated that full implementation would still result in global warming exceeding 2°C above pre-industrial levels. Examples of national actions include the European Union's adoption of the European Green Deal in 2019, which integrates NDC targets into binding legislation like the Effort Sharing Regulation for non-ETS sectors, and China's 2020 NDC update emphasizing carbon intensity reductions and peaking emissions before 2030 through coal phase-downs and electrification. In developing nations, actions often focus on adaptation alongside mitigation, such as India's National Adaptation Fund for Climate Change, which allocates resources for resilient agriculture and water management as outlined in its NDC.\n\nFor the 2025 update cycle, known as NDCs 3.0, Parties are required to submit revised contributions by February 2025, extending targets to 2035 and incorporating outcomes from the first global stocktake completed in 2023, which highlighted insufficient progress toward 1.5°C or 2°C limits. These updates must demonstrate enhanced ambition in absolute emission reductions, particularly for major emitters, and include economy-wide coverage where feasible. As of September 30, 2025, 61 countries representing 31% of global emissions had submitted new or updated NDCs, including major economies like Brazil, Canada, Japan, and the United Kingdom, though delays persist among high-emission nations such as China, India, and Russia. National implementation of these updates involves legislative reforms, such as Uganda's and Nigeria's 2021 National Climate Change Acts, which domesticate NDC commitments into legal frameworks for monitoring and enforcement.\n\nProgress in national actions remains uneven, with many countries integrating NDCs into long-term strategies via sector-specific policies like carbon pricing mechanisms—adopted by over 40 jurisdictions covering 23% of global emissions—or subsidies for low-carbon technologies. However, empirical tracking shows gaps in execution; for instance, while the United States' 2021 NDC update targeted a 50-52% reduction from 2005 levels by 2030, supported by the Inflation Reduction Act's incentives for clean energy, actual deployment lags in permitting and infrastructure. Similarly, the EU's 2023 NDC revision aims for a 55% reduction by 2030 from 1990 levels, enforced through updated national energy and climate plans, yet member states vary in compliance due to economic dependencies on fossil fuels. These actions underscore the Agreement's reliance on voluntary domestic efforts without centralized mandates, leading to calls for verifiable progress indicators in future updates.\n\n### International Reporting and Verification\n\nThe Paris Agreement's Article 13 establishes the Enhanced Transparency Framework (ETF), which requires all parties to submit biennial transparency reports (BTRs) detailing greenhouse gas inventories, progress toward nationally determined contributions (NDCs), adaptation actions, and financial support provided or received.  This framework aims to build mutual trust and promote effective implementation through standardized reporting, while incorporating flexibility for developing countries to accommodate varying capacities.  Unlike the Kyoto Protocol's binding measurement, reporting, and verification (MRV) for developed nations only, the ETF applies universally but replaces differentiated regimes with common modalities, procedures, and guidelines (MPGs) adopted in 2021.\n\nBTRs must be submitted every two years, with the first round due by December 31, 2024; these include national inventory reports (NIRs) on emissions and, for non-Annex I parties, information necessary to track progress.  As of February 2025, 105 parties had submitted their initial BTRs, though full compliance remains incomplete, with synthesis reports highlighting gaps in data from many nations.  Verification occurs via a Technical Expert Review (TER) for each BTR, assessing consistency, completeness, and transparency, followed by a Facilitative Multilateral Consideration of Progress (FMCP) at the Conference of the Parties serving as the meeting of the Parties to the Paris Agreement (CMA), which provides non-binding recommendations without punitive measures. Capacity-building initiatives, such as the Paris Committee on Capacity-building, assist developing countries in meeting these requirements, yet institutional weaknesses persist.\n\nEmpirical assessments reveal challenges in verification and compliance, including inconsistent data quality, delays in submissions, and difficulties in independently confirming self-reported emissions due to the framework's facilitative nature.  For instance, while the ETF enhances comparability over prior UNFCCC reporting, reliance on national self-assessments without robust third-party audits limits causal accountability, potentially allowing free-riding by major emitters.  Developing nations often cite resource constraints as barriers to full reporting, prompting calls for extended technical support, though critics argue this flexibility undermines uniform verification.  Overall, the process supports global stocktakes but faces systemic gaps in enforcement, with compliance driven more by reputational pressures than legal obligations.\n\n### Enforcement Gaps and Compliance Issues\n\nThe Paris Agreement's enforcement framework, outlined in Article 15, relies on the Paris Agreement Implementation and Compliance Committee (PAICC), a 12-member body established in 2021 to facilitate implementation and promote compliance through non-adversarial, non-punitive measures. The PAICC conducts assessments of systemic issues, provides capacity-building support, and addresses questions of implementation raised by parties, but it possesses no authority to impose sanctions, fines, or mandatory adjustments to non-compliant behavior. This facilitative approach underscores a core enforcement gap: the absence of coercive tools, such as trade penalties or legal tribunals, which limits the agreement's ability to compel adherence amid divergent national interests.\n\nNationally Determined Contributions (NDCs), the cornerstone of mitigation commitments, are voluntary and lack legal binding force, exacerbating compliance vulnerabilities as countries face no direct repercussions for underperformance or withdrawal from targets. Enforcement thus depends on transparency frameworks and informal mechanisms like naming-and-shaming via global stocktakes, yet empirical analyses indicate these have limited efficacy in altering trajectories for high-emission nations resistant to external pressure. The agreement's design prioritizes participation over punition, but this has drawn criticism for enabling free-riding, where countries pledge ambitious goals without corresponding domestic enforcement or verifiable progress. Developing nations, in particular, cite capacity constraints in monitoring and reporting as barriers, though the PAICC's supportive role has not sufficiently bridged these gaps to ensure consistent data integrity.\n\nCompliance issues manifest in widespread failure to meet procedural and substantive obligations, with nearly 95% of parties missing the February 2025 deadline for submitting updated NDCs targeting 2035 emissions reductions. Assessments by independent trackers reveal that major economies, including those in the G20—which account for approximately 80% of global emissions—are pursuing policies insufficient to align with the agreement's well-below-2°C goal, often due to low NDC ambition, inconsistent policy mixes, and opposition from vested interests.  For instance, countries rated \"critically insufficient\" or \"highly insufficient\" by the Climate Action Tracker, such as China, India, and several oil-dependent states, project emissions growth incompatible with Paris pathways, highlighting risks from inadequate institutional enforcement and unreliable self-reporting. These shortfalls persist despite biennial transparency reports, as the lack of punitive incentives allows political shifts and economic priorities to override commitments, resulting in a substantial implementation gap between pledged and actual reductions.\n\n## Effectiveness and Empirical Impact\n\n### Measured Achievements in Emissions and Policy\n\nSince the Paris Agreement's entry into force on November 4, 2016, global greenhouse gas (GHG) emissions growth has decelerated markedly, averaging 0.32% per year from 2015 to 2023, a slowdown attributed in part to heightened policy ambition and renewable energy deployment spurred by national commitments. This contrasts with pre-2015 trends of faster expansion, with projections indicating that current policies yield lower 2030 emissions levels than scenarios absent the Agreement's framework. In developed economies, absolute emissions have declined; for instance, EU-27 GHG emissions fell 32% from 1990 to 2022, driven by energy efficiency and renewables policies aligned with Nationally Determined Contributions (NDCs).\n\nRenewable energy capacity has expanded rapidly, with global additions reaching a record 582 gigawatts (GW) in 2024 alone, contributing to clean sources comprising 40% of electricity generation that year. From 2015 to 2024, annual renewable electricity capacity grew by approximately 2,600 GW, a 140% increase, facilitated by NDC-linked incentives and international cooperation under the Agreement. Specific policies, such as feed-in tariffs and subsidies in over 100 countries, have yielded measurable reductions; a global evaluation of 1,500 climate policies identified combinations like renewable portfolio standards paired with carbon taxes as achieving major sectoral cuts, including up to 20% in power sector emissions in implementing jurisdictions.\n\nOn policy fronts, 196 parties have submitted NDCs or updates by 2024, with many incorporating enhanced targets for 2035, including net-zero pledges by mid-century in 90% of G20 nations. Article 6 mechanisms for carbon markets have advanced, enabling cooperative approaches that supported over 100 bilateral agreements by 2025, though full operationalization remains incomplete. Compliance reporting has improved, with enhanced transparency frameworks under the Agreement's Article 13 leading to biennial updates from major emitters, fostering verifiable progress in sectors like transport and industry. These steps have correlated with diversified energy mixes, reducing reliance on coal in regions like the European Union and parts of Asia.\n\n### Shortfalls in Global Emissions Reductions\n\nGlobal greenhouse gas emissions have risen steadily since the Paris Agreement's adoption in 2015, reaching 57.1 GtCO2e in 2023, rather than peaking and declining as necessary to align with the pact's aim of limiting warming to well below 2°C. Energy-related CO2 emissions alone hit a record 37.4 Gt in 2023, up 1.1% from 2022, with preliminary data indicating further increases to approximately 37.6 Gt in 2024. This upward trajectory reflects shortfalls in implementation, as emissions growth has slowed to about 0.32% annually from 2015 to 2024—down from 1.7% in the prior decade—but remains positive despite accelerating clean energy deployment.\n\nNationally determined contributions (NDCs) under the Paris Agreement have proven insufficient, with current unconditional pledges projecting emissions 3% above 2019 levels by 2030, whereas a 28% reduction is required for a 2°C pathway and 42% for 1.5°C.  Even if all conditional NDCs are met with full international support, the emissions gap persists, leading assessments to forecast 2.5–2.9°C warming by 2100 under implemented policies and pledges. The Climate Action Tracker rates most major economies' targets and actions as inadequate or insufficient relative to Paris goals, with low probabilities of achievement for targets in countries like China, India, and the United States.\n\nEmpirical data underscore compliance gaps: while some nations, such as those in the European Union, have reduced emissions post-2015, global totals are driven higher by expanding energy demand in developing economies and rebound effects from events like the COVID-19 pandemic, which saw a temporary 2020 dip reversed by 2021. Annual UNEP Emissions Gap Reports consistently highlight that without accelerated reductions—potentially through deeper cuts in fossil fuel use and enhanced carbon sinks—Paris objectives remain unattainable, as current policies lock in emissions pathways exceeding safe limits. These shortfalls stem from economic priorities overriding climate pledges, inadequate enforcement mechanisms, and reliance on voluntary commitments without binding penalties.\n\n### Projections and Causal Analysis of Temperature Effects\n\nProjections based on full implementation of current unconditional Nationally Determined Contributions (NDCs) under the Paris Agreement indicate a median global temperature increase of approximately 2.6°C by 2100 relative to pre-industrial levels. Including conditional NDCs, which depend on international support, lowers this estimate to around 2.5°C, while incorporating announced long-term net-zero targets reduces it further to about 2.1°C. These estimates derive from integrated assessment models that simulate emissions trajectories, socioeconomic developments, and climate responses, as assessed in frameworks aligned with IPCC AR6 scenarios.\n\nCausal analysis of temperature effects requires tracing the Agreement's influence through policy adoption to emissions reductions and subsequent radiative forcing. Post-2015, global greenhouse gas emissions have risen at an annual rate of about 1.1% from 2015–2019, comparable to pre-Paris trends of 1.8% over prior decades, indicating minimal deceleration attributable directly to the Agreement. While NDCs have prompted renewable energy expansions and efficiency measures in some nations, major emitters like China and India continue emissions growth due to economic priorities, weakening the causal link to global-scale forcing reductions.\n\nTemperature projections hinge on transient climate response and equilibrium climate sensitivity (ECS), with IPCC AR6 estimating ECS at a best value of 3°C per CO2 doubling (likely range 2.5–4.0°C). However, empirical constraints from observed warming and paleoclimate data suggest possible lower sensitivities, potentially capping Paris-aligned warming closer to 2°C even under partial NDC achievement, though models assuming higher ECS predict overshoots beyond Agreement thresholds. Causal realism underscores that committed warming from past emissions—already embedding 1.1–1.2°C—plus lagged ocean heat uptake limits near-term temperature stabilization, rendering NDC-driven forcings insufficient for 1.5°C without unprecedented compliance and technological breakthroughs. Non-linear feedbacks, such as permafrost thaw or aerosol reductions, introduce further uncertainty, with peer-reviewed assessments emphasizing that policy efficacy depends on verifiable enforcement rather than pledges alone.\n\n## Criticisms and Controversies\n\n### Economic Costs and Burdens on Developed Nations\n\nThe Paris Agreement requires developed nations to mobilize $100 billion annually in climate finance for developing countries by 2020, a commitment reaffirmed in subsequent COP decisions and exceeded in 2022 with $115.9 billion provided and mobilized, predominantly from public sources in countries such as the United States, European Union members, and Japan. These funds support mitigation and adaptation efforts in recipient nations, including major emitters like China classified as developing under the agreement, thereby imposing a recurring fiscal burden on donor economies without equivalent binding reduction obligations on recipients. The United States pledged $3 billion to the Green Climate Fund in 2014, disbursing approximately $1 billion before the 2017 withdrawal, while the European Union and its members have committed tens of billions, straining national budgets amid competing domestic priorities.\n\nDomestically, fulfilling nationally determined contributions (NDCs) under the agreement necessitates costly transitions to low-emission energy systems, including subsidies for renewables, carbon pricing, and fossil fuel phase-outs, which elevate energy costs and disrupt traditional industries in developed economies. In the United States, economic modeling estimates that adherence to Paris targets could reduce GDP by 2.5% by 2035 relative to baseline growth, equivalent to $2.5 trillion in lost output, while imposing cumulative household costs of nearly $20,000 per family of four through higher energy prices and regulatory compliance.  European nations face similar pressures; the EU Emissions Trading System and renewable mandates aligned with Paris goals have contributed to electricity price surges, with wholesale prices tripling in periods of high gas dependence and projections indicating further rises by 2030 driven by elevated CO2 and fuel costs.  Germany's Energiewende policy, pursued in line with agreement objectives, has resulted in some of the world's highest household electricity rates, exceeding 30 euro cents per kWh as of 2023, exacerbating industrial competitiveness losses.\n\nBroader analyses project global implementation costs of $819 billion to $1.89 trillion annually by 2030 to meet Paris pledges, with developed nations bearing the majority through direct expenditures and foregone economic activity, yet achieving only marginal emissions reductions insufficient for the agreement's aspirational temperature goals. Economists such as Bjørn Lomborg argue that these expenditures yield net economic losses for decades, as the quantified benefits from averted climate damages do not materialize until after 2070 under optimistic scenarios, prioritizing short-term burdens over verifiable long-term gains. While proponents cite co-benefits like technological innovation, empirical evidence from policy-induced energy price hikes and job displacements in coal-dependent regions underscores the immediate fiscal and opportunity costs concentrated in advanced economies. These dynamics have fueled criticisms that the agreement disproportionately encumbers developed nations, subsidizing emissions growth elsewhere without enforceable reciprocity.\n\n### Sovereignty and Voluntary Nature Concerns\n\nCritics of the Paris Agreement have argued that its framework, while nominally voluntary, introduces elements of international oversight that could erode national sovereignty. The agreement's nationally determined contributions (NDCs) are not legally binding under international law, allowing parties to set their own emission targets and timelines without enforceable penalties for non-compliance. However, provisions for enhanced transparency (Article 13) require parties to submit regular reports on progress, subject to international technical expert review and a multilateral peer review process, which some view as an infringement on domestic policy autonomy.\n\nThe compliance mechanism outlined in Article 15 further fuels these concerns, as it establishes a committee to \"facilitate implementation and promote compliance\" through confidential consultations and potential public reporting of non-compliance, despite its explicitly non-adversarial, non-punitive, and facilitative design. Critics contend this creates indirect pressures via reputational risks or \"naming and shaming,\" potentially compelling nations to align domestic policies with global expectations rather than national priorities. Additionally, linkages between agreement participation and access to international climate finance, such as the Green Climate Fund, may incentivize compliance through economic leverage, blurring the line between voluntarism and obligation.\n\nIn the United States, these issues culminated in President Donald Trump's announcement of withdrawal on June 1, 2017, effective November 4, 2020, which he framed explicitly as \"a reassertion of America's sovereignty.\" Trump administration officials argued the agreement imposed unfair economic burdens while subjecting U.S. decisions to international scrutiny without reciprocal Senate ratification, treating it effectively as an executive agreement bypassing constitutional treaty processes. The U.S. rejoined under President Joe Biden on February 19, 2021, but the withdrawal highlighted broader debates over whether such multilateral frameworks prioritize supranational norms over sovereign decision-making.\n\nProponents counter that the agreement respects sovereignty by design, with withdrawal provisions under Article 28 allowing exit after one year's notice, and no direct enforcement powers. Nonetheless, skeptics maintain that the voluntary structure's reliance on diplomatic and financial incentives fosters a de facto erosion of autonomy, particularly for developed nations funding adaptation in others, without symmetric constraints on major emitters like China and India. This tension underscores ongoing questions about balancing global cooperation with national self-determination in climate policy.\n\n### Inequity Toward Developing Economies and Major Emitters\n\nThe Paris Agreement incorporates the principle of common but differentiated responsibilities (CBDR), which differentiates obligations based on historical emissions and economic capacity, imposing stricter mitigation targets on developed nations while granting developing countries greater flexibility in their nationally determined contributions (NDCs). This framework, intended to promote equity, has drawn criticism from developing economies for failing to deliver sufficient support for their transition to low-carbon development amid rising global emissions pressures. Major emitters like China and India, classified as developing despite accounting for roughly 35% of global CO2 emissions combined in recent years, argue that the agreement undervalues their developmental needs, such as poverty reduction and industrialization, which require continued fossil fuel use. \n\nA core grievance centers on climate finance commitments, where developed countries pledged $100 billion annually by 2020 to assist developing nations with mitigation and adaptation, yet delivery has been inconsistent and often subpar. Official reports indicate the goal was met in 2022 for the first time, but analyses reveal that a significant portion consisted of loans rather than grants, increasing debt loads in recipient countries without addressing grant-based needs for non-debt-creating support.   Developing economies, including least developed countries, report shortfalls in accessible funding, with only a fraction directed toward adaptation despite their vulnerability to climate impacts they contributed minimally to historically. For instance, between 2017 and 2018, several developed donors like Canada and Australia recorded billion-dollar gaps in their contributions.\n\nMajor emitters among developing nations face additional inequities through international calls to abandon their developing status, which would strip flexibilities under CBDR and impose developed-country-level obligations without commensurate historical benefits or financial inflows. China, the largest global emitter at about 30% of CO2 output, has resisted such reclassification, emphasizing its per capita emissions remain far below those of the United States and that its NDC commitments—peaking emissions before 2030 and achieving carbon neutrality by 2060—already strain its growth model reliant on coal for energy security.  Similarly, India, with emissions intensity targets in its NDCs rather than absolute reductions, contends that curbing coal use prematurely would hinder lifting 1.4 billion people from poverty, as its per capita emissions stand at roughly one-seventh of the U.S. level. These pressures, absent proportional technology transfers or finance, underscore perceived imbalances where developing major emitters bear disproportionate scrutiny for current emissions while developed nations retain advantages from past industrialization.\n\n### Skepticism on Scientific Assumptions and Policy Efficacy\n\nCritics of the Paris Agreement contend that its foundational scientific assumptions overestimate the magnitude of anthropogenic influence on climate and the predictability of future warming from emissions reductions. Climate models underpinning the agreement's targets have projected warming rates exceeding observed global temperature increases over recent decades. A 2024 analysis of 38 major models found that the observed warming rate of approximately 0.14°C per decade from 1970 to 2023 falls below predictions from 36 of them, which averaged 0.22°C per decade or higher, suggesting systematic overestimation potentially due to overstated positive feedbacks like water vapor amplification. This discrepancy raises questions about the reliability of model-based projections for policy, as models tuned to historical data may embed assumptions of high climate sensitivity that have not materialized empirically.\n\nEquilibrium climate sensitivity (ECS), defined as the expected global temperature rise from a doubling of atmospheric CO2 concentrations, remains a core uncertainty, with the Intergovernmental Panel on Climate Change's (IPCC) Sixth Assessment Report estimating a likely range of 2.5–4.0°C, though critics argue this skews toward upper-end values influenced by model ensembles rather than direct observations. Empirical assessments, including satellite-era data and paleoclimate proxies, have yielded lower ECS estimates around 1.0–2.0°C, implying less severe long-term impacts from emissions than assumed in Paris scenarios. Such variability underscores risks in basing global policy on equilibrium assumptions that discount transient responses, natural forcings like solar irradiance or ocean cycles (e.g., Atlantic Multidecadal Oscillation), and potential negative feedbacks not fully captured in general circulation models.\n\nRegarding policy efficacy, even optimistic fulfillment of Nationally Determined Contributions (NDCs) under the Paris Agreement is projected to yield minimal temperature mitigation. A peer-reviewed analysis estimated that current pledges, if met, would avert only about 0.05°C of warming by 2100 relative to business-as-usual scenarios, far short of the 1.5–2.0°C goals, due to insufficient aggregate emissions cuts and reliance on aspirational rather than binding targets. This limited impact stems from exemptions for major developing emitters like China and India, whose coal expansion offsets reductions elsewhere, and the agreement's voluntary structure, which lacks enforcement to ensure compliance amid economic incentives for fossil fuel use. Critics, including economist Bjørn Lomborg, argue that the high costs of rapid decarbonization—estimated in trillions annually—do not justify such marginal benefits, prioritizing adaptation over mitigation given historical precedents where emissions decoupled from growth in some nations without Paris-style interventions. Sources advancing these critiques, often from independent researchers outside consensus-driven institutions, highlight potential biases in IPCC-linked modeling toward alarmist outcomes to bolster policy urgency.\n\n## Reception and Future Prospects\n\n### Global and Domestic Political Responses\n\nThe Paris Agreement elicited varied political responses globally, with near-universal ratification reflecting diplomatic consensus among 195 parties by 2023, though implementation enthusiasm diverged based on national economic priorities. Chinese President Xi Jinping and European Commission President Jean-Claude Juncker affirmed continued adherence following the initial U.S. withdrawal announcement in 2017, emphasizing multilateral cooperation to meet emission targets. Indian Prime Minister Narendra Modi endorsed the accord while stressing equity for developing nations, ratifying it on October 2, 2016, alongside commitments to enhance renewable energy capacity. In contrast, leaders from coal-reliant economies, such as Poland's deputy energy minister Grzegorz Tobiszowski, welcomed the U.S. exit as aligning with energy security interests, highlighting tensions between climate goals and domestic fossil fuel dependencies. Nicaragua initially rejected the agreement in 2017, citing insufficient ambition from major emitters, but acceded in 2020 after revisions to its national stance.\n\nDomestically in the United States, the agreement became a flashpoint for partisan division, with President Barack Obama accepting it via executive action on September 3, 2016, without Senate ratification, framing it as essential for global leadership on emissions. President Donald Trump initiated withdrawal on June 1, 2017, effective November 4, 2020, arguing it imposed unfair economic burdens estimated at $2.7 million lost jobs and $3 trillion in GDP by 2040, per administration analyses prioritizing sovereignty over voluntary pledges. President Joe Biden reversed course, rejoining on February 19, 2021, and submitting updated nationally determined contributions aiming for 50-52% emissions reductions by 2030 from 2005 levels; however, a second withdrawal process commenced under Trump's January 20, 2025, inauguration, underscoring ongoing domestic polarization where Republican opposition views the accord as detrimental to manufacturing competitiveness. Public opinion polls indicate majority American support for participation, yet congressional Republicans have blocked binding legislation, limiting enforceability to executive discretion.\n\nIn Europe, the European Union ratified the agreement as a bloc on October 5, 2016, driving domestic policies like Germany's Energiewende coal phaseout by 2038, though populist governments in Hungary and Poland resisted stringent targets favoring nuclear and lignite interests. China's National People's Congress ratified on October 3, 2016, with President Xi pledging carbon peaking by 2030 and neutrality by 2060, but domestic coal expansion continued, reflecting political prioritization of growth over immediate cuts amid rising emissions. India's ratification aligned with domestic solar initiatives targeting 175 gigawatts by 2022, yet Prime Minister Modi critiqued the accord's differentiated responsibilities as inadequate, advocating for technology transfers from developed nations to offset adaptation costs estimated at $2.5 trillion annually for vulnerable economies. These responses reveal a pattern where political support correlates with perceived alignment between global pledges and national sovereignty, with enforcement relying on voluntary updates at Conferences of the Parties rather than penalties.\n\n### Recent Developments and 2025 Outlook\n\nAt the 2024 United Nations Climate Change Conference (COP29) in Baku, Azerbaijan, parties finalized rules for Article 6 of the Paris Agreement, enabling international carbon markets and crediting mechanisms to facilitate emissions reductions through tradable offsets, with safeguards against double-counting and inconsistencies in internationally transferred mitigation outcomes (ITMOs). Negotiators also established a new collective quantified goal on climate finance, committing developed nations to mobilize at least $300 billion annually by 2035 for developing countries' mitigation and adaptation efforts, though this falls short of the trillions estimated necessary by independent analyses to bridge adaptation gaps. The UNFCCC's 2024 NDC Synthesis Report, covering 168 submissions from 195 parties, revealed that current nationally determined contributions (NDCs) would lead to global emissions 2.6% to 10.4% higher in 2030 than 2019 levels, far exceeding the 42% reduction required by that year to align with Paris temperature goals.\n\nGlobal greenhouse gas emissions continued upward in 2024, with fossil fuel CO2 reaching 37.4 billion tonnes—a 0.8% increase from 2023—and total CO2 emissions projected at 41.6 billion tonnes, driven primarily by growth in emerging economies like China and India despite incremental renewable energy expansions in Europe and the US. In the US, preliminary estimates indicated a slight decline in overall GHG emissions amid economic growth, attributed to natural gas displacing coal, but this was offset globally by rising demand in developing regions. On January 20, 2025, President Donald Trump issued an executive order directing the US withdrawal from the Paris Agreement, revoking prior commitments including NDCs and ceasing implementation of related policies, marking the second such exit under his administration and signaling reduced American leadership in multilateral climate efforts.\n\nLooking to 2025, COP30 in Belém, Brazil, in November will review progress on the first NDC cycle and demand submissions of updated 2035 targets, with emphasis on accelerating energy transitions and ecosystem restoration to close the emissions gap, as current trajectories project a 2.5–2.9°C warming by 2100 even if pledges are met. The World Resources Institute's State of Climate Action 2025 report assesses that sectoral pathways in power, industry, and transport remain off-track for limiting warming to 1.5°C, requiring tripling of renewables and efficiency gains beyond current policies, though geopolitical shifts like the US withdrawal may erode momentum and finance mobilization. Analysts anticipate heightened focus on adaptation finance and loss-and-damage mechanisms, but persistent emissions growth and uneven NDC ambition—particularly from major emitters exempt from binding caps—suggest limited causal impact on reversing trends without enforced penalties or technological breakthroughs.\n\n### Potential Reforms or Alternatives\n\nSeveral proposals have emerged to reform the Paris Agreement by enhancing its ambition and implementation mechanisms. Advocates for reform argue that the agreement's voluntary nationally determined contributions (NDCs) lack sufficient enforcement, with current pledges projected to result in global warming of approximately 2.4–2.8°C above pre-industrial levels by 2100, far exceeding the 1.5–2°C targets. To address this, some experts recommend introducing majority voting in UN climate negotiations to replace consensus requirements, which have stalled progress on contentious issues like finance and loss-and-damage funds, potentially requiring three-quarters agreement for core procedural changes. Others propose ratcheting up NDC stringency through mandatory five-year reviews with binding escalation if global emissions trajectories fail to align with temperature goals, alongside expanded transparency frameworks to verify compliance via standardized reporting. European policymakers have called for a 90% emissions reduction target by 2040 for the EU to demonstrate leadership ahead of COP30 in 2025, aiming to pressure major emitters like China and India to revise their NDCs upward.\n\nFinancial reforms constitute another focus, given shortfalls in mobilizing the $100 billion annual climate finance pledge from developed to developing nations, which was only met in 2022 after delays and definitional disputes over what qualifies as \"new and additional\" funding. Suggestions include reforming multilateral development banks to unlock hundreds of billions through de-risking private investments and establishing global levies on sectors like international shipping or fossil fuel extraction to generate revenue independently of national budgets. However, critics contend these measures overlook enforcement challenges, as non-compliance penalties remain absent, potentially perpetuating free-riding by high-emission developing economies exempt from stringent timelines.\n\nAs alternatives to the Paris framework, \"climate clubs\" have been proposed as a decentralized approach to mitigate free-rider incentives inherent in universal treaties. In this model, coalitions of like-minded nations implement coordinated carbon pricing or technology standards, offering tariff exemptions or technology access to members while imposing border adjustments on non-participants to internalize externalities. Economists like William Nordhaus argue this could achieve deeper emissions cuts than the Paris Agreement's bottom-up structure, which relies on non-binding pledges without reciprocal incentives. Other alternatives emphasize unilateral national policies prioritizing innovation over international mandates, such as U.S. executive orders in January 2025 directing \"America First\" negotiations that favor domestic energy independence and market-driven decarbonization through R\\u0026D tax credits rather than regulatory burdens. Skeptics of Paris-style accords, including analyses from policy institutes, advocate shifting to sector-specific bilateral deals or domestic market reforms—like carbon taxes rebated to citizens—to foster technological breakthroughs without the economic costs estimated at trillions in lost GDP from compliance. These alternatives prioritize causal drivers of emissions decline, such as abundant natural gas and nuclear expansion, over top-down diplomacy that has yielded minimal temperature impact despite decade-long implementation.",
  "external_references": [
    {
      "text": "The Paris Agreement",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Climate Finance And The Usd 100 Billion Goal.html",
      "url": "https://www.oecd.org/en/topics/sub-issues/climate-finance-and-the-usd-100-billion-goal.html",
      "domain": "oecd.org",
      "type": "citation"
    },
    {
      "text": "S43247 025 02743 X",
      "url": "https://www.nature.com/articles/s43247-025-02743-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Climate Trace Data Reveal High Impact Opportunities For",
      "url": "https://climatetrace.org/news/climate-trace-data-reveal-high-impact-opportunities-for",
      "domain": "climatetrace.org",
      "type": "citation"
    },
    {
      "text": "R48504",
      "url": "https://www.congress.gov/crs-product/R48504",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Article6",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement/article6",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "History Of The Convention",
      "url": "https://unfccc.int/process/the-convention/history-of-the-convention",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Climate Change Indicators Global Greenhouse Gas Emissions",
      "url": "https://www.epa.gov/climate-indicators/climate-change-indicators-global-greenhouse-gas-emissions",
      "domain": "epa.gov",
      "type": "citation"
    },
    {
      "text": "Global Greenhouse Gas Emissions 1990 2015",
      "url": "https://www.usgs.gov/media/images/global-greenhouse-gas-emissions-1990-2015",
      "domain": "usgs.gov",
      "type": "citation"
    },
    {
      "text": "Paris Global Climate Change Agreements",
      "url": "https://www.cfr.org/backgrounder/paris-global-climate-change-agreements",
      "domain": "cfr.org",
      "type": "citation"
    },
    {
      "text": "Yale Experts Explain Paris Climate Agreement",
      "url": "https://sustainability.yale.edu/explainers/yale-experts-explain-paris-climate-agreement",
      "domain": "sustainability.yale.edu",
      "type": "citation"
    },
    {
      "text": "Success Or Failure The Kyoto Protocols Troubled Legacy",
      "url": "https://www.climateforesight.eu/articles/success-or-failure-the-kyoto-protocols-troubled-legacy/",
      "domain": "climateforesight.eu",
      "type": "citation"
    },
    {
      "text": "The History Of Global Climate Change Negotiations",
      "url": "https://commonslibrary.parliament.uk/the-history-of-global-climate-change-negotiations/",
      "domain": "commonslibrary.parliament.uk",
      "type": "citation"
    },
    {
      "text": "Copenhagen Closes Weak Deal",
      "url": "https://www.theguardian.com/environment/2009/dec/19/copenhagen-closes-weak-deal",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Outcomes Of The Durban Conference",
      "url": "https://unfccc.int/process/conferences/the-big-picture/milestones/outcomes-of-the-durban-conference",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Adp Bodies Page",
      "url": "https://unfccc.int/adp-bodies-page",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Pa.html",
      "url": "https://legal.un.org/avl/ha/pa/pa.html",
      "domain": "legal.un.org",
      "type": "citation"
    },
    {
      "text": "Durban Platform Negotiations Goals And Options",
      "url": "https://www.belfercenter.org/publication/durban-platform-negotiations-goals-and-options",
      "domain": "belfercenter.org",
      "type": "citation"
    },
    {
      "text": "Finale Cop21",
      "url": "https://unfccc.int/news/finale-cop21",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Summary Report",
      "url": "https://enb.iisd.org/paris-climate-change-conference-cop21/summary-report",
      "domain": "enb.iisd.org",
      "type": "citation"
    },
    {
      "text": "L09.pdf",
      "url": "https://unfccc.int/resource/docs/2015/cop21/eng/l09.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Parisagreement Publication.pdf",
      "url": "https://unfccc.int/sites/default/files/resource/parisagreement_publication.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Viewdetails.aspx",
      "url": "https://treaties.un.org/pages/viewdetails.aspx?src=treaty\\u0026mtdsg_no=xxvii-7-d\\u0026chapter=27\\u0026clang=_en",
      "domain": "treaties.un.org",
      "type": "citation"
    },
    {
      "text": "Status Of Ratification",
      "url": "https://unfccc.int/process/the-paris-agreement/status-of-ratification",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Paris Agreement Comes Into Force",
      "url": "https://www.nortonrosefulbright.com/en-bi/knowledge/publications/b12ed838/paris-agreement-comes-into-force",
      "domain": "nortonrosefulbright.com",
      "type": "citation"
    },
    {
      "text": "Timeline Paris Agreement",
      "url": "https://www.consilium.europa.eu/en/policies/paris-agreement-climate/timeline-paris-agreement/",
      "domain": "consilium.europa.eu",
      "type": "citation"
    },
    {
      "text": "Paris Agreement",
      "url": "https://www.un.org/en/climatechange/paris-agreement",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "English Paris Agreement.pdf",
      "url": "https://unfccc.int/sites/default/files/english_paris_agreement.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Key Aspects Of The Paris Agreement",
      "url": "https://unfccc.int/most-requested/key-aspects-of-the-paris-agreement",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Sr15",
      "url": "https://www.ipcc.ch/sr15/",
      "domain": "ipcc.ch",
      "type": "citation"
    },
    {
      "text": "Paris Temperature Goal",
      "url": "https://climateactiontracker.org/methodology/paris-temperature-goal/",
      "domain": "climateactiontracker.org",
      "type": "citation"
    },
    {
      "text": "Nationally Determined Contributions Ndcs",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement/nationally-determined-contributions-ndcs",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Q And A Understanding Paris Agreement Ndcs",
      "url": "https://www.c2es.org/content/q-and-a-understanding-paris-agreement-ndcs/",
      "domain": "c2es.org",
      "type": "citation"
    },
    {
      "text": "All About Ndcs",
      "url": "https://www.un.org/en/climatechange/all-about-ndcs",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "Ndcreg",
      "url": "https://unfccc.int/NDCREG",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Ndc 3.0",
      "url": "https://unfccc.int/ndc-3.0",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "641792",
      "url": "https://unfccc.int/documents/641792",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Pmc9209833",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9209833/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Emissions Gap Report 2023",
      "url": "https://www.unep.org/resources/emissions-gap-report-2023",
      "domain": "unep.org",
      "type": "citation"
    },
    {
      "text": "Preparing For The Etf",
      "url": "https://unfccc.int/process-and-meetings/transparency-and-reporting/preparing-for-the-ETF",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Enhanced Transparency Framework Technical Material",
      "url": "https://unfccc.int/process-and-meetings/transparency-and-reporting/support-for-developing-countries/consultative-group-of-experts/enhanced-transparency-framework-technical-material",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "036f6f4e782b395118aa8c9a71c23a94",
      "url": "https://www.cambridge.org/core/journals/transnational-environmental-law/article/is-enhanced-transparency-the-backbone-of-the-paris-agreement-a-critical-assessment/036F6F4E782B395118AA8C9A71C23A94",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000613",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "337564403 Transparency Requirements Under The Paris Agreement And Their Unlikely Impact On Strengthening The Ambition Of Nationally Determined Contributions Ndcs",
      "url": "https://www.researchgate.net/publication/337564403_Transparency_requirements_under_the_Paris_Agreement_and_their_unlikely_impact_on_strengthening_the_ambition_of_nationally_determined_contributions_NDCs",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Global Stocktake",
      "url": "https://unfccc.int/topics/global-stocktake",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Outcome Of The First Global Stocktake",
      "url": "https://unfccc.int/topics/global-stocktake/about-the-global-stocktake/outcome-of-the-first-global-stocktake",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Cma2023 L17 Adv.pdf",
      "url": "https://unfccc.int/sites/default/files/resource/cma2023_L17_adv.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Global Stocktake Reports Highlight Urgent Need For Accelerated Action To Reach Climate Goals",
      "url": "https://www.un.org/en/climatechange/global-stocktake-reports-highlight-urgent-need-for-accelerated-action-to-reach-climate-goals",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "What Is The Global Stocktake",
      "url": "https://www.mckinsey.com/featured-insights/mckinsey-explainers/what-is-the-global-stocktake",
      "domain": "mckinsey.com",
      "type": "citation"
    },
    {
      "text": "New Elements And Dimensions Of Adaptation Under The Paris Agreement Article 7",
      "url": "https://unfccc.int/topics/adaptation-and-resilience/the-big-picture/new-elements-and-dimensions-of-adaptation-under-the-paris-agreement-article-7",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Adaptation Communications",
      "url": "https://unfccc.int/topics/adaptation-and-resilience/workstreams/adaptation-communications",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Ref 8 Decision Xcp.21.pdf",
      "url": "https://unfccc.int/files/adaptation/groups_committees/loss_and_damage_executive_committee/application/pdf/ref_8_decision_xcp.21.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Climate Finance In The Negotiations",
      "url": "https://unfccc.int/topics/climate-finance/the-big-picture/climate-finance-in-the-negotiations",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Developed Countries Materially Surpassed Their Usd 100 Billion Climate Finance Commitment In 2022 Oecd.html",
      "url": "https://www.oecd.org/en/about/news/press-releases/2024/05/developed-countries-materially-surpassed-their-usd-100-billion-climate-finance-commitment-in-2022-oecd.html",
      "domain": "oecd.org",
      "type": "citation"
    },
    {
      "text": "From Billions To Trillions Setting A New Goal On Climate Finance",
      "url": "https://unfccc.int/news/from-billions-to-trillions-setting-a-new-goal-on-climate-finance",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "100 Billion Climate Finance Provided Fact Or Fiction",
      "url": "https://www.cgdev.org/blog/100-billion-climate-finance-provided-fact-or-fiction",
      "domain": "cgdev.org",
      "type": "citation"
    },
    {
      "text": "Article 64 Mechanism",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement/article-64-mechanism",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Sbsta48.2 12a Dt Outcome.pdf",
      "url": "https://unfccc.int/sites/default/files/resource/sbsta48.2_12a_DT_Outcome.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Cooperative Approaches",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement/article-6/article-62/carp/cooperative-approaches",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Cop27 Faq Article 6 Of The Paris Agreement Explained",
      "url": "https://carbonmarketwatch.org/2022/11/02/cop27-faq-article-6-of-the-paris-agreement-explained/",
      "domain": "carbonmarketwatch.org",
      "type": "citation"
    },
    {
      "text": "What You Need To Know About Article 6 Of The Paris Agreement",
      "url": "https://www.worldbank.org/en/news/feature/2022/05/17/what-you-need-to-know-about-article-6-of-the-paris-agreement",
      "domain": "worldbank.org",
      "type": "citation"
    },
    {
      "text": "Faq Fixing Article 6 Carbon Markets At Cop29",
      "url": "https://carbonmarketwatch.org/2024/11/06/faq-fixing-article-6-carbon-markets-at-cop29/",
      "domain": "carbonmarketwatch.org",
      "type": "citation"
    },
    {
      "text": "New Report Highlights Global Progress On Paris Agreement Article 6 Implementation",
      "url": "https://a6partnership.org/news/new-report-highlights-global-progress-on-paris-agreement-article-6-implementation",
      "domain": "a6partnership.org",
      "type": "citation"
    },
    {
      "text": "448861",
      "url": "https://carbon-pulse.com/448861/",
      "domain": "carbon-pulse.com",
      "type": "citation"
    },
    {
      "text": "Carbon Offsets Have Failed 25 Years And Most Should Be Phased Out Research 0",
      "url": "https://www.smithschool.ox.ac.uk/news/carbon-offsets-have-failed-25-years-and-most-should-be-phased-out-research-0",
      "domain": "smithschool.ox.ac.uk",
      "type": "citation"
    },
    {
      "text": "S44177 025 00084 0",
      "url": "https://link.springer.com/article/10.1007/s44177-025-00084-0",
      "domain": "link.springer.com",
      "type": "citation"
    },
    {
      "text": "S258979182500026x",
      "url": "https://www.sciencedirect.com/science/article/pii/S258979182500026X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "W 003 3376",
      "url": "https://uk.practicallaw.thomsonreuters.com/w-003-3376?transitionType=Default\\u0026contextData=%28sc.Default%29",
      "domain": "uk.practicallaw.thomsonreuters.com",
      "type": "citation"
    },
    {
      "text": "Paris Climate Agreement Everything You Need Know",
      "url": "https://www.nrdc.org/stories/paris-climate-agreement-everything-you-need-know",
      "domain": "nrdc.org",
      "type": "citation"
    },
    {
      "text": "President Obama United States Formally Enters Paris Agreement",
      "url": "https://obamawhitehouse.archives.gov/blog/2016/09/03/president-Obama-United-states-formally-enters-Paris-agreement",
      "domain": "obamawhitehouse.archives.gov",
      "type": "citation"
    },
    {
      "text": "R44609",
      "url": "https://www.congress.gov/crs-product/R44609",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "R48504.1.pdf",
      "url": "https://www.congress.gov/crs_external_products/R/PDF/R48504/R48504.1.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Us Withdrawal Paris Climate Agreement Effective Today",
      "url": "https://www.asil.org/ILIB/us-withdrawal-paris-climate-agreement-effective-today",
      "domain": "asil.org",
      "type": "citation"
    },
    {
      "text": "Science Environment 54797743",
      "url": "https://www.bbc.com/news/science-environment-54797743",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Executive Order On Tackling The Climate Crisis At Home And Abroad",
      "url": "https://bidenwhitehouse.archives.gov/briefing-room/presidential-actions/2021/01/27/executive-order-on-tackling-the-climate-crisis-at-home-and-abroad/",
      "domain": "bidenwhitehouse.archives.gov",
      "type": "citation"
    },
    {
      "text": "The United States Officially Rejoins The Paris Agreement",
      "url": "https://2021-2025.state.gov/the-united-states-officially-rejoins-the-paris-agreement/",
      "domain": "2021-2025.state.gov",
      "type": "citation"
    },
    {
      "text": "Paris Climate Agreement",
      "url": "https://eelp.law.harvard.edu/tracker/paris-climate-agreement/",
      "domain": "eelp.law.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Putting America First In International Environmental Agreements",
      "url": "https://www.whitehouse.gov/presidential-actions/2025/01/putting-america-first-in-international-environmental-agreements/",
      "domain": "whitehouse.gov",
      "type": "citation"
    },
    {
      "text": "Science Environment 59242986",
      "url": "https://www.bbc.com/news/science-environment-59242986",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "2445851",
      "url": "https://www.aa.com.tr/en/middle-east/how-sanctions-bar-iran-from-joining-paris-climate-accord/2445851",
      "domain": "aa.com.tr",
      "type": "citation"
    },
    {
      "text": "Countries Yet Ratify Paris Agreement",
      "url": "https://www.climatechangenews.com/2020/08/13/countries-yet-ratify-paris-agreement/",
      "domain": "climatechangenews.com",
      "type": "citation"
    },
    {
      "text": "Climate Change Libya Lags Behind Mitigation Policies 36824",
      "url": "https://www.ispionline.it/en/publication/climate-change-libya-lags-behind-mitigation-policies-36824",
      "domain": "ispionline.it",
      "type": "citation"
    },
    {
      "text": "Environment And Climate Change",
      "url": "https://www.undp.org/libya/environment-and-climate-change",
      "domain": "undp.org",
      "type": "citation"
    },
    {
      "text": "Climate Change A New Battlefield In Yemens Ongoing Conflict",
      "url": "https://arabcenterdc.org/resource/climate-change-a-new-battlefield-in-yemens-ongoing-conflict/",
      "domain": "arabcenterdc.org",
      "type": "citation"
    },
    {
      "text": "Yemnc2.pdf",
      "url": "https://unfccc.int/resource/docs/natc/yemnc2.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Iran",
      "url": "https://climateactiontracker.org/countries/iran/",
      "domain": "climateactiontracker.org",
      "type": "citation"
    },
    {
      "text": "Assessing 2025 Ndcs",
      "url": "https://www.wri.org/insights/assessing-2025-ndcs",
      "domain": "wri.org",
      "type": "citation"
    },
    {
      "text": "Ndcs Nationally Determined Contributions Climate Change What You Need To Know",
      "url": "https://climatepromise.undp.org/news-and-stories/NDCs-nationally-determined-contributions-climate-change-what-you-need-to-know",
      "domain": "climatepromise.undp.org",
      "type": "citation"
    },
    {
      "text": "Eprs Bri%282025%29775905",
      "url": "https://www.europarl.europa.eu/thinktank/en/document/EPRS_BRI%282025%29775905",
      "domain": "europarl.europa.eu",
      "type": "citation"
    },
    {
      "text": "The Enhanced Transparency Framework In Practice.pdf",
      "url": "https://www.c2es.org/wp-content/uploads/2024/07/The-Enhanced-Transparency-Framework-in-Practice.pdf",
      "domain": "c2es.org",
      "type": "citation"
    },
    {
      "text": "Transparency Of Support Under The Paris Agreement",
      "url": "https://unfccc.int/topics/climate-finance/workstreams/transparency-of-support-ex-post/transparency-of-support-under-the-paris-agreement",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "3.%2520day%25201 Overview%2520of%2520the%2520enhanced%2520transparency%2520framework%2520under%2520the%2520paris%2520agreement.pdf",
      "url": "https://climate-transparency-platform.org/sites/default/files/2023-08/3.%2520Day%25201_Overview%2520of%2520the%2520enhanced%2520transparency%2520framework%2520under%2520the%2520Paris%2520Agreement.pdf",
      "domain": "climate-transparency-platform.org",
      "type": "citation"
    },
    {
      "text": "Cdp Enhanced Transparency Policy Paper.pdf",
      "url": "https://cdn.cdp.net/cdp-production/cms/policy_briefings/documents/000/007/443/original/CDP_Enhanced_Transparency_Policy_Paper.pdf?1700831191",
      "domain": "cdn.cdp.net",
      "type": "citation"
    },
    {
      "text": "Biennial Transparency Reports",
      "url": "https://unfccc.int/biennial-transparency-reports",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "First Biennial Transparency Reports",
      "url": "https://unfccc.int/first-biennial-transparency-reports",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Fb8b5567 51d7 4508 859b 2b1712bc543c",
      "url": "https://cgspace.cgiar.org/items/fb8b5567-51d7-4508-859b-2b1712bc543c",
      "domain": "cgspace.cgiar.org",
      "type": "citation"
    },
    {
      "text": "Lead Reviewers Strengthen Biennial Transparency Report Review Process",
      "url": "https://unfccc.int/news/lead-reviewers-strengthen-biennial-transparency-report-review-process",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "First Look At Btrs.pdf",
      "url": "https://www.oeko.de/fileadmin/user_upload/First-look-at-BTRs.pdf",
      "domain": "oeko.de",
      "type": "citation"
    },
    {
      "text": "Transparency",
      "url": "https://www.thegef.org/what-we-do/topics/transparency",
      "domain": "thegef.org",
      "type": "citation"
    },
    {
      "text": "20733 14.html",
      "url": "https://ideas.repec.org/h/elg/eechap/20733_14.html",
      "domain": "ideas.repec.org",
      "type": "citation"
    },
    {
      "text": "Will The Transparency Rulebook Thwart Free Riders In The Paris Agreement",
      "url": "https://ghginstitute.org/2017/12/07/will-the-transparency-rulebook-thwart-free-riders-in-the-paris-agreement/",
      "domain": "ghginstitute.org",
      "type": "citation"
    },
    {
      "text": "14693062.2021.1895705",
      "url": "https://www.tandfonline.com/doi/full/10.1080/14693062.2021.1895705",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Enhanced Transparency New Report Highlights Progress Challenges And Next Steps",
      "url": "https://unfccc.int/news/enhanced-transparency-new-report-highlights-progress-challenges-and-next-steps",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "S41599 023 02054 6",
      "url": "https://www.nature.com/articles/s41599-023-02054-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "50b84953 B848 4e66 Bca0 4982606cae1e",
      "url": "https://dalspace.library.dal.ca/items/50b84953-b848-4e66-bca0-4982606cae1e",
      "domain": "dalspace.library.dal.ca",
      "type": "citation"
    },
    {
      "text": "Paicc",
      "url": "https://unfccc.int/PAICC",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "More About Paicc",
      "url": "https://unfccc.int/process-and-meetings/bodies/constituted-bodies/paris-agreement-implementation-and-compliance-committee-paicc/more-about-paicc",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://repository.law.miami.edu/cgi/viewcontent.cgi?article=2034\\u0026context=fac_articles",
      "domain": "repository.law.miami.edu",
      "type": "citation"
    },
    {
      "text": "Pnas.2305075120",
      "url": "https://www.pnas.org/doi/10.1073/pnas.2305075120",
      "domain": "pnas.org",
      "type": "citation"
    },
    {
      "text": "The Paris Agreement All Bark No Bite",
      "url": "https://djilp.org/the-paris-agreement-all-bark-no-bite/",
      "domain": "djilp.org",
      "type": "citation"
    },
    {
      "text": "Improving Paris Agreement Compliance Delivery Mechanisms And Strengthening Global Climate Accountability",
      "url": "https://www.ceew.in/publications/improving-paris-agreement-compliance-delivery-mechanisms-and-strengthening-global-climate-accountability",
      "domain": "ceew.in",
      "type": "citation"
    },
    {
      "text": "Analysis 95 Of Countries Miss Un Deadline To Submit 2035 Climate Pledges",
      "url": "https://www.carbonbrief.org/analysis-95-of-countries-miss-un-deadline-to-submit-2035-climate-pledges/",
      "domain": "carbonbrief.org",
      "type": "citation"
    },
    {
      "text": "G20 Climate Strategies Insufficient Meet Paris Agreement Goals 2025 01 31 En",
      "url": "https://joint-research-centre.ec.europa.eu/jrc-news-and-updates/g20-climate-strategies-insufficient-meet-paris-agreement-goals-2025-01-31_en",
      "domain": "joint-research-centre.ec.europa.eu",
      "type": "citation"
    },
    {
      "text": "14693062.2025.2513023",
      "url": "https://www.tandfonline.com/doi/full/10.1080/14693062.2025.2513023",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Countries",
      "url": "https://climateactiontracker.org/countries/",
      "domain": "climateactiontracker.org",
      "type": "citation"
    },
    {
      "text": "10 Years Post Paris Emissions.pdf",
      "url": "https://ca1-eci.edcdn.com/reports/10-Years-Post-Paris-Emissions.pdf?v=1758746633",
      "domain": "ca1-eci.edcdn.com",
      "type": "citation"
    },
    {
      "text": "Science.adl6547",
      "url": "https://www.science.org/doi/10.1126/science.adl6547",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Record Global Renewable Energy Growth Remains Short Climate Target Report Says 2025 10 14",
      "url": "https://www.reuters.com/sustainability/cop/record-global-renewable-energy-growth-remains-short-climate-target-report-says-2025-10-14/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Clean Energy Electricity Nature And Climate Stories This Week",
      "url": "https://www.weforum.org/stories/2025/04/clean-energy-electricity-nature-and-climate-stories-this-week/",
      "domain": "weforum.org",
      "type": "citation"
    },
    {
      "text": "Renewable Energy",
      "url": "https://www.un.org/en/climatechange/raising-ambition/renewable-energy",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "Massive Global Growth Of Renewables To 2030 Is Set To Match Entire Power Capacity Of Major Economies Today Moving World Closer To Tripling Goal",
      "url": "https://www.iea.org/news/massive-global-growth-of-renewables-to-2030-is-set-to-match-entire-power-capacity-of-major-economies-today-moving-world-closer-to-tripling-goal",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "Emissions Gap Report 2024",
      "url": "https://www.unep.org/resources/emissions-gap-report-2024",
      "domain": "unep.org",
      "type": "citation"
    },
    {
      "text": "Co2 Emissions In 2023",
      "url": "https://www.iea.org/reports/co2-emissions-in-2023",
      "domain": "iea.org",
      "type": "citation"
    },
    {
      "text": "Emissions Growth Slows 5 Fold Since Paris Deal As Clean Energy Becomes Unstoppable",
      "url": "https://www.theenergymix.com/emissions-growth-slows-5-fold-since-paris-deal-as-clean-energy-becomes-unstoppable/",
      "domain": "theenergymix.com",
      "type": "citation"
    },
    {
      "text": "Climate Change",
      "url": "https://www.un.org/en/global-issues/climate-change",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "climateactiontracker.org",
      "url": "https://climateactiontracker.org/",
      "domain": "climateactiontracker.org",
      "type": "citation"
    },
    {
      "text": "Interactive Chart Shows Changes Worlds Top 10 Emitters",
      "url": "https://www.wri.org/insights/interactive-chart-shows-changes-worlds-top-10-emitters",
      "domain": "wri.org",
      "type": "citation"
    },
    {
      "text": "Emissions Gap Report",
      "url": "https://www.unep.org/resources/emissions-gap-report",
      "domain": "unep.org",
      "type": "citation"
    },
    {
      "text": "Emissions Pathways",
      "url": "https://climateactiontracker.org/global/emissions-pathways/",
      "domain": "climateactiontracker.org",
      "type": "citation"
    },
    {
      "text": "Chapter 4",
      "url": "https://www.ipcc.ch/report/ar6/wg1/chapter/chapter-4/",
      "domain": "ipcc.ch",
      "type": "citation"
    },
    {
      "text": "75",
      "url": "https://www.mdpi.com/2225-1154/10/5/75",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "2024",
      "url": "https://acp.copernicus.org/articles/24/2679/2024/",
      "domain": "acp.copernicus.org",
      "type": "citation"
    },
    {
      "text": "Ipcc Ar6 Syr Spm.pdf",
      "url": "https://www.ipcc.ch/report/ar6/syr/downloads/report/IPCC_AR6_SYR_SPM.pdf",
      "domain": "ipcc.ch",
      "type": "citation"
    },
    {
      "text": "Consequences Paris Protocol Devastating Economic Costs Essentially Zero",
      "url": "https://www.heritage.org/environment/report/consequences-paris-protocol-devastating-economic-costs-essentially-zero",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "Staying Paris Agreement Would Have Cost Families 20k",
      "url": "https://www.heritage.org/environment/commentary/staying-paris-agreement-would-have-cost-families-20k",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "Trump Paris Agreement",
      "url": "https://www.factcheck.org/2017/05/trump-paris-agreement/",
      "domain": "factcheck.org",
      "type": "citation"
    },
    {
      "text": "Ecb.sp251021 1~a1cd961530.en.html",
      "url": "https://www.ecb.europa.eu/press/key/date/2025/html/ecb.sp251021_1~a1cd961530.en.html",
      "domain": "ecb.europa.eu",
      "type": "citation"
    },
    {
      "text": "S0140988319302579",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0140988319302579",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "S0040162520304157",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0040162520304157",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Paris Climate Change Agreement Too Costly By Bj Rn Lomborg 2015 11",
      "url": "https://www.project-syndicate.org/commentary/paris-climate-change-agreement-too-costly-by-bj-rn-lomborg-2015-11",
      "domain": "project-syndicate.org",
      "type": "citation"
    },
    {
      "text": "Success Of The Paris Agreement Hinges On The Credibility Of National Climate Goals",
      "url": "https://www.brookings.edu/articles/success-of-the-paris-agreement-hinges-on-the-credibility-of-national-climate-goals/",
      "domain": "brookings.edu",
      "type": "citation"
    },
    {
      "text": "Paris Agreement",
      "url": "https://www.emission-index.com/policy/paris-agreement",
      "domain": "emission-index.com",
      "type": "citation"
    },
    {
      "text": "The Paris Agreement Compliance Mechanism Beyond Cop 26",
      "url": "https://www.wakeforestlawreview.com/2021/11/the-paris-agreement-compliance-mechanism-beyond-cop-26/",
      "domain": "wakeforestlawreview.com",
      "type": "citation"
    },
    {
      "text": "Pmc10556554",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10556554/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Statement President Trump Paris Climate Accord",
      "url": "https://trumpwhitehouse.archives.gov/briefings-statements/statement-president-trump-paris-climate-accord/",
      "domain": "trumpwhitehouse.archives.gov",
      "type": "citation"
    },
    {
      "text": "The Paris Agreement Treaty And Should Be Submitted The Senate",
      "url": "https://www.heritage.org/environment/report/the-paris-agreement-treaty-and-should-be-submitted-the-senate",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "The Explainer The Paris Agreement",
      "url": "https://unfccc.int/news/the-explainer-the-paris-agreement",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "China India Developing Countries Cop29 Climate Talks",
      "url": "https://www.theguardian.com/environment/2024/nov/19/china-india-developing-countries-cop29-climate-talks",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Oxfam Climate Finance Short Changed 2024 Update Csna Estimate Methodology Note.pdf",
      "url": "https://unfccc.int/sites/default/files/resource/Oxfam_Climate_Finance_Short-Changed_2024_update_CSNA_Estimate_Methodology_Note.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Developed Countries Contributions Climate Finance Goal",
      "url": "https://www.wri.org/insights/developed-countries-contributions-climate-finance-goal",
      "domain": "wri.org",
      "type": "citation"
    },
    {
      "text": "China%2c India%2c And The Paris Climate Agreement",
      "url": "https://ballotpedia.org/Fact_check/China%2C_India%2C_and_the_Paris_Climate_Agreement",
      "domain": "ballotpedia.org",
      "type": "citation"
    },
    {
      "text": "India",
      "url": "https://climateactiontracker.org/countries/india/",
      "domain": "climateactiontracker.org",
      "type": "citation"
    },
    {
      "text": "Global Warming Observations Vs Climate Models",
      "url": "https://www.heritage.org/environment/report/global-warming-observations-vs-climate-models",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "Scientific Argument Against Paris Climate Agreement",
      "url": "https://www.cato.org/commentary/scientific-argument-against-paris-climate-agreement",
      "domain": "cato.org",
      "type": "citation"
    },
    {
      "text": "Paris Agreement A Risk Regulation Perspective",
      "url": "https://judithcurry.com/2016/03/28/paris-agreement-a-risk-regulation-perspective/",
      "domain": "judithcurry.com",
      "type": "citation"
    },
    {
      "text": "S1342937x25001273",
      "url": "https://www.sciencedirect.com/science/article/pii/S1342937X25001273",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Paris Climate Promises Will Reduce Temperatures Just 005degc 2100 Press Release",
      "url": "https://lomborg.com/paris-climate-promises-will-reduce-temperatures-just-005degc-2100-press-release",
      "domain": "lomborg.com",
      "type": "citation"
    },
    {
      "text": "Key Outcomes From Cop29 Article 6 Of The Paris Agreement.pdf",
      "url": "https://unfccc.int/sites/default/files/resource/Key-Outcomes-from-COP29_Article-6-of-the-Paris-Agreement.pdf",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Cop29 Un Climate Conference Agrees To Triple Finance To Developing Countries Protecting Lives And",
      "url": "https://unfccc.int/news/cop29-un-climate-conference-agrees-to-triple-finance-to-developing-countries-protecting-lives-and",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "2024 Ndc Synthesis Report",
      "url": "https://unfccc.int/process-and-meetings/the-paris-agreement/nationally-determined-contributions-ndcs/2024-ndc-synthesis-report",
      "domain": "unfccc.int",
      "type": "citation"
    },
    {
      "text": "Fossil Fuel Co2 Emissions Increase Again In 2024",
      "url": "https://globalcarbonbudget.org/fossil-fuel-co2-emissions-increase-again-in-2024/",
      "domain": "globalcarbonbudget.org",
      "type": "citation"
    },
    {
      "text": "Preliminary Us Greenhouse Gas Estimates For 2024",
      "url": "https://rhg.com/research/preliminary-us-greenhouse-gas-estimates-for-2024/",
      "domain": "rhg.com",
      "type": "citation"
    },
    {
      "text": "State Climate Action 2025",
      "url": "https://www.wri.org/research/state-climate-action-2025",
      "domain": "wri.org",
      "type": "citation"
    },
    {
      "text": "Cop Experts How Could The Un Climate Talks Be Reformed",
      "url": "https://www.carbonbrief.org/cop-experts-how-could-the-un-climate-talks-be-reformed/",
      "domain": "carbonbrief.org",
      "type": "citation"
    },
    {
      "text": "A Last Chance To Save The Paris Agreement Europe Must Go To Cop30 With Strong Ambition",
      "url": "https://www.reneweuropegroup.eu/news/2025-10-23/a-last-chance-to-save-the-paris-agreement-europe-must-go-to-cop30-with-strong-ambition",
      "domain": "reneweuropegroup.eu",
      "type": "citation"
    },
    {
      "text": "Event Summary 10 Years After The Paris Agreement Insights From Climate Leaders On Multilateralism And The Future Of Climate Action",
      "url": "https://www.sciencespo.fr/psia/chair-sustainable-development/2025/03/07/event-summary-10-years-after-the-paris-agreement-insights-from-climate-leaders-on-multilateralism-and-the-future-of-climate-action/",
      "domain": "sciencespo.fr",
      "type": "citation"
    },
    {
      "text": "Withdraw Paris Withdrawing The Un Framework Convention Climate Change",
      "url": "https://www.heritage.org/environment/report/withdraw-paris-withdrawing-the-un-framework-convention-climate-change",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "Nordhaus Climate Clubs.pdf",
      "url": "https://ycsg.yale.edu/sites/default/files/files/nordhaus-climate-clubs.pdf",
      "domain": "ycsg.yale.edu",
      "type": "citation"
    },
    {
      "text": "Paris Climate Agreement Instead Regulations And Mandates Embrace Markets",
      "url": "https://www.heritage.org/energy-economics/report/paris-climate-agreement-instead-regulations-and-mandates-embrace-markets",
      "domain": "heritage.org",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "treaty",
      "page": "Treaty"
    },
    {
      "text": "climate change",
      "page": "Climate_change"
    },
    {
      "text": "United Nations",
      "page": "United_Nations"
    },
    {
      "text": "Conference of the Parties",
      "page": "Conference_of_the_parties"
    },
    {
      "text": "Paris",
      "page": "Paris"
    },
    {
      "text": "France",
      "page": "France"
    },
    {
      "text": "greenhouse gas emissions",
      "page": "Greenhouse_gas_emissions"
    },
    {
      "text": "Kyoto Protocol",
      "page": "Kyoto_Protocol"
    },
    {
      "text": "technology transfer",
      "page": "Technology_transfer"
    },
    {
      "text": "finance",
      "page": "Finance"
    },
    {
      "text": "mitigation",
      "page": "Mitigation"
    },
    {
      "text": "adaptation",
      "page": "Adaptation"
    },
    {
      "text": "verification",
      "page": "Verification"
    },
    {
      "text": "ratification",
      "page": "Ratification"
    },
    {
      "text": "global stocktake",
      "page": "Global_stocktake"
    },
    {
      "text": "temperature",
      "page": "Temperature"
    },
    {
      "text": "effectiveness",
      "page": "Effectiveness"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "President",
      "page": "President"
    },
    {
      "text": "Earth Summit",
      "page": "Earth_Summit"
    },
    {
      "text": "Rio de Janeiro",
      "page": "Rio_de_Janeiro"
    },
    {
      "text": "common but differentiated responsibilities",
      "page": "Common_But_Differentiated_Responsibilities"
    },
    {
      "text": "carbon dioxide",
      "page": "Carbon_dioxide"
    },
    {
      "text": "India",
      "page": "India"
    },
    {
      "text": "Kyoto",
      "page": "Kyoto"
    },
    {
      "text": "Japan",
      "page": "Japan"
    },
    {
      "text": "Russia",
      "page": "Russia"
    },
    {
      "text": "Canada",
      "page": "Canada"
    },
    {
      "text": "emissions trading",
      "page": "Emissions_trading"
    },
    {
      "text": "Copenhagen Accord",
      "page": "Copenhagen_Accord"
    },
    {
      "text": "Ad Hoc",
      "page": "Ad_hoc"
    },
    {
      "text": "ADP",
      "page": "ADP"
    },
    {
      "text": "protocol",
      "page": "Protocol"
    },
    {
      "text": "legal instrument",
      "page": "Legal_instrument"
    },
    {
      "text": "Le Bourget",
      "page": "Le_Bourget"
    },
    {
      "text": "Laurent Fabius",
      "page": "Laurent_Fabius"
    },
    {
      "text": "climate finance",
      "page": "Climate_finance"
    },
    {
      "text": "Working Group",
      "page": "Working_group"
    },
    {
      "text": "small island developing states",
      "page": "Small_Island_Developing_States"
    },
    {
      "text": "COP",
      "page": "Cop"
    },
    {
      "text": "Paris Agreement",
      "page": "Agreement"
    },
    {
      "text": "consensus",
      "page": "Consensus"
    },
    {
      "text": "preamble",
      "page": "Preamble"
    },
    {
      "text": "diplomacy",
      "page": "Diplomacy"
    },
    {
      "text": "April",
      "page": "April"
    },
    {
      "text": "New York",
      "page": "New_York"
    },
    {
      "text": "December",
      "page": "December"
    },
    {
      "text": "depositary",
      "page": "Depositary"
    },
    {
      "text": "Bolivia",
      "page": "Bolivia"
    },
    {
      "text": "European Union",
      "page": "European_Union"
    },
    {
      "text": "Germany",
      "page": "Germany"
    },
    {
      "text": "Yemen",
      "page": "Yemen"
    },
    {
      "text": "sustainable development",
      "page": "Sustainable_development"
    },
    {
      "text": "adaptive capacity",
      "page": "Adaptive_capacity"
    },
    {
      "text": "resilience",
      "page": "Resilience"
    },
    {
      "text": "threshold",
      "page": "Threshold"
    },
    {
      "text": "baseline",
      "page": "Baseline"
    },
    {
      "text": "Intergovernmental Panel on Climate Change",
      "page": "Intergovernmental_Panel_on_Climate_Change"
    },
    {
      "text": "scientific evidence",
      "page": "Scientific_evidence"
    },
    {
      "text": "Independent",
      "page": "Independent"
    },
    {
      "text": "initial",
      "page": "Initial"
    },
    {
      "text": "implementation",
      "page": "Implementation"
    },
    {
      "text": "global warming",
      "page": "Global_warming"
    },
    {
      "text": "accounting",
      "page": "Accounting"
    },
    {
      "text": "transparency",
      "page": "Transparency"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "greenhouse gas",
      "page": "Greenhouse_gas"
    },
    {
      "text": "climate change impacts",
      "page": "Climate_change_impacts"
    },
    {
      "text": "Dubai",
      "page": "Dubai"
    },
    {
      "text": "renewable energy",
      "page": "Renewable_energy"
    },
    {
      "text": "energy efficiency",
      "page": "Energy_efficiency"
    },
    {
      "text": "vulnerability",
      "page": "Vulnerability"
    },
    {
      "text": "effects of climate change",
      "page": "Effects_of_climate_change"
    },
    {
      "text": "technology",
      "page": "Technology"
    },
    {
      "text": "scaling",
      "page": "Scaling"
    },
    {
      "text": "developed country",
      "page": "Developed_country"
    },
    {
      "text": "climate action",
      "page": "Climate_action"
    },
    {
      "text": "OECD",
      "page": "OECD"
    },
    {
      "text": "Green Climate Fund",
      "page": "Green_Climate_Fund"
    },
    {
      "text": "European",
      "page": "European"
    },
    {
      "text": "official development assistance",
      "page": "Official_development_assistance"
    },
    {
      "text": "loss",
      "page": "Loss"
    },
    {
      "text": "peer review",
      "page": "Peer_review"
    },
    {
      "text": "tonne",
      "page": "Tonne"
    },
    {
      "text": "national",
      "page": "National"
    },
    {
      "text": "Clean Development Mechanism",
      "page": "Clean_Development_Mechanism"
    },
    {
      "text": "nuclear",
      "page": "Nuclear"
    },
    {
      "text": "Peru",
      "page": "Peru"
    },
    {
      "text": "Ghana",
      "page": "Ghana"
    },
    {
      "text": "carbon tax",
      "page": "Carbon_tax"
    },
    {
      "text": "governance",
      "page": "Governance"
    },
    {
      "text": "progress",
      "page": "Progress"
    },
    {
      "text": "reductions",
      "page": "Reductions"
    },
    {
      "text": "Earth Day",
      "page": "Earth_Day"
    },
    {
      "text": "entry into force",
      "page": "Entry_into_force"
    },
    {
      "text": "Iran",
      "page": "Iran"
    },
    {
      "text": "Libya",
      "page": "Libya"
    },
    {
      "text": "compliance",
      "page": "Compliance"
    },
    {
      "text": "Joe Biden",
      "page": "Joe_Biden"
    },
    {
      "text": "executive order",
      "page": "Executive_order"
    },
    {
      "text": "nationally determined contribution",
      "page": "Nationally_determined_contribution"
    },
    {
      "text": "Trump",
      "page": "Trump"
    },
    {
      "text": "Ambassador",
      "page": "Ambassador"
    },
    {
      "text": "Senate",
      "page": "Senate"
    },
    {
      "text": "executive",
      "page": "Executive"
    },
    {
      "text": "nature",
      "page": "Nature"
    },
    {
      "text": "April 22",
      "page": "April_22"
    },
    {
      "text": "international sanctions",
      "page": "International_sanctions"
    },
    {
      "text": "development aid",
      "page": "Development_aid"
    },
    {
      "text": "Muammar Gaddafi",
      "page": "Muammar_Gaddafi"
    },
    {
      "text": "OPEC",
      "page": "OPEC"
    },
    {
      "text": "fossil fuel",
      "page": "Fossil_fuel"
    },
    {
      "text": "civil war",
      "page": "Civil_war"
    },
    {
      "text": "foreign policy",
      "page": "Foreign_policy"
    },
    {
      "text": "infrastructure",
      "page": "Infrastructure"
    },
    {
      "text": "sovereignty",
      "page": "Sovereignty"
    },
    {
      "text": "self-interest",
      "page": "Self-interest"
    },
    {
      "text": "forestry",
      "page": "Forestry"
    },
    {
      "text": "conservation",
      "page": "Conservation"
    },
    {
      "text": "2020",
      "page": "2020"
    },
    {
      "text": "European Green Deal",
      "page": "European_Green_Deal"
    },
    {
      "text": "electrification",
      "page": "Electrification"
    },
    {
      "text": "agriculture",
      "page": "Agriculture"
    },
    {
      "text": "Brazil",
      "page": "Brazil"
    },
    {
      "text": "United Kingdom",
      "page": "United_Kingdom"
    },
    {
      "text": "Enhanced Transparency Framework (ETF)",
      "page": "ETF"
    },
    {
      "text": "information",
      "page": "Information"
    },
    {
      "text": "track",
      "page": "Track"
    },
    {
      "text": "data quality",
      "page": "Data_quality"
    },
    {
      "text": "reporting",
      "page": "Reporting"
    },
    {
      "text": "technical support",
      "page": "Technical_support"
    },
    {
      "text": "enforcement",
      "page": "Enforcement"
    },
    {
      "text": "2021",
      "page": "2021"
    },
    {
      "text": "binding",
      "page": "Binding"
    },
    {
      "text": "withdrawal",
      "page": "Withdrawal"
    },
    {
      "text": "capacity",
      "page": "Capacity"
    },
    {
      "text": "data integrity",
      "page": "Data_integrity"
    },
    {
      "text": "G20",
      "page": "G20"
    },
    {
      "text": "transport",
      "page": "Transport"
    },
    {
      "text": "industry",
      "page": "Industry"
    },
    {
      "text": "coal",
      "page": "Coal"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "international",
      "page": "International"
    },
    {
      "text": "Climate Action Tracker",
      "page": "Climate_Action_Tracker"
    },
    {
      "text": "COVID-19 pandemic",
      "page": "COVID-19_pandemic"
    },
    {
      "text": "Paris Agreement",
      "page": "Paris_Agreement"
    },
    {
      "text": "equilibrium climate sensitivity",
      "page": "Climate_sensitivity"
    },
    {
      "text": "ocean",
      "page": "Ocean"
    },
    {
      "text": "aerosol",
      "page": "Aerosol"
    },
    {
      "text": "2022",
      "page": "2022"
    },
    {
      "text": "energy",
      "page": "Energy"
    },
    {
      "text": "carbon pricing",
      "page": "Pricing"
    },
    {
      "text": "trillion",
      "page": "Trillion"
    },
    {
      "text": "regulatory compliance",
      "page": "Regulatory_compliance"
    },
    {
      "text": "Energiewende",
      "page": "Energiewende"
    },
    {
      "text": "Bjørn Lomborg",
      "page": "Bjørn_Lomborg"
    },
    {
      "text": "climate",
      "page": "Climate"
    },
    {
      "text": "technological innovation",
      "page": "Technological_innovation"
    },
    {
      "text": "international law",
      "page": "International_law"
    },
    {
      "text": "domestic policy",
      "page": "Domestic_policy"
    },
    {
      "text": "autonomy",
      "page": "Autonomy"
    },
    {
      "text": "committee",
      "page": "Committee"
    },
    {
      "text": "public reporting",
      "page": "Business_reporting"
    },
    {
      "text": "executive agreement",
      "page": "Executive_agreement"
    },
    {
      "text": "de facto",
      "page": "De_facto"
    },
    {
      "text": "erosion",
      "page": "Erosion"
    },
    {
      "text": "self-determination",
      "page": "Self-determination"
    },
    {
      "text": "poverty reduction",
      "page": "Poverty_reduction"
    },
    {
      "text": "least developed countries",
      "page": "Least_developed_countries"
    },
    {
      "text": "Australia",
      "page": "Australia"
    },
    {
      "text": "per capita",
      "page": "Per_capita"
    },
    {
      "text": "energy security",
      "page": "energy_security"
    },
    {
      "text": "poverty",
      "page": "Poverty"
    },
    {
      "text": "anthropogenic",
      "page": "Anthropogenic"
    },
    {
      "text": "projected",
      "page": "Projected"
    },
    {
      "text": "global",
      "page": "Global"
    },
    {
      "text": "2024",
      "page": "2024"
    },
    {
      "text": "analysis",
      "page": "Analysis"
    },
    {
      "text": "water vapor",
      "page": "Water_vapor"
    },
    {
      "text": "Sixth Assessment Report",
      "page": "IPCC_Sixth_Assessment_Report"
    },
    {
      "text": "solar irradiance",
      "page": "Solar_irradiance"
    },
    {
      "text": "Atlantic Multidecadal Oscillation",
      "page": "Atlantic_multidecadal_oscillation"
    },
    {
      "text": "decoupled",
      "page": "Decoupled"
    },
    {
      "text": "Xi Jinping",
      "page": "Xi_Jinping"
    },
    {
      "text": "European Commission",
      "page": "European_Commission"
    },
    {
      "text": "Jean-Claude Juncker",
      "page": "Jean-Claude_Juncker"
    },
    {
      "text": "Narendra Modi",
      "page": "Narendra_Modi"
    },
    {
      "text": "energy security",
      "page": "Energy_security"
    },
    {
      "text": "Nicaragua",
      "page": "Nicaragua"
    },
    {
      "text": "Barack Obama",
      "page": "Barack_Obama"
    },
    {
      "text": "Donald Trump",
      "page": "Donald_Trump"
    },
    {
      "text": "manufacturing",
      "page": "Manufacturing"
    },
    {
      "text": "Public opinion",
      "page": "Public_opinion"
    },
    {
      "text": "legislation",
      "page": "Legislation"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "coal phaseout",
      "page": "Coal_phase-out"
    },
    {
      "text": "Hungary",
      "page": "Hungary"
    },
    {
      "text": "Poland",
      "page": "Poland"
    },
    {
      "text": "National People's Congress",
      "page": "National_People's_Congress"
    },
    {
      "text": "Prime Minister",
      "page": "Prime_minister"
    },
    {
      "text": "United Nations Climate Change Conference",
      "page": "United_Nations_Climate_Change_conference"
    },
    {
      "text": "Baku",
      "page": "Baku"
    },
    {
      "text": "Azerbaijan",
      "page": "Azerbaijan"
    },
    {
      "text": "Synthesis",
      "page": "Synthesis"
    },
    {
      "text": "Report",
      "page": "Report"
    },
    {
      "text": "economic growth",
      "page": "Economic_growth"
    },
    {
      "text": "Belém",
      "page": "Belém"
    },
    {
      "text": "power",
      "page": "Power"
    },
    {
      "text": "reform",
      "page": "Reform"
    }
  ],
  "fetched_at": "2025-12-07T07:29:28.539730",
  "elapsed_ms": 921476
}