{
  "topic": "Plato",
  "title": "Plato",
  "slug": "plato",
  "grokipedia_slug": "Plato",
  "grokipedia_url": "https://grokipedia.com/page/Plato",
  "source": "grokipedia",
  "content": "# Plato\n\nPlato (c. 427 – 347 BCE) was an ancient Greek philosopher of aristocratic Athenian birth who, after studying under Socrates, founded the Academy around 387 BCE as a center for philosophical and mathematical inquiry, thereby establishing the model for Western institutions of higher learning. As a prolific author of dialogues featuring Socrates as the central figure, Plato systematized inquiries into reality, knowledge, ethics, and governance, most notably developing the Theory of Forms—positing immutable, ideal archetypes beyond the sensible world—as the foundation for true understanding and moral order. His mentorship of Aristotle extended this intellectual lineage, profoundly shaping subsequent philosophy, science, and political theory through emphasis on reason's primacy over empirical flux and the soul's pursuit of eternal truths. In works like the *Republic*, Plato outlined an ideal state ruled by philosopher-kings, advocating censorship of corrupting arts and a rigid class structure to achieve justice, ideas that have inspired both admiration for their rationalism and criticism for potential authoritarianism.\n\n## Biography\n\n### Early Life and Aristocratic Background\n\nPlato was born around 428 BCE in Athens to an aristocratic family during the waning years of Pericles' leadership amid the Peloponnesian War. His father, Ariston, traced descent from Codrus, an early king of Athens, while his mother, Perictione, was related to Solon, the renowned lawgiver who reformed Athenian governance in the early 6th century BCE. This lineage positioned Plato within the eupatridae, the hereditary nobility that held significant influence in Athenian politics and society despite the democratic shifts following Cleisthenes' reforms.\n\nOriginally named Aristocles after his grandfather, Plato acquired his nickname—meaning \"broad\" in Greek—likely referring to his physique, such as broad shoulders developed through wrestling or a broad forehead. He was the youngest of three sons to Ariston and Perictione, with brothers Glaucon and Adeimantus, the latter two featuring prominently as interlocutors in his *Republic*, and a sister named Potone whose son Speusippus later succeeded him at the Academy. The family's deme, Collytus, placed them in an urban district of Athens, underscoring their embeddedness in the city's elite networks rather than rural or mercantile classes.\n\nAs a youth from this privileged stratum, Plato received the standard *paideia* education for aristocratic males, emphasizing physical training in gymnastics and wrestling for military preparedness, alongside intellectual pursuits in poetry, music, grammar, and recitation of Homeric epics to cultivate virtue and civic duty. This curriculum, rooted in the \"old education\" predating widespread sophist influence, aimed to produce well-rounded *kalos kagathos*—beautiful and good—citizens capable of leadership, reflecting the aristocracy's emphasis on inherited excellence over democratic equality. Such formation exposed him early to tensions between oligarchic traditions and the radical democracy that empowered lower classes, shaping his later critiques of mob rule.\n\n### Formative Influences: Socrates and Pre-Socratics\n\nPlato's intellectual formation occurred primarily through direct mentorship under Socrates and critical engagement with Pre-Socratic philosophers, shaping his dialectical method and metaphysical inquiries. Born around 428 BCE into an aristocratic Athenian family, Plato encountered Socrates, approximately 40 years his senior and born circa 469 BCE, likely in his late teens or early twenties, around 408 BCE. This association lasted until Socrates' trial and execution in 399 BCE for impiety and corrupting the youth, events that profoundly impacted Plato and prompted his disillusionment with Athenian democracy.\n\nSocrates' influence is evident in Plato's early dialogues, where Socrates serves as the protagonist employing the elenchus—a rigorous questioning technique to refute false beliefs and pursue definitions of virtues like justice and piety. This method, aimed at achieving aporia (perplexity) to stimulate deeper inquiry, forms the basis of Plato's Socratic dialogues such as the *Euthyphro*, *Apology*, and *Crito*, which reconstruct Socrates' defense and final days based on Plato's firsthand observations. While these works preserve Socratic ethics emphasizing self-examination (\"the unexamined life is not worth living\") and intellectual humility, scholars note that Plato increasingly infuses his own doctrines, distinguishing historical Socrates' focus on ethics from Plato's later metaphysics. The absence of writings by Socrates himself renders Plato the primary, though interpretive, source for his teacher's life and ideas.\n\nPlato's philosophy also responded to Pre-Socratic thinkers, whose inquiries into nature (*physis*) and being he critiqued and transcended by prioritizing rational dialectic over empirical observation. Heraclitus (c. 535–475 BCE), proponent of universal flux (\"one cannot step twice into the same river\"), highlighted perpetual change, which Plato countered in dialogues like *Cratylus* and *Theaetetus* by positing unchanging eternal Forms as the stable reality behind sensory illusions. This Heraclitean emphasis on strife and opposition as generative informed Plato's view of dialectical tension but was subordinated to a realm of permanence.\n\nParmenides (c. 515–450 BCE), advocating an unchanging, indivisible Being accessible only through reason, rejecting sensory multiplicity as illusory, directly influenced Plato's separation of sensible and intelligible worlds. In the dialogue *Parmenides*, a young Socrates debates the elder philosopher on the nature of Forms and participation, exposing tensions in Parmenides' monism while adopting its rationalist insistence on what truly *is*. Plato synthesized Heraclitean becoming with Parmenidean being through Forms that exist timelessly yet participate in the flux of becoming, resolving their apparent contradiction via metaphysical hierarchy.\n\nPythagoras (c. 570–495 BCE) and his followers contributed to Plato's reverence for mathematics as revealing cosmic order and the soul's immortality through metempsychosis. Though Plato mentions Pythagoras sparingly, the Academy's curriculum prioritized geometry and harmonics, echoing Pythagorean number mysticism, and dialogues like *Phaedo* and *Timaeus* incorporate ideas of numerical proportions governing the universe and soul purification via philosophical ascent. These influences shifted Plato from Pre-Socratic materialism toward idealism, where abstract principles govern reality.\n\n### Response to Athenian Democracy's Failures\n\nPlato, born circa 428/427 BCE into an Athenian aristocratic family, witnessed the Peloponnesian War (431–404 BCE), during which democratic assemblies made decisions that prolonged the conflict and led to catastrophic losses, such as the Sicilian Expedition of 415 BCE, where Athens dispatched 134 triremes and over 5,000 hoplites only to have its fleet annihilated, resulting in the deaths of approximately 40,000 men and the enslavement of 7,000 survivors. This expedition, approved by popular vote despite opposition from figures like Nicias, exemplified for Plato the dangers of mass decision-making driven by demagogic rhetoric rather than expertise, as crowds favored ambitious orators like Alcibiades over prudent counsel.\n\nThe war's conclusion in 404 BCE brought Spartan victory and the imposition of the Thirty Tyrants, an oligarchic regime that executed over 1,500 Athenian citizens, including Plato's relative Critias, who served as its leader; this period disillusioned Plato with extreme oligarchy, yet the subsequent restoration of democracy in 403 BCE under an amnesty failed to stabilize governance. Democratic institutions then demonstrated further flaws, such as the 406 BCE trial after the Battle of Arginusae, where the assembly condemned eight victorious generals to death for failing to recover drowned sailors amid a storm, prioritizing ritual over rational assessment and ignoring legal procedures.\n\nIn response, Plato rejected participatory politics, viewing Athenian democracy as a system prone to degeneration through excessive liberty, where the poor envy the rich, leading to redistribution, exile of elites, and eventual tyranny, as outlined in Book VIII of *The Republic*. He argued that rule by the many equates to rule by the uninformed, likening the state to a ship steered by a crew who overthrows the navigator for lacking seafaring skills, privileging instead a hierarchical order governed by philosopher-kings trained in dialectic to apprehend the Forms of justice and the good. This shift marked Plato's pivot from political ambition—initially considering involvement under the Thirty—to founding the Academy around 387 BCE as a space for cultivating wisdom over popular opinion. His aristocratic background amplified this critique, emphasizing competence over equality in suffrage, though he acknowledged democracy's appeal to freedom while decrying its causal path to instability.\n\n### Political Engagements and the Trial of Socrates\n\nPlato, born into an aristocratic Athenian family around 428 BCE, initially aspired to political involvement, influenced by relatives such as his uncle Charmides and cousin Critias, who held prominent roles in the oligarchic regime of the Thirty Tyrants established after Athens's defeat in the Peloponnesian War in 404 BCE. The Thirty, installed by Sparta, executed approximately 1,500 Athenian citizens and confiscated properties to consolidate power among a narrow elite, actions that Plato later described as excessive in his *Seventh Letter*, where he recounted his youthful hope that the regime might reform the corrupt democracy but his subsequent disillusionment upon witnessing their violence. At about 24 years old during the regime's brief rule until its overthrow in 403 BCE, Plato maintained familial ties without documented direct participation, though ancient sources note Socrates's own resistance to the Thirty's orders, such as refusing to arrest Leon of Salamis, an episode linked to associates like Critias.\n\nThe restoration of democracy in 403 BCE under Thrasybulus included an amnesty to prevent civil strife, yet political tensions persisted, culminating in the trial of Socrates in 399 BCE on charges of impiety and corrupting the youth. Plato, then in his late twenties, attended the trial, as Socrates references him by name in Plato's account of the *Apology*, noting Plato among the supporters present and suggesting he could contribute to a proposed fine. The jury of 501 Athenians voted 280 to 221 for conviction after Socrates's defense, which rejected compromise and emphasized his philosophical mission as a divine service, leading to a death sentence by hemlock that Plato witnessed indirectly through his writings.\n\nThis event profoundly shaped Plato's retreat from Athenian politics, as detailed in the *Seventh Letter*, where he attributes his aversion to both the Thirty's tyranny and the democracy's judicial overreach—evident in executing Socrates despite his service to Athens, including valor at battles like Potidaea in 432 BCE and Delium in 424 BCE—to a systemic failure of unphilosophical rule. Plato's familial oligarchic connections drew suspicion amid democratic backlash against perceived sympathizers, reinforcing his view that practical politics deviated from justice, prompting his turn toward establishing the Academy around 387 BCE as an alternative to direct governance. Scholarly analyses, such as those examining Plato's dialogues like *Charmides*, interpret his portrayals of Critias and Charmides as efforts to rehabilitate their images while critiquing extremism, underscoring his meta-awareness of biased historical narratives favoring democratic victors over oligarchic losers.\n\n### Journeys to Sicily and Magna Graecia\n\nPlato's travels to Magna Graecia and Sicily occurred primarily after the execution of Socrates in 399 BCE, during a period of approximately twelve years of wandering before he founded the Academy in Athens around 387 BCE. These journeys exposed him to Pythagorean communities in southern Italy and the tyrannical courts of Syracuse, shaping his political philosophy through direct encounters with alternative governance models and mathematical traditions.\n\nIn Magna Graecia, Plato visited Tarentum, where he established a guest-friendship (*xenia*) with the Pythagorean leader Archytas, a mathematician and statesman who ruled as *strategos* seven times. Archytas' harmonization of arithmetic, geometry, and music, along with his ethical emphasis on limiting power to prevent tyranny, influenced Plato's integration of Pythagorean number mysticism into works like the *Timaeus*. Plato likely also encountered communities in Metapontum and Croton, absorbing doctrines of metempsychosis and mathematical cosmology that informed his theory of Forms and critique of democratic excess.\n\nPlato's first Sicilian visit around 387 BCE followed his Italian sojourns and was prompted by an invitation from the tyrant Dionysius I, possibly via his brother-in-law Dion, to discuss philosophical governance at the Syracusan court. During discussions, Plato advocated for a philosopher-ruled state emphasizing virtue over wealth, but Dionysius dismissed these ideas as impractical, reportedly mocking Plato's asceticism and ordering his seizure for sale into slavery as a spy; Plato was ransomed by friends and departed, possibly aided by a ship dispatched by Archytas. This episode, recounted in Plato's *Seventh Letter*, underscored the tyrant's resistance to rational reform, reinforcing Plato's later writings on the perils of unchecked autocracy.\n\nIn 367 BCE, Dion urged Plato to return to tutor the young Dionysius II, the new tyrant, in hopes of realizing the philosopher-king ideal from the *Republic*. Plato arrived amid court luxury but faced Dionysius' superficial engagement with philosophy, jealousy toward Dion, and suspicions of conspiracy; after brief instruction, Plato was confined to a country estate before being released and departing for Italy, returning briefly to Syracuse only to leave permanently following Dion's exile.\n\nA final reluctant visit in 361 BCE, again at Dionysius' invitation and with Archytas' encouragement for mediation, ended in disillusionment amid palace intrigues and Dionysius' claim to prior mastery of Platonic doctrines; Plato departed swiftly after negotiations failed, affirming his view that political transformation requires prior moral education of rulers, not imposition on resistant elites. These expeditions, detailed in ancient sources like the *Seventh Letter* and Diogenes Laertius, highlight Plato's empirical testing of his theories against real tyrannies, yielding cautionary insights into power's corrupting tendencies rather than successful implementation.\n\n### Founding and Role in the Academy\n\nPlato established the Academy circa 387 BCE in Athens, shortly after returning from his second journey to Sicily, marking it as the first known institution of higher learning in the Western world. Located in a public gymnasium and olive grove northwest of the city walls, dedicated to the mythical hero Akademos, the site provided an outdoor setting conducive to communal lectures, discussions, and exercises. The Academy operated without formal property ownership or rigid enrollment, attracting students through Plato's reputation and the study of his dialogues, emphasizing dialectical reasoning over rote memorization.\n\nAs scholarch, Plato directed the Academy for approximately forty years until his death in 347 BCE, fostering an interdisciplinary curriculum that integrated mathematics, astronomy, harmonics, and philosophy to pursue knowledge of eternal truths. He personally lectured on topics such as the theory of Forms and the ideal state, often orally rather than through written treatises, while encouraging rigorous debate and empirical investigation, as evidenced by the mathematical focus influenced by Pythagorean traditions encountered in Magna Graecia. Notable students included Aristotle, who resided and studied there from 367 BCE until Plato's passing, absorbing and later critiquing these doctrines before founding his own Lyceum.\n\nThe Academy's structure promoted both teaching and collaborative research, with members living communally and sharing resources, reflecting Plato's vision of philosophers training guardians for societal harmony as outlined in his *Republic*. Unlike contemporary rhetorical schools like Isocrates', it prioritized abstract inquiry and skepticism toward unexamined opinions, contributing to advancements in geometry—such as solutions to doubling the cube—and laying groundwork for Hellenistic science. Plato's leadership ensured the institution's endurance beyond his lifetime, evolving through successors like Speusippus, though maintaining its core commitment to dialectical pursuit of wisdom.\n\n### Death and Succession\n\nPlato died in 348/347 BCE at approximately eighty years of age. The precise cause remains unknown, though ancient reports suggest natural death, possibly from illness or old age, with no evidence of violence or suicide. Later accounts, including a recently deciphered Herculaneum papyrus attributed to the Epicurean Philodemus, describe scenarios such as death during a wedding feast amid musical critique or from lice infestation, but these lack corroboration and reflect potential sectarian bias against Platonism.\n\nHe was buried within the grounds of the Academy in Athens, the institution he founded circa 387 BCE. Tradition places his tomb in a garden area associated with the school, and 2024 analysis of Herculaneum scrolls has proposed a more exact site: a private garden reserved for Plato adjacent to the sacred shrine of the Muses, though archaeological confirmation awaits excavation.\n\nFollowing Plato's death, leadership of the Academy passed to his nephew Speusippus, son of Plato's sister Potone, who served as scholarch from 347 to 339 BCE. Speusippus's succession aligned with Athenian inheritance practices favoring familial ties, overriding potential rivals like Aristotle, who had studied under Plato for two decades but departed shortly after to propagate his own doctrines elsewhere. Under Speusippus, the Academy shifted emphasis, de-emphasizing Plato's theory of transcendent Forms in favor of mathematical and empirical pursuits, marking an early divergence from the founder's metaphysics.\n\n## Philosophical Foundations\n\n### Metaphysics: The Eternal Forms and Participation\n\nPlato's metaphysics distinguishes between the eternal, unchanging **realm of Forms** (Greek: *eidos* or *idea*), which represent perfect, intelligible archetypes of all qualities, relations, and objects, and the sensible world of becoming, characterized by flux and imperfection. The Forms exist independently of physical particulars, serving as the objective basis for true definitions and knowledge; for instance, the Form of Circle is the eternal standard by which all drawn circles are measured as approximations. This dualism resolves the tension between Heraclitean change (\"panta rhei,\" everything flows) and Parmenidean permanence by positing Forms as the stable reality behind apparent mutability.\n\nIn the *Phaedo*, Socrates illustrates participation (*methexis*) as the mechanism linking Forms to particulars: sensible objects derive their properties by partaking in the Forms, such as a stick appearing equal because it participates in the Form of Equality, though never fully coinciding with it due to material limitations. This causal relation positions Forms as *final causes*, explaining why things are as they are without reducing to efficient material causes alone, countering pre-Socratic materialism. Recollection (*anamnesis*) theory supports this, positing that the soul, immortal and pre-existent, encounters Forms before birth, enabling innate recognition of universals amid sensory deception.\n\nThe *Republic*'s divided line analogy (509d-511e) hierarchizes reality: at the apex, the Form of the Good (*agathon*) unifies and illuminates all Forms, akin to the sun enabling vision and growth in the sensible realm. Dialectic ascends from hypotheses to direct intuition of Forms, yielding *episteme* (knowledge) over *doxa* (opinion) derived from shadows in the cave allegory. Participation thus sustains the cosmos without Forms mingling or diffusing, preserving their unity and transcendence.\n\nIn the *Symposium*, Diotima's ladder of love escalates from physical beauty to the Form of Beauty itself, where particulars participate asymmetrically—many share one Form, avoiding numerical multiplication of universals. The *Timaeus* extends this to cosmogony: the Demiurge crafts the universe by imitating eternal Forms, with space as a receptacle (*chora*) for becoming, ensuring order (*kosmos*) through participatory mimesis rather than chaos.\n\nThe *Parmenides* critiques participation via the \"third man\" regress: if particulars participate in Forms, and Forms in a higher Form, an infinite chain undermines explanation, highlighting unresolved tensions in self-predication and separation. Plato leaves these *aporiai* open, emphasizing the Forms' explanatory power despite logical challenges, prioritizing ontological realism over nominalist dissolution of universals.\n\n### Psychology: The Immortal Tripartite Soul\n\nPlato divides the human soul into three distinct parts—rational (*logistikon*), spirited (*thumoeides*), and appetitive (*epithumetikon*)—to explain internal conflict and the pursuit of justice, as detailed in Book IV of the *Republic*. The rational part, governing wisdom and calculation, resides in the head and corresponds to the ruling class in the ideal state; the spirited part, associated with courage and honor, occupies the chest and aligns with the guardians; the appetitive part, driven by bodily desires like hunger and lust, is located in the abdomen and mirrors the producers' pursuits. This division arises from observations of psychological discord: for instance, one may thirst (appetitive urge) yet rationally abstain, or feel anger (spirited) opposing rational judgment, as in the case of Leontius unable to resist viewing corpses despite disgust. Each part has its own proper function and virtue—prudence for reason, temperance for spirit, and moderation for appetite—achieving justice when reason rules harmoniously over the others.\n\nThe tripartite model extends to bodily embodiment in the *Timaeus*, where the immortal soul is crafted by divine demiurges and implanted into a mortal body, with the lower parts more susceptible to somatic influences like passions and illusions. Plato argues the soul's unity persists despite division, as the parts motivate as one agent under rational dominance, countering potential charges of fragmentation by analogy to a city's coordinated classes. This psychology underpins ethical development: education and habituation train the spirited part to ally with reason against appetitive excesses, fostering virtues essential for personal and political order.\n\nPlato asserts the soul's immortality across dialogues, most rigorously in the *Phaedo*, where Socrates, facing execution, presents four arguments to console his interlocutors. The cyclical argument posits life and death as opposites generating each other, implying souls cycle eternally between states, neither originating nor perishing absolutely. The recollection argument infers pre-existence from innate knowledge: learning geometry recalls eternal Forms glimpsed by the soul before birth, as equals perceived imperfectly evoke perfect Equality. The affinity argument likens the soul to divine, invisible, and uniform Forms rather than composite, visible bodies, rendering it deathless and separable, though purifiable cycles may bind impure souls to reincarnation. Finally, the indestructibility argument deems the soul as the essence animating life, akin to ungenerated motion self-causing itself, thus imperishable since what is deathless cannot admit destruction.\n\nIn this framework, the rational soul proves most enduring, akin to the intelligible realm, while lower parts, though integral, entwine with bodily decay; purification via philosophy detaches it for eternal contemplation of Forms, as unphilosophical souls reincarnate in brutish forms matching their vices. This dual emphasis on tripartition and immortality grounds Plato's rejection of materialist psychologies, privileging the soul's divine origin and teleological orientation toward truth over ephemeral sensations.\n\n### Epistemology: From Opinion to Knowledge\n\nPlato posits a fundamental distinction between *doxa* (opinion or belief) and *episteme* (knowledge), wherein opinion arises from sensory engagement with the mutable physical world, rendering it unreliable and prone to error, while knowledge involves rational apprehension of eternal, unchanging Forms. In the *Republic*, this divide structures human cognition hierarchically: opinions stem from the realm of becoming, where particulars imitate Forms imperfectly, leading to shifting appearances that deceive the senses. True knowledge, by contrast, requires dialectical ascent to grasp Forms directly, unmediated by physical instances, as sensory data alone cannot yield certainty due to the flux of material existence.\n\nThe analogy of the Divided Line in *Republic* Book VI elucidates this progression, segmenting cognition into four stages proportional in clarity and reliability. The lower segment encompasses *eikasia* (imagination of shadows or reflections) and *pistis* (belief in physical objects), both forms of opinion tethered to the visible realm and susceptible to illusion. The upper segment elevates to the intelligible: *dianoia* (discursive thought, as in geometry using hypotheses and diagrams) and *noesis* (pure intellect grasping Forms via dialectic, hypothesizing the unhypothetical first principle, the Form of the Good). This schema underscores that knowledge demands transcending empirical variability through reason, where the Good illuminates Forms akin to the sun illuminating objects.\n\nComplementing the Divided Line, the Allegory of the Cave in *Republic* Book VII dramatizes the perilous journey from opinion to knowledge. Chained prisoners perceive only shadows cast by artifacts before a fire, mistaking these projections for reality—a metaphor for doxa confined to sensory illusions. Liberation and ascent to sunlight represent philosophical education: initial pain from unaccustomed truth yields vision of reflections, then celestial bodies, culminating in direct sight of the sun (the Good), enabling return to guide others despite resistance from the unenlightened. Plato emphasizes that such transformation is rare, requiring rigorous training to overcome habitual reliance on opinion.\n\nIn the *Meno*, Plato introduces recollection (*anamnesis*) to resolve the paradox of inquiry—how one seeks what is unknown—positing that the soul, immortal and pre-existent, encounters Forms prior to embodiment, imprinting innate knowledge. Demonstrated through an uneducated slave boy's geometric deductions under Socratic questioning, learning emerges not as novel acquisition but as elicited remembrance, bridging opinion's instability with knowledge's stability. This theory aligns with the Forms' eternity, implying sensory experience triggers but does not originate episteme, which reason reactivates from the soul's depths.\n\nThe *Theaetetus* probes definitions of knowledge, rejecting perception (as Heraclitean flux undermines stability) and true opinion alone (liable to manipulation, as in jury persuasion). Theaetetus proposes knowledge as true belief with *logos* (account or justification), anticipating later analyses, yet Socrates dismantles it: accounts may explain elements without securing wholeness, or devolve into infinite regress. Plato leaves no settled definition, suggesting knowledge evades propositional capture, demanding holistic dialectical engagement with reality's structure—Forms as midwifed truths over mere verbal formulas. Thus, the path from opinion to knowledge demands disciplined reason, purging sensory distortions to attain unassailable insight into being.\n\n### Ethics: Justice as Harmony and the Cardinal Virtues\n\nIn Plato's *Republic*, justice is conceptualized as an intrinsic harmony within the individual soul, analogous to the balanced order in a well-functioning state, where each constituent part performs its proper function without interference from the others. This view emerges in Book IV, where Socrates argues that the soul comprises three distinct parts—rational (logistikon), spirited (thumoeides), and appetitive (epithumetikon)—with justice arising when reason governs, the spirited element supports reason's rule, and appetites are moderated to obey. Such harmony ensures the soul's overall health and functionality, much like the attunement of strings in a lyre produces musical concord, preventing discord from factional strife within the psyche.\n\nThe cardinal virtues—wisdom, courage, temperance, and justice—correspond to this tripartite structure and collectively sustain ethical order. Wisdom (sophia) resides in the rational part, enabling deliberation and knowledge of what is truly good, thus guiding the soul toward truth rather than mere opinion. Courage (andreia) is the preserve of the spirited part, manifesting as steadfast preservation of rational beliefs about what is to be feared or endured, even amid pain or pleasure, as exemplified by guardians trained to withstand battle or temptation without flinching. Temperance (sophrosyne) involves a harmonious concord across all parts, particularly the appetitive yielding to reason's supremacy, creating a unified \"order and control of certain pleasures and desires\" that prevents internal upheaval.\n\nJustice, as the crowning virtue, integrates these others by enforcing the principle that \"each [part] doing its own\" precludes overreach, yielding a stable psyche where virtue as a whole prevails over vice. Plato maintains this ethical framework yields eudaimonia, or human flourishing, not through external rewards but through the soul's intrinsic excellence, contrasting with conventional views of justice as mere reciprocity or legal compliance. Critics, including some modern interpreters, note potential tensions, such as whether this harmony overly subordinates natural appetites, yet Plato substantiates it through analogical reasoning from observable psychological conflicts, like the simultaneous pull of thirst and restraint.\n\n### Rhetoric, Poetry, and the Critique of Mimetic Arts\n\nIn Plato's *Republic*, particularly in Books II–III and X, mimetic arts such as poetry, painting, and sculpture are critiqued as representations of appearances rather than reality, constituting copies of copies distant from the eternal Forms. Mimesis, or imitation, is thrice removed from truth: craftsmen produce useful objects approximating Forms, artists imitate those imperfect objects, and thus mislead by prioritizing sensory illusion over rational insight, potentially corrupting the guardians' souls by fostering emotional excess and irrationality. Plato argues that such arts weaken the rational part of the tripartite soul, promoting vice through depictions of gods as flawed or heroes as lamenting, which guardians must avoid to maintain psychic harmony and civic justice.\n\nPoetry receives special scrutiny as a dominant mimetic form, with Plato proposing its expulsion from the ideal city unless it hymns virtue and censors immoral narratives, as in the censorship of Homeric epics for misrepresenting divine caprice or human frailty. In the *Ion*, however, Plato attributes poetic creation not to technical skill (*technē*) but to divine inspiration (*enthousiasmos*), likening poets and rhapsodes to a magnetic chain suspended from the Muse, wherein rational control yields to frenzy, rendering the poet an unconscious vessel incapable of explaining or applying their work beyond its inspirational domain. This irrationality underscores poetry's unreliability for philosophical knowledge, as it bypasses dialectic and appeals to lower appetites, though Plato allows purified imitative hymns if they reinforce moral education.\n\nPlato's treatment of rhetoric evolves across dialogues, initially condemning it as mere flattery in the *Gorgias*, where it parallels cookery as an empirical knack (*tribē*) producing persuasion without truth, enabling demagogues to sway crowds on justice or policy despite ignorance, thus undermining genuine expertise like statesmanship. In the *Phaedrus*, rhetoric is rehabilitated as a potential philosophical tool when grounded in knowledge of the soul's divisions, dialectical method, and truth about Forms, requiring speakers to adapt discourse to audiences' intellectual capacities while pursuing the good rather than mere victory in debate. This ideal contrasts sophistic rhetoric's focus on probability and emotion, emphasizing instead a psychagogic art that elevates souls toward virtue through reasoned discourse, though Plato remains wary of writing's fixed nature hindering live inquiry.\n\n## Political Theory\n\n### Critique of Democracy and the Cycle of Regimes\n\nIn Plato's *Republic*, Book VIII (558c–569c), Socrates delineates a degenerative cycle of constitutions, positing that the ideal aristocratic regime—governed by philosopher-kings attuned to reason and the Forms—inevitably declines due to human flaws such as the erosion of virtue and the ascendancy of lower appetites. This progression moves first to timocracy, where honor and spirit dominate over wisdom; then to oligarchy, ruled by wealth and avarice, which fractures society into impoverished masses and acquisitive elites; subsequently to democracy; and finally to tyranny. Plato attributes this sequence to internal corruption rather than external conquest, emphasizing that each regime's defining vice sows the seeds of its successor through imbalance in the soul's tripartite structure—reason, spirit, and appetite—mirroring societal decay.\n\nThe transition from oligarchy to democracy arises when the oligarchic emphasis on wealth accumulation impoverishes the lower classes, breeding resentment and factional strife (557a–c). The dispossessed revolt, installing a regime of extreme liberty (*eleutheria*) and equality (*isotēs*), where all offices are open to all regardless of merit, and traditional hierarchies dissolve (557b–558a). Plato portrays democracy as a \"bazar of constitutions,\" colorful and diverse, permitting an array of lifestyles from austerity to indulgence, with no compulsion to rule or be ruled if one prefers otherwise (557b, 561d–e). Yet this freedom devolves into license, as citizens prioritize personal appetites over rational order, fostering anarchy where children defy parents, students mock teachers, and laws bind only the unwilling (563b–d).\n\nPlato's critique centers on democracy's inversion of natural hierarchy: it equates the wise and the foolish, treating unequal souls as identical and measuring governance by the gratification of desires rather than justice or virtue (558c, 561a–c). In the democratic soul, the appetitive element usurps reason's guidance, leading to a life of aimless variety and hedonism, which Plato deems inferior even to oligarchy's disciplined avarice because it rejects any substantive good beyond subjective pleasure (561c–562a). This regime, while appearing tolerant and inclusive, undermines the conditions for philosophical inquiry and stable rule, as the masses—deemed by Plato insufficiently educated for self-governance—elect flatterers over true guardians (564a–e). Empirical observations from Athens, including the Sicilian Expedition's failures (415–413 BCE) and the execution of Socrates in 399 BCE amid populist fervor, inform Plato's distrust of mob rule, though he frames it philosophically as a causal outcome of unchecked appetites eroding civic harmony.\n\nUltimately, democracy's excess of liberty exhausts itself, prompting a backlash where the populace, wearied by disorder, empowers a charismatic protector against minor threats, who then disarms opponents, confiscates wealth, and establishes tyranny (562a–569c). The tyrant, initially a champion of the people, becomes their oppressor, sustained by sycophants and foreign mercenaries while enslaving citizens (566c–569c). Plato ranks democracy fourth in nobility, above only tyranny, arguing it sustains vice under the guise of freedom but lacks the rational structure of higher regimes, a view rooted in his metaphysical commitment to Forms over empirical flux. This cyclical model underscores Plato's broader political realism: without philosopher-rulers, no constitution endures indefinitely against human nature's drift toward disorder.\n\n### The Ideal State: Philosopher-Kings and Guardians\n\nPlato's ideal state, as depicted in the *Republic*, vests political authority in a select class of guardians tasked with defending and governing the city against internal disorder and external threats. These guardians embody the spirited and rational elements of the soul writ large, selected from childhood through a meritocratic process emphasizing physical training, moral indoctrination, and intellectual rigor to ensure loyalty to the collective good over personal interests.\n\nWithin the guardian class, Plato distinguishes between auxiliaries, who function as warriors enforcing the rulers' decrees and maintaining martial discipline, and the supreme rulers known as philosopher-kings. Auxiliaries possess courage and obedience, honed via gymnastic exercises and censored exposure to heroic myths that instill fearlessness toward death while fostering communal harmony, but they lack the dialectical insight required for legislation. Philosopher-kings emerge from the auxiliaries as those rare individuals who ascend through advanced mathematical and dialectical studies to comprehend the eternal Forms, culminating in knowledge of the Form of the Good, which illuminates true justice and equips them to align the state's laws with unchanging reality rather than transient opinions or appetites.\n\nPhilosopher-kings rule reluctantly, compelled by duty rather than ambition, rotating in governance to prevent corruption while prioritizing the city's welfare over private property, family, or honor—practices abolished among guardians to eliminate factionalism. This structure mirrors the tripartite soul's harmony, with rulers corresponding to reason, ensuring the state's virtue through wisdom rather than coercive force or popular consent. Critics, including ancient commentators like Aristotle, questioned the feasibility of such elites emerging without innate predispositions toward power, yet Plato maintains their possibility hinges on rigorous selection and education transforming potential into philosophical detachment.\n\n### Communal Institutions and Class Structure\n\nIn Plato's conception of the ideal state outlined in the *Republic*, society is stratified into three classes corresponding to the tripartite division of the soul—rational, spirited, and appetitive—ensuring each performs its specialized function without overstepping, thereby achieving justice as psychic and social harmony. The producer class, comprising farmers, artisans, merchants, and laborers, satisfies the state's material needs through economic activity, motivated by appetite and moderated by the guardians' oversight to prevent excess. This class retains private property and family structures, as their roles do not demand the self-sacrifice required of the elite.\n\nThe guardian classes—divided into rulers (philosopher-kings) and auxiliaries (warriors)—form the state's protective and directive core, selected from youth through education emphasizing gymnastics, music, and dialectic to cultivate wisdom and courage. Rulers, numbering ideally in the few tens after dialectical training around age 50, govern by apprehending the Forms, particularly the Good, and devising laws. Auxiliaries enforce these decrees, defending against external threats and internal disorder. Unlike producers, guardians forfeit private ownership: land, housing, and gold/silver are communal, with guardians residing in barracks, subsisting on state-provided rations via obligatory common messes to eliminate acquisitive motives that breed corruption or faction. Plato argues this fosters unity, as \"mine\" and \"not mine\" distinctions among guardians would dissolve the city into civil war.\n\nCommunal institutions extend to reproduction and child-rearing among guardians, abolishing nuclear families to prioritize collective welfare over kin loyalty. Guardian women train alongside men, sharing auxiliary duties based on merit rather than sex, with superior pairings arranged seasonally by rulers via rigged lots to mimic eugenic selection, producing offspring raised in creches by nurses ignorant of parentage. Children are classified early into classes via testing, with promising ones entering guardian education; failures rejoin producers. This system, Plato contends, aligns breeding with virtue, treating guardians as \"sacred herds\" whose purity sustains the state's immortality, though Aristotle later critiqued it for ignoring human attachments and incentives. Such arrangements apply solely to guardians, exempting producers to maintain economic productivity without imposing asceticism universally.\n\n### Education as Indoctrination or Enlightenment?\n\nIn Plato's *Republic*, education forms the cornerstone of the ideal state's stability, designed primarily for the guardian class to instill virtues of wisdom, courage, moderation, and justice through a structured curriculum divided into stages. From infancy, guardians undergo communal rearing without private family attachments to foster loyalty to the polis, with early instruction emphasizing censored myths and poetry that promote moral harmony and avoid depictions of divine immorality or excessive emotion, as detailed in Books II and III. Gymnastics complement mousike (music and poetry) to balance body and soul, aiming to prevent licentiousness while building physical resilience.\n\nA pivotal element is the \"noble lie\" or myth of the metals, wherein citizens are told that guardians contain gold souls suited for rule, auxiliaries silver for defense, and producers base metals for crafts, with offspring inheriting metallic qualities to justify hereditary class roles and deter social upheaval. This fabrication, proposed by Socrates, seeks to engender willing acceptance of inequality as divinely ordained, preserving unity despite the philosophers' awareness of its falsity. Critics argue this constitutes indoctrination by embedding false beliefs to manipulate social cohesion, potentially eroding trust if exposed, though Plato posits it as a medicinal falsehood necessary for civic virtue in imperfect humans.\n\nFor select philosopher-kings, education escalates post-adolescence to intellectual disciplines: arithmetic, geometry, astronomy, and harmonics from ages 20 to 35, training the mind to abstract from sensibles toward eternal Forms, followed by dialectic until 50 to grasp the Form of the Good, enabling just governance. This progression, outlined in Book VII's Allegory of the Cave, liberates the soul from opinion (*doxa*) to knowledge (*episteme*), with Plato viewing it as enlightenment—reorienting innate rational potential toward truth via rigorous inquiry rather than rote imposition. Scholarly analyses affirm that Plato's method eschews mere transmission of dogma, emphasizing transformative questioning akin to Socratic elenchus, though its elitism restricts enlightenment to a few, relegating masses to formative habituation.\n\nThe tension between indoctrination and enlightenment arises from causal priorities: Plato prioritizes societal order and elite wisdom over universal truth-telling, reasoning that unbridled freedom breeds tyranny, as seen in democratic Athens' fall. Empirical alignment with first-principles holds that true enlightenment demands dialectical ascent, achieved only by the qualified, while lower education's controls prevent vice, not deceive for power—evident in guardians' tested incorruptibility. Yet, reliance on deception risks perpetuating illusion, contrasting pure enlightenment; Plato counters that partial truths serve higher justice, with philosophers' reluctant rule underscoring self-sacrifice over domination.\n\n## Writings and Method\n\n### Dialogic Form and Socratic Irony\n\nPlato composed his philosophical corpus exclusively in the form of dialogues, featuring extended conversations among named characters—most prominently Socrates—set against historical or dramatized backdrops, rather than in the expository treatises favored by later philosophers like Aristotle. This format, evident in works from the early *Apology* (circa 399 BCE, post-Socrates' trial) to the late *Laws*, prioritizes the portrayal of inquiry as a dynamic process of question-and-answer (dialectic or elenchus), avoiding dogmatic assertions of truth. By embedding arguments within interpersonal exchanges, Plato illustrates the provisional and contestable nature of philosophical claims, compelling readers to actively reconstruct and evaluate positions rather than passively accept them.\n\nThe dialogic structure facilitates several pedagogical and epistemological aims: it mirrors the Socratic method of refuting false beliefs through cross-examination, exposes logical inconsistencies in interlocutors' views, and underscores the limitations of human knowledge without resolving into definitive doctrines. For instance, early dialogues like *Euthyphro* and *Laches* often conclude aporetically, with participants recognizing their ignorance, thus modeling intellectual humility and the iterative pursuit of wisdom. Later works, such as *Republic* and *Phaedrus*, incorporate mythic elements and longer monologues within the frame, blending drama with systematic exposition to explore complex theories like the Forms or the soul's tripartite nature, yet retaining the conversational core to critique unexamined opinions.\n\nCentral to this form is Socratic irony (*eirōneia*), a rhetorical device where Socrates feigns profound ignorance—\"I know that I know nothing\"—to disarm interlocutors and elicit their untested assumptions, thereby dismantling them through relentless questioning. This irony operates on multiple levels: superficially, it flatters the respondent's expertise, as in the *Meno* where Socrates professes helplessness in defining virtue to provoke Meno's definitions, only to refute them systematically; deeper, it reflects genuine epistemic caution, acknowledging that true knowledge eludes easy articulation. Aristotle, in *Nicomachean Ethics* (circa 350 BCE), critiques this as excessive pretense, distinguishing it from frankness, yet Plato deploys it to advance elenchus, revealing that professed experts—like Euthyphro on piety or Protagoras on relativism—harbor contradictions.\n\nThrough irony, Socrates not only exposes individual fallacies but critiques broader cultural pretensions, such as sophistic rhetoric's emphasis on persuasion over truth, fostering a therapeutic effect akin to midwifery (*maieutics*) that births clearer ideas from muddled ones. In dialogues like *Symposium* and *Gorgias*, this evolves into a tool for moral examination, where irony underscores the gulf between opinion (*doxa*) and knowledge (*epistēmē*), urging pursuit of the latter via rigorous dialectic. While some scholars interpret irony as purely dramatic license, its consistent role across Plato's corpus evidences a deliberate method for cultivating virtue and intellect, prioritizing causal scrutiny of beliefs over superficial consensus.\n\n### Major Dialogues by Theme and Development\n\nPlato's dialogues exhibit a developmental progression, traditionally divided into early, middle, and late periods based on stylistic criteria such as linguistic patterns, length of sentences, and use of particles, first systematically analyzed by Lewis Campbell in 1867 and refined by later stylometrists like Eduard Schwartz and Gregory Vlastos. Early dialogues emphasize Socratic elenctic questioning to probe ethical concepts, often concluding without resolution (aporetic endings), reflecting Plato's initial focus on exposing ignorance rather than positing doctrines. The *Apology* depicts Socrates' defense at his 399 BCE trial, portraying philosophy as a divine mission to question assumptions, while *Crito* examines whether Socrates should escape prison, arguing that unjust acts harm the soul and violate social contracts. *Euthyphro* interrogates piety through failed definitions, highlighting the Euthyphro dilemma: whether goodness is loved by gods because it is good or vice versa. *Laches* and *Charmides* similarly seek definitions of courage and temperance, using interlocutors' inconsistencies to underscore the unity of virtues. *Protagoras* and *Gorgias* extend this to debates on whether virtue is teachable and rhetoric's moral status, with Gorgias critiquing sophistic flattery as inferior to true dialectic. These works develop the theme of ethical inquiry via cross-examination, establishing virtue as knowledge but without a full theory.\n\nIn middle-period dialogues, Plato transitions to constructive doctrines, introducing the Theory of Forms as eternal, intelligible realities distinct from sensible particulars, enabling positive epistemology and metaphysics. The *Meno* (c. 387–380 BCE) posits knowledge as recollection from prenatal exposure to Forms, demonstrated via a slave boy's geometry proof without instruction. *Phaedo* argues for the soul's immortality through cyclical arguments and affinity with Forms, recounting Socrates' last hours in 399 BCE and positing philosophy as soul purification. The *Symposium* traces eros from physical attraction to contemplation of Beauty itself, with Diotima's speech outlining an ascent of love toward the Good. *Phaedrus* integrates rhetoric, psychology, and metaphysics, depicting the soul as a charioteer with winged horses, where true rhetoric aligns with dialectic and recollects Forms. These advance themes of epistemology (from opinion to knowledge via Forms) and ethics (soul's harmony with divine order), building on early aporia by providing explanatory frameworks.\n\nThe *Republic*, Plato's longest dialogue (c. 375 BCE), synthesizes ethics, politics, and epistemology in Books II–X, analogizing justice in the soul (reason ruling appetites) to the ideal city ruled by philosopher-kings trained in dialectic to grasp the Form of the Good. It develops the tripartite soul and class structure (guardians, auxiliaries, producers), critiquing poetry as mimetic illusion thrice removed from truth. Late dialogues refine and critique these ideas, showing doctrinal evolution toward complexity and skepticism about early middle-period optimism. *Theaetetus* (c. 369 BCE) examines knowledge definitions—perception, true opinion, true opinion with logos—rejecting them aporetically, influencing later epistemology by distinguishing knowledge from belief. *Parmenides* critiques the Theory of Forms via the young Socrates' debate with Parmenides, raising the participation problem and third man regress, suggesting Plato's self-criticism. *Sophist* and *Statesman* address being, non-being, and ideal rulership through methodical division (diairesis), defining the sophist as an illusory image-maker. *Timaeus* presents a demiurge crafting the cosmos from mathematical Forms and chaotic matter, explaining physics via geometric atoms, while *Critias* sketches Atlantis as a cautionary empire. The *Laws* (c. 350 BCE), Plato's longest, proposes a practical second-best state with nocturnal council and mixed constitution, emphasizing piety and law over ideal guardians. This late phase tempers metaphysical idealism with empirical accommodation, developing themes of cosmology, ontology, and realistic politics.\n\n### Chronology, Stylometry, and Authenticity Disputes\n\nThe chronology of Plato's dialogues lacks direct external testimony, with ancient sources providing only approximate composition periods rather than a precise sequence. Scholars thus rely on internal evidence from doctrinal development—such as the progression from Socratic elenchus in early works to the mature theory of Forms in middle dialogues and dialectical critiques in late ones—and stylometric analysis of linguistic features. The standard division, established in the 19th century, classifies dialogues into early (e.g., *Apology*, *Crito*, *Euthyphro*, emphasizing aporia and ethical inquiry around 399–387 BCE), middle (e.g., *Phaedo*, *Republic*, *Symposium*, introducing Forms and ideal state theory circa 387–380 BCE), and late periods (e.g., *Parmenides*, *Theaetetus*, *Laws*, featuring complex ontology and legalism post-367 BCE).\n\nStylometry, pioneered by Lewis Campbell in 1867, quantifies stylistic markers like vocabulary frequency, particle usage (e.g., δέ, γάρ), sentence complexity, and idiom avoidance to infer relative dating. Early applications identified \"middle\" style traits, such as increased abstract terms and longer sentences, distinguishing periods; later computer-assisted studies by Leonard Brandwood (1990) and Gerard Ledger analyzed over 100 variables across texts, confirming broad groupings with clusters for early (short, simple syntax), middle (elaborate prose), and late (archaic influences, varied lexicon) phases, though absolute dates remain estimates tied to biographical events like Plato's Sicilian visits (367–367 BCE). These methods assume stylistic evolution but face critiques for overlooking deliberate variation (e.g., archaic style in *Cratylus* or *Timaeus*) and small sample sizes in shorter works, leading some to propose alternative orders, such as placing *Parmenides* earlier based on content or questioning *Phaedrus* as late due to mismatched metrics.\n\nAuthenticity disputes center on about seven dialogues and several letters, assessed via stylometric divergence, doctrinal inconsistencies with core works, and ancient attributions. Thrasyllus's 1st-century CE tetralogical arrangement included disputed texts like *Alcibiades I*, *Hipparchus*, *Lovers*, *Theages*, *Minos*, and *Epinomis*, but modern analysis rejects most as post-Platonic: for instance, *Alcibiades I* shows late-style particles yet anachronistic ethics absent in undisputed dialogues, while *Epinomis* echoes *Laws* vocabulary excessively, suggesting imitation. Statistical tests, including Brandwood's multivariate analysis, cluster these as outliers with non-Platonic frequencies (e.g., rare use of connective particles), supporting spurious status; *Greater Hippias* and *Ion* fare better but remain contested for simplistic Socratic portrayals. The *Seventh Letter*, often cited for autobiographical insights, divides scholars—stylometry aligns it loosely with late works, but inconsistencies like mismatched historical details (e.g., Dionysius II's timeline) fuel skepticism, with evidence leaning toward pseudepigraphy by a 3rd-century BCE follower. Core 35 dialogues, from *Euthyphro* to *Laws*, exhibit consistent evolutionary traits, affirming authenticity absent such anomalies.\n\n### Textual Transmission and Ancient Editions\n\nThe textual tradition of Plato's dialogues relies primarily on medieval Byzantine manuscripts, as no complete ancient copies survive. The earliest extant manuscript containing a substantial portion of the corpus is the Codex Oxoniensis Clarkianus 39, known as the Clarke Plato, copied in Constantinople in 895 AD by the scribe John the Calligrapher. This manuscript includes about half of the dialogues and serves as a key ancestor for many later copies, with approximately 150 manuscripts of Plato's works surviving overall, though only a handful predate the 13th century.\n\nAncient transmission is evidenced by fragmentary papyri dating from the 3rd century BC, such as scraps from the *Phaedo*, *Laches*, *Sophist*, and an epistle, discovered in Egypt; these confirm early circulation but represent less than 1% of the total text. Quotations in authors like Aristotle and later Hellenistic writers indicate ongoing copying and study in antiquity, yet the full corpus's preservation through the Roman period remains opaque, with potential losses during the decline of classical learning in the West. The Byzantine East maintained the tradition, funneling it to the Renaissance via copies like those used by Marsilio Ficino in his 1484 Latin translation.\n\nThe standard ancient edition shaping this transmission was compiled by Thrasyllus, court astrologer to Tiberius in the early 1st century AD, who arranged the dialogues into nine tetralogies—groups of four works each—followed by appendices including the *Letters*, *Definitions*, and other spuria. This classification, possibly drawing on earlier Peripatetic efforts by figures like Xenocrates, persists in medieval manuscripts and influences modern editions, though it reflects interpretive groupings rather than chronological or thematic authenticity. Earlier Hellenistic editions are hypothesized but unattested in detail, with Diogenes Laertius noting collections by Aristophanes of Byzantium in the 3rd–2nd century BC, focusing on textual emendations rather than comprehensive corpora.\n\nTextual criticism reveals a relatively stable tradition, with fewer variants than in some classical authors, attributed to the controlled Byzantine monastic copying; however, stemmatic analysis identifies two main families descending from archetypes around the 9th century AD, incorporating ancient glosses and interpolations. Modern critical editions, such as those by John Burnet (1900–1907) in the Oxford Classical Texts series, collate these manuscripts against papyri and ancient citations to reconstruct the vulgate text, acknowledging Thrasyllus' framework while excising undisputed forgeries like the *Alcibiades II*.\n\n## Esoteric Teachings and Unwritten Doctrines\n\n### Evidence from Aristotle and Ancient Testimonia\n\nAristotle, as Plato's student for approximately twenty years until 347 BC, offers the primary ancient evidence for Plato's unwritten doctrines through critical summaries in his *Metaphysics*. In Book Alpha (987b18–988a17), Aristotle states that Plato, building on Pythagorean numerology and the Socratic search for definitions, identified two archai or first principles: the One, embodying unity, limit, and the Good, and the Indefinite Dyad, described as the Great-and-Small, representing unlimited multiplicity and a substrate akin to matter. Numbers arise from the One imposing form on the Dyad, serving as paradigms or causes for the sensible world and the separate Forms. Aristotle contrasts this with his own rejection of separate Forms, viewing Plato's system as positing numbers as intermediate between principles and sensibles, though he acknowledges it as an extension of earlier Italian philosophy.\n\nIn *Physics* II.2 (193b22–35? wait, actually from sources it's 209b), Aristotle explicitly refers to these as Plato's \"so-called unwritten doctrines\" (agrapha dogmata), indicating teachings delivered orally rather than in written dialogues. He critiques them for prioritizing mathematical causes over efficient or final ones, yet his detailed exposition suggests direct familiarity from Academy lectures. Aristotle also implies in *Metaphysics* Zeta that Plato's oral emphasis on principles aimed to resolve aporias in the theory of Forms, such as their generation.\n\nAristoxenus of Tarentum, another Aristotelian pupil active circa 360–300 BC, preserves testimony to a specific oral presentation: Plato's public lecture \"On the Good\" in Athens, spanning multiple sessions over months circa 370s BC. Aristoxenus reports that Plato equated the Good with the One, deriving ethical and ontological implications through mathematical deductions on numbers' origins from the One and Dyad, but the audience, anticipating practical politics or pleasure, grew frustrated and departed, with even animals wandering in during the prolonged geometric expositions. This account, relayed via Aristotle, underscores Plato's preference for esoteric, Pythagorean-style instruction over exoteric ethics, aligning with the unwritten focus on first principles as the true Good.\n\nFurther testimonia from Plato's contemporaries and successors reinforce this. Eudemus of Rhodes, in his *Physics* fragments, echoes Aristotle on the One-Dyad duality as Plato's generative principles. Speusippus, Plato's nephew and Academy successor (until 339 BC), reportedly critiqued the One's role in his own works, implying familiarity with Plato's oral monad-monism. Xenocrates, scholicarch from 339–314 BC, integrated the unwritten doctrines into his triad of principles (One, Dyad, World Soul), citing Plato's lectures. Theophrastus, Aristotle's successor, notes in *Metaphysics* fragments Plato's view of numbers as separate causes, distinct from Forms. These reports, preserved in later compilations like those by Proclus (5th century AD) but originating in 4th-century BC sources, consistently attest to Plato's oral prioritization of metaphysical principles over dialogic explorations, though Aristotle's adversarial stance may exaggerate mathematical formalism to highlight divergences.\n\n### The One and the Indefinite Dyad\n\nPlato's unwritten doctrines posited two archetypal principles as the foundational causes of reality: **the One**, embodying unity, limit, and the Good, and **the Indefinite Dyad**, representing multiplicity, indeterminacy, and the unlimited. The One functions as the active, unifying force that imposes determinate structure, serving as the origin of Forms and mathematical entities by delimiting the boundless potential of the Dyad. In contrast, the Indefinite Dyad, often characterized as the \"Dyad of the Great and Small,\" supplies the receptive, material substrate of variation and plurality, akin to a pre-cosmic flux without inherent measure.\n\nThese principles interact dialectically to generate the hierarchical structure of being: the One limits the Dyad to produce the realm of numbers and ideal magnitudes, from which the eternal Forms emerge as fully determinate essences, and ultimately the sensible world as a participatory imitation marked by imperfection. Aristotle, Plato's student and primary reporter of these oral teachings, describes them in his *Metaphysics* (987a29–b13; 988a8–17; 1091b35–1092a1) as Pythagorean-influenced innovations, where the One equates to the form-giving cause and the Dyad to matter, though he critiques their separation from sensible particulars as insufficiently explanatory. Ancient testimonia, including those from Speusippus and later Neoplatonists like Plutarch, corroborate this duality, portraying the One as the supreme ontological principle beyond being and the Dyad as the source of becoming's instability.\n\nThe doctrine's esoteric nature is evidenced by its absence from Plato's written dialogues, which Aristotle attributes to Plato's deliberate reservation for Academy lectures, emphasizing oral transmission to select pupils around the 360s BCE. This framework resolves tensions in Plato's metaphysics by grounding the transcendence of the Good (as in *Republic* 509b) in the One's absolute simplicity, while the Dyad accounts for the participatory multiplicity critiqued in *Parmenides*. Though Aristotle's accounts, as a rival philosopher, introduce interpretive disputes—such as whether the Dyad truly precedes Forms or merely receptive capacity—their consistency across sources like Theophrastus affirms the principles' centrality to Plato's late thought.\n\n### Relation to Written Dialogues: Exoteric vs. Esoteric\n\nPlato distinguished between his written dialogues, intended as exoteric works for a general audience, and esoteric oral teachings reserved for select students in the Academy, which elaborated fundamental metaphysical principles not fully articulated in writing. In the *Phaedrus*, Plato critiques writing as a mere reminder that lacks the living responsiveness of dialectical discourse, suggesting it cannot convey ultimate truths effectively, as it invites misinterpretation without the teacher's guidance. This aligns with reports that Plato's lectures, such as the one on the Good delivered around 367 BCE, drew sparse attendance initially due to their abstract nature, focusing on the One as the principle of unity beyond the sensible world.\n\nThe dialogues relate to these esoteric doctrines by serving preparatory or illustrative roles, employing Socratic irony, myths, and unresolved aporiae to provoke inquiry toward unwritten principles like the One and the Indefinite Dyad, rather than presenting dogmatic expositions. For instance, in the *Republic*, the Form of the Good is analogized to the sun but left undefined, implying a deeper, oral elucidation; Aristotle attests that Plato's unwritten teachings on principles underpinned such discussions, with dialogues exploring their applications in ethics, politics, and cosmology. Similarly, the *Philebus* hints at limiting and unlimited principles echoing the Dyad, yet defers full systematic treatment, consistent with Plato's practice of using writing to stimulate rather than exhaust philosophical insight.\n\nScholars like Giovanni Reale interpret this duality as integral to Plato's method, where exoteric dialogues derive from and gesture toward the esoteric \"protology\" of first principles, unifying the corpus without contradiction; the unwritten doctrines provide the metaphysical foundation from which dialogic themes emerge. Aristotle's testimonies in works like *Metaphysics* A and M corroborate this, describing Plato's oral principles as generating the Forms and multiplicity, though he critiques their separation from sensibles, indicating direct exposure rather than invention. Conversely, skeptics such as Harold Cherniss argue Aristotle exaggerated differences to differentiate his own views, positing the dialogues as self-sufficient, but this overlooks convergent ancient reports from Speusippus and others affirming Plato's reticence on core doctrines in writing. The relation thus reflects Plato's pedagogical strategy: exoteric texts as public invitations to philosophy, esoteric orally for initiates capable of grasping causal realities beyond verbal fixation.\n\n### Modern Scholarly Debates on Credibility\n\nThe Tübingen-Milan School, emerging in the mid-20th century with scholars such as Hans Joachim Krämer and Konrad Gaiser, posits that Plato maintained systematic unwritten doctrines as his core metaphysical teachings, distinct from the preparatory, exoteric content of his dialogues. These doctrines, centered on primordial principles like the One and the Indefinite Dyad, were allegedly transmitted orally in the Academy to select students, as evidenced by reports from Aristotle and other ancient sources. Proponents argue that passages in Plato's dialogues, such as the divided line in the *Republic* and the receptacle in the *Timaeus*, allude indirectly to these principles, while the Seventh Letter explicitly warns against committing ultimate truths to writing.\n\nCritics, predominantly from the analytic tradition including Gregory Vlastos and Myles Burnyeat, challenge the credibility of these claims, dismissing the unwritten doctrines as an overinterpretation of fragmentary ancient testimonia rather than a coherent, intentional esoteric system. Vlastos, for instance, viewed the topic as marginal, arguing that Aristotle's references—often polemical and aimed at critiquing Plato's divergences from empiricism—do not substantiate a hidden dogmatic core but reflect Plato's exploratory lectures. Burnyeat and Michael Frede further contend that the ancient reports, including those from Speusippus and Hermodorus, are too sparse and inconsistent to reconstruct systematic doctrines, emphasizing instead the self-sufficiency of the dialogues for understanding Plato's evolving thought.\n\nA focal point of contention is the authenticity of the Seventh Letter, invoked by esotericists to justify Plato's reticence on writing deepest principles. While some scholars accept it as genuine based on stylistic and doctrinal alignment with late dialogues, skeptics highlight anachronisms, such as its advocacy of philosophical rule tempered by law, which conflicts with Plato's earlier absolutism, and philological discrepancies in vocabulary and syntax. The letter's transmission in a corpus of dubious epistles further undermines its reliability, with debates tracing back to antiquity but intensifying in modern scholarship through linguistic analysis.\n\nOngoing disputes reflect broader methodological divides: esotericists prioritize integrating oral testimonia with textual hints for a holistic Plato, cautioning against reducing philosophy to written artifacts, whereas critics demand stricter evidential standards, wary of speculative reconstruction from potentially biased pupil accounts like Aristotle's, who systematically opposed Plato's idealism. Recent assessments, such as Denis O'Brien's 2025 analysis, weigh these positions without resolution, noting that while ancient evidence confirms Plato's oral instruction, its doctrinal systematization remains unproven and contested in mainstream Platonic studies.\n\n## Legacy and Reception\n\n### Hellenistic and Roman Interpretations\n\nFollowing Plato's death in 347 BCE, his nephew Speusippus led the Academy until approximately 339 BCE, diverging from the theory of transcendent Forms by positing mathematical numbers as the fundamental principles of reality, while still engaging with Platonic ideas on the soul and ethics. Xenocrates, Speusippus's successor until around 314 BCE, restored a more orthodox interpretation, emphasizing a theological hierarchy where the divine intellect governs the cosmos, though he too critiqued the separate existence of Forms in favor of immanent principles. These early Hellenistic scholarchs preserved Platonic dialectical methods but shifted toward esoteric metaphysics, influencing later syncretisms without fully adhering to the dialogues' literal doctrines.\n\nBy the mid-third century BCE, Arcesilaus (scholarch circa 268–241 BCE) initiated the skeptical phase of the Middle Academy, reinterpreting Plato's aporetic dialogues—such as those ending without resolution—as evidence that certain knowledge is unattainable, using Socratic irony to challenge Stoic claims of cognitive impressions as infallible criteria. His successor Carneades (head circa 155–129 BCE) advanced this by developing a probabilistic epistemology centered on the \"reasonable\" or pithanon, allowing practical action based on likely beliefs rather than dogmatic certainty, while critiquing Platonic realism as unverifiable; this approach drew selectively from Plato's Theaetetus to argue against sensory and intellectual infallibility. The New Academy under Carneades maintained institutional ties to Plato but prioritized suspension of judgment (epochē) over metaphysical commitments, reflecting Hellenistic pressures from rival schools like Stoicism.\n\nAntiochus of Ascalon (circa 130–68 BCE) rejected this skepticism, reviving a dogmatic \"Old Academy\" synthesis that integrated Platonic ethics and theology with Aristotelian and Stoic elements, asserting the knowability of truths about the divine and the good life; he viewed Plato's Forms as compatible with Stoic materialism, marking the transition to Middle Platonism. In the Roman context, Marcus Tullius Cicero (106–43 BCE), trained under Philo of Larissa (last skeptical scholarch), adapted Platonic ideas eclectically, modeling his De Re Publica (51 BCE) on Plato's Republic while incorporating Roman constitutionalism and Academic probabilism to defend mixed government against pure idealism. Cicero's partial translation of the Timaeus (circa 45 BCE) introduced Platonic cosmology to Latin audiences, portraying himself as a Roman emulator of Socrates and Plato, though he tempered transcendent Forms with empirical pragmatism suited to republican politics. The Academy's destruction by Sulla in 86 BCE ended its institutional form, but Platonic interpretations persisted through such Roman-mediated transmissions, influencing later eclectic philosophies.\n\n### Medieval Synthesis with Theology\n\nAugustine of Hippo (354–430 CE) played a pivotal role in integrating Platonic philosophy with Christian theology, viewing Plato's doctrines of a transcendent, immaterial realm and the soul's immortality as preparatory for Christian revelation. In his *Confessions* (c. 397–400 CE), Augustine recounts how reading Neoplatonic texts, which echoed Plato's ideas in the *Phaedo* and *Republic*, resolved his intellectual struggles with Manichaeism and facilitated his conversion to Christianity in 386 CE. He adapted Plato's theory of Forms into a Christian framework, positing eternal divine ideas in God's mind as archetypes for creation, while critiquing pagan polytheism but praising Plato's proximity to monotheism. Augustine's synthesis, emphasizing the soul's ascent to God and the distinction between earthly and heavenly cities, profoundly shaped Western theology for centuries, as seen in works like *City of God* (413–426 CE), where Platonic dualism informs eschatological dualities.\n\nBoethius (c. 480–524 CE), writing amid the Ostrogothic kingdom's collapse, further bridged Platonic thought and Christianity in *The Consolation of Philosophy* (c. 523 CE), portraying philosophy as a divine guide echoing Plato's emphasis on reason's pursuit of eternal truth amid temporal fortune. As a Christian senator and scholar, Boethius translated and commented on Platonic-influenced works like Aristotle's logic, but infused his consolation with Platonic motifs of providence, free will, and the soul's participation in divine eternity, aligning them with Trinitarian doctrine in his theological treatises (c. 512–523 CE). His efforts preserved Greek philosophical terminology—such as *persona* for Christological debates—and facilitated the transmission of Platonic humanism into Carolingian Europe, influencing monastic education and later scholastics.\n\nIn the Islamic world, philosophers like al-Farabi (c. 872–950 CE) synthesized Plato's *Republic* with prophetic revelation, envisioning an ideal ruler as a philosopher-prophet uniting political virtue and divine law, which influenced medieval European conceptions of governance and theology via translations in Toledo and Sicily during the 12th century. Avicenna (Ibn Sina, 980–1037 CE) incorporated Platonic emanationism—adapted through Neoplatonism—into his proofs for God's existence as the Necessary Existent, impacting Latin scholastics' metaphysical arguments. This Arabic transmission revived direct engagement with Plato's *Timaeus* (via Calcidius' 4th-century Latin version) and Neoplatonic intermediaries, fostering a cosmological synthesis where Platonic Forms prefigure divine creation ex nihilo.\n\nThe 12th-century School of Chartres exemplified a distinctive Platonic revival in Christian theology, with masters like Bernard of Chartres (fl. 1114–1130 CE) and William of Conches (c. 1080–1155 CE) interpreting the *Timaeus* as a natural philosophical complement to Genesis, positing a participatory cosmos where sensible forms derive from exemplary divine ideas. They integrated Platonic cosmology—emphasizing a world soul and mathematical order—with Trinitarian creation, viewing human reason as a divine gift for contemplating eternal truths, though subordinating philosophy to faith to avoid dualism. This approach contrasted with emerging Aristotelian empiricism but enriched theological aesthetics and ethics, influencing figures like Thierry of Chartres (d. c. 1155 CE) in reconciling Platonic idealism with scriptural exegesis.\n\nBy the 13th century, Thomas Aquinas (1225–1274 CE) prioritized Aristotle for natural theology, critiquing Plato's separated Forms as insufficiently explanatory of individuation and change, yet retained Platonic elements via Augustine, such as exemplary ideas in the divine intellect and the soul's immateriality. In *Summa Theologica* (1265–1274 CE), Aquinas harmonized Platonic transcendence with Aristotelian hylomorphism, arguing that while Plato excelled in divine simplicity, Aristotle better accounted for efficient causation in creation. This selective synthesis subordinated Platonic abstraction to empirical realism, cementing a theological framework where philosophy serves revelation without conflating pagan myths with Christian dogma, though Platonic dualism persisted in debates on sacraments and eschatology.\n\n### Renaissance Humanism and Neoplatonism\n\nDuring the Renaissance, Platonic philosophy experienced a profound revival through Neoplatonism, which humanists adapted to emphasize individual dignity, cosmic harmony, and the soul's intellectual ascent, diverging from the medieval Aristotelian dominance in scholasticism. This resurgence began in Florence under Medici patronage, where scholars sought *ad fontes*—direct return to original classical texts—to counter perceived corruptions in transmission. Marsilio Ficino (1433–1499), a priest and philosopher, played a pivotal role by translating Plato's complete works into Latin between 1463 and 1484, rendering dialogues like the *Symposium* and *Timaeus* widely accessible beyond Greek-literate elites for the first time. His editions, printed in 1484, integrated Neoplatonic interpretations from Plotinus and Proclus, portraying Plato as a proto-Christian sage whose theory of Forms aligned with divine ideas and the immortality of the soul.\n\nFicino's efforts were spurred by Cosimo de' Medici, who, inspired by Gemistos Plethon's advocacy of Plato at the 1439 Council of Florence, commissioned the collection of Greek manuscripts and established the Platonic Academy around 1462 at the Villa Careggi. This informal circle of scholars, including Cristoforo Landino and Angelo Poliziano, convened to debate Platonic texts, blending them with Hermetic and Cabalistic elements to explore love (*eros*) as a metaphysical force uniting the material and divine realms. Unlike Plato's original Academy, Ficino's emphasized esoteric doctrines, such as the soul's purification through philosophy and contemplation, influencing Renaissance humanism's optimistic view of human potential as a microcosm reflecting the macrocosmic One. Ficino's *Platonic Theology* (1482) argued for the soul's immortality via rational demonstration, synthesizing Plato's arguments in the *Phaedo* with Neoplatonic emanation, which resonated with humanists seeking alternatives to empirical nominalism.\n\nGiovanni Pico della Mirandola (1463–1494), a key Academy associate, extended this tradition in his *Oration on the Dignity of Man* (1486), drawing on Platonic and Neoplatonic ideas to assert humanity's unique capacity for self-transformation toward divinity, though tempered by Christian orthodoxy. Pico's syncretism, evident in his 900 Theses (1486), fused Plato with Kabbalah and Zoroastrianism, but faced papal condemnation for perceived heresy, highlighting tensions between Neoplatonic eclecticism and institutional doctrine. This Florentine Platonism permeated art and literature, as seen in Botticelli's mythological paintings inspired by Ficino's commentaries on Plato's myths, and Michelangelo's ceiling frescoes evoking Neoplatonic ascent. Yet, while promoting intellectual freedom, it retained Plato's hierarchical ontology, where lower forms participated in higher ideals, aligning with humanism's elite patronage but challenging egalitarian impulses. The revival waned post-1494 with Savonarola's critiques and the French invasion, shifting focus to Aristotelian empiricism in later humanism.\n\n### Modern Critiques: From Enlightenment to Popper\n\nEnlightenment philosophers, prioritizing empirical observation and skepticism toward metaphysical speculation, mounted critiques against Plato's rationalist framework, particularly his doctrine of transcendent Forms and innate ideas. David Hume, in his *A Treatise of Human Nature* (1739–1740), rejected Platonic innate knowledge, asserting that all ideas originate from sensory impressions rather than a priori rational intuition, thereby undermining the epistemological foundation of Plato's idealism. Similarly, Voltaire lampooned Plato's visionary metaphysics in his satirical tale *Plato's Dream* (1756), portraying the philosopher's cosmic speculations—such as the creation of worlds and human punishment through bisection—as absurd reveries detached from observable reality. These critiques reflected a broader Enlightenment shift from Platonic essentialism to mechanistic views of nature, as seen in the preference for Lockean empiricism over ancient idealism, viewing Plato's eternal realm as unverifiable and obstructive to scientific progress.\n\nIn the nineteenth century, as positivism gained traction, Plato's rationalism faced further empirical challenges, with thinkers like Auguste Comte dismissing metaphysical entities like Forms as unscientific hypotheses ungrounded in observable phenomena. Comte's *Course of Positive Philosophy* (1830–1842) advocated a hierarchy of sciences culminating in sociology, implicitly relegating Platonic ontology to a theological stage superseded by empirical methods. This era's materialist turn, influenced by Darwinian evolution after 1859, portrayed Plato's static hierarchy of Forms as incompatible with dynamic natural processes, favoring Aristotelian immanence or outright nominalism over transcendent universals.\n\nKarl Popper's *The Open Society and Its Enemies* (1945), Volume I, delivered the most pointed modern assault, interpreting Plato's *Republic* as a blueprint for totalitarianism rather than utopia. Popper argued that Plato's advocacy for a rigidly stratified state, ruled by philosopher-kings who manipulate education and censor poetry to enforce harmony, embodies \"holism\" and \"historicism\"—doctrines subordinating individuals to an organic whole and predicting inevitable societal cycles of growth and decay, justifying authoritarian intervention. Writing amid World War II, Popper traced Plato's closed, tribal ethos to a reactionary disdain for Athenian democracy's individualism, contrasting it with the piecemeal engineering of open societies that tolerate criticism and error-correction. While Popper's reading has been lauded for highlighting causal risks in Platonic collectivism—such as the eugenic breeding programs and suppression of dissent outlined in Books IV–V of the *Republic*—critics contend it anachronistically projects twentieth-century ideologies onto ancient texts, overlooking Plato's ironic dialogues and emphasis on dialectical inquiry over dogmatic rule. Nonetheless, Popper's analysis enduringly influenced postwar liberalism, framing Plato as philosophically complicit in threats to pluralism.\n\n### Contemporary Applications and Revivals\n\nStraussians and political philosophers in the late 20th and early 21st centuries have drawn on Plato's doctrines to critique liberal democracy, emphasizing the need for philosophical guardianship amid mass society's vulnerabilities. Leo Strauss's rereading of Plato's *Republic* as an esoteric critique of utopianism—rather than endorsement—has shaped debates on regime stability and the philosopher's role, influencing figures in American conservatism who prioritize natural right over historicism. This approach counters egalitarian excesses by stressing hierarchy and virtue, as seen in applications to foreign policy realism where decisive leadership trumps popular opinion.\n\nIn mathematics and science, Platonic realism persists through debates over the ontology of numbers and structures, with proponents arguing that mathematical truths exist independently of human minds, indispensable for empirical predictions in physics. Contemporary defenses invoke the \"indispensability argument,\" positing that science's reliance on abstract entities like sets or infinities implies their objective reality, challenging nominalist reductions. Physicists such as Max Tegmark extend this to a \"mathematical universe hypothesis,\" where physical laws embody Platonic forms, reviving the idea of eternal, discoverable principles amid quantum and cosmological modeling.\n\nEducational reformers apply Plato's paideia—dialectical inquiry and moral formation—to counter utilitarian training, as in Socratic seminars that prioritize critical reasoning over rote skills. Programs echoing the Academy, such as those at St. John's College since its 1937 great books revival, use Platonic dialogues to cultivate intellectual virtues, yielding alumni data showing higher persistence in rigorous pursuits compared to standard curricula. Plato's non-egalitarian sorting by aptitude informs selective tracking, though contested in egalitarian policy circles.\n\nRecent cultural revivals, amplified by podcasts and online discourse since 2020, frame Platonism as antidotes to nihilism, with John Vervaeke linking the Forms to relevance realization in cognitive science, addressing modernity's \"meaning crisis\" through participatory knowing over propositional belief. Empirical uptake appears in rising searches for Platonic texts, correlating with youth disaffection from materialism, though academic skepticism persists due to institutional preferences for empiricist paradigms.\n\n## Controversies\n\n### Totalitarian Readings vs. Idealist Defenses\n\nIn 1945, Karl Popper published *The Open Society and Its Enemies*, Volume 1 of which critiques Plato's *Republic* as laying the intellectual groundwork for totalitarianism through its advocacy of a closed society prioritizing collective harmony over individual liberty. Popper identifies Plato's holism—subordinating the individual to the state—as fostering historicism, where societal change is seen as inevitable decline unless arrested by elite intervention, and collectivism, exemplified by the abolition of private property and family among the guardian class to prevent factionalism. He argues that Plato's philosopher-kings, selected via rigorous intellectual and moral training, embody an undemocratic elitism that justifies coercion, drawing parallels to modern totalitarian regimes despite Plato's pre-modern context.\n\nSpecific features of the *Republic* underpin these readings, including the \"noble lie\"—a foundational myth positing that citizens are born from the earth with metals in their souls (gold for rulers, silver for auxiliaries, bronze/iron for producers) to legitimize hereditary class divisions and suppress social mobility. Plato endorses state-controlled eugenics, communal child-rearing, and selective breeding among guardians to maintain genetic purity and loyalty (Republic 459d-460c), alongside censorship of poetry, music, and drama to align cultural output with virtues like courage and temperance, expelling artists whose works depict gods or heroes as flawed (Republic 377b-398b). These measures, per totalitarian interpreters, prioritize regime stability over truth or freedom, with rulers permitted expedient falsehoods (Republic 389b-c), reflecting a realist calculus where deception serves the greater good of justice as hierarchical order.\n\nDefenders of Plato counter that Popper's analysis imposes anachronistic liberal individualism on an ancient text, ignoring the *Republic*'s dialectical form and Socratic irony, which undermine literal implementation as a blueprint. They emphasize its idealist framework: the polity as an analogy for the soul's tripartite structure (reason, spirit, appetite), where justice emerges from rational governance internally and externally, not as a totalitarian program but a speculative inquiry into virtue amid Athens' democratic failures, such as the execution of Socrates in 399 BCE. Scholars like Leo Strauss argue the *Republic* esoterically critiques tyranny by exaggerating extremes, while the noble lie functions pedagogically to inculcate civic unity without implying endorsement of perpetual deception in practice; moreover, Plato's guardians possess private critiques of their system (e.g., Glaucon's challenges), and the dialogue concludes with the state's inevitable corruption (Republic 546a-608b), underscoring human imperfection over utopian enforcement.\n\nThe debate persists in scholarship, with totalitarian readings gaining traction post-World War II for highlighting causal risks in Plato's anti-egalitarian hierarchy—evident in his disdain for democracy as mob rule (Republic 557a-562a)—yet idealist defenses prevail in classical studies by stressing metaphysical Forms as the true focus, rendering political proposals subordinate to transcendent philosophy. Empirically, Plato's Syracuse interventions (367 and 361 BCE) failed to impose his vision, suggesting his ideas prioritize theoretical purity over practical total control, though they undeniably valorize authority structures incompatible with empirical pluralism observed in open societies. Critics of Popper note his selective emphasis on *Republic* over *Laws*, which moderates some extremes with mixed constitutions, but acknowledge that Plato's causal realism—rooted in observed Athenian instability—favors stability via coercion, a stance empirically defensible in unstable polities yet hazardous when scaled.\n\n### Anti-Egalitarianism and Hierarchy in Practice\n\nIn Plato's *Republic*, the ideal polity mirrors the tripartite structure of the soul, comprising rulers (philosopher-kings), auxiliaries (warriors), and producers (artisans and farmers), with authority flowing strictly from the rational elite to subordinate classes based on innate aptitudes rather than egalitarian distribution. Justice emerges when each class confines itself to its specialized function—rulers deliberate, auxiliaries protect, and producers provide sustenance—ensuring harmony through inequality aligned with natural capacities, as deviation invites discord akin to bodily dysfunction. This hierarchy rejects blanket equality, positing that equal treatment of unequals breeds injustice; instead, proportionality prevails, with the wise governing the less capable for collective benefit.\n\nTo sustain this order, Plato prescribes mechanisms like the \"noble lie,\" a foundational myth imparting metallic essences to souls—gold for rulers, silver for auxiliaries, and base metals for producers—to foster voluntary acceptance of roles and avert resentment, while concealing the contingency of class assignments determined by rigorous testing. Rulers and auxiliaries forgo private property and family to prioritize communal welfare, with selective breeding via rigged lotteries ensuring genetic excellence among guardians, thereby perpetuating hierarchy without overt coercion. Education cements divisions: philosophical dialectic trains rulers in transcendent Forms, while auxiliaries receive martial and moral conditioning, and producers basic civic instruction, all under state-controlled narratives that censor disruptive poetry and myths to align appetites with reason.\n\nPlato critiques egalitarian regimes, particularly democracy, as degenerative: by enfranchising all desires indifferently and honoring the mediocre, it erodes standards, empowering flatterers over experts and paving the way for tyranny, as seen in Athens' execution of Socrates in 399 BCE. He favors \"aristocracy\" (rule by the best) over timocracy, oligarchy, democracy, or tyranny, arguing empirical observation of flawed states confirms the superiority of hierarchical meritocracy, where unqualified rule invites inefficiency and vice.\n\nIn practice, Plato endeavored to instantiate these principles during visits to Syracuse in 367 BCE and 361 BCE, invited by Dion to tutor the young tyrant Dionysius II in philosophy toward enlightened governance, aiming to supplant tyrannical whim with rational hierarchy. Per his *Seventh Letter*, these efforts faltered amid court intrigues, Dionysius's superficial engagement with ideas, and resistance from entrenched interests; Plato faced threats, temporary enslavement upon departure in 361 BCE, and ultimate exile, underscoring the chasm between theoretical hierarchy and realpolitik, where power-holders balked at subordinating to philosophical oversight. Despite failures, the Academy, founded circa 387 BCE, served as a training ground for potential rulers, indirectly applying hierarchical pedagogy by selecting and educating elites in dialectic over mass instruction.\n\n### Empirical Challenges to Transcendent Forms\n\nAristotle, Plato's student, mounted one of the earliest empirical critiques of transcendent Forms by arguing that they fail to explain observed particulars and change in the physical world. He contended that Forms, posited as separate eternal entities, do not causally interact with sensible objects, rendering them explanatorily inert for natural phenomena. Instead, Aristotle proposed that universals exist immanently within substances, abstracted through empirical observation rather than accessed via pure reason divorced from sensory data. This shift prioritized inductive investigation of the material world, where forms serve as essences realized in concrete things, avoiding the \"third man\" regress where explaining similarity among particulars requires an infinite hierarchy of higher Forms.\n\nModern scientific methodologies amplify these challenges by demonstrating that empirical regularities in nature—such as physical laws and biological adaptations—emerge from observable mechanisms without invoking a transcendent realm. For instance, evolutionary theory accounts for morphological similarities among species through descent with variation and natural selection, not imperfect participations in ideal archetypes. Physics describes universal behaviors via testable models grounded in measurement and experimentation, rendering separate Forms an unnecessary hypothesis under principles of parsimony. The absence of direct sensory or instrumental evidence for transcendent entities undermines their ontological status, as scientific progress relies on falsifiable predictions tied to the spatiotemporal world rather than immutable ideals.\n\nCognitive science further erodes the epistemological foundation of Forms by showing that concept formation arises from experiential learning and neural pattern recognition, contradicting Plato's doctrine of innate recollection from a pre-existent acquaintance with ideals. Neuroimaging studies reveal universals as distributed representations in the brain, shaped by environmental inputs and probabilistic associations, not a priori access to non-physical realities. This empirical grounding aligns with causal accounts where mental abstractions reflect adaptive responses to sensory data, obviating the need for a dualistic ontology separating knowable essences from deceptive appearances.\n\nCritics like nominalists extend these objections by denying the independent existence of universals altogether, positing that predicates denote resemblances among particulars discerned empirically, without positing mind-independent Forms. While mathematical Platonism persists in some scientific contexts for its utility in modeling, broader transcendent Forms lack analogous predictive power or verifiability, positioning them as metaphysical speculation rather than empirically warranted truths.\n\n### Influence on Total Regimes: Causal or Coincidental?\n\nKarl Popper, in his 1945 work *The Open Society and Its Enemies*, contended that Plato's political philosophy in *The Republic* exhibited totalitarian tendencies by advocating a closed society ruled by an elite class of philosopher-kings who enforce unity through mechanisms such as the \"noble lie,\" censorship of art and poetry, and rigid social hierarchies, thereby suppressing individual freedoms in favor of state harmony. Popper argued these elements prioritized collective stability over open democratic processes, laying intellectual groundwork for later authoritarian systems by promoting historicism—the idea that societal change follows inevitable laws discerned only by guardians—and rejecting piecemeal reform in favor of utopian blueprints. However, Popper's interpretation has faced criticism for overstating Plato's prescriptive intent; scholars note that *The Republic*'s kallipolis is presented as an ideal form rather than a practical blueprint, with Socratic dialogues often employing irony to critique rather than endorse absolute control.\n\nEmpirical examination reveals scant direct causal links between Platonic texts and 20th-century totalitarian regimes. Nazi Germany's ideology drew primarily from racial pseudoscience, Friedrich Nietzsche's will to power, and Richard Wagner's mythic nationalism, with no prominent citations of Plato in Adolf Hitler's *Mein Kampf* (1925) or Joseph Goebbels' propaganda frameworks; while Martin Heidegger engaged Plato philosophically, his influence emphasized ontology over political totalitarianism. Similarly, Soviet communism under Vladimir Lenin and Joseph Stalin stemmed from Karl Marx's materialist dialectic and class struggle, which explicitly critiqued idealist philosophers like Plato as bourgeois distractions, rather than adopting his guardian-class communism—limited to elite rulers without private property—or eugenic breeding programs. Mussolini's Italian Fascism invoked Roman imperial traditions and syndicalism, occasionally referencing ancient hierarchy but not Plato's Forms or tripartite soul as foundational.\n\nCoincidental parallels exist in shared authoritarian motifs, such as state supremacy over the individual and elite guardianship, which recur across disparate ideologies due to convergent responses to perceived societal decay—Plato reacted to Athenian democracy's excesses post-Peloponnesian War (431–404 BCE), while modern totalitarians addressed industrial upheaval and World War I's aftermath. Yet, Plato's system lacked key totalitarian features like mass ideological indoctrination via modern media, secret police surveillance, or expansionist imperialism; his guardians aimed for philosophical contemplation over perpetual mobilization, and the Republic explicitly warns against degeneration into tyranny. Critics of causal claims, including defenders of Platonic idealism, argue that attributing regime atrocities to a 4th-century BCE text ignores intervening historical contingencies and selective misappropriations, rendering the influence more archetypal than mechanistic. This debate underscores broader tensions in interpreting ancient philosophy through modern lenses, where structural similarities do not imply direct causation absent verifiable transmission chains.",
  "external_references": [
    {
      "text": "Plato",
      "url": "https://mathshistory.st-andrews.ac.uk/Biographies/Plato/",
      "domain": "mathshistory.st-andrews.ac.uk",
      "type": "citation"
    },
    {
      "text": "Academy.html",
      "url": "https://www.departments.bucknell.edu/history/carnegie/plato/academy.html",
      "domain": "departments.bucknell.edu",
      "type": "citation"
    },
    {
      "text": "Plato A Theory Of Forms",
      "url": "https://philosophynow.org/issues/90/Plato_A_Theory_of_Forms",
      "domain": "philosophynow.org",
      "type": "citation"
    },
    {
      "text": "What Did Socrates Plato And Aristotle Think About Wisdom",
      "url": "https://wisdomcenter.uchicago.edu/news/wisdom-news/what-did-socrates-plato-and-aristotle-think-about-wisdom",
      "domain": "wisdomcenter.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Plato.htm",
      "url": "https://pages.hmc.edu/beckman/philosophy/Phil-179S/plato.htm",
      "domain": "pages.hmc.edu",
      "type": "citation"
    },
    {
      "text": "Plato The Name And The Poet",
      "url": "https://www.worldhistory.org/article/33/plato-the-name-and-the-poet/",
      "domain": "worldhistory.org",
      "type": "citation"
    },
    {
      "text": "Ej1016076.pdf",
      "url": "https://files.eric.ed.gov/fulltext/EJ1016076.pdf",
      "domain": "files.eric.ed.gov",
      "type": "citation"
    },
    {
      "text": "Plato Academy",
      "url": "https://iep.utm.edu/plato-academy/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Plato Republic Athens Democracy Aristocracy Tyrants",
      "url": "https://jacobin.com/2023/04/plato-republic-athens-democracy-aristocracy-tyrants",
      "domain": "jacobin.com",
      "type": "citation"
    },
    {
      "text": "832 Plato Socrates",
      "url": "https://www.famous-trials.com/socrates/832-plato-socrates",
      "domain": "famous-trials.com",
      "type": "citation"
    },
    {
      "text": "Entry 277.html",
      "url": "https://europe.factsanddetails.com/article/entry-277.html",
      "domain": "europe.factsanddetails.com",
      "type": "citation"
    },
    {
      "text": "Platos Answer To Heraclitus And Parmenides",
      "url": "https://askaphilosopher.org/2011/07/20/platos-answer-to-heraclitus-and-parmenides/",
      "domain": "askaphilosopher.org",
      "type": "citation"
    },
    {
      "text": "Heraclit",
      "url": "https://iep.utm.edu/heraclit/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Platoparmenides.html",
      "url": "http://www.integralscience.org/platoparmenides.html",
      "domain": "integralscience.org",
      "type": "citation"
    },
    {
      "text": "Pre Socratic Influences In Plato 725970",
      "url": "https://www.123helpme.com/essay/Pre-Socratic-Influences-In-Plato-725970",
      "domain": "123helpme.com",
      "type": "citation"
    },
    {
      "text": "Plato Arguments Against Democracy",
      "url": "https://www.thecollector.com/plato-arguments-against-democracy/",
      "domain": "thecollector.com",
      "type": "citation"
    },
    {
      "text": "Reipod 2",
      "url": "https://philarchive.org/archive/REIPOD-2",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://dc.ewu.edu/cgi/viewcontent.cgi?article=1178\\u0026context=theses",
      "domain": "dc.ewu.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarlycommons.law.hofstra.edu/cgi/viewcontent.cgi?article=2354\\u0026context=faculty_scholarship",
      "domain": "scholarlycommons.law.hofstra.edu",
      "type": "citation"
    },
    {
      "text": "What Did Ancient Greek Philosophers And Scholars Think About Democracy",
      "url": "https://www.lifestyledemocracy.com/what-did-ancient-greek-philosophers-and-scholars-think-about-democracy/",
      "domain": "lifestyledemocracy.com",
      "type": "citation"
    },
    {
      "text": "034 Plato.html",
      "url": "https://archive.schillerinstitute.com/fid_02-06/034_plato.html",
      "domain": "archive.schillerinstitute.com",
      "type": "citation"
    },
    {
      "text": "833 H",
      "url": "https://www.famous-trials.com/socrates/833-h",
      "domain": "famous-trials.com",
      "type": "citation"
    },
    {
      "text": "Plato The Apology Of Socrates Sb",
      "url": "https://chs.harvard.edu/primary-source/plato-the-apology-of-socrates-sb/",
      "domain": "chs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "290088418 Plato%27s Charmides As A Political Act Apologetics And The Promotion Of Ideology",
      "url": "https://www.researchgate.net/publication/290088418_Plato%27s_Charmides_as_a_Political_Act_Apologetics_and_the_Promotion_of_Ideology",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "13685",
      "url": "https://grbs.library.duke.edu/index.php/grbs/article/download/14747/3891/13685",
      "domain": "grbs.library.duke.edu",
      "type": "citation"
    },
    {
      "text": "Index.php",
      "url": "https://www.heritage-history.com/index.php?c=resources\\u0026s=char-dir\\u0026f=plato",
      "domain": "heritage-history.com",
      "type": "citation"
    },
    {
      "text": "Plato 12 4 The Grand Tour Ee99a90d7316",
      "url": "https://medium.com/the-first-philosophers/plato-12-4-the-grand-tour-ee99a90d7316",
      "domain": "medium.com",
      "type": "citation"
    },
    {
      "text": "Archytas",
      "url": "https://plato.stanford.edu/entries/archytas/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Archytas",
      "url": "https://mathshistory.st-andrews.ac.uk/Biographies/Archytas/",
      "domain": "mathshistory.st-andrews.ac.uk",
      "type": "citation"
    },
    {
      "text": "When Philosopher Met King On Platos Italian Voyages",
      "url": "https://aeon.co/essays/when-philosopher-met-king-on-platos-italian-voyages",
      "domain": "aeon.co",
      "type": "citation"
    },
    {
      "text": "Plato On Sicily",
      "url": "https://www.livius.org/sources/content/plato/letter-7/plato-on-sicily/",
      "domain": "livius.org",
      "type": "citation"
    },
    {
      "text": "Plato",
      "url": "https://www.worldhistory.org/timeline/plato/",
      "domain": "worldhistory.org",
      "type": "citation"
    },
    {
      "text": "Art407.htm",
      "url": "http://www.bestofsicily.com/mag/art407.htm",
      "domain": "bestofsicily.com",
      "type": "citation"
    },
    {
      "text": "A Short History Of Platos Academy",
      "url": "https://platosacademy.org/a-short-history-of-platos-academy/",
      "domain": "platosacademy.org",
      "type": "citation"
    },
    {
      "text": "400687410",
      "url": "https://academic.oup.com/book/45820/chapter/400687410",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Plato",
      "url": "https://iep.utm.edu/plato/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Ancient Scroll Reveals New Story Of Platos Death Heres Why You Should Be Suspicious Of It 229312",
      "url": "https://theconversation.com/ancient-scroll-reveals-new-story-of-platos-death-heres-why-you-should-be-suspicious-of-it-229312",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "Location Plato Grave Found Athens",
      "url": "https://greekreporter.com/2025/08/29/location-plato-grave-found-athens/",
      "domain": "greekreporter.com",
      "type": "citation"
    },
    {
      "text": "Speusippus",
      "url": "https://plato.stanford.edu/entries/speusippus/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Reg 0035 2039 1971 Num 84 401 1184",
      "url": "https://www.persee.fr/doc/reg_0035-2039_1971_num_84_401_1184",
      "domain": "persee.fr",
      "type": "citation"
    },
    {
      "text": "Plato Ethics Politics",
      "url": "https://plato.stanford.edu/entries/plato-ethics-politics/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Ancient Soul",
      "url": "https://plato.stanford.edu/entries/ancient-soul/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Sinttt",
      "url": "https://philarchive.org/archive/SINTTT",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "Phaedo",
      "url": "https://iep.utm.edu/phaedo/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Markaf 4",
      "url": "https://philarchive.org/archive/MARKAF-4",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "Platos Theory Of Forms",
      "url": "https://daily-philosophy.com/platos-theory-of-forms/",
      "domain": "daily-philosophy.com",
      "type": "citation"
    },
    {
      "text": "Theatetu",
      "url": "https://iep.utm.edu/theatetu/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Plato Rationalism",
      "url": "https://thisisrationalism.com/plato-rationalism/",
      "domain": "thisisrationalism.com",
      "type": "citation"
    },
    {
      "text": "Justice Virtue",
      "url": "https://plato.stanford.edu/entries/justice-virtue/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Ch5.xhtml",
      "url": "https://books.openbookpublishers.com/10.11647/obp.0229/ch5.xhtml",
      "domain": "books.openbookpublishers.com",
      "type": "citation"
    },
    {
      "text": "Plato Rhetoric",
      "url": "https://plato.stanford.edu/entries/plato-rhetoric/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Art And Mimesis In Plato S Republic",
      "url": "https://www.lrb.co.uk/the-paper/v20/n10/m.f.-burnyeat/art-and-mimesis-in-plato-s-republic",
      "domain": "lrb.co.uk",
      "type": "citation"
    },
    {
      "text": "1586606735.pdf",
      "url": "https://www.haaconline.org.in/attendence/classnotes/files/1586606735.pdf",
      "domain": "haaconline.org.in",
      "type": "citation"
    },
    {
      "text": "Ion.html",
      "url": "http://classics.mit.edu/Plato/ion.html",
      "domain": "classics.mit.edu",
      "type": "citation"
    },
    {
      "text": "Plato Philosophy Ion Art",
      "url": "https://www.thecollector.com/plato-philosophy-ion-art/",
      "domain": "thecollector.com",
      "type": "citation"
    },
    {
      "text": "Werrap",
      "url": "https://philarchive.org/archive/WERRAP",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "Plato On The Value Of Philosophy The Art Of Argument In The Gorgias And Phaedrus",
      "url": "https://ndpr.nd.edu/reviews/plato-on-the-value-of-philosophy-the-art-of-argument-in-the-gorgias-and-phaedrus/",
      "domain": "ndpr.nd.edu",
      "type": "citation"
    },
    {
      "text": "Republic.9.viii.html",
      "url": "https://classics.mit.edu/Plato/republic.9.viii.html",
      "domain": "classics.mit.edu",
      "type": "citation"
    },
    {
      "text": "Education In Platos Republic",
      "url": "https://www.scu.edu/character/resources/education-in-platos-republic/",
      "domain": "scu.edu",
      "type": "citation"
    },
    {
      "text": "Republic.pdf",
      "url": "https://philosophy.uncg.edu/wp-content/uploads/2024/01/Republic.pdf",
      "domain": "philosophy.uncg.edu",
      "type": "citation"
    },
    {
      "text": "Book Iii Section Iii",
      "url": "https://www.cliffsnotes.com/literature/r/republic/summary-and-analysis/book-iii-section-iii",
      "domain": "cliffsnotes.com",
      "type": "citation"
    },
    {
      "text": "Bria 19 4 C Plato And The Republic",
      "url": "https://teachdemocracy.org/bill-of-rights-in-action/bria-19-4-c-plato-and-the-republic",
      "domain": "teachdemocracy.org",
      "type": "citation"
    },
    {
      "text": "Lecture 6",
      "url": "https://oyc.yale.edu/political-science/plsc-114/lecture-6",
      "domain": "oyc.yale.edu",
      "type": "citation"
    },
    {
      "text": "Plato Utopia",
      "url": "https://plato.stanford.edu/entries/plato-utopia/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Common Good",
      "url": "https://plato.stanford.edu/entries/common-good/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Plato On Education",
      "url": "https://infed.org/dir/welcome/plato-on-education/",
      "domain": "infed.org",
      "type": "citation"
    },
    {
      "text": "Platos Republic Book Iii The Noble Lie",
      "url": "https://greatbooksguy.com/2017/10/23/platos-republic-book-iii-the-noble-lie/",
      "domain": "greatbooksguy.com",
      "type": "citation"
    },
    {
      "text": "The Truth About Platos Noble Lie",
      "url": "https://voegelinview.com/the-truth-about-platos-noble-lie/",
      "domain": "voegelinview.com",
      "type": "citation"
    },
    {
      "text": "Ed559997.pdf",
      "url": "https://files.eric.ed.gov/fulltext/ED559997.pdf",
      "domain": "files.eric.ed.gov",
      "type": "citation"
    },
    {
      "text": "Aai9517932",
      "url": "https://epublications.marquette.edu/dissertations/AAI9517932/",
      "domain": "epublications.marquette.edu",
      "type": "citation"
    },
    {
      "text": "Ancifort.htm",
      "url": "https://www.bu.edu/wcp/Papers/Anci/AnciFort.htm",
      "domain": "bu.edu",
      "type": "citation"
    },
    {
      "text": "Interpreting.pdf",
      "url": "https://sites.temple.edu/dwolf/files/2020/06/Interpreting.pdf",
      "domain": "sites.temple.edu",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://vtechworks.lib.vt.edu/bitstreams/c59c535b-c0ce-4ce6-b0e7-368ee7c2b46b/download",
      "domain": "vtechworks.lib.vt.edu",
      "type": "citation"
    },
    {
      "text": "Irony.pdf",
      "url": "https://sites.temple.edu/dwolf/files/2020/06/Irony.pdf",
      "domain": "sites.temple.edu",
      "type": "citation"
    },
    {
      "text": "Socraticignoranceascomplexirony.pdf",
      "url": "https://people.bu.edu/roochnik/documents/SocraticIgnoranceAsComplexIrony.pdf",
      "domain": "people.bu.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0174:text=Apol",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0170:text=Crito",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0170:text=Euthyph",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0180:text=Meno",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0181:text=Phaedo",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0174:text=Sym",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0168:text=Rep",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0182:text=Theaet",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "Text",
      "url": "https://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.01.0179:text=Parm",
      "domain": "perseus.tufts.edu",
      "type": "citation"
    },
    {
      "text": "84b9ac52a7ac86c1bd7bb50c51b49537",
      "url": "https://www.cambridge.org/core/books/cambridge-companion-to-plato/stylometry-and-chronology/84B9AC52A7AC86C1BD7BB50C51B49537",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "1992.01.12",
      "url": "https://bmcr.brynmawr.edu/1992/1992.01.12/",
      "domain": "bmcr.brynmawr.edu",
      "type": "citation"
    },
    {
      "text": "Ghoaco",
      "url": "https://philarchive.org/archive/GHOACO",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "Leonard Brandwood The Chronology Of Platos Dialogues Cambridge Cambridge University Press 1990",
      "url": "https://www.academia.edu/7545180/Leonard_Brandwood_The_Chronology_of_Platos_Dialogues_Cambridge_Cambridge_University_Press_1990",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "Stylometricarguments.html",
      "url": "http://www.juliustomin.org/stylometricarguments.html",
      "domain": "juliustomin.org",
      "type": "citation"
    },
    {
      "text": "354199497",
      "url": "https://academic.oup.com/edited-volume/41754/chapter/354199497",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "What The Controversial Letters Of Plato Reveal About Us",
      "url": "https://aeon.co/essays/what-the-controversial-letters-of-plato-reveal-about-us",
      "domain": "aeon.co",
      "type": "citation"
    },
    {
      "text": "20627",
      "url": "https://grbs.library.duke.edu/index.php/grbs/article/download/16197/7290/20627",
      "domain": "grbs.library.duke.edu",
      "type": "citation"
    },
    {
      "text": "Dialouges Of Plato",
      "url": "https://www.worldhistory.org/image/10818/dialouges-of-plato/",
      "domain": "worldhistory.org",
      "type": "citation"
    },
    {
      "text": "How Did The Works Of Plato Reach Us The Textual Tradition Of The Dialogues",
      "url": "https://www.roger-pearse.com/weblog/2024/05/11/how-did-the-works-of-plato-reach-us-the-textual-tradition-of-the-dialogues/",
      "domain": "roger-pearse.com",
      "type": "citation"
    },
    {
      "text": "The Transmission Of Plato.html",
      "url": "https://jefdemolder.blogspot.com/2019/04/the-transmission-of-plato.html",
      "domain": "jefdemolder.blogspot.com",
      "type": "citation"
    },
    {
      "text": "Writings 4",
      "url": "https://www.rep.routledge.com/articles/biographical/plato-427-347-bc/v-1/sections/writings-4",
      "domain": "rep.routledge.com",
      "type": "citation"
    },
    {
      "text": "Phoenix.73.3 4.0372",
      "url": "https://www.jstor.org/stable/10.7834/phoenix.73.3-4.0372",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Works.htm",
      "url": "https://plato-dialogues.org/works.htm",
      "domain": "plato-dialogues.org",
      "type": "citation"
    },
    {
      "text": "Excerpt 18 Aristotle On Plato On The One And Forms",
      "url": "https://intotheclarities.com/2018/02/23/excerpt-18-aristotle-on-plato-on-the-one-and-forms/",
      "domain": "intotheclarities.com",
      "type": "citation"
    },
    {
      "text": "F0297d76e5984c917e9843ed750fecda",
      "url": "https://www.cambridge.org/core/elements/platos-unwritten-doctrines/F0297D76E5984C917E9843ED750FECDA",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Pepplej",
      "url": "https://personal.kenyon.edu/pepplej/",
      "domain": "personal.kenyon.edu",
      "type": "citation"
    },
    {
      "text": "Platos Unwritten Doctrines And Christianity Part 1 Introduction",
      "url": "https://juvenileinstructor.org/platos-unwritten-doctrines-and-christianity-part-1-introduction/",
      "domain": "juvenileinstructor.org",
      "type": "citation"
    },
    {
      "text": "Article 29661.html",
      "url": "https://mph.ui.ac.ir/article_29661.html?lang=en",
      "domain": "mph.ui.ac.ir",
      "type": "citation"
    },
    {
      "text": "Platos Enigmatic Lecture On The Good",
      "url": "https://atlantis.fyi/sources/platos-enigmatic-lecture-on-the-good/",
      "domain": "atlantis.fyi",
      "type": "citation"
    },
    {
      "text": "Gilpll",
      "url": "https://philarchive.org/archive/GILPLL",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "4182081",
      "url": "https://www.jstor.org/stable/4182081",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Midplato",
      "url": "https://iep.utm.edu/midplato/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "215543768.pdf",
      "url": "https://core.ac.uk/download/pdf/215543768.pdf",
      "domain": "core.ac.uk",
      "type": "citation"
    },
    {
      "text": "The Problem Of Writing",
      "url": "https://www.rep.routledge.com/articles/biographical/plato-427-347-bc/v-1/sections/the-problem-of-writing",
      "domain": "rep.routledge.com",
      "type": "citation"
    },
    {
      "text": "98",
      "url": "https://www.mdpi.com/2073-8994/11/1/98",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Article 1585.html",
      "url": "https://orj.sru.ac.ir/article_1585.html?lang=en",
      "domain": "orj.sru.ac.ir",
      "type": "citation"
    },
    {
      "text": "Platos First Principles",
      "url": "https://www.academia.edu/5728764/Platos_First_Principles",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "Aristotle.pdf",
      "url": "https://mural.maynoothuniversity.ie/id/eprint/389/1/Aristotle.pdf",
      "domain": "mural.maynoothuniversity.ie",
      "type": "citation"
    },
    {
      "text": "43767868",
      "url": "https://www.jstor.org/stable/43767868",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "2021.07.31",
      "url": "https://bmcr.brynmawr.edu/2021/2021.07.31/",
      "domain": "bmcr.brynmawr.edu",
      "type": "citation"
    },
    {
      "text": "Platos Statement About The Superiority Of Oral Transmission To Writing",
      "url": "https://via-hygeia.art/platos-statement-about-the-superiority-of-oral-transmission-to-writing/",
      "domain": "via-hygeia.art",
      "type": "citation"
    },
    {
      "text": "Plato The Unwritten Doctrine",
      "url": "https://sleimanbook.com/2020/05/13/plato-the-unwritten-doctrine/",
      "domain": "sleimanbook.com",
      "type": "citation"
    },
    {
      "text": "Modern Views Of Platos Silence Pt 1",
      "url": "https://voegelinview.com/modern-views-of-platos-silence-pt-1/",
      "domain": "voegelinview.com",
      "type": "citation"
    },
    {
      "text": "Html",
      "url": "https://www.degruyterbrill.com/document/doi/10.12987/9780300158816-005/html",
      "domain": "degruyterbrill.com",
      "type": "citation"
    },
    {
      "text": "1998.07.22",
      "url": "https://bmcr.brynmawr.edu/1998/1998.07.22/",
      "domain": "bmcr.brynmawr.edu",
      "type": "citation"
    },
    {
      "text": "45174328",
      "url": "https://www.jstor.org/stable/45174328",
      "domain": "jstor.org",
      "type": "citation"
    },
    {
      "text": "Mmiller The Choice Between The Dialogues And The Unwritten Teachings Third Way Ed Gonzalez 1995.pdf",
      "url": "https://pages.vassar.edu/mitchellmiller/files/2023/03/MMiller-The-Choice-between-the-Dialogues-and-the-Unwritten-Teachings-Third-Way-ed-Gonzalez-1995.pdf",
      "domain": "pages.vassar.edu",
      "type": "citation"
    },
    {
      "text": "Ancirodr.htm",
      "url": "https://www.bu.edu/wcp/Papers/Anci/AnciRodr.htm",
      "domain": "bu.edu",
      "type": "citation"
    },
    {
      "text": "Bp000021.pdf",
      "url": "https://brill.com/downloadpdf/book/edcoll/9789004285163/BP000021.pdf",
      "domain": "brill.com",
      "type": "citation"
    },
    {
      "text": "Bp000012.xml",
      "url": "https://brill.com/display/book/9789004534544/BP000012.xml",
      "domain": "brill.com",
      "type": "citation"
    },
    {
      "text": "195460083",
      "url": "https://academic.oup.com/book/26680/chapter/195460083",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "304956483 Plato%27s Unwritten Doctrines A Discussion",
      "url": "https://www.researchgate.net/publication/304956483_Plato%27s_unwritten_doctrines_a_discussion",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Arcesilaus",
      "url": "https://plato.stanford.edu/entries/arcesilaus/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Ancient Greek Skepticism",
      "url": "https://iep.utm.edu/ancient-greek-skepticism/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Antiochus Ascalon",
      "url": "https://plato.stanford.edu/entries/antiochus-ascalon/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Cicero",
      "url": "https://plato.stanford.edu/entries/cicero/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Watton Matthew Rain 202111 Phd Thesis.pdf",
      "url": "https://tspace.library.utoronto.ca/bitstream/1807/125881/3/Watton_Matthew_Rain_202111_PhD_thesis.pdf",
      "domain": "tspace.library.utoronto.ca",
      "type": "citation"
    },
    {
      "text": "Biemiller Augustine And Plato.pdf",
      "url": "https://aporia.byu.edu/pdfs/biemiller-augustine_and_plato.pdf",
      "domain": "aporia.byu.edu",
      "type": "citation"
    },
    {
      "text": "Bootro 7",
      "url": "https://philarchive.org/archive/BOOTRO-7",
      "domain": "philarchive.org",
      "type": "citation"
    },
    {
      "text": "Boethius",
      "url": "https://plato.stanford.edu/entries/boethius/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Christian Platonism Boethius Consolation Philosophy Jordan Bissell.html",
      "url": "https://theimaginativeconservative.org/2023/10/christian-platonism-boethius-consolation-philosophy-jordan-bissell.html",
      "domain": "theimaginativeconservative.org",
      "type": "citation"
    },
    {
      "text": "H001.htm",
      "url": "http://www.muslimphilosophy.com/ip/rep/H001.htm",
      "domain": "muslimphilosophy.com",
      "type": "citation"
    },
    {
      "text": "Arabic Islamic Influence",
      "url": "https://plato.stanford.edu/entries/arabic-islamic-influence/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "School Of Chartres",
      "url": "https://www.britannica.com/place/School-of-Chartres",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Chartrian Platonism",
      "url": "https://www.rep.routledge.com/articles/thematic/chartres-school-of/v-1/sections/chartrian-platonism",
      "domain": "rep.routledge.com",
      "type": "citation"
    },
    {
      "text": "Medieval Philosophy",
      "url": "https://plato.stanford.edu/entries/medieval-philosophy/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "The Thought Of Saint Thomas Aquinas More Than Plato And Aristotle",
      "url": "https://voegelinview.com/the-thought-of-saint-thomas-aquinas-more-than-plato-and-aristotle/",
      "domain": "voegelinview.com",
      "type": "citation"
    },
    {
      "text": "Ficino",
      "url": "https://iep.utm.edu/ficino/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "C577410bcdbe0f947bbe66786ce0ab5f",
      "url": "https://www.cambridge.org/core/books/cambridge-history-of-literary-criticism/renaissance-neoplatonism/C577410BCDBE0F947BBE66786CE0AB5F",
      "domain": "cambridge.org",
      "type": "citation"
    },
    {
      "text": "Ficino",
      "url": "https://plato.stanford.edu/entries/ficino/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Marsilio Ficino",
      "url": "https://www.lindahall.org/about/news/scientist-of-the-day/marsilio-ficino/",
      "domain": "lindahall.org",
      "type": "citation"
    },
    {
      "text": "Pico Della Mirandola",
      "url": "https://plato.stanford.edu/entries/pico-della-mirandola/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Occult Philosophy Italian Renaissance Pico Della Mirandola Frances Yates",
      "url": "https://www.taylorfrancis.com/chapters/mono/10.4324/9780203167113-5/occult-philosophy-italian-renaissance-pico-della-mirandola-frances-yates",
      "domain": "taylorfrancis.com",
      "type": "citation"
    },
    {
      "text": "Platos Persona",
      "url": "https://www.pennpress.org/9780812249859/platos-persona/",
      "domain": "pennpress.org",
      "type": "citation"
    },
    {
      "text": "Platos Persona Marsilo Ficino Renaissance Humanism And Platonic Traditions",
      "url": "https://ndpr.nd.edu/reviews/platos-persona-marsilo-ficino-renaissance-humanism-and-platonic-traditions/",
      "domain": "ndpr.nd.edu",
      "type": "citation"
    },
    {
      "text": "David Hume Disinformation The Slave Of The Passions",
      "url": "https://euvsdisinfo.eu/david-hume-disinformation-the-slave-of-the-passions/",
      "domain": "euvsdisinfo.eu",
      "type": "citation"
    },
    {
      "text": "Plato.html",
      "url": "https://monadnock.net/voltaire/plato.html",
      "domain": "monadnock.net",
      "type": "citation"
    },
    {
      "text": "Enlightenment",
      "url": "https://plato.stanford.edu/entries/enlightenment/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Continental Rationalism",
      "url": "https://plato.stanford.edu/entries/continental-rationalism/",
      "domain": "plato.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Popp Pol",
      "url": "https://iep.utm.edu/popp-pol/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "The Open Society Revisited",
      "url": "https://philosophynow.org/issues/38/The_Open_Society_Revisited",
      "domain": "philosophynow.org",
      "type": "citation"
    },
    {
      "text": "249677799 Plato And K R Popper Toward A Critique Of Plato%27s Political Philosophy",
      "url": "https://www.researchgate.net/publication/249677799_Plato_and_K_R_Popper_Toward_a_Critique_of_Plato%27s_Political_Philosophy",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Review The Open Society And Its Enemies Volume 1 By Karl Popper",
      "url": "https://iea.org.uk/review-the-open-society-and-its-enemies-volume-1-by-karl-popper/",
      "domain": "iea.org.uk",
      "type": "citation"
    },
    {
      "text": "251771",
      "url": "https://modernagejournal.com/strausss-escape-from-platos-cave/251771/",
      "domain": "modernagejournal.com",
      "type": "citation"
    },
    {
      "text": "29.pdf",
      "url": "https://ijsshr.in/v5i4/Doc/29.pdf",
      "domain": "ijsshr.in",
      "type": "citation"
    },
    {
      "text": "Mathematical Platonism",
      "url": "https://philosophynow.org/issues/84/Mathematical_Platonism",
      "domain": "philosophynow.org",
      "type": "citation"
    },
    {
      "text": "Platonism Without Plato",
      "url": "https://samzdat.com/2018/01/26/platonism-without-plato/",
      "domain": "samzdat.com",
      "type": "citation"
    },
    {
      "text": "7277549",
      "url": "https://academic.oup.com/jope/article/57/3/739/7277549",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Why Platonism Stoicism Are Going Viral",
      "url": "https://www.greecepodcast.com/why-platonism-stoicism-are-going-viral/",
      "domain": "greecepodcast.com",
      "type": "citation"
    },
    {
      "text": "Are There Any Modern Defencesrevivals Of Platonic",
      "url": "https://www.reddit.com/r/askphilosophy/comments/ukudu0/are_there_any_modern_defencesrevivals_of_platonic/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "The Open Society And Its Enemies Karl Poppers Legacy",
      "url": "https://blogs.lse.ac.uk/lsehistory/2024/11/20/the-open-society-and-its-enemies-karl-poppers-legacy/",
      "domain": "blogs.lse.ac.uk",
      "type": "citation"
    },
    {
      "text": "18512",
      "url": "https://www.thepublicdiscourse.com/2017/03/18512/",
      "domain": "thepublicdiscourse.com",
      "type": "citation"
    },
    {
      "text": "12176",
      "url": "http://cscanada.net/index.php/sll/article/view/12176",
      "domain": "cscanada.net",
      "type": "citation"
    },
    {
      "text": "Plato As An Authoritarian Thinker",
      "url": "https://www.mingkunwu.com/academic-essays/plato-as-an-authoritarian-thinker",
      "domain": "mingkunwu.com",
      "type": "citation"
    },
    {
      "text": "Totalitarian.pdf",
      "url": "https://media.philosophy.ox.ac.uk/docs/people/brown/totalitarian.pdf",
      "domain": "media.philosophy.ox.ac.uk",
      "type": "citation"
    },
    {
      "text": "Rethinking Plato Philisophical Idealism And Political Totalitarianism",
      "url": "https://fountainmagazine.com/2001/issue-34-april-june-2001/rethinking-plato-philisophical-idealism-and-political-totalitarianism",
      "domain": "fountainmagazine.com",
      "type": "citation"
    },
    {
      "text": "Platopol",
      "url": "https://iep.utm.edu/platopol/",
      "domain": "iep.utm.edu",
      "type": "citation"
    },
    {
      "text": "Plato Republic Dialogue",
      "url": "https://www.senigaglia.com/plato-republic-dialogue/",
      "domain": "senigaglia.com",
      "type": "citation"
    },
    {
      "text": "Seventh Letter.html",
      "url": "http://classics.mit.edu/Plato/seventh_letter.html",
      "domain": "classics.mit.edu",
      "type": "citation"
    },
    {
      "text": "Idea Forms",
      "url": "https://www.sparknotes.com/philosophy/aristotle/idea-forms/",
      "domain": "sparknotes.com",
      "type": "citation"
    },
    {
      "text": "Why Did Aristotle Oppose Platos Theory Of Forms",
      "url": "https://www.thecollector.com/why-did-aristotle-oppose-platos-theory-of-forms/",
      "domain": "thecollector.com",
      "type": "citation"
    },
    {
      "text": "Plato Aristotle Ocr",
      "url": "https://alevelphilosophyandreligion.com/ocr-religious-studies/ocr-philosophy/plato-aristotle-ocr/",
      "domain": "alevelphilosophyandreligion.com",
      "type": "citation"
    },
    {
      "text": "1 1 5 Evaluation Of Platos Theories",
      "url": "https://senecalearning.com/en-GB/revision-notes/a-level/religious-studies/ocr/1-1-5-evaluation-of-platos-theories",
      "domain": "senecalearning.com",
      "type": "citation"
    },
    {
      "text": "Vfemd5fpnzstj6ka",
      "url": "https://fiveable.me/history-ancient-philosophy/unit-4/criticisms-interpretations-theory-forms/study-guide/vFeMD5fPNZstJ6kA",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Which Philosophers Best Opposed Platos Theory Of Forms",
      "url": "https://philosophy.stackexchange.com/questions/43282/which-philosophers-best-opposed-platos-theory-of-forms",
      "domain": "philosophy.stackexchange.com",
      "type": "citation"
    },
    {
      "text": "Viewtopic.php",
      "url": "https://forum.philosophynow.org/viewtopic.php?t=43671",
      "domain": "forum.philosophynow.org",
      "type": "citation"
    },
    {
      "text": "The First Authoritarian",
      "url": "https://hedgehogreview.com/issues/political-mythologies/articles/the-first-authoritarian",
      "domain": "hedgehogreview.com",
      "type": "citation"
    },
    {
      "text": "281",
      "url": "https://journals.openedition.org/etudesplatoniciennes/281",
      "domain": "journals.openedition.org",
      "type": "citation"
    },
    {
      "text": "The Legacy Of Plato The Republic And Fascism",
      "url": "https://apuedge.com/the-legacy-of-plato-the-republic-and-fascism",
      "domain": "apuedge.com",
      "type": "citation"
    },
    {
      "text": "Democracy And The Totalitarian Threat From Plato To Popper Via Arginusae",
      "url": "https://adastrapermundum.com/2019/04/18/democracy-and-the-totalitarian-threat-from-plato-to-popper-via-arginusae/",
      "domain": "adastrapermundum.com",
      "type": "citation"
    },
    {
      "text": "Plato A Totalitarian Advocate",
      "url": "https://retrospectjournal.com/2020/11/08/plato-a-totalitarian-advocate/",
      "domain": "retrospectjournal.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "Athens",
      "page": "Athens"
    },
    {
      "text": "Pericles",
      "page": "Pericles"
    },
    {
      "text": "Peloponnesian War",
      "page": "Peloponnesian_War"
    },
    {
      "text": "Codrus",
      "page": "Codrus"
    },
    {
      "text": "Solon",
      "page": "Solon"
    },
    {
      "text": "6th century",
      "page": "6th_century"
    },
    {
      "text": "eupatridae",
      "page": "Eupatridae"
    },
    {
      "text": "Cleisthenes",
      "page": "Cleisthenes"
    },
    {
      "text": "Aristocles",
      "page": "Aristocles"
    },
    {
      "text": "broad",
      "page": "The_Broad"
    },
    {
      "text": "Glaucon",
      "page": "Glaucon"
    },
    {
      "text": "Republic",
      "page": "Republic"
    },
    {
      "text": "Speusippus",
      "page": "Speusippus"
    },
    {
      "text": "Academy",
      "page": "Academy"
    },
    {
      "text": "deme",
      "page": "Deme"
    },
    {
      "text": "gymnastics",
      "page": "Gymnastics"
    },
    {
      "text": "grammar",
      "page": "Grammar"
    },
    {
      "text": "recitation",
      "page": "Recitation"
    },
    {
      "text": "kalos kagathos",
      "page": "Kalos_kagathos"
    },
    {
      "text": "radical democracy",
      "page": "Radical_democracy"
    },
    {
      "text": "Socrates",
      "page": "Socrates"
    },
    {
      "text": "impiety",
      "page": "Impiety"
    },
    {
      "text": "Athenian democracy",
      "page": "Athenian_democracy"
    },
    {
      "text": "questioning",
      "page": "Questioning"
    },
    {
      "text": "justice",
      "page": "Justice"
    },
    {
      "text": "piety",
      "page": "Piety"
    },
    {
      "text": "aporia",
      "page": "Aporia"
    },
    {
      "text": "Euthyphro",
      "page": "Euthyphro"
    },
    {
      "text": "Apology",
      "page": "Apology"
    },
    {
      "text": "Crito",
      "page": "Crito"
    },
    {
      "text": "ethics",
      "page": "Ethics"
    },
    {
      "text": "intellectual humility",
      "page": "Intellectual_humility"
    },
    {
      "text": "Heraclitus",
      "page": "Heraclitus"
    },
    {
      "text": "Cratylus",
      "page": "Cratylus"
    },
    {
      "text": "Parmenides",
      "page": "Parmenides"
    },
    {
      "text": "monism",
      "page": "Monism"
    },
    {
      "text": "Sicilian",
      "page": "The_Sicilian"
    },
    {
      "text": "Nicias",
      "page": "Nicias"
    },
    {
      "text": "Alcibiades",
      "page": "Alcibiades"
    },
    {
      "text": "Thirty Tyrants",
      "page": "Thirty_Tyrants"
    },
    {
      "text": "oligarchic",
      "page": "Oligarchy"
    },
    {
      "text": "Critias",
      "page": "Critias"
    },
    {
      "text": "democracy",
      "page": "Democracy"
    },
    {
      "text": "amnesty",
      "page": "Amnesty"
    },
    {
      "text": "Battle of Arginusae",
      "page": "Battle_of_Arginusae"
    },
    {
      "text": "liberty",
      "page": "Liberty"
    },
    {
      "text": "envy",
      "page": "Envy"
    },
    {
      "text": "dialectic",
      "page": "Dialectic"
    },
    {
      "text": "suffrage",
      "page": "Suffrage"
    },
    {
      "text": "Thrasybulus",
      "page": "Thrasybulus"
    },
    {
      "text": "jury",
      "page": "Jury"
    },
    {
      "text": "hemlock",
      "page": "Hemlock"
    },
    {
      "text": "Seventh Letter",
      "page": "Seventh_Letter"
    },
    {
      "text": "Potidaea",
      "page": "Potidaea"
    },
    {
      "text": "Magna Graecia",
      "page": "Magna_Graecia"
    },
    {
      "text": "Sicily",
      "page": "Sicily"
    },
    {
      "text": "southern Italy",
      "page": "Southern_Italy"
    },
    {
      "text": "political philosophy",
      "page": "Political_philosophy"
    },
    {
      "text": "Tarentum",
      "page": "Tarentum"
    },
    {
      "text": "xenia",
      "page": "Xenia"
    },
    {
      "text": "Archytas",
      "page": "Archytas"
    },
    {
      "text": "mathematician",
      "page": "Mathematician"
    },
    {
      "text": "strategos",
      "page": "Strategos"
    },
    {
      "text": "arithmetic",
      "page": "History_of_arithmetic"
    },
    {
      "text": "geometry",
      "page": "Geometry"
    },
    {
      "text": "Metapontum",
      "page": "Metapontum"
    },
    {
      "text": "metempsychosis",
      "page": "Metempsychosis"
    },
    {
      "text": "theory of Forms",
      "page": "Theory_of_forms"
    },
    {
      "text": "Dionysius",
      "page": "Dionysius"
    },
    {
      "text": "Dion",
      "page": "Dion"
    },
    {
      "text": "governance",
      "page": "Governance"
    },
    {
      "text": "asceticism",
      "page": "Asceticism"
    },
    {
      "text": "slavery",
      "page": "Slavery"
    },
    {
      "text": "autocracy",
      "page": "Autocracy"
    },
    {
      "text": "Diogenes Laertius",
      "page": "Diogenes_Laertius"
    },
    {
      "text": "higher learning",
      "page": "Higher_Learning"
    },
    {
      "text": "Western world",
      "page": "Western_world"
    },
    {
      "text": "gymnasium",
      "page": "Gymnasium"
    },
    {
      "text": "olive",
      "page": "Olive"
    },
    {
      "text": "Isocrates",
      "page": "Isocrates"
    },
    {
      "text": "skepticism",
      "page": "Skepticism"
    },
    {
      "text": "doubling the cube",
      "page": "Doubling_the_cube"
    },
    {
      "text": "old age",
      "page": "Old_age"
    },
    {
      "text": "evidence",
      "page": "Evidence"
    },
    {
      "text": "violence",
      "page": "Violence"
    },
    {
      "text": "suicide",
      "page": "Suicide"
    },
    {
      "text": "Herculaneum",
      "page": "Herculaneum"
    },
    {
      "text": "Philodemus",
      "page": "Philodemus"
    },
    {
      "text": "wedding",
      "page": "Wedding"
    },
    {
      "text": "feast",
      "page": ".Feast"
    },
    {
      "text": "infestation",
      "page": "Infestation"
    },
    {
      "text": "Platonism",
      "page": "Platonism"
    },
    {
      "text": "Muses",
      "page": "Muses"
    },
    {
      "text": "Aristotle",
      "page": "Aristotle"
    },
    {
      "text": "eidos",
      "page": "Eidos"
    },
    {
      "text": "Circle",
      "page": "Circle"
    },
    {
      "text": "dualism",
      "page": "Dualism"
    },
    {
      "text": "panta rhei",
      "page": "Panta_Rhei"
    },
    {
      "text": "Phaedo",
      "page": "Phaedo"
    },
    {
      "text": "particulars",
      "page": "Particular"
    },
    {
      "text": "Equality",
      "page": "Equality"
    },
    {
      "text": "materialism",
      "page": "Materialism"
    },
    {
      "text": "anamnesis",
      "page": "Anamnesis"
    },
    {
      "text": "soul",
      "page": "Soul"
    },
    {
      "text": "Form of the Good",
      "page": "Form_of_the_Good"
    },
    {
      "text": "the sun",
      "page": "The_Sun"
    },
    {
      "text": "cosmos",
      "page": "Cosmos"
    },
    {
      "text": "transcendence",
      "page": "Transcendence"
    },
    {
      "text": "Symposium",
      "page": "Symposium"
    },
    {
      "text": "beauty",
      "page": "Beauty"
    },
    {
      "text": "cosmogony",
      "page": "Cosmogony"
    },
    {
      "text": "Demiurge",
      "page": "Demiurge"
    },
    {
      "text": "chora",
      "page": "The_Chora"
    },
    {
      "text": "mimesis",
      "page": "Mimesis"
    },
    {
      "text": "chaos",
      "page": "Chaos"
    },
    {
      "text": "tripartite",
      "page": "Tripartite"
    },
    {
      "text": "somatic",
      "page": "Somatic"
    },
    {
      "text": "passions",
      "page": "Passions"
    },
    {
      "text": "analogy",
      "page": "Analogy"
    },
    {
      "text": "psychology",
      "page": "Psychology"
    },
    {
      "text": "education",
      "page": "Education"
    },
    {
      "text": "habituation",
      "page": "Habituation"
    },
    {
      "text": "reincarnation",
      "page": "Reincarnation"
    },
    {
      "text": "philosophy",
      "page": "Philosophy"
    },
    {
      "text": "eternal",
      "page": "Eternal"
    },
    {
      "text": "contemplation",
      "page": "Contemplation"
    },
    {
      "text": "immortality",
      "page": "Immortality"
    },
    {
      "text": "analogy of the Divided Line",
      "page": "Analogy_of_the_divided_line"
    },
    {
      "text": "pistis",
      "page": "Pistis"
    },
    {
      "text": "dianoia",
      "page": "Dianoia"
    },
    {
      "text": "noesis",
      "page": "Noesis"
    },
    {
      "text": "first principle",
      "page": "First_principle"
    },
    {
      "text": "knowledge",
      "page": "Knowledge"
    },
    {
      "text": "shadows",
      "page": "The_Shadows"
    },
    {
      "text": "metaphor",
      "page": "Metaphor"
    },
    {
      "text": "doxa",
      "page": "Doxa"
    },
    {
      "text": "Meno",
      "page": "Meno"
    },
    {
      "text": "Socratic questioning",
      "page": "Socratic_questioning"
    },
    {
      "text": "episteme",
      "page": "Episteme"
    },
    {
      "text": "opinion",
      "page": "Opinion"
    },
    {
      "text": "infinite regress",
      "page": "Infinite_regress"
    },
    {
      "text": "insight",
      "page": "Insight"
    },
    {
      "text": "harmony",
      "page": "Harmony"
    },
    {
      "text": "lyre",
      "page": "Lyre"
    },
    {
      "text": "psyche",
      "page": "Psyche"
    },
    {
      "text": "Wisdom",
      "page": "Wisdom"
    },
    {
      "text": "Courage",
      "page": "Courage"
    },
    {
      "text": "spirited",
      "page": "Spirited"
    },
    {
      "text": "pain",
      "page": "Pain"
    },
    {
      "text": "pleasure",
      "page": "Pleasure"
    },
    {
      "text": "battle",
      "page": "Battle"
    },
    {
      "text": "virtue",
      "page": "Virtue"
    },
    {
      "text": "vice",
      "page": "Vice"
    },
    {
      "text": "eudaimonia",
      "page": "Eudaimonia"
    },
    {
      "text": "thirst",
      "page": "Thirst"
    },
    {
      "text": "poetry",
      "page": "Poetry"
    },
    {
      "text": "painting",
      "page": "Painting"
    },
    {
      "text": "sculpture",
      "page": "Sculpture"
    },
    {
      "text": "reality",
      "page": "Reality"
    },
    {
      "text": "illusion",
      "page": "Illusion"
    },
    {
      "text": "souls",
      "page": "The_Souls"
    },
    {
      "text": "irrationality",
      "page": "Irrationality"
    },
    {
      "text": "rhetoric",
      "page": "Rhetoric"
    },
    {
      "text": "flattery",
      "page": "Flattery"
    },
    {
      "text": "Gorgias",
      "page": "Gorgias"
    },
    {
      "text": "policy",
      "page": "Policy"
    },
    {
      "text": "ignorance",
      "page": "Ignorance"
    },
    {
      "text": "method",
      "page": "Method"
    },
    {
      "text": "discourse",
      "page": "Discourse"
    },
    {
      "text": "intellectual",
      "page": "Intellectual"
    },
    {
      "text": "art",
      "page": "Art"
    },
    {
      "text": "nature",
      "page": "Nature"
    },
    {
      "text": "human",
      "page": "Human"
    },
    {
      "text": "erosion",
      "page": "Erosion"
    },
    {
      "text": "appetite",
      "page": "Appetite"
    },
    {
      "text": "timocracy",
      "page": "Timocracy"
    },
    {
      "text": "spirit",
      "page": "Spirit"
    },
    {
      "text": "wealth",
      "page": "Wealth"
    },
    {
      "text": "resentment",
      "page": "Resentment"
    },
    {
      "text": "regime",
      "page": "Regime"
    },
    {
      "text": "eleutheria",
      "page": "Eleutheria"
    },
    {
      "text": "austerity",
      "page": "Austerity"
    },
    {
      "text": "anarchy",
      "page": "Anarchy"
    },
    {
      "text": "hierarchy",
      "page": "Hierarchy"
    },
    {
      "text": "hedonism",
      "page": "Hedonism"
    },
    {
      "text": "the masses",
      "page": "The_Masses"
    },
    {
      "text": "self-governance",
      "page": "Self-governance"
    },
    {
      "text": "tyranny",
      "page": "Tyrant"
    },
    {
      "text": "champion",
      "page": "Champion"
    },
    {
      "text": "people",
      "page": "People"
    },
    {
      "text": "freedom",
      "page": "Freedom"
    },
    {
      "text": "realism",
      "page": "Realism"
    },
    {
      "text": "constitution",
      "page": "Constitution"
    },
    {
      "text": "class",
      "page": "Class"
    },
    {
      "text": "indoctrination",
      "page": "Indoctrination"
    },
    {
      "text": "loyalty",
      "page": "Loyalty"
    },
    {
      "text": "corruption",
      "page": "Corruption"
    },
    {
      "text": "welfare",
      "page": "Welfare"
    },
    {
      "text": "private property",
      "page": "Private_property"
    },
    {
      "text": "family",
      "page": "Family"
    },
    {
      "text": "auxiliaries",
      "page": "Auxiliaries"
    },
    {
      "text": "music",
      "page": "Music"
    },
    {
      "text": "barracks",
      "page": "Barracks"
    },
    {
      "text": "unity",
      "page": "Unity"
    },
    {
      "text": "civil war",
      "page": "Civil_war"
    },
    {
      "text": "guardians",
      "page": "Guardian"
    },
    {
      "text": "sex",
      "page": "Sex"
    },
    {
      "text": "offspring",
      "page": "Offspring"
    },
    {
      "text": "system",
      "page": "System"
    },
    {
      "text": "productivity",
      "page": "Productivity"
    },
    {
      "text": "noble lie",
      "page": "Noble_lie"
    },
    {
      "text": "inequality",
      "page": "Inequality"
    },
    {
      "text": "cohesion",
      "page": "Cohesion"
    },
    {
      "text": "civic virtue",
      "page": "Civic_virtue"
    },
    {
      "text": "enlightenment",
      "page": "Enlightenment"
    },
    {
      "text": "deceive",
      "page": "Deception"
    },
    {
      "text": "self-sacrifice",
      "page": "Self-sacrifice"
    },
    {
      "text": "Socratic method",
      "page": "Socratic_method"
    },
    {
      "text": "rhetorical device",
      "page": "Rhetorical_device"
    },
    {
      "text": "Nicomachean Ethics",
      "page": "Nicomachean_Ethics"
    },
    {
      "text": "Protagoras",
      "page": "Protagoras"
    },
    {
      "text": "relativism",
      "page": "Relativism"
    },
    {
      "text": "epistemology",
      "page": "Epistemology"
    },
    {
      "text": "Phaedrus",
      "page": "Phaedrus"
    },
    {
      "text": "19th century",
      "page": "19th_century"
    },
    {
      "text": "ontology",
      "page": "Ontology"
    },
    {
      "text": "legalism",
      "page": "Legalism"
    },
    {
      "text": "Lewis",
      "page": "Lewis"
    },
    {
      "text": "relative dating",
      "page": "Relative_dating"
    },
    {
      "text": "style",
      "page": "Style"
    },
    {
      "text": "syntax",
      "page": "Hungarian_noun_phrase"
    },
    {
      "text": "Constantinople",
      "page": "Constantinople"
    },
    {
      "text": "John",
      "page": "John"
    },
    {
      "text": "3rd century BC",
      "page": "3rd_century_BC"
    },
    {
      "text": "*Sophist*",
      "page": "Sophist"
    },
    {
      "text": "epistle",
      "page": "Epistle"
    },
    {
      "text": "Egypt",
      "page": "Egypt"
    },
    {
      "text": "antiquity",
      "page": "Antiquity"
    },
    {
      "text": "Roman",
      "page": "Roman"
    },
    {
      "text": "West",
      "page": "West"
    },
    {
      "text": "Renaissance",
      "page": "Renaissance"
    },
    {
      "text": "Marsilio Ficino",
      "page": "Marsilio_Ficino"
    },
    {
      "text": "Tiberius",
      "page": "Tiberius"
    },
    {
      "text": "Xenocrates",
      "page": "Xenocrates"
    },
    {
      "text": "Aristophanes",
      "page": "Aristophanes"
    },
    {
      "text": "Byzantium",
      "page": "Byzantium"
    },
    {
      "text": "9th century",
      "page": "9th_century"
    },
    {
      "text": "Oxford",
      "page": "Oxford"
    },
    {
      "text": "vulgate",
      "page": "Vulgate"
    },
    {
      "text": "Zeta",
      "page": "Zeta"
    },
    {
      "text": "the unwritten",
      "page": "The_Unwritten"
    },
    {
      "text": "Proclus",
      "page": "Proclus"
    },
    {
      "text": "5th century",
      "page": "5th_century"
    },
    {
      "text": "inquiry",
      "page": "The_Inquiry"
    },
    {
      "text": "Philebus",
      "page": "Philebus"
    },
    {
      "text": "exoteric",
      "page": "Exoteric"
    },
    {
      "text": "corpus",
      "page": "Corpus"
    },
    {
      "text": "empiricism",
      "page": "Empiricism"
    },
    {
      "text": "absolutism",
      "page": "Absolutism"
    },
    {
      "text": "modern",
      "page": "Modern"
    },
    {
      "text": "scholarship",
      "page": "Scholarship"
    },
    {
      "text": "analysis",
      "page": "Analysis"
    },
    {
      "text": "idealism",
      "page": "Idealism"
    },
    {
      "text": "Denis",
      "page": "Denis"
    },
    {
      "text": "Platonic",
      "page": "Platonic"
    },
    {
      "text": "on the soul",
      "page": "On_the_Soul"
    },
    {
      "text": "intellect",
      "page": "Intellect"
    },
    {
      "text": "existence",
      "page": "Existence"
    },
    {
      "text": "Arcesilaus",
      "page": "Arcesilaus"
    },
    {
      "text": "Stoic",
      "page": "Stoic"
    },
    {
      "text": "Carneades",
      "page": "Carneades"
    },
    {
      "text": "suspension of judgment",
      "page": "Suspension_of_judgment"
    },
    {
      "text": "Stoicism",
      "page": "Stoicism"
    },
    {
      "text": "theology",
      "page": "Theology"
    },
    {
      "text": "Middle Platonism",
      "page": "Middle_Platonism"
    },
    {
      "text": "Cicero",
      "page": "Cicero"
    },
    {
      "text": "De Re Publica",
      "page": "De_re_publica"
    },
    {
      "text": "mixed government",
      "page": "Mixed_government"
    },
    {
      "text": "Sulla",
      "page": "Sulla"
    },
    {
      "text": "CE",
      "page": "CE"
    },
    {
      "text": "Christianity",
      "page": "Christianity"
    },
    {
      "text": "providence",
      "page": "Providence"
    },
    {
      "text": "free will",
      "page": "Free_will"
    },
    {
      "text": "eternity",
      "page": "Eternity"
    },
    {
      "text": "doctrine",
      "page": "Doctrine"
    },
    {
      "text": "Greek",
      "page": "Greek"
    },
    {
      "text": "persona",
      "page": "Persona"
    },
    {
      "text": "humanism",
      "page": "Humanism"
    },
    {
      "text": "Islamic world",
      "page": "Muslim_world"
    },
    {
      "text": "al-Farabi",
      "page": "Al-Farabi"
    },
    {
      "text": "divine law",
      "page": "Divine_law"
    },
    {
      "text": "Toledo",
      "page": "Toledo"
    },
    {
      "text": "12th century",
      "page": "12th_century"
    },
    {
      "text": "Avicenna",
      "page": "Avicenna"
    },
    {
      "text": "emanationism",
      "page": "Emanationism"
    },
    {
      "text": "Neoplatonism",
      "page": "Neoplatonism"
    },
    {
      "text": "Bernard of Chartres",
      "page": "Bernard_of_Chartres"
    },
    {
      "text": "Genesis",
      "page": "Genesis"
    },
    {
      "text": "faith",
      "page": "Faith"
    },
    {
      "text": "theological aesthetics",
      "page": "Theological_aesthetics"
    },
    {
      "text": "exegesis",
      "page": "Exegesis"
    },
    {
      "text": "Thomas Aquinas",
      "page": "Thomas_Aquinas"
    },
    {
      "text": "natural theology",
      "page": "Natural_theology"
    },
    {
      "text": "Plato",
      "page": "Plato"
    },
    {
      "text": "individuation",
      "page": "Individuation"
    },
    {
      "text": "Summa Theologica",
      "page": "Summa_Theologica"
    },
    {
      "text": "hylomorphism",
      "page": "Hylomorphism"
    },
    {
      "text": "divine simplicity",
      "page": "Divine_simplicity"
    },
    {
      "text": "revelation",
      "page": "Revelation"
    },
    {
      "text": "dogma",
      "page": "Dogma"
    },
    {
      "text": "eschatology",
      "page": "Eschatology"
    },
    {
      "text": "scholasticism",
      "page": "Scholasticism"
    },
    {
      "text": "Florence",
      "page": "Florence"
    },
    {
      "text": "ad fontes",
      "page": "Ad_fontes"
    },
    {
      "text": "Plotinus",
      "page": "Plotinus"
    },
    {
      "text": "Cosimo de' Medici",
      "page": "Cosimo_de'_Medici"
    },
    {
      "text": "Council of Florence",
      "page": "Council_of_Florence"
    },
    {
      "text": "Platonic Academy",
      "page": "Platonic_Academy"
    },
    {
      "text": "Hermetic",
      "page": "Hermetic"
    },
    {
      "text": "nominalism",
      "page": "Nominalism"
    },
    {
      "text": "divinity",
      "page": "Divinity"
    },
    {
      "text": "orthodoxy",
      "page": "Orthodoxy"
    },
    {
      "text": "syncretism",
      "page": "Syncretism"
    },
    {
      "text": "Kabbalah",
      "page": "Kabbalah"
    },
    {
      "text": "Zoroastrianism",
      "page": "Zoroastrianism"
    },
    {
      "text": "heresy",
      "page": "Heresy"
    },
    {
      "text": "intellectual freedom",
      "page": "Intellectual_freedom"
    },
    {
      "text": "patronage",
      "page": "Patronage"
    },
    {
      "text": "French",
      "page": "French"
    },
    {
      "text": "David Hume",
      "page": "David_Hume"
    },
    {
      "text": "A Treatise of Human Nature",
      "page": "A_Treatise_of_Human_Nature"
    },
    {
      "text": "intuition",
      "page": "Intuition"
    },
    {
      "text": "Voltaire",
      "page": "Voltaire"
    },
    {
      "text": "essentialism",
      "page": "Essentialism"
    },
    {
      "text": "positivism",
      "page": "Positivism"
    },
    {
      "text": "rationalism",
      "page": "Rationalism"
    },
    {
      "text": "Auguste Comte",
      "page": "Auguste_Comte"
    },
    {
      "text": "Course of Positive Philosophy",
      "page": "Course_of_Positive_Philosophy"
    },
    {
      "text": "sociology",
      "page": "Sociology"
    },
    {
      "text": "immanence",
      "page": "Immanence"
    },
    {
      "text": "Max Tegmark",
      "page": "Max_Tegmark"
    },
    {
      "text": "mathematical universe hypothesis",
      "page": "Mathematical_universe_hypothesis"
    },
    {
      "text": "paideia",
      "page": "Paideia"
    },
    {
      "text": "books",
      "page": "The_Books"
    },
    {
      "text": "alumni",
      "page": "Alumni"
    },
    {
      "text": "nihilism",
      "page": "Nihilism"
    },
    {
      "text": "cognitive science",
      "page": "Cognitive_science"
    },
    {
      "text": "academic skepticism",
      "page": "Academic_skepticism"
    },
    {
      "text": "social mobility",
      "page": "Social_mobility"
    },
    {
      "text": "eugenics",
      "page": "Eugenics"
    },
    {
      "text": "selective breeding",
      "page": "Selective_breeding"
    },
    {
      "text": "censorship",
      "page": "Censorship"
    },
    {
      "text": "drama",
      "page": "Drama"
    },
    {
      "text": "implementation",
      "page": "Implementation"
    },
    {
      "text": "Leo Strauss",
      "page": "Leo_Strauss"
    },
    {
      "text": "dialogue",
      "page": "Dialogue"
    },
    {
      "text": "coercion",
      "page": "Coercion"
    },
    {
      "text": "polity",
      "page": "Polity"
    },
    {
      "text": "elite",
      "page": "Elite"
    },
    {
      "text": "function",
      "page": "Function"
    },
    {
      "text": "injustice",
      "page": "Injustice"
    },
    {
      "text": "proportionality",
      "page": "Proportionality"
    },
    {
      "text": "myth",
      "page": "Myth"
    },
    {
      "text": "acceptance",
      "page": "Acceptance"
    },
    {
      "text": "martial",
      "page": "Martial"
    },
    {
      "text": "moral",
      "page": "Moral"
    },
    {
      "text": "aristocracy",
      "page": "Aristocracy"
    },
    {
      "text": "meritocracy",
      "page": "Meritocracy"
    },
    {
      "text": "exile",
      "page": "Exile"
    },
    {
      "text": "realpolitik",
      "page": "Realpolitik"
    },
    {
      "text": "pedagogy",
      "page": "Pedagogy"
    },
    {
      "text": "the physical world",
      "page": "The_Physical_World"
    },
    {
      "text": "observation",
      "page": "Observation"
    },
    {
      "text": "species",
      "page": "Species"
    },
    {
      "text": "natural selection",
      "page": "Natural_selection"
    },
    {
      "text": "hypothesis",
      "page": "Hypothesis"
    },
    {
      "text": "parsimony",
      "page": "Parsimony"
    },
    {
      "text": "experiential learning",
      "page": "Experiential_learning"
    },
    {
      "text": "pattern recognition",
      "page": "Pattern_recognition"
    },
    {
      "text": "Neuroimaging",
      "page": "Neuroimaging"
    },
    {
      "text": "predictive power",
      "page": "Predictive_power"
    },
    {
      "text": "pseudoscience",
      "page": "Pseudoscience"
    },
    {
      "text": "will to power",
      "page": "Will_to_power"
    },
    {
      "text": "nationalism",
      "page": "Nationalism"
    },
    {
      "text": "Mein Kampf",
      "page": "Mein_Kampf"
    },
    {
      "text": "Goebbels",
      "page": "Joseph_Goebbels"
    },
    {
      "text": "Heidegger",
      "page": "Martin_Heidegger"
    },
    {
      "text": "totalitarianism",
      "page": "Totalitarianism"
    },
    {
      "text": "communism",
      "page": "Communism"
    },
    {
      "text": "Lenin",
      "page": "Vladimir_Lenin"
    },
    {
      "text": "Stalin",
      "page": "Joseph_Stalin"
    },
    {
      "text": "Fascism",
      "page": "Italian_fascism"
    },
    {
      "text": "syndicalism",
      "page": "Syndicalism"
    },
    {
      "text": "state",
      "page": "State"
    },
    {
      "text": "secret police",
      "page": "Secret_police"
    },
    {
      "text": "imperialism",
      "page": "Imperialism"
    },
    {
      "text": "ancient philosophy",
      "page": "Ancient_philosophy"
    }
  ],
  "fetched_at": "2025-12-07T07:24:33.249030",
  "elapsed_ms": 626186
}