{
  "topic": "Ship",
  "title": "Ship",
  "slug": "ship",
  "grokipedia_slug": "Ship",
  "grokipedia_url": "https://grokipedia.com/page/Ship",
  "source": "grokipedia",
  "content": "# Ship\n\nA ship is a vessel of any type whatsoever operating in the marine environment, including hydrofoil boats, air-cushion vehicles, submersibles, floating craft, and floating platforms. These watercraft are designed for navigation across oceans, seas, rivers, and other bodies of water, primarily to transport cargo, passengers, or personnel, or to support military, fishing, research, and other specialized operations. Distinguished from smaller boats by their size, complexity, and capacity for extended voyages, ships typically exceed 100 gross tons and are built to withstand marine conditions while complying with international safety and environmental standards set by organizations like the International Maritime Organization (IMO).\n\nThe history of ships reflects humanity's drive for exploration, trade, and conquest, spanning over 6,000 years. The earliest known boats emerged around 4000 BCE in ancient Egypt, constructed from reeds or wood and propelled by oars using human muscle power for local transport and fishing. By the 2nd millennium BCE, the Phoenicians advanced shipbuilding with cargo vessels featuring improved hull designs and secondary masts for sail propulsion, facilitating Mediterranean trade networks that exchanged goods like wine, metals, and textiles. Archaeological evidence, such as the Kyrenia shipwreck from circa 300 BCE, underscores these early Greek vessels' role in establishing long-distance commerce. During the Age of Sail (15th–19th centuries), European innovations like the caravel and galleon enabled global voyages, including Columbus's 1492 expedition and the expansion of colonial empires, while the 17th-century Dutch fluyt optimized efficiency for bulk trade in spices, textiles, and slaves.\n\nThe 19th century marked a technological leap with the advent of steam power and iron hulls, transitioning from sail to mechanized propulsion and enabling faster, more reliable transoceanic travel. The 20th century introduced diesel engines, containerization in the 1950s, and supertankers, revolutionizing global logistics by reducing costs and increasing capacity. Today, ships underpin international commerce, carrying over 80% of global trade volume; as of 1 January 2025, the world merchant fleet consists of approximately 112,501 vessels with a total deadweight tonnage exceeding 2.35 billion tons, dominated by container ships, bulk carriers, and oil tankers.  Classification societies and IMO regulations ensure structural integrity, stability, and pollution prevention across diverse types, including passenger ships (carrying more than 12 passengers), fishing vessels, chemical tankers, and high-speed craft.\n\n## Basic Concepts\n\n### Definition and Scope\n\nA ship is a large seafaring vessel designed for navigation on oceans, seas, or other large bodies of water, serving as a primary means of transportation across maritime environments. In international maritime law, a ship is broadly understood as any vessel capable of being used for transportation on water, encompassing a wide array of types from merchant carriers to specialized craft. The United Nations Convention on the Law of the Sea (UNCLOS) adopts an inclusive approach, defining a \"ship\" to include any type of vessel operating in the marine environment, such as hydrofoils, air-cushion vehicles, submersibles, floating craft, and platforms, with the exception of those employed as part of sea-bed mineral resources exploration or exploitation.\n\nTechnical and legal definitions under the International Maritime Organization (IMO) often hinge on size and operational thresholds to ensure safety and regulatory compliance. For instance, the SOLAS Convention applies to all passenger ships and cargo ships of 500 gross tons and above engaged in international voyages, with certain provisions extending to cargo ships from 300 gross tons for radio communications. Additionally, many IMO stability and safety standards, such as those in the Intact Stability Code, cover ships of 24 meters in length or greater, distinguishing them from smaller craft based on structural and navigational demands.\n\nShips are differentiated from boats primarily by scale, purpose, and seaworthiness; boats are smaller watercraft suited for inland, riverine, or short coastal operations, whereas ships are engineered for extended ocean voyages with greater capacity and complexity. Other vessels like submarines qualify as ships but operate primarily underwater, while hovercraft, as air-cushion vehicles, traverse surfaces including water and land, yet both are integrated into the broader \"ship\" category under UNCLOS for navigational rights and obligations.\n\nThe core functions of ships revolve around transporting goods and passengers, conducting military operations, and supporting exploration, thereby forming the backbone of global connectivity. Maritime shipping handles over 80% of international trade by volume, underscoring ships' pivotal role in economic exchange and resource distribution. Over time, ships have evolved from rudimentary rafts and dugout canoes of ancient societies to intricate, steel-constructed behemoths with diesel-electric or nuclear propulsion, transforming isolated communities into an interconnected world economy.\n\n### Nomenclature and Terminology\n\nShip naming conventions have long followed maritime traditions that assign gender and specific prefixes to vessels, reflecting their historical and operational roles. Traditionally, ships are referred to as female (\"she\"), a practice rooted in the protective and nurturing qualities attributed to vessels that safeguard their crews, akin to a mother's care during perilous voyages. This gendering persists in naval and merchant contexts, though some modern institutions have adopted gender-neutral language. Prefixes denote ownership, propulsion, or service type; for instance, \"SS\" originally stood for \"Steam Ship,\" indicating steam-powered vessels from the mid-19th century onward, while \"HMS\" signifies \"His/Her Majesty's Ship\" for Royal Navy warships, a convention dating back to the 17th century to honor the monarch. Similarly, the U.S. Navy uses \"USS\" for \"United States Ship\" on commissioned warships and \"USNS\" for non-commissioned naval vessels.\n\nIn modern practice, ship names are selected by owners or operators and must comply with flag state registry rules to ensure uniqueness within that nation's register, preventing confusion in international waters and facilitating identification under the International Convention for the Safety of Life at Sea (SOLAS). The name is recorded in the ship's certificate of registry, issued by the flag state, which links the vessel to its nationality and regulatory oversight. While traditions influence choices—such as naming naval ships after historical figures, battles, or geographic features—commercial vessels often use evocative or brand-specific names, subject to approval by the registry authority to avoid duplication.\n\nKey anatomical terms describe a ship's physical structure for precise communication among crew and operators. The bow is the forward end of the vessel, designed to part the water, while the stern is the aft end, typically housing propulsion and steering mechanisms. When facing forward from the stern, the left side is the port side, and the right side is the starboard side—a convention derived from historical steering oar placements to avoid confusion during maneuvers. Decks are horizontal platforms within the hull; the main deck runs continuously from bow to stern, providing structural integrity, while upper decks, forecastle decks (forward partial decks), and poop decks (aft partial decks) vary by design. The superstructure encompasses all structures above the main deck, including bridges, masts, and accommodations, distinguishing it from the hull below.\n\nClassification societies, such as Lloyd's Register, play a critical role in standardizing ship identification through assigned notations that certify compliance with safety, structural, and operational standards. Established in 1760, Lloyd's Register surveys vessels during construction and throughout their service life, issuing class notations like \"100A1\" to indicate hull strength, machinery reliability, and suitability for specific trades (e.g., oil tanker or bulk carrier). These notations, entered in the society's register, serve as a global benchmark for insurers, charterers, and port authorities, ensuring the vessel meets international regulations like those from the International Maritime Organization (IMO). Other societies, including the American Bureau of Shipping (ABS) and Det Norske Veritas (DNV), follow similar protocols, collectively representing over 90% of the world's classed tonnage.\n\nCommon acronyms and abbreviations in ship terminology quantify size, capacity, and dimensions for regulatory and commercial purposes. Gross Tonnage (GT) measures a ship's total internal volume in cubic meters, using a formula based on enclosed spaces under the International Convention on Tonnage Measurement of Ships (1969), serving as a basis for safety fees and manning requirements. Deadweight Tonnage (DWT) represents the maximum weight a ship can carry, including cargo, fuel, crew, and stores, expressed in metric tons, which is essential for assessing loading limits and stability. Length Overall (LOA) denotes the extreme length from the foremost to the aftermost points of the hull, excluding appendages like bow sprits, used in classification and navigation restrictions. These metrics, verified by classification societies, ensure consistent application across global shipping.\n\n## Historical Development\n\n### Ancient and Classical Eras\n\nThe earliest evidence of watercraft in human history dates to the Mesolithic period, with simple rafts constructed from logs or reeds and dugout canoes hollowed from tree trunks. In the Netherlands, the Pesse canoe, discovered in 1955 and dated to approximately 8040–7510 BCE through radiocarbon analysis, represents one of the oldest known examples of a dugout vessel, measuring about 3 meters in length and crafted from a single pine trunk. These rudimentary boats enabled early coastal navigation and resource exploitation, primarily along rivers and inland waters, marking the transition from foot travel to maritime mobility.\n\nIn ancient Egypt, shipbuilding advanced significantly during the Old Kingdom (c. 2686–2181 BCE), utilizing both reed-based and wooden construction techniques. Reed boats, made by bundling papyrus stalks and lashing them with ropes, were common for Nile River transport and fishing from the Predynastic period onward, offering lightweight and flexible vessels up to 20 meters long. For larger seagoing ships, cedar wood imported from Lebanon was employed, as exemplified by Pharaoh Khufu's solar barge, a 43.6-meter vessel dismantled and buried beside his pyramid at Giza around 2500 BCE to symbolize the pharaoh's eternal voyage with the sun god Ra. This cedar ship, reconstructed from over 1,200 pieces, featured a flat-bottomed hull with tenon joints and a capacity for ceremonial rather than practical use, highlighting the integration of religious symbolism in early ship design.\n\nMediterranean civilizations built upon these foundations, developing specialized warships and merchant vessels during the Classical period. In ancient Greece, the trireme emerged as a dominant oar-powered galley by the 5th century BCE, characterized by three banks of oars on each side accommodating 170 rowers, a slender hull for speed, and a bronze ram for ramming tactics in naval battles like Salamis in 480 BCE. These vessels, typically 35–40 meters long and constructed from pine with mortise-and-tenon joinery, prioritized maneuverability over cargo capacity. The Romans adapted and expanded this maritime tradition, employing robust merchant vessels known as *navis oneraria* for bulk trade across the empire, with hulls often exceeding 20 meters in length and capacities up to 350 tons, as evidenced by wrecks like that at Madrague de Giens (c. 50–60 BCE) featuring shell-first plank construction and lead sheathing for durability on Mediterranean routes.\n\nParallel developments occurred in Asia, where early sail rigs facilitated trade in the Indian Ocean and beyond. In the Indian Ocean region, dhow precursors with sewn-plank hulls and lateen or square sails appeared by around 2000 BCE, enabling monsoon-driven voyages between the Arabian Peninsula, India, and East Africa, as indicated by cuneiform records of palm-fiber sewn vessels carrying goods like copper and minerals. These lightweight, flexible ships, often 15–25 meters long, used coconut coir for lashings and relied on wind patterns for long-distance commerce. In China, prototypes of the junk evolved from Neolithic dugouts and plank boats during the Warring States period (475–221 BCE), incorporating watertight bulkheads and battened sails made from bamboo mats, which enhanced stability and cargo efficiency for riverine and coastal navigation.\n\nKey innovations in ancient shipbuilding included the shift to plank-on-frame construction, the widespread adoption of sails, and rudimentary celestial navigation. Plank construction, originating in Egypt and Mesopotamia around 3000 BCE, involved edge-joined wooden planks fastened with mortises, tenons, or sewing, allowing for larger, more seaworthy hulls compared to monocoque reed designs. Sails, first depicted on Egyptian reed boats c. 3000 BCE as rectangular linen or papyrus sheets rigged on single masts, harnessed wind power to supplement oars, with square rigs dominating Mediterranean galleys and battened variants emerging in Asia by the 1st millennium BCE. Early mariners, including Phoenicians and Greeks, navigated using stars such as Polaris for northern bearings and constellations like the Southern Cross for southern routes, determining latitude through their altitude above the horizon without mechanical instruments. These advancements laid the groundwork for expanded trade networks and cultural exchanges across hemispheres.\n\n### Medieval and Early Modern Periods\n\nDuring the medieval period, shipbuilding in northern Europe evolved significantly from the versatile Viking longships, which featured clinker-built hulls, a single square sail, and oars for propulsion, enabling raids, trade, and exploration across the North Atlantic and influencing subsequent Scandinavian and Baltic designs. By the 10th to 12th centuries, the cog emerged as a key innovation, characterized by a round hull, high sides, a single mast with a square sail, and stern and stem castles for defense and cargo protection, making it ideal for the bulk trade in grain, timber, and fish conducted by the Hanseatic League across the Baltic and North Seas. The cog's design allowed for larger capacities—up to 200 tons—and stability in coastal waters, supporting the League's commercial dominance from the 13th to 15th centuries. Complementing the cog, the hulk developed in the 14th century as a broader, more capacious vessel with a rounded bottom and removable internal bulkheads for efficient loading, further enhancing Hanseatic trade by carrying greater volumes of goods like salt and herring while maintaining shallow draft for river access.\n\nKey innovations during this era included the adoption of the sternpost-mounted rudder around the 12th century, which replaced side steering oars and improved control for larger vessels navigating open seas, likely transmitted from Asian designs via Arab intermediaries. Multi-masting also advanced in the 14th and 15th centuries, with ships progressing from single to two- or three-masted configurations combining square and lateen sails—the triangular lateen rig borrowed from Arab dhows, enabling better upwind sailing and facilitating cross-cultural exchanges in the Mediterranean and beyond. These developments built on Viking and Arab influences, such as the longship's shallow draft for beaching and the lateen sail's maneuverability, which together supported expanding trade networks and military applications in northern waters.\n\nIn southern Europe, the late 15th century Age of Discovery spurred further advancements, exemplified by the Portuguese caravel, a small, agile vessel with a combination of lateen and square sails on two or three masts, a rounded hull, and sternpost rudder, allowing explorers like Vasco da Gama to navigate coastal and open-ocean routes to Africa and India. The Spanish nao, such as Christopher Columbus's flagship Santa Maria in 1492—a three-masted ship approximately 70 feet long with a deck and square rigging—served as a seaworthy cargo carrier for transatlantic voyages, bridging medieval bulk traders to early modern exploration fleets. Paralleling these European innovations, Asian shipbuilding in Ming China reached new heights with full-rigged junks in Admiral Zheng He's treasure fleets (1405–1433), massive vessels reportedly up to 400 feet long according to traditional accounts, though modern estimates suggest 200–300 feet, with nine masts carrying multiple square sails, watertight bulkhead compartments to prevent flooding, and reinforced hulls for long-distance diplomacy and trade across the Indian Ocean. These junks' compartmentalized design, dividing the hull into sealed sections, enhanced safety and capacity, influencing regional maritime practices.\n\n### Industrial and Modern Eras\n\nThe Industrial and Modern Eras marked a profound shift in shipbuilding, driven by advancements in materials, propulsion, and mass production techniques that enabled larger, faster, and more efficient vessels for global trade and warfare. The transition from wooden hulls to iron and steel began in the mid-19th century, revolutionizing durability and scale. The SS *Great Britain*, launched in 1843, exemplified this change as the first iron-hulled, propeller-driven ocean-going steamer, powered by a 1,000 horsepower engine that allowed it to cross the Atlantic in 14 days. Designed by Isambard Kingdom Brunel, it combined an iron structure with a screw propeller, overcoming the limitations of wooden ships and paddlewheels, and paved the way for steel construction that dominated subsequent designs.\n\nThe steamship era further accelerated these innovations, evolving from paddlewheel propulsion to screw propellers for greater efficiency in rough seas. The SS *Archimedes*, built in 1839 by Francis Pettit Smith, was the world's first successful screw-propelled steamship, demonstrating superior performance during trials, such as a 21-hour voyage from Gravesend to Portsmouth against adverse winds. This design influenced naval architects, leading to its adoption in larger vessels like the *Great Britain* and marking the decline of paddlewheels by the late 19th century. In the early 20th century, luxury liners like the RMS *Titanic* represented the pinnacle of these developments, constructed in 1912 by Harland and Wolff in Belfast as part of the Olympic-class series. At 882 feet long with a double-bottom steel hull divided into 16 watertight compartments, it symbolized opulent transatlantic travel but also highlighted safety assumptions of the era before its sinking prompted international regulations.\n\nWorld War II catalyzed unprecedented mass production, particularly with the Liberty ships, which addressed the urgent need for merchant tonnage amid submarine threats. From 1941 to 1945, U.S. shipyards constructed over 2,700 of these standardized cargo vessels, averaging three launches every two days through prefabrication and welding techniques that reduced build times from months to weeks. These utilitarian ships, like the first, SS *Patrick Henry*, transported vital supplies across the Atlantic, sustaining Allied efforts despite heavy losses to U-boats. The conflicts also spurred advancements in naval architecture, with submarine warfare emerging as a decisive factor; U.S. submarines sank nearly 5 million tons of Japanese shipping, over 60% of their merchant fleet, using classes like the Gato and Balao that featured streamlined hulls for underwater speed. Simultaneously, aircraft carriers rose to prominence, evolving from World War I experiments—such as Britain's 1918 conversion of a liner into a flattop—to central roles in World War II, where the U.S. built over 150 carriers, including fleet, light, and escort types, that shifted naval power from battleships to air superiority in the Pacific.\n\nPost-war, diesel engines transformed merchant propulsion for their fuel efficiency and reliability, gradually replacing steam in commercial fleets starting with milestones like the 1912 MS *Selandia*, the first ocean-going diesel-powered vessel. By mid-century, this adoption complemented containerization, which revolutionized cargo handling. The Ideal X, a converted T2 tanker launched in 1956 by Malcolm McLean, carried 58 standardized containers from New York to Houston, slashing loading times from days to hours and costs from $5 to 15 cents per ton, fundamentally enabling modern global supply chains.\n\n### Contemporary Advances\n\nIn the 21st century, the shipping industry has seen the emergence of mega-container ships capable of carrying over 20,000 TEU, exemplified by the Ever Given, a 400-meter-long vessel that grounded in the Suez Canal in March 2021, blocking global trade for six days and underscoring the vulnerabilities of these massive carriers. Such ships have enabled unprecedented economies of scale in global container shipping, with capacities pushing the limits of port infrastructure and canal dimensions, though incidents like the Suez blockage highlighted risks from high winds and narrow passages.\n\nSustainability efforts have driven adoption of green propulsion technologies, including liquefied natural gas (LNG) and hydrogen fuel cells, to reduce emissions in line with international regulations. The Icon of the Seas, launched in 2024 as the world's largest cruise ship, features six dual-fuel engines powered by LNG, allowing for up to 25% less CO2 emissions compared to traditional marine fuels, while designed as multi-fuel ready, including potential for methanol and hydrogen, to facilitate future transitions.\n\nAutomation has advanced with the deployment of fully electric autonomous ships, such as the Yara Birkeland, the world's first zero-emission container vessel, which entered commercial operations in Norway in April 2022. This 120 TEU ship, powered by batteries and equipped with AI for navigation, has completed over 250 voyages by 2025, transporting over 35,000 containers and replacing thousands of diesel truck trips and reducing road emissions. The International Maritime Organization's (IMO) Maritime Autonomous Surface Ships (MASS) code framework, established through a 2021 regulatory scoping exercise, provides guidelines for degrees of autonomy from remote control to fully unmanned operations; in May 2025, the IMO adopted the non-mandatory MASS Code, with mandatory implementation planned for 2028, ensuring safety and integration into existing maritime rules.\n\nPost-COVID-19 disruptions have prompted supply chain shifts toward greater resilience, including nearshoring and diversified routing, with maritime trade growth projected to stall at 0.5% in 2025 amid geopolitical tensions and front-loading of cargo. Climate change has accelerated Arctic route expansions, with ice melt enabling the Northern Sea Route and Central Arctic paths for container ships; by 2025, vessels with icebreaking capabilities are navigating these waters during late summer, shortening Asia-Europe transits by up to 40% and boosting traffic by 37% over the past decade.\n\nDigital twins and AI are transforming ship design by creating virtual replicas for simulation and optimization, integrating real-time data to predict performance and maintenance needs. In 2025, these technologies enable lifecycle tracking from design to operation, enhancing fuel efficiency and cyber-security in vessels like offshore wind support ships. The IMO's MASS framework supports AI integration by addressing regulatory gaps for autonomous systems, fostering innovations that align with decarbonization goals.\n\n## Classification and Types\n\n### Inland and Coastal Vessels\n\nInland and coastal vessels are specialized ships designed for navigation in confined waters such as rivers, lakes, canals, and near-shore areas, prioritizing efficiency in low-depth environments over long-distance ocean capability. These vessels typically feature compact designs suited to locks, bridges, and variable water levels, enabling them to transport bulk goods, passengers, and vehicles in regional networks. Unlike larger ocean-going ships, they emphasize flexibility for frequent stops and tight turns, supporting local economies through reliable short-haul logistics.\n\nRiver barges and push boats form the backbone of inland freight systems, where non-powered barges are assembled into tows and propelled by powerful push boats. In the United States, on the Mississippi River and its tributaries, towboats typically push configurations of 15 to 40 barges, carrying commodities like grain, coal, and petroleum products through a network of locks and dams. In Europe, the Rhine River hosts a diverse fleet including approximately 1,200 pushed barges among 6,900 vessels, transporting over 276 million tonnes of cargo annually, with iron ore, coal, and containers dominating the load. These operations rely on push boats with robust engines and articulated couplings to navigate currents and bends effectively.\n\nFerries and coastal traders facilitate passenger and vehicle movement along short-sea routes, often employing roll-on/roll-off (ro-ro) designs for seamless loading via ramps. Ro-ro ferries dominate short-sea shipping in regions like Europe's North Sea and Baltic, where they handle wheeled cargo such as automobiles and trucks, reducing reliance on road transport for distances under 500 nautical miles. In North America, similar vessels operate in coastal corridors, like those connecting Vancouver to nearby islands, carrying vehicles and freight in scheduled services that integrate with highway systems.\n\nGreat Lakes bulk carriers, known as lakers, represent a regional specialty for lake-based transport, with many exceeding 1,000 feet in length and equipped as self-unloaders for efficient cargo discharge. These vessels primarily haul iron ore from ports like Duluth to steel mills in the lower lakes, with capacities reaching 70,000 tons per trip using conveyor systems to offload without external cranes. The fleet includes about 13 such \"footers,\" optimized for the lakes' locks and weather, contributing to the transport of over 100 million tons of bulk cargo yearly.\n\nAdaptations for inland and coastal operations include shallow drafts to accommodate depths as low as 2-3 meters, enhanced by hull forms that minimize grounding risks during low-water periods. High maneuverability is achieved through bow thrusters, azimuth propellers, and lightweight materials, allowing precise handling in narrow channels and ports. For northern routes prone to ice, such as the Great Lakes or European rivers like the Rhine in winter, vessels incorporate ice-strengthened hulls with reinforced plating up to 25-30 mm thick and rounded bows to break thin ice layers without dedicated icebreakers.\n\nEconomically, inland and coastal vessels handle a significant share of regional freight, accounting for approximately 5% of total freight in tonne-kilometres in the EU (as of 2022), less than 1% in the US, and around 18% in China (as of 2020), where they offer low-cost, low-emission alternatives to trucks for bulk goods. In Germany, for instance, over 86% of inland waterway freight travels via the Rhine, underscoring their role in efficient, high-volume corridors.\n\n### Merchant and Cargo Ships\n\nMerchant and cargo ships form the backbone of global commerce, transporting vast quantities of goods across oceans to facilitate international trade. These vessels are designed for efficiency in loading, carrying, and unloading bulk or packaged commodities, operating on major shipping routes that connect ports worldwide. According to the United Nations Conference on Trade and Development (UNCTAD), maritime transport carries over 80% of the volume of international trade in goods, with global seaborne trade reaching 12.3 billion tons in 2023 after a 2.4% growth from the previous year. This sector's economic significance is underscored by its role in supplying raw materials, manufactured products, and energy resources, supporting supply chains for industries from manufacturing to agriculture.\n\nBulk carriers are specialized merchant vessels built to transport unpackaged dry commodities such as iron ore, coal, grain, and bauxite in large volumes. These ships feature large open holds and conveyor systems for rapid loading and unloading, with sizes categorized by deadweight tonnage (DWT). A prominent example is the Capesize bulk carrier, typically around 170,000 DWT, designed for long-haul voyages carrying ore from major exporters like Australia and Brazil to steel-producing regions in Asia and Europe; these vessels often exceed 290 meters in length and require deep-water ports due to their draft of about 18 meters. Smaller variants, such as Handymax or Supramax carriers (40,000–60,000 DWT), serve more versatile routes but maintain the core principle of maximizing cargo hold volume for cost-effective bulk transport.\n\nContainer ships and roll-on/roll-off (Ro-Ro) vessels represent key innovations in standardized cargo handling, enabling seamless intermodal logistics where goods move efficiently between sea, rail, and road transport. Container ships use the Twenty-foot Equivalent Unit (TEU) as the standard measure, allowing uniform 20-foot or 40-foot steel containers to be stacked securely in cellular holds, with modern ultra-large container vessels (ULCVs) carrying over 20,000 TEU. This system reduces handling time and damage risks, as containers are loaded at origin and transferred directly to final destinations without unpacking. Ro-Ro vessels, meanwhile, accommodate wheeled cargo like vehicles, trucks, and heavy machinery by driving them on and off via ramps, integrating with intermodal networks for just-in-time delivery in automotive and construction sectors; these ships often combine Ro-Ro decks with container capacity for hybrid flexibility.\n\nTankers are merchant ships engineered for liquid cargoes, with designs optimized for safe containment and temperature control to prevent spills or volatility. Crude oil tankers, such as Very Large Crude Carriers (VLCCs) with capacities up to 320,000 DWT, dominate energy transport, shuttling unrefined petroleum from extraction regions to refineries. Chemical tankers feature coated tanks and segregated compartments to handle corrosive or hazardous substances like acids and vegetable oils, adhering to strict International Maritime Organization (IMO) standards for safety. Liquefied natural gas (LNG) carriers employ cryogenic tanks—insulated to maintain temperatures around -162°C—using membrane or spherical designs to transport supercooled gas without boil-off, supporting the global shift toward cleaner fuels.\n\nCrewing on merchant and cargo ships has evolved with technological advancements, balancing operational needs with safety regulations under the IMO's Standards of Training, Certification and Watchkeeping (STCW) convention. Modern vessels typically operate with crews of 20 to 30 members, including officers for navigation and engineering, ratings for maintenance, and support staff, a reduction from historical sizes due to integrated bridge systems and automated machinery that handle routine tasks like engine monitoring and cargo logging. Automation trends are accelerating this shift, with AI-driven predictive maintenance, remote monitoring via satellite, and semi-autonomous navigation reducing crew requirements by up to 20% on newbuilds; initiatives like the IMO's MASS (Maritime Autonomous Surface Ships) framework will regulate autonomous operations up to fully unmanned (Degree 4), with mandatory provisions expected to enter into force in 2032, though human oversight remains essential for complex decision-making and regulatory compliance.\n\n### Specialized and Service Vessels\n\nSpecialized and service vessels encompass a diverse array of ships designed for targeted civilian functions beyond commercial cargo transport, including support for resource extraction, scientific inquiry, infrastructure development, and passenger recreation. These vessels often incorporate advanced technologies to operate in challenging environments, such as deep waters, polar regions, or congested ports.\n\nOffshore supply vessels (OSVs) play a critical role in supporting oil and gas operations by transporting supplies, equipment, and personnel to remote platforms. Platform supply vessels (PSVs) are equipped with large deck areas and cargo holds to deliver drilling mud, fuel, and provisions, while anchor handling tug supply (AHTS) vessels manage mooring operations, towing, and emergency towing with powerful winches and bollards capable of handling loads exceeding 200 tons. These vessels, which form about one-third of the global OSV fleet classified by the American Bureau of Shipping, enhance operational efficiency in harsh offshore conditions.\n\nResearch and survey ships facilitate scientific exploration, particularly in extreme environments. For instance, the USCGC Healy, the United States Coast Guard's largest icebreaker at 420 feet long, supports polar science missions by breaking through up to 4.5 feet of ice continuously at 3 knots and accommodating up to 50 scientists in over 4,200 square feet of laboratory space equipped with oceanographic winches and sensor systems. Expedition vessels like the RRS Sir David Attenborough, operated by the British Antarctic Survey, further advance multidisciplinary research with reconfigurable labs, a moon pool for underwater deployments, and capacity for 60 scientists studying climate, ecosystems, and geology in polar waters.\n\nCable layer ships maintain and install subsea infrastructure essential for global telecommunications and power transmission. These vessels, such as those in Boskalis's fleet including the Ndurance and Boka Ocean, have laid over 5,000 kilometers of export and inter-array cables, using trenchers to bury lines up to 8 meters below the seabed for offshore wind farms and interconnectors. Advanced maintenance ships, like the two ordered by Orange Marine for delivery in 2028 and 2029, feature remotely operated vehicles for cable inspection, cutting, and burial, along with hybrid propulsion to reduce emissions by 20% while covering regions from the Atlantic to the Red Sea.\n\nDredgers ensure port functionality by excavating sediments to sustain navigable depths for shipping. Trailing suction hopper dredgers, a common hydraulic type, suction up silt and sand while underway and discharge via pipelines or overboard, maintaining channels in busy harbors like those along major coastlines. Cutter suction dredgers, combining hydraulic and mechanical methods, rotate a cutting head to loosen compacted materials for port expansions or routine maintenance, handling depths from a few meters to over 100 meters.\n\nCruise ships and expedition vessels prioritize passenger transport and leisure, often in remote or scenic areas. Megaships like Royal Caribbean's Icon of the Seas exemplify large-scale operations, accommodating up to 7,600 passengers with amenities including multiple pools, waterslides, and dining venues across eight neighborhoods. Smaller expedition vessels, such as those in polar fleets, carry hundreds of passengers while integrating research elements, like zodiac launches for wildlife observation and onboard naturalists.\n\nUnique features distinguish these vessels for specialized tasks. Dynamic positioning systems, using thrusters, GPS, and sensors, allow precise station-keeping without anchors, critical for drill ships, cable layers, and supply vessels during operations like ROV support or pipe laying. Helipads, typically at the stern of OSVs and lift boats, enable rapid helicopter transfers of personnel to offshore installations, improving safety and logistics. Scientific labs on research vessels, including wet and dry spaces with analytical equipment, support on-site data collection and experimentation in fields like oceanography and environmental monitoring.\n\n### Naval and Military Ships\n\nNaval and military ships, collectively known as warships, are vessels designed primarily for combat operations, deterrence, and power projection on the seas, forming the backbone of modern navies worldwide. These ships integrate advanced propulsion, sensors, and weaponry to engage in surface, subsurface, and air warfare, often operating in carrier strike groups or task forces for coordinated missions. Unlike merchant vessels, warships prioritize speed, survivability, and stealth over cargo capacity, with designs evolving from wooden sailing ships to nuclear-powered platforms capable of global deployment.\n\nSurface combatants, such as destroyers and frigates, serve as versatile multi-role platforms for anti-air, anti-surface, and anti-submarine warfare. The Arleigh Burke-class destroyer, for instance, is a guided-missile destroyer equipped with the Aegis Combat System, which uses phased-array radar for simultaneous tracking of over 100 targets and coordination of missile launches. These ships typically displace 9,000 to 10,000 tons and achieve speeds exceeding 30 knots, enabling rapid response in fleet defense scenarios. Frigates, like the U.S. Navy's Constellation-class, are lighter and more cost-effective for escort duties, featuring vertical launch systems for missiles and advanced sonar for submarine detection.\n\nAircraft carriers represent the pinnacle of naval aviation, projecting air power far beyond a nation's coastline through embarked squadrons of fighter jets and helicopters. The USS Gerald R. Ford-class carriers incorporate electromagnetic aircraft launch systems (EMALS), replacing traditional steam catapults to enable more precise and efficient launches of up to 160 sorties per day. These supercarriers, displacing over 100,000 tons, are nuclear-powered for unlimited range and feature integrated warfare systems for self-defense against missiles and submarines. Amphibious assault ships, such as the America-class, support Marine Corps operations by deploying troops, vehicles, and aircraft via well decks and flight decks, blending carrier-like capabilities with landing craft deployment.\n\nSubmarines form a stealthy underwater component of naval forces, divided into attack submarines for hunter-killer roles and ballistic missile submarines for strategic deterrence. Nuclear-powered submarines, like the Virginia-class attack boats, use pressurized water reactors for extended submerged operations lasting months, armed with Tomahawk cruise missiles and torpedoes for precision strikes. In contrast, diesel-electric submarines, such as those in the German Type 212 class, rely on air-independent propulsion for quieter, shorter-duration missions in littoral waters. Ballistic missile submarines, exemplified by the Ohio-class, carry up to 24 Trident II missiles, providing a survivable second-strike nuclear capability with stealth features that minimize acoustic signatures.\n\nThe evolution of naval ships traces from the heavily armored battleships of the early 20th century, like the Iowa-class with 16-inch guns, to modern stealth-oriented designs that reduce radar cross-sections for survivability in contested environments. The Zumwalt-class destroyer exemplifies this shift, employing composite materials and angular hull forms to achieve low observability; recent upgrades include the installation of Conventional Prompt Strike hypersonic missile launchers in place of the original Advanced Gun Systems, along with directed-energy weapons such as lasers for future warfare. Armament integration across these vessels relies on sophisticated sensors: active and towed-array sonar for underwater threats, over-the-horizon radars for air and surface detection, and vertical launch systems accommodating anti-ship missiles like the Harpoon or SM-6 for versatile engagements. Some naval ships adapt merchant hulls for auxiliary roles, such as converting container vessels into expeditionary transfer docks for logistics support.\n\n## Structural Design\n\n### Hull and Form\n\nThe hull forms the watertight outer body of a ship, providing buoyancy and structural integrity while interacting with water to influence performance. Traditionally constructed from wood, which dominated shipbuilding from ancient times through the early 19th century due to its availability and workability, hull materials transitioned to iron and then steel during the Industrial Revolution for enhanced strength and durability against larger loads and stresses. By the mid-20th century, steel became the standard for most commercial and naval vessels, offering superior resistance to corrosion and fatigue when properly coated. In recent years, high-tensile steels (e.g., AH36/DH36) and bio-based composites have been adopted to enhance strength-to-weight ratios and reduce emissions, complying with updated IMO green ship guidelines. In parallel, composites such as fiberglass-reinforced plastics emerged in the 1950s for smaller craft, evolving into advanced carbon fiber and epoxy systems by the late 20th century for their lightweight properties and corrosion resistance in specialized applications like high-speed ferries.\n\nA critical evolution in hull design came with the adoption of double-hull standards in the 1990s, primarily for oil tankers, following the 1989 Exxon Valdez spill; the U.S. Oil Pollution Act of 1990 mandated double bottoms and sides for new tankers, with a phase-in requiring all such vessels to comply by 2015 to minimize environmental risks from groundings or collisions. This configuration adds an inner hull separated by void spaces, increasing overall volume but improving safety without significantly altering external form.\n\nShip hull form is quantified through coefficients that describe shape efficiency in terms of volume and resistance to motion. The **block coefficient (C_B)** measures the ratio of the hull's underwater volume to that of a rectangular block with the same length, breadth, and depth, typically ranging from 0.5 for slender, high-speed hulls to 0.85 for full-bodied cargo ships, directly impacting wave-making resistance. The **prismatic coefficient (C_P)** compares the hull volume to a prism formed by extending the maximum cross-sectional area along the length, with values around 0.55-0.65 for efficient displacement hulls, optimizing fore-and-aft distribution to reduce drag. The **midship coefficient (C_M)** assesses the midship section's fullness relative to a rectangle of the same breadth and depth, often 0.95-0.98 for merchant vessels, influencing local hydrodynamic pressure and structural loads. These coefficients guide designers in balancing capacity, speed, and fuel efficiency, with finer forms (lower coefficients) favored for faster vessels to minimize resistance.\n\nBow and stern configurations further refine hull performance by managing water flow and stability. The bulbous bow, a protruding underwater bulb near the waterline, reduces wave drag by generating counter-waves that cancel bow waves, achieving fuel savings of 10-15% on large ships at design speeds since its widespread adoption in the mid-20th century. Stern designs like the transom stern feature a flat, vertical aft end that maximizes deck space and improves propeller efficiency through smoother wake flow, commonly used on modern cargo and passenger ships for simplicity and hydrodynamic benefits. Keel types provide longitudinal stability and resistance to rolling; a full keel extends nearly the hull length for excellent directional control and seaworthiness in heavy weather, while a fin keel is a deeper, shorter appendage enhancing leeward performance in sailing vessels at the cost of maneuverability in shallows. Bilge keels, paired protrusions along the hull's lower sides, dampen roll without deep draft, enabling access to shallow waters while maintaining upright stability when aground.\n\nPractical size limits for hull form are constrained by construction capabilities, port infrastructure, and stability, with the longest ship ever built being the Seawise Giant, an oil tanker completed in 1979 measuring 458 meters in length overall (LOA), 68.8 meters in beam, and capable of 657,000 deadweight tons, though such extremes highlight challenges in maneuverability and canal transit. Modern designs rarely exceed 400 meters LOA for supertankers to balance economies of scale with operational feasibility.\n\n### Internal Layout and Compartments\n\nThe internal layout of a ship is divided into watertight compartments to compartmentalize the vessel, limiting the spread of flooding or fire and enhancing overall safety. Watertight bulkheads form vertical partitions within the hull, constructed from steel plating and stiffened to withstand hydrostatic pressure, as required by the International Convention for the Safety of Life at Sea (SOLAS) Chapter II-1, Regulation 9. These bulkheads must extend continuously from the ship's bottom shell to the bulkhead deck. Watertight bulkheads divide the vessel into sufficient compartments to satisfy SOLAS damage stability requirements (Chapter II-1, Part B-1), generally ensuring the ship remains buoyant after damage to one or more adjacent compartments extending up to 20% of its length or more, depending on probabilistic calculations. Collision bulkheads, positioned forward of the machinery space and cargo holds, provide additional protection against forward impacts by creating a dedicated forepeak tank that remains watertight up to the freeboard deck.\n\nCargo holds in bulk carriers are typically large, rectangular compartments spanning multiple decks, designed to accommodate dry bulk materials like ore, grain, or coal with minimal residue buildup. These holds feature hopper slopes at the bottom and sides to facilitate self-trimming and efficient discharge, often equipped with box-shaped upper regions for uniform loading, and their number—commonly five to nine—varies by vessel size to optimize stability during partial cargoes. Ballast tanks, integral to trim management, are positioned in the double bottom, side wings, and peaks, filled or emptied with seawater to adjust the ship's draft and longitudinal balance, thereby maintaining hydrodynamic stability and reducing hull girder stresses when unladen. For instance, in a typical Panamax bulk carrier, ballast capacity can reach 50-60% of deadweight tonnage to counteract the high centers of gravity from stacked cargoes.\n\nThe superstructure, elevated above the main deck, organizes key operational and living spaces, including the bridge, crew accommodations, and engine rooms, typically located aft to improve forward visibility and lower the center of gravity. The bridge serves as the nerve center with integrated consoles for monitoring and control, while accommodations provide private cabins and communal areas amidships or aft, and engine rooms occupy the lowest levels for direct access to shafting. These elements are arranged to minimize structural weight aloft, adhering to classification society rules that limit superstructure volume to 5-10% of total displacement for stability.\n\nCrew quarters and galleys prioritize ergonomic design to support long-term habitability, incorporating adjustable furniture, natural lighting where feasible, and noise-vibration isolation to reduce fatigue, in accordance with guidelines from the International Association of Classification Societies (IACS). Materials such as non-combustible steel panels and fire-retardant textiles, meeting SOLAS fire safety standards under Chapter II-2, line these spaces to limit flame spread, with galleys featuring stainless-steel surfaces and automatic suppression systems for cooking appliances. Layouts ensure clear escape routes and accessibility, with minimum floor areas of 4.5 m² for single- or two-person sleeping rooms as per Maritime Labour Convention (MLC) 2006 Standard A3.1.9 to promote crew welfare.\n\nVentilation systems circulate conditioned air through ducts to all compartments, preventing moisture buildup and maintaining breathable environments, with supply fans delivering 20-30 air changes per hour in machinery spaces per International Maritime Organization (IMO) guidelines. Piping systems for fluids, including bilge, ballast, and fuel lines, are segregated by material—seamless steel for high-pressure fuel and non-metallic hoses for bilge—to avoid cross-contamination, routed through dedicated trunkways with non-return valves to comply with SOLAS Regulation II-1/35. These networks ensure efficient fluid transfer while isolating cargo holds from machinery fluids, as stipulated in classification rules from societies like DNV. The hull serves as the outer shell enclosing these internal spaces.\n\n### Propulsion and Power Systems\n\nShip propulsion systems generate the thrust required to move vessels through water, encompassing a range of technologies from wind-powered sails to advanced electric drives. These systems convert energy sources into mechanical or electrical power that drives propellers or other propulsors, with efficiency influenced by vessel size, operational demands, and environmental factors.\n\nSail propulsion relies on wind captured by fabric sails rigged to masts, traditionally the primary means of ship movement before mechanical engines. Square-rigged sails, hung from horizontal yards perpendicular to the mast, excel in downwind sailing due to their large surface area but require more crew for handling and perform poorly when sailing close to the wind. In contrast, fore-and-aft rigs, with sails aligned along the ship's longitudinal axis, allow better maneuverability and upwind performance, as seen in schooners and modern auxiliary sail systems on yachts. Today, sails serve mainly auxiliary roles on recreational or eco-friendly vessels, supplementing engines to reduce fuel consumption during favorable winds.\n\nMechanical propulsion dominates modern shipping, with steam turbines and diesel engines as key technologies. Steam turbines, introduced in the late 19th century for faster vessels, drove propellers via high-pressure steam expansion and were widely adopted during the industrial era for transoceanic liners. In contemporary use, they persist primarily in nuclear-powered naval ships, where steam from reactors provides reliable high-power output exceeding 100,000 horsepower. Diesel engines, however, power most commercial fleets, with two-stroke variants favored for large ships due to their simplicity, high power density, and efficiency in low-speed, high-torque applications. For instance, engines like the Wärtsilä-Sulzer RTA96-C deliver over 50,000 horsepower in 14-cylinder configurations, propelling ultra-large container ships at speeds around 25 knots.\n\nElectric and hybrid systems offer enhanced efficiency and emissions reductions, particularly for specialized vessels. In electric propulsion, motors drive propellers directly or via pods, with Azipod units—a gearless, 360-degree rotatable design—mounted externally to the hull for improved hydrodynamics and maneuverability. These are common on cruise ships and icebreakers, reducing fuel use by up to 20% through optimized power delivery. Hybrid setups integrate batteries with diesel generators, allowing short all-electric operation to cut emissions in ports or sensitive areas. Ferries exemplify this, with vessels like those from Washington State Ferries using megawatt-scale lithium-ion batteries for hybrid-electric drives, enabling zero-emission crossings of several nautical miles.\n\nPropellers convert rotational energy into thrust, with design choices balancing efficiency, speed range, and control. Fixed-pitch propellers (FPP), with blades set at a constant angle, provide high efficiency at design speeds but lose performance across varying conditions, making them suitable for single-speed cargo ships. Controllable-pitch propellers (CPP) adjust blade angle hydraulically to optimize thrust and enable quick direction changes without reversing the engine, though they incur higher maintenance and initial costs. CPP systems improve overall efficiency by 5-10% in variable-speed operations, such as on tugs or ferries, by maintaining engine sweet spots.\n\nFuel types have evolved from solid to liquid and gaseous forms, driven by energy density, availability, and regulations. Coal, used historically in steam boilers, offered about 24 MJ/kg but required bulky storage and produced high emissions. Modern marine diesel oil (MDO) and heavy fuel oil (HFO) provide higher densities around 42 MJ/kg, enabling longer voyages in large tanks. Biofuels, such as fatty acid methyl esters (FAME), match diesel's compatibility while cutting lifecycle CO2; however, their energy density is lower at 37-39 MJ/kg, necessitating 5-10% more volume for equivalent range. Advanced options like liquefied natural gas (LNG) with a gravimetric energy density of about 50 MJ/kg, though its volumetric density as a liquid is approximately 22 MJ/L, requiring cryogenic storage, supporting dual-fuel engines in over 780 vessels as of 2025, with more than 600 on order.\n\n### Steering and Navigation Systems\n\nSteering systems on ships primarily involve rudders and auxiliary devices that control the vessel's direction by altering water flow around the hull. Rudders generate hydrodynamic forces to change the ship's heading, typically mounted behind the propeller to leverage propeller slipstream for enhanced efficiency. Common types include the spade rudder, which features a full underwater foil without horn support, allowing high angles of attack up to 35 degrees for maximum lift and maneuverability, particularly in vessels like ferries and offshore support ships. The semi-spoiler rudder, partially supported by a horn, offers a thinner profile and smaller movable area, reducing propulsion losses by up to 5% compared to full spade designs while maintaining adequate steering torque. Hydraulic actuators power these rudders through ram-type or rotary vane mechanisms; ram systems use two to four rams connected to a tiller for tiller arm rotation up to 70 degrees, while rotary vanes achieve up to 65 degrees via hydraulic pressure on a rotor within a stator.\n\nThrusters supplement rudders for precise low-speed maneuvering, especially in confined ports or during docking. Bow thrusters, installed in athwartship tunnels forward of the collision bulkhead, provide lateral thrust typically rated at 0.5-1.0 kW per meter of ship length, enabling sideways movement without tug assistance; for example, a 1000 kW controllable-pitch bow thruster on an anchor-handling tug supply vessel delivers about 25 tons of thrust. Stern thrusters, less common and usually smaller at 0.2-0.3 kW per meter of ship length, are positioned aft to counter bow swing during berthing. Azimuth thrusters, which rotate 360 degrees, often replace traditional rudders in dynamic positioning vessels, combining propulsion and steering for enhanced agility; retractable variants minimize drag at sea by folding into the hull.\n\nNavigation systems integrate sensors and displays to determine position, monitor surroundings, and plot courses. The Global Positioning System (GPS) provides satellite-based 3D positioning accurate to within 10 meters under open skies, essential for real-time tracking on open seas. Electronic Chart Display and Information Systems (ECDIS) serve as digital nautical charts compliant with International Hydrographic Organization standards, overlaying GPS data, radar echoes, and Automatic Identification System (AIS) targets to replace paper charts on SOLAS vessels over 300 gross tons. Radar detects surface objects up to 96 nautical miles using X-band (9 GHz) for high resolution in fog or rain, while S-band (3 GHz) offers better long-range performance in precipitation; Automatic Radar Plotting Aids (ARPA) automate collision risk assessment by tracking relative motion vectors. AIS broadcasts vessel identity, position, speed, and course via VHF to nearby ships and shore stations within 20-40 nautical miles, mandatory for vessels over 300 gross tons since 2004 to enhance situational awareness and prevent collisions.\n\nAutopilot systems maintain heading by adjusting the rudder based on gyrocompass or GPS inputs, using proportional-integral-derivative (PID) control algorithms to minimize deviation from set courses, often integrated with thrusters for track-keeping in adverse weather. Integrated Bridge Systems (IBS) consolidate these elements into a unified console, combining ECDIS, radar, AIS, autopilot, and propulsion controls to reduce cognitive load on bridge officers; per IMO guidelines, IBS must include redundancy and alarm prioritization to support safe navigation under SOLAS Chapter V.\n\nRegulatory standards govern these systems to ensure collision avoidance. The International Regulations for Preventing Collisions at Sea (COLREGS), adopted in 1972 and amended through 2018, define rules for conduct in sight or restricted visibility, requiring vessels to maintain proper lookout, sound signals, and actions like altering course to starboard in head-on encounters or yielding when overtaking. Compliance is mandatory under SOLAS, with IBS and navigation aids designed to alert operators to COLREGS violations, such as collision risks under 2 nautical miles.\n\n## Engineering Principles\n\n### Hydrostatic Stability\n\nHydrostatic stability refers to the static equilibrium of a ship in still water, governed primarily by buoyancy principles that ensure the vessel remains upright and afloat under varying load conditions. At its core is Archimedes' principle, which states that the buoyant force acting on a submerged or partially submerged body equals the weight of the fluid displaced by that body. For ships, this principle dictates that the total weight of the vessel, including hull, cargo, fuel, and crew, must balance the weight of the displaced seawater to achieve flotation. The buoyant force is mathematically expressed as \\( F_B = \\rho g V \\), where \\( \\rho \\) is the density of the surrounding water, \\( g \\) is the acceleration due to gravity, and \\( V \\) is the volume of the submerged portion of the hull. This equilibrium allows ships to float despite their high-density materials, such as steel, by displacing a sufficient volume of water whose weight matches the ship's displacement./Book%3A_University_Physics_I_-_Mechanics_Sound_Oscillations_and_Waves_(OpenStax)/14%3A_Fluid_Mechanics/14.06%3A_Archimedes_Principle_and_Buoyancy)/Book%3A_University_Physics_I_-_Mechanics_Sound_Oscillations_and_Waves_(OpenStax)/14%3A_Fluid_Mechanics/14.06%3A_Archimedes_Principle_and_Buoyancy)\n\nA critical measure of a ship's initial transverse stability is the metacentric height, denoted as GM, which quantifies the righting moment that restores the vessel to an upright position after a small heel. GM is calculated as the difference between the height of the metacenter above the keel (KM) and the height of the center of gravity above the keel (KG), given by the formula  \n\\[ GM = KM - KG. \\]  \nThe metacenter is the point where the vertical line through the center of buoyancy intersects the centerline of the ship when heeled, and KM depends on the ship's hull form, with wider beams typically yielding larger values for enhanced stability. A positive GM value indicates stable equilibrium, as the metacenter lies above the center of gravity, producing a restoring torque; conversely, a negative GM signals instability and potential capsizing. Hull shapes that distribute buoyancy broadly, such as those with flared sides, contribute to a higher KM and thus improve overall hydrostatic stability.\n\nFreeboard and draft are essential parameters that directly influence hydrostatic stability by defining the limits of safe submersion. Freeboard is the vertical distance from the waterline to the uppermost continuous deck (freeboard deck), providing reserve buoyancy to prevent excessive immersion, while draft measures the depth from the waterline to the lowest point of the hull. The International Convention on Load Lines (1966), administered by the International Maritime Organization, establishes minimum freeboard requirements based on ship type, length, and damage stability assessments to ensure adequate buoyancy margins and limit maximum permissible drafts. Load lines marked on the hull indicate these limits for different zones and seasons, with calculations incorporating subdivision to maintain stability even if compartments are compromised.\n\nShip stability varies across load conditions, from lightship (empty of cargo and consumables, representing minimum displacement) to fully loaded states, where added weight lowers the center of gravity and alters buoyancy distribution. To verify GM in practice, the inclining experiment is conducted post-construction in calm, sheltered waters under near-lightship conditions, with all non-essential weights removed and tanks either empty or fully pressed up. Known masses are transversely shifted across the deck, and the resulting heel angles are measured using pendulums or stabilographs; GM is then derived from the formula  \n\\[ GM = \\frac{w \\\times d}{\\Delta \\\times \\\tan \\\theta}, \\]  \nwhere \\( w \\) is the shifted weight, \\( d \\) its transverse distance, \\( \\Delta \\) the ship's displacement, and \\( \\\theta \\) the heel angle. This empirical method accounts for actual weight distribution and provides baseline stability data for operational loading.\n\nIn assessing damage stability, the concept of floodable length evaluates a ship's ability to survive flooding without loss of buoyancy up to the margin line (typically 76 mm below the bulkhead deck). Floodable length at any point along the hull is the maximum length of compartments, centered at that point, that can be flooded without submerging the margin line, assuming the ship remains upright and accounting for permeability of flooded spaces (e.g., 0.95 for empty holds, 0.60 for stores). Calculations involve iterative determination of the centroid of lost buoyancy and ensure that bulkhead spacing does not exceed a fraction of this length, based on the ship's subdivision standard (e.g., 100% for one-compartment survivability). This deterministic approach, while partially superseded by probabilistic methods in modern regulations, remains a foundational tool for designing resilient hull subdivisions.\n\n### Hydrodynamic Performance\n\nHydrodynamic performance in ships refers to the interaction between the vessel and surrounding water, influencing speed, fuel efficiency, and maneuverability through fluid dynamic principles. This encompasses the forces resisting forward motion and the vessel's response to waves, optimized via hull design and propulsion to minimize energy loss while maximizing operational capabilities. Key aspects include resistance components, scaling parameters like the Froude number, propeller operation, experimental validation, and seakeeping qualities.\n\nShip resistance comprises several components that collectively oppose forward motion. Total resistance \\( R_T \\) is the sum of frictional resistance \\( R_V \\), which arises from viscous shear along the hull surface due to water viscosity; wave-making resistance \\( R_W \\), generated by the energy required to create waves at the bow and stern; and air resistance \\( R_{AA} \\), resulting from the ship's displacement of air, typically a minor contributor for displacement hulls. Frictional resistance dominates at low speeds, while wave-making becomes significant at higher velocities, often accounting for up to 50% of total resistance in fast vessels.\n\nThe Froude number \\( Fr \\), defined as \\( Fr = \\frac{V}{\\sqrt{g L}} \\) where \\( V \\) is the ship's speed, \\( g \\) is gravitational acceleration, and \\( L \\) is the waterline length, provides a dimensionless measure for scaling hydrodynamic similarity between models and full-scale ships, particularly for wave patterns. It governs the transition from subcritical to supercritical flow regimes, with values around 0.4 marking the onset of the hull speed limit where wave-making resistance rises sharply, limiting efficient speeds for conventional displacement hulls to approximately \\( 1.34 \\sqrt{L} \\) in knots for \\( L \\) in feet. This parameter ensures that model tests replicate full-scale wave resistance accurately when \\( Fr \\) is matched.\n\nPropeller efficiency is assessed through open water tests, which evaluate thrust and torque in uniform flow to determine the propeller's ability to convert engine power into propulsive force, typically achieving 50-70% efficiency for marine propellers. Cavitation avoidance is critical, as vapor bubble formation on blades due to low pressure reduces thrust by up to 20% and causes erosion; designs incorporate blade skew, rake, and pitch adjustments to maintain pressure above vapor limits, often verified via cavitation inception speed metrics.\n\nModel testing in tow tanks involves towing scaled hull models at controlled speeds to measure resistance and wake fields, enabling hull optimization by iterating forms that reduce drag by 5-15%. Computational fluid dynamics (CFD) simulations complement physical tests, solving Navier-Stokes equations to predict flow separation and pressure distributions, with validation against tank data showing agreement within 5% for total resistance in optimized bulbous bow designs.\n\nSeakeeping evaluates a ship's dynamic responses to waves, including heave (vertical translation), pitch (fore-aft rotation), and roll (transverse rotation), which affect crew comfort and structural loads. Response amplitude operators (RAOs) quantify these motions relative to wave height, with optimal designs minimizing pitch RAOs at encounter frequencies to limit accelerations below 0.2g in moderate seas, enhancing operational limits in rough conditions.\n\n### Safety and Regulatory Considerations\n\nThe International Maritime Organization (IMO) plays a central role in establishing global standards for ship safety through key conventions. The International Convention for the Safety of Life at Sea (SOLAS), adopted in 1974 and subsequently amended, sets minimum standards for ship construction, equipment, and operation to enhance safety and prevent loss of life. SOLAS Chapter III specifically mandates life-saving appliances, including sufficient lifeboats, liferafts, immersion suits, and distress signaling equipment, ensuring vessels carry enough capacity for all persons on board plus reserves. Complementing SOLAS, the International Convention for the Prevention of Pollution from Ships (MARPOL), adopted in 1973 and modified by the 1978 Protocol, addresses regulatory aspects of pollution prevention to mitigate environmental risks from ship operations, with six annexes covering oil, noxious liquids, harmful substances in packaged form, sewage, garbage, and air pollution from ships.\n\nShip stability criteria are critical regulatory requirements to prevent capsizing, with IMO distinguishing between intact and damage stability. Intact stability standards, outlined in the 2008 Intact Stability Code, provide criteria for various ship types to maintain equilibrium under normal conditions, drawing from earlier developments since the 1990s. Damage stability regulations in SOLAS Chapter II-1 employ probabilistic methods, introduced post-2000, where the ship's subdivision index (A) is calculated as the sum of products of damage probabilities (p_i) and survival probabilities (s_i) across potential flooding scenarios, ensuring a required index (R) is met based on ship length and passenger capacity. These criteria reference hydrostatic stability metrics, such as metacentric height, to verify compliance without altering core design principles.\n\nFire safety protocols under SOLAS Chapter II-2 emphasize prevention, detection, and suppression to minimize fire risks. Ships must incorporate structural zoning with fire-resistant divisions to contain outbreaks, automatic detection systems using smoke and heat sensors in key areas like machinery spaces and accommodation, and fixed extinguishing systems such as water mist or CO2. For oil tankers, inert gas systems are required to maintain non-explosive atmospheres in cargo tanks by diluting hydrocarbon vapors with exhaust gases, reducing ignition hazards during loading and unloading. These measures, updated through amendments like those in 1992 and beyond, apply to both new and existing vessels to align with evolving fire risk assessments.\n\nHuman factors regulations address crew performance to reduce errors, with bridge resource management (BRM) integrated into training under the International Convention on Standards of Training, Certification and Watchkeeping for Seafarers (STCW). BRM promotes effective communication, teamwork, and resource utilization on the bridge to prevent incidents like collisions, as highlighted in IMO guidelines for watchkeeping. Fatigue management is enforced via STCW Regulation VIII/1, requiring minimum rest periods—such as 10 hours in any 24-hour period and 77 hours in any seven-day period—to counteract contributing factors like long hours, sleep disruption, and workload. These provisions recognize fatigue's role in up to 60% of maritime casualties and mandate companies to implement risk assessments.\n\nRegulatory compliance is verified through inspections, including port state control (PSC) and classification society surveys. PSC allows port authorities to inspect foreign ships to ensure adherence to IMO conventions like SOLAS and MARPOL, with powers to detain non-compliant vessels until deficiencies are rectified. Classification societies, as recognized organizations (ROs) authorized by flag states, conduct mandatory surveys—initial, annual, intermediate, and renewal—for issuing safety certificates, covering structural integrity, machinery, and equipment under the harmonized system of survey and certification (HSSC). This dual oversight framework promotes uniform global standards and rapid identification of safety risks.\n\n## Construction and Lifecycle\n\n### Design and Planning\n\nThe design and planning phase of shipbuilding begins with feasibility studies to assess the viability of a proposed vessel. These studies typically involve market analysis to evaluate demand, such as projected cargo volumes for container ships, and cost-benefit evaluations that calculate return on investment (ROI) based on construction costs, operational expenses, and revenue projections over the vessel's lifecycle. For instance, in the case of post-Panama Canal container vessels, feasibility analyses compare newbuild versus secondhand options by modeling 20-year spot earnings through risk-adjusted iterations to determine economic attractiveness. Such assessments ensure that the project aligns with commercial objectives before proceeding to design.\n\nConceptual design follows, focusing on establishing the vessel's overall form and functionality through initial sketches and models. This stage includes creating lines plans, which are two-dimensional representations of the hull's shape—comprising body, half-breadth, and sheer views—to define the hydrodynamic profile and ensure adequate space for cargo or passengers. Modern conceptual design increasingly employs 3D modeling with computer-aided design (CAD) software to visualize and refine the hull form, allowing for rapid iterations that incorporate basic hydrodynamic principles like resistance minimization. Tools such as Siemens NX enable quick generation of ship general arrangements in 3D during this phase, facilitating stakeholder review and alignment with operational needs.\n\nDetailed engineering then elaborates on the conceptual framework, producing precise schematics for systems integration. This involves designing piping networks for fuel, water, and ballast systems, as well as electrical layouts for power distribution and automation, using specialized software to simulate flows and ensure compatibility. NAPA software supports this through integrated 3D modeling for hull structures and outfitting, including piping routing and electrical cable management, while Rhino provides NURBS-based surface modeling for accurate component placement and interference checks. These tools automate rule-based checks and generate fabrication-ready drawings, reducing errors in complex interconnections.\n\nThroughout the design process, classification societies provide critical input to verify early compliance with safety and construction rules. Organizations like the American Bureau of Shipping (ABS) and DNV engage from the conceptual stage, reviewing plans against their rulebooks to confirm structural integrity, stability, and environmental standards before detailed engineering advances. This involvement includes advisory services and preliminary approvals, preventing costly redesigns later; for example, societies conduct initial audits of hull and system designs to ensure adherence to International Maritime Organization (IMO) conventions. Such checks are essential for obtaining class notation upon completion.\n\nProject management oversees the entire design and planning effort, coordinating multidisciplinary teams through contracts and timelines. Standard shipbuilding contracts, such as the BIMCO SHIPMAN forms, outline responsibilities, milestones, and penalties for delays, often structured as fixed-price agreements to mitigate risks. Typical timelines span 2 to 5 years from feasibility to contract signing, depending on vessel complexity, with design phases consuming 12 to 24 months to allow for iterations and approvals. Effective management employs tools like critical path method scheduling to track progress and allocate resources, ensuring the project transitions smoothly to construction.\n\n### Building and Assembly\n\nShipbuilding occurs in specialized shipyards, which vary in scale and methodology. Traditional shipyards employed sequential construction, where the vessel was built piece by piece starting from the keel on slipways or in dry docks, relying on manual assembly of frames and plates. In contrast, modern shipyards predominantly use modular or block construction, dividing the hull into large prefabricated sections assembled in parallel workshops before final integration, which significantly reduces build time and labor. South Korean mega-yards, such as those operated by Hyundai Heavy Industries and Samsung Heavy Industries, exemplify this approach, utilizing vast facilities to produce high-value vessels like LNG carriers through efficient block methods, achieving up to 30% productivity gains via automation.\n\nThe construction process unfolds in distinct stages, beginning with keel laying, where the foundational backbone of the ship—typically the first major block—is positioned on keel blocks in a dry dock or slipway, marking the official commencement of physical assembly based on detailed design blueprints. This is followed by block assembly, in which pre-fabricated modules, including hull sections up to 300 tons, are outfitted with internal components like piping and wiring in controlled workshop environments before being lifted by cranes and joined to form the complete structure. Launching transfers the assembled hull from the construction site into water, often via slipways for smaller vessels or by flooding dry docks for larger ones, allowing the ship to float for the first time. Final outfitting then integrates remaining systems, such as propulsion machinery and electrical installations, either dockside or afloat, completing the vessel for trials.\n\nJoining techniques in shipbuilding have evolved from riveting to welding, with the latter dominating since World War II for its strength and efficiency in fabricating steel hulls, which form the primary material for large commercial and naval vessels. Riveting, once common for its reliability in early 20th-century builds, has been largely supplanted by arc welding processes like gas metal arc welding (GMAW) and gas tungsten arc welding (GTAW), enabling continuous seams that reduce weight and assembly time. For smaller vessels, such as patrol boats or yachts, aluminum alloys (e.g., 5XXX series like 5083) are preferred for their corrosion resistance and lighter weight, joined via specialized welding with fillers like 5183 to maintain structural integrity in marine environments.\n\nShipyards rely on dry docks and slipways for assembly and launching. Graving docks, permanent excavated basins with concrete walls and watertight gates, allow water to be pumped out after the ship enters, providing stable support on blocks for precise construction of large hulls. Floating dry docks, self-contained U-shaped structures made of steel, submerge via ballast tanks to receive the vessel before rising to expose the hull, offering mobility for use in various harbors and suitability for mid-sized ships. Slipways, inclined planes leading to water, facilitate the sliding launch of completed hulls, particularly effective for smaller or medium vessels where dry dock capacity is limited.\n\nThe workforce in shipbuilding demands skilled labor, including welders, shipfitters, and crane operators, to handle complex tasks amid ongoing shortages exacerbated by industry cycles and competition from other sectors. Since the 2010s, automation has addressed these gaps, with robotic welders—such as collaborative systems introduced by HD Hyundai Heavy Industries in 2018—performing high-precision tasks like orbital welding, reducing preparation time by up to 60% and enhancing safety by minimizing human exposure to hazards. These systems, including laser high-speed robots at Samsung Heavy Industries since 2021, integrate with block assembly lines to boost efficiency in mega-yards.\n\n### Maintenance and Upgrades\n\nMaintenance and upgrades are essential for ensuring the structural integrity, operational efficiency, and regulatory compliance of ships throughout their service life. These activities involve routine inspections, repairs to address wear and damage, and modifications to meet evolving environmental standards, all while minimizing downtime and costs. By proactively managing corrosion, biofouling, and emissions, shipowners extend vessel lifespan and reduce fuel consumption, which can account for a significant portion of operational expenses.\n\nScheduled dry-docking is a cornerstone of ship maintenance, mandated by international regulations to inspect and service the underwater hull and appendages. Under the International Convention for the Safety of Life at Sea (SOLAS), merchant vessels must undergo a complete hull survey in dry dock twice within any five-year period, with an intermediate survey no later than 36 months after the previous dry docking. During these periods, typically every 2.5 to 3 years, the hull is cleaned to remove marine growth such as barnacles and algae, which can increase drag and fuel use by up to 10-20% if unchecked. Antifouling coatings, often silicone-based or biocide-releasing paints, are then reapplied to deter biofouling, with the process adhering to IMO guidelines to prevent environmental harm from toxic releases. These interventions, conducted in graving docks or floating docks, also allow for propeller polishing and rudder alignment, enhancing hydrodynamic performance.\n\nRepairs during maintenance focus on restoring structural components compromised by fatigue, impacts, or environmental exposure. Cracks in the hull plating, often resulting from cyclic loading or collisions, are repaired by grinding out the defect to sound metal, followed by welding using techniques like shielded metal arc or submerged arc welding to ensure fusion without introducing new stresses. Corrosion control is equally critical, particularly in the harsh marine environment where steel hulls can degrade rapidly without intervention. Cathodic protection systems, either galvanic anodes (sacrificial zinc or aluminum alloys) or impressed current cathodic protection (ICCP), are employed to mitigate electrochemical corrosion by making the hull the cathode in an electrolytic cell, polarizing it to a protective potential of around -0.80 V versus a silver/silver chloride reference electrode. These systems, integrated during construction or retrofitted, require periodic anode replacement or current adjustments during dry docking to maintain effectiveness against pitting and general thinning.\n\nUpgrades modernize ships to comply with stringent emissions regulations and improve efficiency. Following the IMO's 2020 global sulfur cap, which limits fuel sulfur content to 0.50% m/m outside emission control areas, many vessels have been retrofitted with exhaust gas cleaning systems, or scrubbers, to remove sulfur oxides from engine exhaust. Open-loop or closed-loop scrubbers enable continued use of cheaper high-sulfur heavy fuel oil while meeting MARPOL Annex VI standards, with over 2,300 installations reported by mid-2020. Engine retrofits, such as selective catalytic reduction for NOx or hybrid propulsion additions, further reduce emissions and align with future decarbonization goals, often funded through lifecycle cost savings in fuel and compliance penalties.\n\nCondition monitoring technologies enable early detection of issues, reducing the need for invasive repairs. Ultrasonic thickness measurement (UTM) uses high-frequency sound waves to assess hull plating integrity, identifying corrosion thinning to as low as 0.1 mm resolution without surface preparation, and is standard during class surveys. Drone inspections, increasingly adopted by classification societies, provide safer access to hard-to-reach areas like tanks and rudders, combining visual imaging with ultrasonic probes for real-time data on defects and coating breakdown. These methods, supported by DNV and Bureau Veritas protocols, facilitate predictive maintenance, minimizing unplanned downtime.\n\nOverall, maintenance and upgrades typically cost 2-5% of a ship's value annually, varying with age, size, and operational profile, but yielding substantial returns through extended service life and regulatory adherence.\n\n### Decommissioning and Recycling\n\nDecommissioning a ship typically begins with lay-up, a temporary suspension of operations where the vessel is anchored or moored in a secure location to preserve its condition while awaiting sale or reactivation. During lay-up, known as mothballing, systems are secured by draining fluids, sealing openings to prevent corrosion, and maintaining minimal crew or automated monitoring to address humidity and potential hazards like fire risks. This process can last from weeks to years, often driven by market overcapacity or anticipation of higher scrap values, after which the ship is sold to recycling facilities, frequently transferred to major breaking yards such as those in Alang, India, the world's largest shipbreaking site.\n\nOnce at the recycling yard, dismantling commences with the removal of hazardous materials to mitigate health and environmental risks, followed by systematic cutting of the structure. Key hazardous substances, including asbestos used in insulation and polychlorinated biphenyls (PCBs) in electrical equipment and paints, are inventoried, contained, and disposed of according to safety protocols before any cutting begins, as these materials can release toxic fumes or contaminate soil and water if mishandled. The cutting sequence generally starts from the upper decks and superstructure, progressing downward to the hull using oxy-fuel torches or mechanical shears, allowing workers to access and salvage components layer by layer while minimizing structural instability.\n\nInternational regulations govern these practices to ensure safety and sustainability. The Basel Convention on the Control of Transboundary Movements of Hazardous Wastes and Their Disposal, adopted in 1989, classifies end-of-life ships containing hazardous materials like asbestos and PCBs as waste, requiring prior informed consent and environmentally sound management for transboundary shipments to recycling facilities. Complementing this, the Hong Kong International Convention for the Safe and Environmentally Sound Recycling of Ships, adopted in 2009 and entering into force on 26 June 2025, mandates an inventory of hazardous materials on board, ship recycling plans, and certification for facilities to minimize risks to workers, health, and the environment throughout the decommissioning process.\n\nA primary outcome of dismantling is the recovery of materials, with steel from ship hulls representing 75-85% of a vessel's weight and achieving 90-95% reusability through melting and reprocessing, which consumes significantly less energy than producing virgin steel. In 2024, the ship recycling industry processed 324 merchant ships (per Lloyd's List) or 409 vessels overall (per NGO Shipbreaking Platform), with over 90% occurring in South Asian yards like Alang and sustaining employment for more than 100,000 workers in hazardous conditions despite ongoing safety improvements; projections indicate volumes will more than double over the next decade, with around 16,000 ships expected to be recycled by 2035.   This scale underscores the sector's role in resource circularity, though it briefly intersects with broader environmental concerns such as localized pollution from breaking activities.\n\n## Measurement and Operations\n\n### Sizing and Capacity Metrics\n\nSizing and capacity metrics provide standardized measures for assessing a ship's physical dimensions, internal volume, and load-carrying potential, essential for design, regulation, and commercial operations. These metrics ensure uniformity across international maritime practices, facilitating comparisons, port access, and compliance with conventions like the International Convention on Tonnage Measurement of Ships, 1969 (TMC 69).\n\nTonnage represents a ship's size and capacity through volume- or weight-based calculations, distinct from displacement which measures total weight. Gross tonnage (GT) quantifies the total internal volume of the ship's enclosed spaces, serving as a proxy for overall size and used for safety regulations and port fees. It is calculated using the formula $$ GT = K_1 V $$, where \\( V \\) is the total volume of all enclosed spaces in cubic meters, and \\( K_1 = 0.2 + 0.02 \\log_{10} V \\) is a coefficient that adjusts for scale, as defined in the TMC 69. Net tonnage (NT) measures the volume available for revenue-earning cargo and passengers, derived from the formula $$ NT = K_2 V_c \\left( \\frac{D}{d} \\right)^2 + K_3 (N_1 + N_2) $$, where \\( V_c \\) is the volume of cargo spaces, \\( D \\) and \\( d \\) are moulded depth and draught, \\( N_1 \\) and \\( N_2 \\) account for passengers, and coefficients \\( K_2 \\) and \\( K_3 \\) follow similar logarithmic adjustments; NT cannot be less than 30% of GT. Deadweight tonnage (DWT) differs by focusing on weight rather than volume, representing the maximum load a ship can carry—including cargo, fuel, water, provisions, crew, and stores—calculated as the difference between the ship's loaded and lightweight displacements at a specified draught.\n\nPrincipal dimensions define a ship's external form, influencing stability, speed, and capacity. Length overall (LOA) is the maximum distance from the foremost to the aftermost points of the ship, including protrusions like the bow and stern. Beam refers to the ship's width; the moulded beam measures the maximum width inside the shell plating at the widest frame, while the extreme beam includes the plating thickness. Depth is the vertical distance from the lowest keel point to the uppermost continuous deck; moulded depth excludes plating thickness, whereas extreme depth incorporates it for overall height assessment.\n\nCapacity metrics specify cargo volumes in specialized units tailored to cargo types. For container ships, twenty-foot equivalent units (TEU) measure the number of standard 20-foot containers (approximately 6.1 m long, 2.4 m wide, 2.6 m high) that can be accommodated, with modern vessels often exceeding 20,000 TEU. Oil tankers use barrels (bbl), where one barrel equals 42 US gallons (159 liters), to denote liquid cargo volume; for example, very large crude carriers hold over 2 million bbl. Dry bulk or general cargo ships employ bale capacity, measured in cubic meters or feet for baled or bagged goods like cotton, typically 7-10% less than grain capacity due to required air spaces.\n\nHistorically, ship tonnage evolved from medieval estimates based on wine cask volumes (tuns of about 40 cubic feet) in the 13th century, used for customs levies, to 19th-century weight-based formulas like Carpenter's (length × beam × depth × coefficient) that shipowners manipulated to minimize dues. The 1854 Moorsom system standardized gross register tonnage (GRT) as enclosed volume divided by 100 cubic feet and net register tonnage (NRT) as earnings space after deductions, adopted internationally but varying by nation and canal rules. The TMC 69 marked a pivotal shift to modern volume-based GT and NT, entering force in 1982 after phasing out older register tons by 1994, driven by the need for a universal system amid technological advances like steel hulls and to prevent design distortions for tax avoidance.\n\n### Operational Practices\n\nShip operations rely on structured manning to ensure safety and efficiency, with a clear hierarchy of officers overseeing deck and engine departments. The captain, or master, holds ultimate authority for the vessel's navigation, safety, and compliance with international regulations. The chief engineer leads the engine department, managing propulsion systems, maintenance, and fuel efficiency, reporting directly to the captain. All senior officers must hold certifications under the International Convention on Standards of Training, Certification and Watchkeeping for Seafarers (STCW) of 1978, which sets minimum training standards for roles like masters and chief engineers to promote competence in safety and operations. The STCW requires officers to demonstrate proficiency in areas such as navigation, engineering operations, and emergency response through mandatory training and periodic refresher courses.\n\nLoading and unloading procedures prioritize cargo integrity and vessel stability, utilizing specialized equipment to handle diverse goods efficiently. Cranes, often ship-mounted or shore-based, lift containerized or breakbulk cargo, while conveyor systems facilitate rapid transfer of bulk materials like grain or ore. During these operations, continuous stability checks are essential, involving calculations of trim, heel, and shear forces to prevent capsizing or structural damage, as outlined in the IMO's Code of Safe Practice for Solid Bulk Cargoes (BLU Code). Masters collaborate with terminal operators to develop loading or unloading plans that specify cargo distribution, sequence, and ballast adjustments, ensuring compliance with stability criteria throughout the process.\n\nVoyage planning forms the backbone of safe and economical ship transit, integrating route selection, resource allocation, and contingency measures. Weather routing uses meteorological forecasts to select paths that minimize fuel consumption and avoid adverse conditions, often employing software for dynamic adjustments. Fuel management strategies, including just-in-time arrivals, optimize engine speeds and port synchronization to reduce idling emissions and costs, guided by IMO Resolution A.893(21) on voyage planning. These plans encompass appraisal of hazards, detailed route plotting, execution monitoring, and post-voyage evaluation to enhance future operations.\n\nEmergency drills are conducted regularly to prepare crews for crises, mandated by the International Safety Management (ISM) Code adopted in 1993. Fire drills simulate outbreak scenarios, training personnel in detection, suppression, and evacuation using onboard systems like fixed CO2 units and hoses. Abandon ship drills practice mustering at lifeboats, donning immersion suits, and launching survival craft, ensuring all crew members know assigned duties and equipment locations. The ISM Code requires companies to implement a safety management system that includes these drills at least monthly for cargo ships, fostering a culture of preparedness.\n\nGlobal ship operations demand continuous coverage through 24/7 shift rotations, typically structured as four-hour watches to maintain vigilance in navigation, engineering, and cargo monitoring. With approximately 1.89 million seafarers worldwide serving on merchant vessels, crews are predominantly multicultural, drawing from over 140 nationalities to address labor shortages. About 70-80% of the global merchant fleet operates with multinational teams, necessitating cross-cultural training to mitigate communication barriers and enhance teamwork.\n\n## Environmental Impacts\n\n### Operational Pollution\n\nOperational pollution from ships encompasses emissions and discharges generated during routine voyages, contributing to air, water, and acoustic degradation in marine environments. These pollutants arise primarily from fuel combustion, wastewater management, and vessel operations, with international regulations under the International Maritime Organization (IMO) aiming to mitigate their impacts. Air emissions, including sulfur oxides (SOx), nitrogen oxides (NOx), and carbon dioxide (CO2), stem from marine fuels and propulsion systems, while water-based pollution involves oily discharges and ballast water releases that can introduce contaminants or invasive species. Noise and light pollution further disrupt marine ecosystems, particularly affecting sensitive species like cetaceans. Accidental oil spills, though not routine, represent a severe operational risk with established global response frameworks.\n\nAir emissions from ships are dominated by SOx and NOx, produced during the combustion of heavy fuel oil, which contribute to acid rain, respiratory issues in coastal populations, and photochemical smog. The IMO's 2020 sulfur cap, implemented under MARPOL Annex VI, limits sulfur content in marine fuels to 0.50% globally (down from 3.50%), achieving an estimated 77% reduction in SOx emissions from international shipping. NOx emissions, which exacerbate eutrophication and ground-level ozone formation, are regulated through tiered standards in MARPOL Annex VI; Tier III requirements in designated Emission Control Areas (ECAs) mandate up to an 80% reduction from Tier I levels for engines built after 2016, typically via selective catalytic reduction systems. Additionally, GHG emissions from shipping account for approximately 2.3% of global anthropogenic emissions as of 2023, with annual outputs of about 860 million tonnes CO2e, underscoring the sector's role in climate change. These regulations apply outside ECAs where Tier II limits (about 20% reduction from Tier I) remain in effect.\n\nWater pollution during operations includes bilge water discharges, which accumulate oil, fuel residues, and other hydrocarbons from engine rooms and cargo holds. Under MARPOL Annex I, ships must use oily water separators to process bilge water, ensuring effluent oil content does not exceed 15 parts per million (ppm) before discharge, with instantaneous alarms triggering at this threshold to prevent violations. Discharges are prohibited within 12 nautical miles of land or in special areas, and monitoring devices must achieve accuracy within ±5 ppm. Ballast water, used for stability and comprising up to 50% of a vessel's draft, poses risks by transporting non-native species that can become invasive, disrupting local biodiversity upon release. The IMO's International Convention for the Ballast Water Management (2004), effective since 2017, requires treatment systems to limit viable organisms in discharged water; approved methods include ultraviolet (UV) irradiation, which inactivates microorganisms by damaging their DNA without chemical residuals, achieving compliance with D-2 standards (e.g., less than 10 viable organisms per cubic meter greater than 50 micrometers).\n\nUnderwater noise from ship propellers, engines, and hulls propagates over long distances, masking communication signals and causing behavioral changes in marine mammals, such as displacement from foraging grounds or stress-induced strandings. Commercial shipping contributes significantly to ambient ocean noise levels, which have increased by 20 decibels since pre-industrial times in some frequencies, impairing echolocation in species like whales and dolphins. The United Nations Convention on the Law of the Sea (UNCLOS) imposes a general obligation under Articles 192 and 194 to prevent marine environmental pollution, including noise as a form of energy pollution, though enforcement relies on national measures. In 2014, the IMO issued non-binding Guidelines for the Reduction of Underwater Noise from Commercial Shipping to promote quieter designs and operational practices, such as speed reductions in sensitive areas. Ship-generated light pollution, from deck and navigation lights, alters natural photoperiods, disorienting nocturnal migrants like seabirds and affecting larval settlement in invertebrates, though specific regulations remain limited beyond general UNCLOS protections.\n\nAccidental oil spills during operations, often from collisions or groundings, release crude or bunker fuel into the marine environment, causing immediate toxicity to wildlife and long-term habitat degradation. A prominent example is the 1989 Exxon Valdez incident, where the tanker grounded in Alaska's Prince William Sound, spilling approximately 11 million U.S. gallons (41,000 cubic meters) of crude oil, devastating fisheries and coastal ecosystems over 1,300 miles of shoreline. International response protocols are governed by the IMO's International Convention on Oil Pollution Preparedness, Response and Co-operation (OPRC, 1990), which mandates shipboard oil pollution emergency plans, national contingency strategies, and international cooperation for containment, dispersal, and cleanup using booms, skimmers, and dispersants. Parties to OPRC must report spills exceeding minimal quantities and coordinate mutual assistance, with exercises required biennially to enhance readiness.\n\n### Waste Management and Shipbreaking\n\nWaste management on ships encompasses the handling and disposal of solid and hazardous wastes generated during operations to prevent marine pollution. Under the International Convention for the Prevention of Pollution from Ships (MARPOL) Annex V, the discharge of all garbage into the sea is generally prohibited, with specific exceptions for food wastes and certain cargo residues under controlled conditions. This regulation, revised in 2013 through amendments adopted in 2012 and entering into force on 1 August 2013, strengthened prohibitions by banning all types of solid garbage discharges, including plastics, which pose severe risks to marine life through ingestion and entanglement. Ships of 100 gross tonnage and above must maintain a Garbage Management Plan and Garbage Record Book to record all garbage handling and disposal activities, ensuring compliance and traceability.\n\nHazardous materials, such as polychlorinated biphenyls (PCBs) and heavy metals, are commonly found in ship components like electrical equipment, paints, insulation, and batteries, requiring specialized handling during maintenance to mitigate environmental and health risks. PCBs, present in cable insulation, transformers, and oils, are persistent toxins that can leach into soil and water if not properly managed, and their burning releases highly hazardous dioxins and furans. Heavy metals, including lead, cadmium, and mercury from anodes, piping, and electronics, generate fumes and particulates during cutting or removal, potentially contaminating air, water, and ground if containment measures fail. The Basel Convention's technical guidelines recommend removing these materials in dedicated facilities using impermeable surfaces and sealed containers, with trained personnel employing personal protective equipment (PPE) to prevent dispersal. Asbestos, used in thermal insulation, must be removed wet to suppress fibers, which cause respiratory diseases like mesothelioma, and disposed of in sealed bags at approved landfills.\n\nShipbreaking, the process of dismantling end-of-life vessels, involves significant environmental challenges and varies by method, with beaching and dock-based approaches differing in safety and impact. Beaching, prevalent in regions like South Asia, grounds ships on intertidal zones for manual cutting, often leading to uncontrolled releases of toxins into coastal waters and sediments due to limited infrastructure. In contrast, dock methods, typically used in industrialized facilities, employ dry docks or piers for controlled disassembly, reducing pollution through better waste containment and access for heavy machinery. Worker safety in shipbreaking is governed by the International Labour Organization (ILO) guidelines adopted in 2004, which mandate occupational safety and health (OSH) management systems, including hazard identification, risk assessments, and emergency preparedness to address risks like falls, fires, and exposure to confined spaces. These guidelines emphasize training, PPE provision, and prohibiting unsafe practices such as working in non-gas-free areas, aiming to align beach operations with safer dry dock standards.\n\nThe environmental impacts of shipbreaking include toxic releases from dismantling, such as heavy metals, PCBs, and oil residues, which contaminate soil, water, and air in breaking yards. In 2024, approximately 409 end-of-life ships were dismantled globally, each containing substantial hazardous substances that, if unmanaged, lead to persistent pollution in hotspots like Chittagong, Bangladesh. Oil residues and other hydrocarbons from fuel tanks and bilges contribute to sediment and groundwater contamination, exacerbating local ecosystem damage. To mitigate these, green shipbreaking certifications under the Hong Kong International Convention for the Safe and Environmentally Sound Recycling of Ships (HKC), which entered into force on 26 June 2025, require facilities to obtain Statements of Compliance for safe handling and waste management. These standards promote pre-cleaning of ships and use of authorized yards to minimize releases.\n\nIntegrating shipbreaking into a circular economy framework enhances material reuse and reduces waste, with up to 95-98% of a ship's light displacement tonnage recoverable as secondary resources like steel, aluminum, and non-ferrous metals. Electronics from navigation and communication systems generate e-waste containing valuable but hazardous components, such as circuit boards with gold and rare earths, which must be segregated and recycled to prevent toxic leaching. The European Union's Ship Recycling Regulation supports this by mandating recycling at certified facilities and design-for-recycling principles, fostering closed-loop material flows and aligning with broader sustainability goals like the European Green Deal. Technologies such as plasma gasification further enable high-efficiency recovery, turning potential waste into reusable inputs for industries.",
  "external_references": [
    {
      "text": "Marpol Ingles.pdf",
      "url": "https://portalcip.org/wp-content/uploads/2024/05/MARPOL-INGLES.pdf",
      "domain": "portalcip.org",
      "type": "citation"
    },
    {
      "text": "Law 9780199231690 E1197",
      "url": "https://opil.ouplaw.com/abstract/10.1093/law:epil/9780199231690/law-9780199231690-e1197",
      "domain": "opil.ouplaw.com",
      "type": "citation"
    },
    {
      "text": "International Convention For The Prevention Of Pollution From Ships %28marpol%29.aspx",
      "url": "https://www.imo.org/en/about/conventions/pages/international-convention-for-the-prevention-of-pollution-from-ships-%28marpol%29.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "The Historical And Cultural Impact Of Sea Commerce",
      "url": "https://opentextbooks.clemson.edu/sts1010fidlerfall2021/chapter/the-historical-and-cultural-impact-of-sea-commerce/",
      "domain": "opentextbooks.clemson.edu",
      "type": "citation"
    },
    {
      "text": "Phoenicia",
      "url": "https://www.britannica.com/topic/Phoenicia",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302645",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Types Of Sails",
      "url": "https://www.britannica.com/technology/ship/Types-of-sails",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "1",
      "url": "https://research.library.fordham.edu/transportation/1/",
      "domain": "research.library.fordham.edu",
      "type": "citation"
    },
    {
      "text": "Us.merchantfleet",
      "url": "https://unctadstat.unctad.org/datacentre/reportInfo/US.MerchantFleet",
      "domain": "unctadstat.unctad.org",
      "type": "citation"
    },
    {
      "text": "Maritime Transport Data Insights.pdf",
      "url": "https://www.sipotra.it/wp-content/uploads/2025/04/Maritime-transport-Data-insights.pdf",
      "domain": "sipotra.it",
      "type": "citation"
    },
    {
      "text": "Regulationsdefault.aspx",
      "url": "https://www.imo.org/en/OurWork/Safety/Pages/RegulationsDefault.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Law 9780199231690 E1197",
      "url": "https://opil.ouplaw.com/display/10.1093/law:epil/9780199231690/law-9780199231690-e1197",
      "domain": "opil.ouplaw.com",
      "type": "citation"
    },
    {
      "text": "Unclos E.pdf",
      "url": "https://www.un.org/depts/los/convention_agreements/texts/unclos/unclos_e.pdf",
      "domain": "un.org",
      "type": "citation"
    },
    {
      "text": "International Convention For The Safety Of Life At Sea %28solas%29%2c 1974.aspx",
      "url": "https://www.imo.org/en/about/conventions/pages/international-convention-for-the-safety-of-life-at-sea-%28solas%29%2C-1974.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "7 Differences Between A Ship And A Boat",
      "url": "https://www.marineinsight.com/types-of-ships/7-differences-between-a-ship-and-a-boat/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Shipping Data Unctad Releases New Seaborne Trade Statistics",
      "url": "https://unctad.org/news/shipping-data-unctad-releases-new-seaborne-trade-statistics",
      "domain": "unctad.org",
      "type": "citation"
    },
    {
      "text": "Why We Call Ship She",
      "url": "https://www.usni.org/magazines/naval-history-magazine/1998/december/why-we-call-ship-she",
      "domain": "usni.org",
      "type": "citation"
    },
    {
      "text": "The Evolution Of Ship Naming In The U S Navy.html",
      "url": "https://www.history.navy.mil/browse-by-topic/heritage/customs-and-traditions0/ship-naming/the-evolution-of-ship-naming-in-the-u-s--navy.html",
      "domain": "history.navy.mil",
      "type": "citation"
    },
    {
      "text": "Usn Ship Naming.pdf",
      "url": "https://www.globalsecurity.org/military/library/report/2012/usn-ship-naming.pdf",
      "domain": "globalsecurity.org",
      "type": "citation"
    },
    {
      "text": "Registration Of Ships And Fraudulent Registration Matters.aspx",
      "url": "https://www.imo.org/en/OurWork/Legal/Pages/Registration-of-ships-and-fraudulent-registration-matters.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "307244 Ship Flag Registration Process Key Requirement",
      "url": "https://www.marinepublic.com/blogs/marine-law/307244-ship-flag-registration-process-key-requirement",
      "domain": "marinepublic.com",
      "type": "citation"
    },
    {
      "text": "Nomenclature Naval Vessels.html",
      "url": "https://www.history.navy.mil/research/library/online-reading-room/title-list-alphabetically/n/nomenclature-naval-vessels.html",
      "domain": "history.navy.mil",
      "type": "citation"
    },
    {
      "text": "Rules And Regulations For The Classification Of Ships",
      "url": "https://www.lr.org/en/knowledge/lloyds-register-rules/rules-and-regulations-for-the-classification-of-ships/",
      "domain": "lr.org",
      "type": "citation"
    },
    {
      "text": "The Importance Of Classification Societies In The Maritime Industry",
      "url": "https://www.marineinsight.com/maritime-law/the-importance-of-classification-societies-in-the-maritime-industry/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "International Convention On Tonnage Measurement Of Ships %281969%29.aspx",
      "url": "https://www.imo.org/en/about/conventions/pages/international-convention-on-tonnage-measurement-of-ships-%281969%29.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Cm Do You Know What Gt And Dwt Measure In A Ship",
      "url": "https://safety4sea.com/cm-do-you-know-what-gt-and-dwt-measure-in-a-ship/",
      "domain": "safety4sea.com",
      "type": "citation"
    },
    {
      "text": "Key Shipping Terms In Brief",
      "url": "https://worldoceanreview.com/en/wor-1/transport/global-shipping/key-shipping-terms-in-brief/",
      "domain": "worldoceanreview.com",
      "type": "citation"
    },
    {
      "text": "Fix Dissertation 2015.pdf",
      "url": "https://oaktrust.library.tamu.edu/bitstream/1969.1/155316/1/FIX-DISSERTATION-2015.pdf",
      "domain": "oaktrust.library.tamu.edu",
      "type": "citation"
    },
    {
      "text": "369976",
      "url": "https://www.journals.uchicago.edu/doi/pdf/10.1086/369976",
      "domain": "journals.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Jenkins Boat.pdf",
      "url": "https://gizamedia.rc.fas.harvard.edu/images/MFA-images/Giza/GizaImage/full/library/jenkins_boat.pdf",
      "domain": "gizamedia.rc.fas.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://corescholar.libraries.wright.edu/cgi/viewcontent.cgi?article=1021\\u0026context=ancient_science_fair",
      "domain": "corescholar.libraries.wright.edu",
      "type": "citation"
    },
    {
      "text": "Pdfcoverpage",
      "url": "https://scholarworks.brandeis.edu/view/pdfCoverPage?instCode=01BRAND_INST\\u0026filePid=13419011460001921\\u0026download=true",
      "domain": "scholarworks.brandeis.edu",
      "type": "citation"
    },
    {
      "text": "Pmc4368416",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4368416/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://vc.bridgew.edu/cgi/viewcontent.cgi?article=1401\\u0026context=br_rev",
      "domain": "vc.bridgew.edu",
      "type": "citation"
    },
    {
      "text": "Lawrence Cody Sailing In The Ancient Mediterranean 2020 05 19 Ocr.pdf",
      "url": "https://corescholar.libraries.wright.edu/context/ancient_science_fair/article/1010/viewcontent/lawrence_cody_sailing_in_the_ancient_mediterranean_2020_05_19_ocr.pdf",
      "domain": "corescholar.libraries.wright.edu",
      "type": "citation"
    },
    {
      "text": "Celestial Navigation",
      "url": "https://timeandnavigation.si.edu/navigating-at-sea/navigating-without-a-clock/celestial-navigation",
      "domain": "timeandnavigation.si.edu",
      "type": "citation"
    },
    {
      "text": "Viking Ships",
      "url": "https://www.rmg.co.uk/stories/maritime-history/viking-ships",
      "domain": "rmg.co.uk",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.unl.edu/cgi/viewcontent.cgi?article=1048\\u0026context=nebanthro",
      "domain": "digitalcommons.unl.edu",
      "type": "citation"
    },
    {
      "text": "Rise Of Urban Europe.pdf",
      "url": "http://stanford.edu/~yamins/uploads/2/4/9/2/24920889/rise_of_urban_europe.pdf",
      "domain": "stanford.edu",
      "type": "citation"
    },
    {
      "text": "The Development Of The Rudder 100 1600 A D A Technological Tale",
      "url": "https://www.medievalists.net/2010/06/the-development-of-the-rudder-100-1600-a-d-a-technological-tale/",
      "domain": "medievalists.net",
      "type": "citation"
    },
    {
      "text": "Lateensail Campbell1995.pdf",
      "url": "https://www.ancientportsantiques.com/wp-content/uploads/Documents/ETUDESarchivees/Navires/Documents/LateenSail-Campbell1995.pdf",
      "domain": "ancientportsantiques.com",
      "type": "citation"
    },
    {
      "text": "Ships And Sailing In The Medieval World",
      "url": "https://brewminate.com/ships-and-sailing-in-the-medieval-world/",
      "domain": "brewminate.com",
      "type": "citation"
    },
    {
      "text": "Caravel",
      "url": "https://exploration.marinersmuseum.org/watercraft/caravel/",
      "domain": "exploration.marinersmuseum.org",
      "type": "citation"
    },
    {
      "text": "Nmah 844077",
      "url": "https://americanhistory.si.edu/collections/nmah_844077",
      "domain": "americanhistory.si.edu",
      "type": "citation"
    },
    {
      "text": "Admiral Zheng He And The Chinese Treasure Fleet",
      "url": "https://www.education.maritime-museum.org/training/north-gallery-2/asian-history/admiral-zheng-he-and-the-chinese-treasure-fleet/",
      "domain": "education.maritime-museum.org",
      "type": "citation"
    },
    {
      "text": "Watertight Bulkhead Technology Of Chinese Junks 00321",
      "url": "https://ich.unesco.org/en/USL/watertight-bulkhead-technology-of-chinese-junks-00321",
      "domain": "ich.unesco.org",
      "type": "citation"
    },
    {
      "text": "World War Ii Shipbuilding In The San Francisco Bay Area.htm",
      "url": "https://www.nps.gov/articles/000/world-war-ii-shipbuilding-in-the-san-francisco-bay-area.htm",
      "domain": "nps.gov",
      "type": "citation"
    },
    {
      "text": "Our Story",
      "url": "https://www.ssgreatbritain.org/our-story/",
      "domain": "ssgreatbritain.org",
      "type": "citation"
    },
    {
      "text": "Artifact Of The Month Claret Jug",
      "url": "https://www.marinersmuseum.org/2014/03/artifact-of-the-month-claret-jug/",
      "domain": "marinersmuseum.org",
      "type": "citation"
    },
    {
      "text": "The Rms Titanic",
      "url": "https://ethw.org/The_RMS_Titanic",
      "domain": "ethw.org",
      "type": "citation"
    },
    {
      "text": "Merchant Marine World War Ii",
      "url": "https://www.nationalww2museum.org/war/articles/merchant-marine-world-war-ii",
      "domain": "nationalww2museum.org",
      "type": "citation"
    },
    {
      "text": "Ww2",
      "url": "https://americanhistory.si.edu/subs/history/subsbeforenuc/ww2/",
      "domain": "americanhistory.si.edu",
      "type": "citation"
    },
    {
      "text": "Taking Seas Rise American Aircraft Carrier",
      "url": "https://www.fordlibrarymuseum.gov/exhibits/taking-seas-rise-american-aircraft-carrier",
      "domain": "fordlibrarymuseum.gov",
      "type": "citation"
    },
    {
      "text": "Henry Kaisers Escort Carriers And The Battle Of Leyte Gulf",
      "url": "https://about.kaiserpermanente.org/who-we-are/our-history/henry-kaisers-escort-carriers-and-the-battle-of-leyte-gulf",
      "domain": "about.kaiserpermanente.org",
      "type": "citation"
    },
    {
      "text": "Tnm 7 3 11 40.pdf",
      "url": "https://www.cnrs-scrn.org/northern_mariner/vol07/tnm_7_3_11-40.pdf",
      "domain": "cnrs-scrn.org",
      "type": "citation"
    },
    {
      "text": "The Setting Of Global Transportation Systems",
      "url": "https://transportgeography.org/contents/chapter1/the-setting-of-global-transportation-systems/",
      "domain": "transportgeography.org",
      "type": "citation"
    },
    {
      "text": "Suez Canal Blockage 2021",
      "url": "https://porteconomicsmanagement.org/pemp/contents/part10/port-resilience/suez-canal-blockage-2021/",
      "domain": "porteconomicsmanagement.org",
      "type": "citation"
    },
    {
      "text": "Predicting Ship Transits In Capacity Constrained Areas",
      "url": "https://www.maritime-executive.com/editorials/predicting-ship-transits-in-capacity-constrained-areas",
      "domain": "maritime-executive.com",
      "type": "citation"
    },
    {
      "text": "New Technology On Cruise Ships How Icon Of The Seas Is Making Waves",
      "url": "https://www.royalcaribbean.com/guides/new-technology-on-cruise-ships-how-icon-of-the-seas-is-making-waves",
      "domain": "royalcaribbean.com",
      "type": "citation"
    },
    {
      "text": "2024 Trends Hydrogen Methanol Wind Push Ahead For Passenger Ships 78825",
      "url": "https://www.rivieramm.com/news-content-hub/news-content-hub/2024-trends-hydrogen-methanol-wind-push-ahead-for-passenger-ships-78825",
      "domain": "rivieramm.com",
      "type": "citation"
    },
    {
      "text": "The Worlds Largest Cruise Ship Is A Climate Liability",
      "url": "https://gcaptain.com/the-worlds-largest-cruise-ship-is-a-climate-liability/",
      "domain": "gcaptain.com",
      "type": "citation"
    },
    {
      "text": "Game Changer For The Environment",
      "url": "https://www.yara.com/knowledge-grows/game-changer-for-the-environment/",
      "domain": "yara.com",
      "type": "citation"
    },
    {
      "text": "Worlds First Fully Electric Autonomous Container Vessel Yara Birkeland Celebrates 3 Years Of Service",
      "url": "https://www.leclanche.com/worlds-first-fully-electric-autonomous-container-vessel-yara-birkeland-celebrates-3-years-of-service/",
      "domain": "leclanche.com",
      "type": "citation"
    },
    {
      "text": "Autonomous Shipping.aspx",
      "url": "https://www.imo.org/en/MediaCentre/HotTopics/Pages/Autonomous-shipping.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Massrse2021.aspx",
      "url": "https://www.imo.org/en/MediaCentre/PressBriefings/pages/MASSRSE2021.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Maritime Trade Under Pressure Growth Set Stall 2025",
      "url": "https://unctad.org/news/maritime-trade-under-pressure-growth-set-stall-2025",
      "domain": "unctad.org",
      "type": "citation"
    },
    {
      "text": "2025 Global Supply Chain Trends",
      "url": "https://www.chrobinson.com/en-us/resources/blog/2025-global-supply-chain-trends/",
      "domain": "chrobinson.com",
      "type": "citation"
    },
    {
      "text": "S41467 025 64437 4",
      "url": "https://www.nature.com/articles/s41467-025-64437-4",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Central Arctic Shipping Route",
      "url": "https://arcticportal.org/shipping-portlet/shipping-routes/central-arctic-shipping-route",
      "domain": "arcticportal.org",
      "type": "citation"
    },
    {
      "text": "Increase In Arctic Shipping",
      "url": "https://arctic-council.org/news/increase-in-arctic-shipping/",
      "domain": "arctic-council.org",
      "type": "citation"
    },
    {
      "text": "Digital Twin Technology In Ship Design And Maintenance Optimizing Vessel Performance Predictive Maintenance And Regulatory Compliance",
      "url": "https://www.mewburn.com/news-insights/digital-twin-technology-in-ship-design-and-maintenance-optimizing-vessel-performance-predictive-maintenance-and-regulatory-compliance",
      "domain": "mewburn.com",
      "type": "citation"
    },
    {
      "text": "Ai Digital Twins Help Design Cyber Secure Green Sovs 86225",
      "url": "https://www.rivieramm.com/news-content-hub/news-content-hub/ai-digital-twins-help-design-cyber-secure-green-sovs-86225",
      "domain": "rivieramm.com",
      "type": "citation"
    },
    {
      "text": "Ai In Shipbuilding",
      "url": "https://www.ssi-corporate.com/blog-lighthouse/ai-in-shipbuilding/",
      "domain": "ssi-corporate.com",
      "type": "citation"
    },
    {
      "text": "01shortsea.pdf",
      "url": "https://www.itf-oecd.org/sites/default/files/docs/01shortsea.pdf",
      "domain": "itf-oecd.org",
      "type": "citation"
    },
    {
      "text": "Rtireportchapter12.pdf",
      "url": "https://www.ams.usda.gov/sites/default/files/media/RTIReportChapter12.pdf",
      "domain": "ams.usda.gov",
      "type": "citation"
    },
    {
      "text": "2 Transport Fluvial De Marchandises",
      "url": "https://inland-navigation-market.org/chapitre/2-transport-fluvial-de-marchandises/?lang=en",
      "domain": "inland-navigation-market.org",
      "type": "citation"
    },
    {
      "text": "River Barges Rhine Remote Reefer Monitoring",
      "url": "https://www.identecsolutions.com/news/river-barges-rhine-remote-reefer-monitoring",
      "domain": "identecsolutions.com",
      "type": "citation"
    },
    {
      "text": "Short Sea Shipping Facts In Focus.pdf",
      "url": "https://metrovancouver.org/services/regional-planning/Documents/short-sea-shipping-facts-in-focus.pdf",
      "domain": "metrovancouver.org",
      "type": "citation"
    },
    {
      "text": "Great Lakes Ships",
      "url": "https://www.eekwi.org/great-lakes/humans-and-great-lakes/great-lakes-ships",
      "domain": "eekwi.org",
      "type": "citation"
    },
    {
      "text": "Self Unloading Technology",
      "url": "https://www.americansteamship.com/fleet-and-operations/self-unloading-technology/",
      "domain": "americansteamship.com",
      "type": "citation"
    },
    {
      "text": "367284432 Options For Shallow Water Climate Resilient Vessels D22",
      "url": "https://www.researchgate.net/publication/367284432_Options_for_shallow-water_climate_resilient_vessels_D22",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Fulltext04.pdf",
      "url": "https://www.diva-portal.org/smash/get/diva2:1689576/FULLTEXT04.pdf",
      "domain": "diva-portal.org",
      "type": "citation"
    },
    {
      "text": "Index.php",
      "url": "https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Inland_waterway_freight_transport_-_quarterly_and_annual_data",
      "domain": "ec.europa.eu",
      "type": "citation"
    },
    {
      "text": "Overview Us Waterborne Foreign And Domestic Freight",
      "url": "https://www.bts.gov/content/overview-us-waterborne-foreign-and-domestic-freight",
      "domain": "bts.gov",
      "type": "citation"
    },
    {
      "text": "353671324 Status Of Inland Waterway Transport In China",
      "url": "https://www.researchgate.net/publication/353671324_Status_of_Inland_Waterway_Transport_in_China",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Moving From Roads To Rivers The Tremendous Potential Of Inland",
      "url": "https://blogs.worldbank.org/en/transport/moving-from-roads-to-rivers--the-tremendous-potential-of-inland-",
      "domain": "blogs.worldbank.org",
      "type": "citation"
    },
    {
      "text": "Pe22 N053 463.html",
      "url": "https://www.destatis.de/EN/Press/2022/08/PE22_N053_463.html",
      "domain": "destatis.de",
      "type": "citation"
    },
    {
      "text": "Review Maritime Transport 2023",
      "url": "https://unctad.org/publication/review-maritime-transport-2023",
      "domain": "unctad.org",
      "type": "citation"
    },
    {
      "text": "A Guide To Bulk Vessel Sizes",
      "url": "https://www.clarksons.com/glossary/a-guide-to-bulk-vessel-sizes/",
      "domain": "clarksons.com",
      "type": "citation"
    },
    {
      "text": "Teu",
      "url": "https://www.inboundlogistics.com/articles/teu/",
      "domain": "inboundlogistics.com",
      "type": "citation"
    },
    {
      "text": "Ro Ro What It Is How It Works Benefits",
      "url": "https://www.savinodelbene.com/ro-ro-what-it-is-how-it-works-benefits/",
      "domain": "savinodelbene.com",
      "type": "citation"
    },
    {
      "text": "Different Types Of Tankers Extensive Classification Of Tanker Ships",
      "url": "https://www.marineinsight.com/types-of-ships/different-types-of-tankers-extensive-classification-of-tanker-ships/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Crew Services",
      "url": "https://vgrouplimited.com/marine-services/crew-services/",
      "domain": "vgrouplimited.com",
      "type": "citation"
    },
    {
      "text": "Msc 110th Session.aspx",
      "url": "https://www.imo.org/en/mediacentre/meetingsummaries/pages/msc-110th-session.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Maritime Trends Innovations",
      "url": "https://www.startus-insights.com/innovators-guide/maritime-trends-innovations/",
      "domain": "startus-insights.com",
      "type": "citation"
    },
    {
      "text": "Offshore Support Vessels.html",
      "url": "https://ww2.eagle.org/en/Products-and-Services/offshore-energy/offshore-support-vessels.html",
      "domain": "ww2.eagle.org",
      "type": "citation"
    },
    {
      "text": "Tidewater",
      "url": "https://www.noia.org/tidewater/",
      "domain": "noia.org",
      "type": "citation"
    },
    {
      "text": "Cgchealy",
      "url": "https://www.pacificarea.uscg.mil/Our-Organization/Cutters/cgcHealy/",
      "domain": "pacificarea.uscg.mil",
      "type": "citation"
    },
    {
      "text": "Rrs Sir David Attenborough",
      "url": "https://www.bas.ac.uk/polar-operations/sites-and-facilities/facility/rrs-sir-david-attenborough/",
      "domain": "bas.ac.uk",
      "type": "citation"
    },
    {
      "text": "Subsea Cables",
      "url": "https://boskalis.com/activities/offshore-energy/subsea-cables",
      "domain": "boskalis.com",
      "type": "citation"
    },
    {
      "text": "Orange Orders Two Advanced Cable Maintenance Ships",
      "url": "https://www.marinelog.com/news/orange-orders-two-advanced-cable-maintenance-ships/",
      "domain": "marinelog.com",
      "type": "citation"
    },
    {
      "text": "Dredging Activities And Equipment",
      "url": "https://porteconomicsmanagement.org/pemp/contents/part4/port-terminal-construction/dredging-activities-and-equipment/",
      "domain": "porteconomicsmanagement.org",
      "type": "citation"
    },
    {
      "text": "Top Cruise Lines Readers Choice Awards 2014",
      "url": "https://www.cntraveler.com/galleries/2014-10-20/top-cruise-lines-readers-choice-awards-2014",
      "domain": "cntraveler.com",
      "type": "citation"
    },
    {
      "text": "How Dynamic Positioning Helps Offshore Vessels Remain Stable And Safe.html",
      "url": "https://www.nautinst.org/resources-page/how-dynamic-positioning-helps-offshore-vessels-remain-stable-and-safe.html",
      "domain": "nautinst.org",
      "type": "citation"
    },
    {
      "text": "Understanding Offshore Support Vessels An Essential Guide",
      "url": "https://ouco-industry.com/understanding-offshore-support-vessels-an-essential-guide/",
      "domain": "ouco-industry.com",
      "type": "citation"
    },
    {
      "text": "Labs And Workshops",
      "url": "https://www.bas.ac.uk/polar-operations/sites-and-facilities/facility/rrs-sir-david-attenborough/science-facilities/labs-and-workshops/",
      "domain": "bas.ac.uk",
      "type": "citation"
    },
    {
      "text": "First U S Warship Fitted For Hypersonic Missiles Back In The Water",
      "url": "https://news.usni.org/2024/12/06/first-u-s-warship-fitted-for-hypersonic-missiles-back-in-the-water",
      "domain": "news.usni.org",
      "type": "citation"
    },
    {
      "text": "Wood To Welding The Evolution Of Shipbuilding Materials",
      "url": "https://hec.lrfoundation.org.uk/whats-on/stories/wood-to-welding-the-evolution-of-shipbuilding-materials",
      "domain": "hec.lrfoundation.org.uk",
      "type": "citation"
    },
    {
      "text": "History Of Steel In Shipbuilding",
      "url": "https://beamcut.com/history-of-steel-in-shipbuilding/",
      "domain": "beamcut.com",
      "type": "citation"
    },
    {
      "text": "Green Ship Recycling.aspx",
      "url": "https://www.imo.org/en/OurWork/Environment/Pages/Green-Ship-Recycling.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "403.pdf",
      "url": "https://www.shipstructure.org/pdf/403.pdf",
      "domain": "shipstructure.org",
      "type": "citation"
    },
    {
      "text": "Marine Vessel Construction Materials",
      "url": "https://inthebite.com/2022/03/marine-vessel-construction-materials/",
      "domain": "inthebite.com",
      "type": "citation"
    },
    {
      "text": "Spills Never Happened Thanks Double Hulls",
      "url": "https://blog.response.restoration.noaa.gov/spills-never-happened-thanks-double-hulls",
      "domain": "blog.response.restoration.noaa.gov",
      "type": "citation"
    },
    {
      "text": "25 Years After Exxon Valdez U S Mandates Double Hulled Oil Tankers",
      "url": "https://www.ijpr.org/northwest-environmental-news/2014-12-30/25-years-after-exxon-valdez-u-s-mandates-double-hulled-oil-tankers",
      "domain": "ijpr.org",
      "type": "citation"
    },
    {
      "text": "4",
      "url": "https://nap.nationalacademies.org/read/9131/chapter/4",
      "domain": "nap.nationalacademies.org",
      "type": "citation"
    },
    {
      "text": "Understanding Block Coefficient Of A Ship",
      "url": "https://www.marineinsight.com/naval-architecture/understanding-block-coefficient-of-a-ship/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Form Coefficient Of Ship",
      "url": "https://nautilusshipping.com/news-and-insights/form-coefficient-of-ship",
      "domain": "nautilusshipping.com",
      "type": "citation"
    },
    {
      "text": "Coefficients Of Form",
      "url": "https://www.wartsila.com/encyclopedia/term/coefficients-of-form",
      "domain": "wartsila.com",
      "type": "citation"
    },
    {
      "text": "1126972358955983",
      "url": "https://www.facebook.com/groups/878845303768691/posts/1126972358955983/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "Different Types Ships Sterns",
      "url": "https://www.marineinsight.com/naval-architecture/different-types-ships-sterns/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Importance Of Ships Keel And Types Of Keel",
      "url": "https://www.marineinsight.com/naval-architecture/importance-of-ships-keel-and-types-of-keel/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Choosing A Yacht Bilge Keels Vs Fin Keels",
      "url": "https://uk.boats.com/boat-buyers-guide/choosing-a-yacht-bilge-keels-vs-fin-keels/",
      "domain": "uk.boats.com",
      "type": "citation"
    },
    {
      "text": "Biggest Oil Tanker Ever Constructed",
      "url": "https://www.marineinsight.com/know-more/biggest-oil-tanker-ever-constructed/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Seawise Giant The Largest Ship Ever Built Knock Nevis",
      "url": "https://maritimepage.com/seawise-giant-the-largest-ship-ever-built-knock-nevis/",
      "domain": "maritimepage.com",
      "type": "citation"
    },
    {
      "text": "A.1118%2820%29.pdf",
      "url": "https://www.imo.org/en/KnowledgeCentre/IndexofIMOResolutions/SOLASDocuments/A.1118%2820%29.pdf",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Water Tight Bulkheads On Ships Construction And Arrangement",
      "url": "https://www.marineinsight.com/naval-architecture/water-tight-bulkheads-on-ships-construction-and-arrangement/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Ui Sc156 Rev.3 Jul 2024 Cln.pdf",
      "url": "https://www.classnk.or.jp/hp/pdf/info_service/iacs_ur_and_ui/ui_sc156_rev.3_jul_2024_cln.pdf",
      "domain": "classnk.or.jp",
      "type": "citation"
    },
    {
      "text": "Cargo Hold Design Types Of Ships",
      "url": "https://www.marineinsight.com/naval-architecture/cargo-hold-design-types-of-ships/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Arrangement.html",
      "url": "https://bulkcarrierguide.com/arrangement.html",
      "domain": "bulkcarrierguide.com",
      "type": "citation"
    },
    {
      "text": "A Guide To Ballast Tanks On Ships",
      "url": "https://www.marineinsight.com/naval-architecture/a-guide-to-ballast-tanks-on-ships/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Superstructure Of Ships Requirements Of Good Design Types Of Loads Acting",
      "url": "https://www.marineinsight.com/naval-architecture/superstructure-of-ships-requirements-of-good-design-types-of-loads-acting/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Superstructure",
      "url": "https://captaindamley.net/e-modules/general-ship-knowledge/superstructure/",
      "domain": "captaindamley.net",
      "type": "citation"
    },
    {
      "text": "Ergo Guide Sept21.pdf",
      "url": "https://ww2.eagle.org/content/dam/eagle/rules-and-guides/current/other/201_ergonomic_notations_2021/ergo-guide-sept21.pdf",
      "domain": "ww2.eagle.org",
      "type": "citation"
    },
    {
      "text": "F",
      "url": "https://www.ilo.org/dyn/normlex/en/f?p=1000:12100:0::NO::P12100_ILO_CODE:C186",
      "domain": "ilo.org",
      "type": "citation"
    },
    {
      "text": "International Association Of Classification Societies Rec No 132.pdf",
      "url": "https://sea-health-and-welfare.squarespace.com/s/International-Association-of-Classification-Societies-rec-No-132.pdf",
      "domain": "sea-health-and-welfare.squarespace.com",
      "type": "citation"
    },
    {
      "text": "55",
      "url": "https://www.mdpi.com/2411-5134/6/3/55",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Iww Pt5 Ch13 2.html",
      "url": "https://www.imorules.com/IWW_PT5_CH13_2.html",
      "domain": "imorules.com",
      "type": "citation"
    },
    {
      "text": "Ts406.pdf",
      "url": "https://civamblog.files.wordpress.com/2016/11/ts406.pdf",
      "domain": "civamblog.files.wordpress.com",
      "type": "citation"
    },
    {
      "text": "Azipod",
      "url": "https://new.abb.com/marine/systems-and-solutions/azipod",
      "domain": "new.abb.com",
      "type": "citation"
    },
    {
      "text": "Sailing Ship Rigs",
      "url": "https://maritimemuseum.novascotia.ca/research/sailing-ship-rigs",
      "domain": "maritimemuseum.novascotia.ca",
      "type": "citation"
    },
    {
      "text": "Introduction To Rigging.pdf",
      "url": "https://www.nationalhistoricships.org.uk/sites/default/files/data/files/resources/801/Introduction-to-Rigging.pdf",
      "domain": "nationalhistoricships.org.uk",
      "type": "citation"
    },
    {
      "text": "Re Introducing Steam Power Into Commercial Maritime Propulsion",
      "url": "https://maritime-executive.com/editorials/re-introducing-steam-power-into-commercial-maritime-propulsion",
      "domain": "maritime-executive.com",
      "type": "citation"
    },
    {
      "text": "Engines",
      "url": "https://wingd.com/products-solutions/engines/",
      "domain": "wingd.com",
      "type": "citation"
    },
    {
      "text": "Marine Engine Market 100771",
      "url": "https://www.fortunebusinessinsights.com/industry-reports/marine-engine-market-100771",
      "domain": "fortunebusinessinsights.com",
      "type": "citation"
    },
    {
      "text": "Electric And Hybrid Ferries",
      "url": "https://corvusenergy.com/electric-and-hybrid-ferries",
      "domain": "corvusenergy.com",
      "type": "citation"
    },
    {
      "text": "Electric Ferries.html",
      "url": "https://www.siemens-energy.com/us/en/home/stories/electric-ferries.html",
      "domain": "siemens-energy.com",
      "type": "citation"
    },
    {
      "text": "Controllable Pitch Propeller Cpp Vs Fixed Pitch Propeller Fpp",
      "url": "https://www.marineinsight.com/naval-architecture/controllable-pitch-propeller-cpp-vs-fixed-pitch-propeller-fpp/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Propulsion Optimization Solutions",
      "url": "https://www.bergpropulsion.com/propulsion-optimization-solutions/",
      "domain": "bergpropulsion.com",
      "type": "citation"
    },
    {
      "text": "Marine Biofuel Report Final Oct 2017.pdf",
      "url": "https://www.ieabioenergy.com/wp-content/uploads/2018/02/Marine-biofuel-report-final-Oct-2017.pdf",
      "domain": "ieabioenergy.com",
      "type": "citation"
    },
    {
      "text": "Alternative Fuels.html",
      "url": "https://www.dnv.com/maritime/insights/topics/alternative-fuels.html",
      "domain": "dnv.com",
      "type": "citation"
    },
    {
      "text": "23.html",
      "url": "https://www.emsa.europa.eu/fc-default-view/download/1626/1376/23.html",
      "domain": "emsa.europa.eu",
      "type": "citation"
    },
    {
      "text": "Wartsila O Marine Encyclopedia.pdf",
      "url": "https://maritimesafetyinnovationlab.org/wp-content/uploads/2017/04/wartsila-o-marine-encyclopedia.pdf",
      "domain": "maritimesafetyinnovationlab.org",
      "type": "citation"
    },
    {
      "text": "Mk Ii Electronics Lecture 2021%2c V12.4.pdf",
      "url": "https://www.usna.edu/Sailing/_files/documents/2020_OSTS/MK_II_Electronics_Lecture_2021%2C_v12.4.pdf",
      "domain": "usna.edu",
      "type": "citation"
    },
    {
      "text": "Msc.252%2883%29.pdf",
      "url": "https://wwwcdn.imo.org/localresources/en/KnowledgeCentre/IndexofIMOResolutions/MSCResolutions/MSC.252%2883%29.pdf",
      "domain": "wwwcdn.imo.org",
      "type": "citation"
    },
    {
      "text": "M3%2520from%2520management%2520to%2520operation%2520final.pdf",
      "url": "https://wwwcdn.imo.org/localresources/en/OurWork/Environment/Documents/Air%2520pollution/M3%2520from%2520management%2520to%2520operation%2520final.pdf",
      "domain": "wwwcdn.imo.org",
      "type": "citation"
    },
    {
      "text": "7",
      "url": "https://www.nap.edu/read/10708/chapter/7",
      "domain": "nap.edu",
      "type": "citation"
    },
    {
      "text": "Yacht.pdf",
      "url": "https://radionavlab.ae.utexas.edu/images/stories/files/papers/yacht.pdf",
      "domain": "radionavlab.ae.utexas.edu",
      "type": "citation"
    },
    {
      "text": "Colreg.aspx",
      "url": "https://www.imo.org/en/about/conventions/pages/colreg.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "University Physics (openstax",
      "url": "https://phys.libretexts.org/Bookshelves/University_Physics/University_Physics_(OpenStax",
      "domain": "phys.libretexts.org",
      "type": "citation"
    },
    {
      "text": "What Is The Metacentric Height Of A Ship",
      "url": "https://maritimepage.com/what-is-the-metacentric-height-of-a-ship/",
      "domain": "maritimepage.com",
      "type": "citation"
    },
    {
      "text": "International Convention On Load Lines.aspx",
      "url": "https://www.imo.org/en/About/Conventions/Pages/International-Convention-on-Load-Lines.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Inclining Experiment Determining Metacentric Height Of The Ship",
      "url": "https://www.marineinsight.com/naval-architecture/inclining-experiment-determining-metacentric-height-of-the-ship/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Floodable Length",
      "url": "https://www.sciencedirect.com/topics/engineering/floodable-length",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Ship Resistance",
      "url": "https://www.sciencedirect.com/topics/engineering/ship-resistance",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Nombre De Froude.htm",
      "url": "https://www.mecaflux.com/en/nombre_de_froude.htm",
      "domain": "mecaflux.com",
      "type": "citation"
    },
    {
      "text": "Basic Principles Of Ship Propulsion Eng.pdf",
      "url": "https://www.man-es.com/docs/default-source/document-sync/basic-principles-of-ship-propulsion-eng.pdf",
      "domain": "man-es.com",
      "type": "citation"
    },
    {
      "text": "S0029801824000295",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0029801824000295",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "1234",
      "url": "https://www.mdpi.com/2077-1312/9/11/1234",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "En455 Chapter1.pdf",
      "url": "https://www.usna.edu/NAOE/_files/documents/Courses/EN455/EN455_Chapter1.pdf",
      "domain": "usna.edu",
      "type": "citation"
    },
    {
      "text": "S2092678218301031",
      "url": "https://www.sciencedirect.com/science/article/pii/S2092678218301031",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Shipdesignandstability Default.aspx",
      "url": "https://www.imo.org/en/OurWork/Safety/Pages/ShipDesignAndStability-default.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Damagestability.aspx",
      "url": "https://www.imo.org/en/OurWork/Safety/Pages/DamageStability.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Summaryofsolaschapterii 2 Default.aspx",
      "url": "https://www.imo.org/en/ourwork/safety/pages/summaryofsolaschapterii-2-default.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Fireprotection Default.aspx",
      "url": "https://www.imo.org/en/OurWork/Safety/Pages/FireProtection-default.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "1162.pdf",
      "url": "https://wwwcdn.imo.org/localresources/en/OurWork/Safety/Documents/1162.pdf",
      "domain": "wwwcdn.imo.org",
      "type": "citation"
    },
    {
      "text": "Fatigue.aspx",
      "url": "https://www.imo.org/en/OurWork/HumanElement/Pages/Fatigue.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Portstatecontrol.aspx",
      "url": "https://www.imo.org/en/ourwork/msas/pages/portstatecontrol.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Recognized Organizations.aspx",
      "url": "https://www.imo.org/en/OurWork/IIIS/Pages/Recognized-Organizations.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Austin Jr. D. Comparative Feasibility Investment Study Between Newly Built And Secondhand Post Panama Container Vessels.pdf",
      "url": "https://thesis.eur.nl/pub/33241/Austin-jr.-D.-Comparative-Feasibility-Investment-Study-between-Newly-Built-and-Secondhand-Post-Panama-Container-Vessels.pdf",
      "domain": "thesis.eur.nl",
      "type": "citation"
    },
    {
      "text": "Different Stages Of Ship Design Explained",
      "url": "https://www.marineinsight.com/naval-architecture/different-stages-of-ship-design-explained/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Marine Design Solutions",
      "url": "https://plm.sw.siemens.com/en-US/nx/cad-online/workflows/marine-design-solutions/",
      "domain": "plm.sw.siemens.com",
      "type": "citation"
    },
    {
      "text": "Software",
      "url": "https://www.napa.fi/software-and-services/ship-design/software/",
      "domain": "napa.fi",
      "type": "citation"
    },
    {
      "text": "Marine",
      "url": "https://www.rhino3d.com/en/for/marine/",
      "domain": "rhino3d.com",
      "type": "citation"
    },
    {
      "text": "Top 20 Software Used In Naval Architecture",
      "url": "https://www.marineinsight.com/naval-architecture/top-20-software-used-in-naval-architecture/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Roles And Responsibilities Of Classification Societies",
      "url": "https://www.shippingandfreightresource.com/roles-and-responsibilities-of-classification-societies/",
      "domain": "shippingandfreightresource.com",
      "type": "citation"
    },
    {
      "text": "245",
      "url": "https://shipjournal.co/index.php/sst/article/view/245",
      "domain": "shipjournal.co",
      "type": "citation"
    },
    {
      "text": "Ship25 A New Standard Form Shipbuilding Contract For A New Era",
      "url": "https://www.wr.no/en/news/ship25-a-new-standard-form-shipbuilding-contract-for-a-new-era",
      "domain": "wr.no",
      "type": "citation"
    },
    {
      "text": "Rb9116.html",
      "url": "https://www.rand.org/pubs/research_briefs/RB9116.html",
      "domain": "rand.org",
      "type": "citation"
    },
    {
      "text": "Gao 09 322.pdf",
      "url": "https://www.gao.gov/assets/gao-09-322.pdf",
      "domain": "gao.gov",
      "type": "citation"
    },
    {
      "text": "Lessons From Shipbuilding Productivity",
      "url": "https://www.construction-physics.com/p/lessons-from-shipbuilding-productivity",
      "domain": "construction-physics.com",
      "type": "citation"
    },
    {
      "text": "Duke Kiet Korea And The Shipbuilding Gvc Ch 4.pdf",
      "url": "https://www.globalvaluechains.org/wp-content/uploads/Duke_KIET_Korea_and_the_Shipbuilding_GVC_CH_4.pdf",
      "domain": "globalvaluechains.org",
      "type": "citation"
    },
    {
      "text": "Dry Dock Types Of Dry Docks Requirements For Dry Dock",
      "url": "https://www.marineinsight.com/guidelines/dry-dock-types-of-dry-docks-requirements-for-dry-dock/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Fabricating",
      "url": "https://www.osha.gov/ship-building-repair/fabricating",
      "domain": "osha.gov",
      "type": "citation"
    },
    {
      "text": "11 Tips For Welding Aluminum In Shipbuilding",
      "url": "https://www.lincolnelectric.com/en/welding-and-cutting-resource-center/process-and-theory/11-tips-for-welding-aluminum-in-shipbuilding",
      "domain": "lincolnelectric.com",
      "type": "citation"
    },
    {
      "text": "Shipbuilders Embrace Robotics Amid Labor Shortage",
      "url": "https://www.koreatimes.co.kr/business/companies/20231014/shipbuilders-embrace-robotics-amid-labor-shortage",
      "domain": "koreatimes.co.kr",
      "type": "citation"
    },
    {
      "text": "Anti Fouling System.aspx",
      "url": "https://www.imo.org/en/OurWork/Environment/Pages/Anti-fouling-System.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Common Welding Methods Weld Defects Shipbuilding Industry",
      "url": "https://www.marineinsight.com/naval-architecture/common-welding-methods-weld-defects-shipbuilding-industry/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Cathodic Protection Gn Dec17.pdf",
      "url": "https://ww2.eagle.org/content/dam/eagle/rules-and-guides/current/conventional_ocean_service/289_cathodicprotectionofships_2017/cathodic-protection-gn-dec17.pdf",
      "domain": "ww2.eagle.org",
      "type": "citation"
    },
    {
      "text": "Sulphur 2020.aspx",
      "url": "https://www.imo.org/en/mediacentre/hottopics/pages/sulphur-2020.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Ultrasonic Thickness Measurements On Ships A Non Destructive Method Of Measuring Hull Corrosion",
      "url": "https://www.virtuemarine.nl/post/ultrasonic-thickness-measurements-on-ships-a-non-destructive-method-of-measuring-hull-corrosion",
      "domain": "virtuemarine.nl",
      "type": "citation"
    },
    {
      "text": "New Opportunities Drone Use Inspection",
      "url": "https://marine-offshore.bureauveritas.com/insight/business-insights/new-opportunities-drone-use-inspection",
      "domain": "marine-offshore.bureauveritas.com",
      "type": "citation"
    },
    {
      "text": "Drone Surveys The Safer And Smarter Way 103018",
      "url": "https://www.dnv.com/services/drone-surveys-the-safer-and-smarter-way-103018/",
      "domain": "dnv.com",
      "type": "citation"
    },
    {
      "text": "Ship Operating Costs Maritime Vessel Expenses",
      "url": "https://www.shipfinex.com/blog/ship-operating-costs-maritime-vessel-expenses",
      "domain": "shipfinex.com",
      "type": "citation"
    },
    {
      "text": "The Unwanted Ship Break It Or Lay It Up",
      "url": "https://www.marinelog.com/news/the-unwanted-ship-break-it-or-lay-it-up/",
      "domain": "marinelog.com",
      "type": "citation"
    },
    {
      "text": "Ship Recycling.aspx",
      "url": "https://www.imo.org/en/ourwork/environment/pages/ship-recycling.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Inventory Hazardous Materials",
      "url": "https://www.osha.gov/etools/shipyard/shipbreaking/inventory-hazardous-materials",
      "domain": "osha.gov",
      "type": "citation"
    },
    {
      "text": "Default.aspx",
      "url": "https://www.basel.int/Implementation/ShipDismantling/Overview/tabid/2762/Default.aspx",
      "domain": "basel.int",
      "type": "citation"
    },
    {
      "text": "The Hong Kong International Convention For The Safe And Environmentally Sound Recycling Of Ships.aspx",
      "url": "https://www.imo.org/en/about/Conventions/pages/the-hong-kong-international-convention-for-the-safe-and-environmentally-sound-recycling-of-ships.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Turning%2520the%2520tide%2520 %2520ship%2520recycling%2520as%2520a%2520source%2520of%2520green%2520steel%2520in%2520india.pdf",
      "url": "https://www.theclimategroup.org/sites/default/files/2024-12/Turning%2520the%2520Tide%2520-%2520Ship%2520Recycling%2520as%2520a%2520Source%2520of%2520Green%2520Steel%2520in%2520India.pdf",
      "domain": "theclimategroup.org",
      "type": "citation"
    },
    {
      "text": "Ship Recycling Volumes In 2024 Drop To Lowest Levels Since 2005",
      "url": "https://www.lloydslist.com/LL1152167/Ship-recycling-volumes-in-2024-drop-to-lowest-levels-since-2005",
      "domain": "lloydslist.com",
      "type": "citation"
    },
    {
      "text": "Platform Publishes List 2024",
      "url": "https://shipbreakingplatform.org/platform-publishes-list-2024/",
      "domain": "shipbreakingplatform.org",
      "type": "citation"
    },
    {
      "text": "Ship Recycling To Double With 16000 Vessels Expected To Be Scrapped In Next Decade",
      "url": "https://www.marineinsight.com/shipping-news/ship-recycling-to-double-with-16000-vessels-expected-to-be-scrapped-in-next-decade/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "International Convention On Tonnage Measurement Of Ships.aspx",
      "url": "https://www.imo.org/en/About/Conventions/Pages/International-Convention-on-Tonnage-Measurement-of-Ships.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Tm%20convention%20 %20draft%20text%20version%20with%20figures%20tm.5 Circ.6.pdf",
      "url": "https://www.dco.uscg.mil/Portals/9/DCO%20Documents/Marine%20Safety%20Center/Tonnage/TM%20Convention%20-%20Draft%20Text%20Version%20With%20Figures%20TM.5-Circ.6.pdf?ver=2017-06-09-123757-647",
      "domain": "dco.uscg.mil",
      "type": "citation"
    },
    {
      "text": "Deadweight %28dwt%29",
      "url": "https://www.wartsila.com/encyclopedia/term/deadweight-%28dwt%29",
      "domain": "wartsila.com",
      "type": "citation"
    },
    {
      "text": "Principle Dimensions Of Ship.html",
      "url": "https://www.marineengineersknowledge.com/2020/01/principle-dimensions-of-ship.html",
      "domain": "marineengineersknowledge.com",
      "type": "citation"
    },
    {
      "text": "Understanding The Beam Of A Ship",
      "url": "https://www.marineinsight.com/naval-architecture/understanding-the-beam-of-a-ship/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Twenty Foot Equivalent Unit Teu",
      "url": "https://www.freightos.com/glossary/twenty-foot-equivalent-unit-teu/",
      "domain": "freightos.com",
      "type": "citation"
    },
    {
      "text": "Ship Bale Capacity And Ship Grain Capacity",
      "url": "https://www.handybulk.com/ship-bale-capacity-and-ship-grain-capacity/",
      "domain": "handybulk.com",
      "type": "citation"
    },
    {
      "text": "Tonmeasur.pdf",
      "url": "https://www.immersinelblu.com/Mariart/Tonmeasur.pdf",
      "domain": "immersinelblu.com",
      "type": "citation"
    },
    {
      "text": "A Guide To Merchant Navy Officer Ranks",
      "url": "https://www.marineinsight.com/careers-2/a-guide-to-merchant-navy-officer-ranks/",
      "domain": "marineinsight.com",
      "type": "citation"
    },
    {
      "text": "Stcw Convention.aspx",
      "url": "https://www.imo.org/en/ourwork/humanelement/pages/stcw-convention.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "358121 Ship Cranes Complete Guide To Marine Lifting Operations",
      "url": "https://www.marinepublic.com/blogs/training/358121-ship-cranes-complete-guide-to-marine-lifting-operations",
      "domain": "marinepublic.com",
      "type": "citation"
    },
    {
      "text": "A.862%2820%29.pdf",
      "url": "https://wwwcdn.imo.org/localresources/en/KnowledgeCentre/IndexofIMOResolutions/AssemblyDocuments/A.862%2820%29.pdf",
      "domain": "wwwcdn.imo.org",
      "type": "citation"
    },
    {
      "text": "Mg 7 41 3.pdf",
      "url": "https://www.register-iri.com/wp-content/uploads/MG-7-41-3.pdf",
      "domain": "register-iri.com",
      "type": "citation"
    },
    {
      "text": "A Guide To Voyage Planning",
      "url": "https://www.sofarocean.com/posts/a-guide-to-voyage-planning",
      "domain": "sofarocean.com",
      "type": "citation"
    },
    {
      "text": "A.893%2821%29.pdf",
      "url": "https://wwwcdn.imo.org/localresources/en/KnowledgeCentre/IndexofIMOResolutions/AssemblyDocuments/A.893%2821%29.pdf",
      "domain": "wwwcdn.imo.org",
      "type": "citation"
    },
    {
      "text": "Ismcode.aspx",
      "url": "https://www.imo.org/en/ourwork/humanelement/pages/ismcode.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "A.742%2818%29.pdf",
      "url": "https://wwwcdn.imo.org/localresources/en/KnowledgeCentre/IndexofIMOResolutions/AssemblyDocuments/A.742%2818%29.pdf",
      "domain": "wwwcdn.imo.org",
      "type": "citation"
    },
    {
      "text": "Seafarer Workforce Report",
      "url": "https://www.bimco.org/products/publications/titles/seafarer-workforce-report/",
      "domain": "bimco.org",
      "type": "citation"
    },
    {
      "text": "3006",
      "url": "https://www.jmr.unican.es/jmr/article/download/784/810/3006",
      "domain": "jmr.unican.es",
      "type": "citation"
    },
    {
      "text": "Wef Net Zero Industry Tracker 2024 Shipping.pdf",
      "url": "https://reports.weforum.org/docs/WEF_Net_Zero_Industry_Tracker_2024_Shipping.pdf",
      "domain": "reports.weforum.org",
      "type": "citation"
    },
    {
      "text": "Garbage Default.aspx",
      "url": "https://www.imo.org/en/ourwork/environment/pages/garbage-default.aspx",
      "domain": "imo.org",
      "type": "citation"
    },
    {
      "text": "Techgships E.pdf",
      "url": "https://www.basel.int/Portals/4/Basel%20Convention/docs/meetings/sbc/workdoc/techgships-e.pdf",
      "domain": "basel.int",
      "type": "citation"
    },
    {
      "text": "Wcms 107689.pdf",
      "url": "https://www.ilo.org/sites/default/files/wcmsp5/groups/public/@ed_protect/@protrav/@safework/documents/normativeinstrument/wcms_107689.pdf",
      "domain": "ilo.org",
      "type": "citation"
    },
    {
      "text": "5919",
      "url": "https://www.mdpi.com/2071-1050/15/7/5919",
      "domain": "mdpi.com",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "vessel",
      "page": "Vessel"
    },
    {
      "text": "the marine",
      "page": "The_Marine"
    },
    {
      "text": "hydrofoil",
      "page": "Hydrofoil"
    },
    {
      "text": "watercraft",
      "page": "Watercraft"
    },
    {
      "text": "navigation",
      "page": "Navigation"
    },
    {
      "text": "oceans",
      "page": "Ocean's"
    },
    {
      "text": "rivers",
      "page": "Chandrabhaga"
    },
    {
      "text": "cargo",
      "page": "Cargo"
    },
    {
      "text": "military",
      "page": "Military"
    },
    {
      "text": "fishing",
      "page": "Fishing"
    },
    {
      "text": "boats",
      "page": "Trawler"
    },
    {
      "text": "International Maritime Organization",
      "page": "International_Maritime_Organization"
    },
    {
      "text": "ancient Egypt",
      "page": "Ancient_Egypt"
    },
    {
      "text": "2nd millennium",
      "page": "2nd_millennium"
    },
    {
      "text": "Phoenicians",
      "page": "Phoenicia"
    },
    {
      "text": "shipbuilding",
      "page": "Shipbuilding"
    },
    {
      "text": "Kyrenia",
      "page": "Kyrenia"
    },
    {
      "text": "shipwreck",
      "page": "Shipwreck"
    },
    {
      "text": "caravel",
      "page": "Caravel"
    },
    {
      "text": "galleon",
      "page": "Galleon"
    },
    {
      "text": "Dutch",
      "page": "Dutch"
    },
    {
      "text": "fluyt",
      "page": "Fluyt"
    },
    {
      "text": "19th century",
      "page": "19th_century"
    },
    {
      "text": "sail",
      "page": "Sail"
    },
    {
      "text": "propulsion",
      "page": "Propulsion"
    },
    {
      "text": "travel",
      "page": "Travel"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "containerization",
      "page": "Containerization"
    },
    {
      "text": "logistics",
      "page": "Logistics"
    },
    {
      "text": "deadweight tonnage",
      "page": "Deadweight_tonnage"
    },
    {
      "text": "Classification",
      "page": "Classification"
    },
    {
      "text": "IMO",
      "page": "IMO"
    },
    {
      "text": "high-speed craft",
      "page": "High-speed_craft"
    },
    {
      "text": "water",
      "page": "Water"
    },
    {
      "text": "transportation",
      "page": "Aerostar"
    },
    {
      "text": "maritime",
      "page": "Maritime"
    },
    {
      "text": "maritime law",
      "page": "Admiralty_law"
    },
    {
      "text": "United Nations",
      "page": "United_Nations"
    },
    {
      "text": "Law of the Sea",
      "page": "Law_of_the_sea"
    },
    {
      "text": "SOLAS Convention",
      "page": "SOLAS_Convention"
    },
    {
      "text": "submarines",
      "page": "The_Submarines"
    },
    {
      "text": "hovercraft",
      "page": "Hovercraft"
    },
    {
      "text": "land",
      "page": "Land"
    },
    {
      "text": "goods",
      "page": "Storage"
    },
    {
      "text": "exploration",
      "page": "Exploration"
    },
    {
      "text": "international trade",
      "page": "International_trade"
    },
    {
      "text": "nuclear propulsion",
      "page": "Nuclear_propulsion"
    },
    {
      "text": "world economy",
      "page": "World_economy"
    },
    {
      "text": "international waters",
      "page": "International_waters"
    },
    {
      "text": "flag state",
      "page": "Flag_state"
    },
    {
      "text": "nationality",
      "page": "Nationality"
    },
    {
      "text": "structure",
      "page": "Structure"
    },
    {
      "text": "crew",
      "page": "Crew"
    },
    {
      "text": "stern",
      "page": "Stern"
    },
    {
      "text": "steering",
      "page": "Steering"
    },
    {
      "text": "port",
      "page": "Port"
    },
    {
      "text": "steering oar",
      "page": "Steering_oar"
    },
    {
      "text": "hull",
      "page": "Hull"
    },
    {
      "text": "forecastle",
      "page": "Forecastle"
    },
    {
      "text": "superstructure",
      "page": "Superstructure"
    },
    {
      "text": "Lloyd's Register",
      "page": "Lloyd's_Register"
    },
    {
      "text": "oil tanker",
      "page": "Oil_tanker"
    },
    {
      "text": "bulk carrier",
      "page": "Bulk_carrier"
    },
    {
      "text": "American Bureau of Shipping",
      "page": "American_Bureau_of_Shipping"
    },
    {
      "text": "Netherlands",
      "page": "Netherlands"
    },
    {
      "text": "Pesse canoe",
      "page": "Pesse_canoe"
    },
    {
      "text": "the Old Kingdom",
      "page": "The_Old_Kingdom"
    },
    {
      "text": "papyrus",
      "page": "Papyrus"
    },
    {
      "text": "Nile",
      "page": "Nile"
    },
    {
      "text": "Lebanon",
      "page": "Lebanon"
    },
    {
      "text": "Pharaoh",
      "page": "Pharaoh"
    },
    {
      "text": "pyramid",
      "page": "Pyramid"
    },
    {
      "text": "Giza",
      "page": "Giza"
    },
    {
      "text": "Ra",
      "page": "Ra"
    },
    {
      "text": "ancient Greece",
      "page": "Ancient_Greece"
    },
    {
      "text": "trireme",
      "page": "Trireme"
    },
    {
      "text": "galley",
      "page": "Galley"
    },
    {
      "text": "bronze",
      "page": "Bronze"
    },
    {
      "text": "ram",
      "page": "Ram"
    },
    {
      "text": "pine",
      "page": "Pine"
    },
    {
      "text": "joinery",
      "page": "Joinery"
    },
    {
      "text": "capacity",
      "page": "Capacity"
    },
    {
      "text": "merchant",
      "page": "Merchant"
    },
    {
      "text": "trade",
      "page": "Trade"
    },
    {
      "text": "empire",
      "page": "Empire"
    },
    {
      "text": "length",
      "page": "Length"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "Indian Ocean",
      "page": "Indian_Ocean"
    },
    {
      "text": "lateen",
      "page": "Lateen"
    },
    {
      "text": "Arabian Peninsula",
      "page": "Arabian_Peninsula"
    },
    {
      "text": "India",
      "page": "India"
    },
    {
      "text": "East Africa",
      "page": "East_Africa"
    },
    {
      "text": "cuneiform",
      "page": "Cuneiform"
    },
    {
      "text": "copper",
      "page": "Copper"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "junk",
      "page": "Junk"
    },
    {
      "text": "Warring States period",
      "page": "Warring_States_period"
    },
    {
      "text": "plank-on-frame construction",
      "page": "Construction"
    },
    {
      "text": "celestial navigation",
      "page": "Celestial_navigation"
    },
    {
      "text": "Egypt",
      "page": "Egypt"
    },
    {
      "text": "Mesopotamia",
      "page": "Mesopotamia"
    },
    {
      "text": "monocoque",
      "page": "Monocoque"
    },
    {
      "text": "Egyptian",
      "page": "Egyptian"
    },
    {
      "text": "linen",
      "page": "Linen"
    },
    {
      "text": "Greeks",
      "page": "Greeks"
    },
    {
      "text": "Polaris",
      "page": "Polaris"
    },
    {
      "text": "latitude",
      "page": "Latitude"
    },
    {
      "text": "Baltic",
      "page": "Baltic"
    },
    {
      "text": "cog",
      "page": "Cog"
    },
    {
      "text": "Hanseatic League",
      "page": "Hanseatic_League"
    },
    {
      "text": "hulk",
      "page": "Hulk"
    },
    {
      "text": "14th century",
      "page": "14th_century"
    },
    {
      "text": "salt",
      "page": "Salt"
    },
    {
      "text": "herring",
      "page": "Herring"
    },
    {
      "text": "rudder",
      "page": "Rudder"
    },
    {
      "text": "Arab",
      "page": "AR-Ab"
    },
    {
      "text": "draft",
      "page": "Draft"
    },
    {
      "text": "southern Europe",
      "page": "Southern_Europe"
    },
    {
      "text": "15th century",
      "page": "15th_century"
    },
    {
      "text": "Age of Discovery",
      "page": "Age_of_Discovery"
    },
    {
      "text": "Vasco da Gama",
      "page": "Vasco_da_Gama"
    },
    {
      "text": "Africa",
      "page": "Africa"
    },
    {
      "text": "Santa Maria",
      "page": "Santa_Maria"
    },
    {
      "text": "deck",
      "page": "Deck"
    },
    {
      "text": "rigging",
      "page": "Rigging"
    },
    {
      "text": "transatlantic",
      "page": "Transatlantic"
    },
    {
      "text": "Zheng He",
      "page": "Zheng_He"
    },
    {
      "text": "diplomacy",
      "page": "Diplomacy"
    },
    {
      "text": "mass production",
      "page": "Mass_production"
    },
    {
      "text": "steel",
      "page": "Steel"
    },
    {
      "text": "SS *Great Britain*",
      "page": "SS_Great_Britain"
    },
    {
      "text": "engine",
      "page": "Engine"
    },
    {
      "text": "the Atlantic",
      "page": "The_Atlantic"
    },
    {
      "text": "Isambard Kingdom Brunel",
      "page": "Isambard_Kingdom_Brunel"
    },
    {
      "text": "SS *Archimedes*",
      "page": "SS_Archimedes"
    },
    {
      "text": "steamship",
      "page": "Steamship"
    },
    {
      "text": "Gravesend",
      "page": "Gravesend"
    },
    {
      "text": "Portsmouth",
      "page": "Portsmouth"
    },
    {
      "text": "Great Britain",
      "page": "Great_Britain"
    },
    {
      "text": "Belfast",
      "page": "Belfast"
    },
    {
      "text": "prefabrication",
      "page": "Prefabrication"
    },
    {
      "text": "welding",
      "page": "Welding"
    },
    {
      "text": "naval architecture",
      "page": "Naval_architecture"
    },
    {
      "text": "submarine warfare",
      "page": "Submarine_warfare"
    },
    {
      "text": "steam",
      "page": "Steam"
    },
    {
      "text": "T2 tanker",
      "page": "T2_tanker"
    },
    {
      "text": "New York",
      "page": "New_York"
    },
    {
      "text": "Houston",
      "page": "Houston"
    },
    {
      "text": "21st century",
      "page": "21st_century"
    },
    {
      "text": "Ever Given",
      "page": "Ever_Given"
    },
    {
      "text": "Suez Canal",
      "page": "Suez_Canal"
    },
    {
      "text": "economies of scale",
      "page": "Economies_of_scale"
    },
    {
      "text": "liquefied natural gas",
      "page": "Liquefied_natural_gas"
    },
    {
      "text": "hydrogen",
      "page": "Hydrogen"
    },
    {
      "text": "Icon of the Seas",
      "page": "Icon_of_the_Seas"
    },
    {
      "text": "cruise ship",
      "page": "Cruise_ship"
    },
    {
      "text": "methanol",
      "page": "Methanol"
    },
    {
      "text": "Norway",
      "page": "Norway"
    },
    {
      "text": "AI",
      "page": "Ai"
    },
    {
      "text": "MASS",
      "page": "Mass"
    },
    {
      "text": "autonomy",
      "page": "Autonomy"
    },
    {
      "text": "remote control",
      "page": "Remote_control"
    },
    {
      "text": "supply chain",
      "page": "Supply_chain"
    },
    {
      "text": "resilience",
      "page": "Resilience"
    },
    {
      "text": "Climate change",
      "page": "Climate_change"
    },
    {
      "text": "Northern Sea Route",
      "page": "Northern_Sea_Route"
    },
    {
      "text": "container",
      "page": "Container"
    },
    {
      "text": "design",
      "page": "Design"
    },
    {
      "text": "virtual",
      "page": "Virtual"
    },
    {
      "text": "simulation",
      "page": "Simulation"
    },
    {
      "text": "real-time data",
      "page": "Real-time_data"
    },
    {
      "text": "maintenance",
      "page": "Maintenance"
    },
    {
      "text": "fuel efficiency",
      "page": "Fuel_efficiency"
    },
    {
      "text": "offshore",
      "page": "Offshore"
    },
    {
      "text": "wind",
      "page": "Wind"
    },
    {
      "text": "Mississippi River",
      "page": "Mississippi_River"
    },
    {
      "text": "coal",
      "page": "Coal"
    },
    {
      "text": "petroleum",
      "page": "Petroleum"
    },
    {
      "text": "dams",
      "page": "DAMS"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "Rhine",
      "page": "Rhine"
    },
    {
      "text": "iron ore",
      "page": "Iron_ore"
    },
    {
      "text": "short-sea shipping",
      "page": "Short-sea_shipping"
    },
    {
      "text": "North Sea",
      "page": "North_Sea"
    },
    {
      "text": "road transport",
      "page": "Road_transport"
    },
    {
      "text": "North America",
      "page": "North_America"
    },
    {
      "text": "Vancouver",
      "page": "Vancouver"
    },
    {
      "text": "70,000",
      "page": "70,000"
    },
    {
      "text": "bulk cargo",
      "page": "Bulk_cargo"
    },
    {
      "text": "meters",
      "page": "The_Meters"
    },
    {
      "text": "azimuth",
      "page": "Azimuth"
    },
    {
      "text": "Great Lakes",
      "page": "Great_Lakes"
    },
    {
      "text": "commerce",
      "page": "Commerce"
    },
    {
      "text": "goods",
      "page": "Goods"
    },
    {
      "text": "maritime transport",
      "page": "Maritime_transport"
    },
    {
      "text": "manufactured products",
      "page": "Manufacturing"
    },
    {
      "text": "agriculture",
      "page": "Agriculture"
    },
    {
      "text": "sea",
      "page": "Sea"
    },
    {
      "text": "rail",
      "page": "Rail"
    },
    {
      "text": "Twenty-foot Equivalent Unit",
      "page": "Twenty-foot_equivalent_unit"
    },
    {
      "text": "vehicles",
      "page": "Aston_Martin_VH_platform"
    },
    {
      "text": "merchant ships",
      "page": "Merchant_Ships"
    },
    {
      "text": "liquid",
      "page": "Liquid"
    },
    {
      "text": "containment",
      "page": "Containment"
    },
    {
      "text": "temperature control",
      "page": "Temperature_control"
    },
    {
      "text": "volatility",
      "page": "Volatility"
    },
    {
      "text": "energy",
      "page": "Energy"
    },
    {
      "text": "membrane",
      "page": "Membrane"
    },
    {
      "text": "infrastructure",
      "page": "Infrastructure"
    },
    {
      "text": "recreation",
      "page": "Recreation"
    },
    {
      "text": "platforms",
      "page": "Platform"
    },
    {
      "text": "USCGC Healy",
      "page": "USCGC_Healy"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "Coast",
      "page": "Coast"
    },
    {
      "text": "icebreaker",
      "page": "Icebreaker"
    },
    {
      "text": "RRS Sir David Attenborough",
      "page": "RRS_Sir_David_Attenborough"
    },
    {
      "text": "British Antarctic Survey",
      "page": "British_Antarctic_Survey"
    },
    {
      "text": "moon pool",
      "page": "Moon_pool"
    },
    {
      "text": "geology",
      "page": "Geology"
    },
    {
      "text": "telecommunications",
      "page": "Telecommunications"
    },
    {
      "text": "power transmission",
      "page": "Power_transmission"
    },
    {
      "text": "Orange",
      "page": "Orange"
    },
    {
      "text": "Marine",
      "page": "Marine"
    },
    {
      "text": "Red Sea",
      "page": "Red_Sea"
    },
    {
      "text": "suction",
      "page": "Suction"
    },
    {
      "text": "silt",
      "page": "Silt"
    },
    {
      "text": "sand",
      "page": "Sand"
    },
    {
      "text": "leisure",
      "page": "Leisure"
    },
    {
      "text": "Royal",
      "page": "Royal"
    },
    {
      "text": "wildlife observation",
      "page": "Wildlife_observation"
    },
    {
      "text": "Dynamic positioning",
      "page": "Dynamic_positioning"
    },
    {
      "text": "helicopter",
      "page": "Helicopter"
    },
    {
      "text": "data collection",
      "page": "Data_collection"
    },
    {
      "text": "oceanography",
      "page": "Oceanography"
    },
    {
      "text": "environmental monitoring",
      "page": "Environmental_monitoring"
    },
    {
      "text": "combat",
      "page": "Combat"
    },
    {
      "text": "power projection",
      "page": "Power_projection"
    },
    {
      "text": "stealth",
      "page": "Stealth"
    },
    {
      "text": "sailing",
      "page": "Sailing"
    },
    {
      "text": "destroyers",
      "page": "Destroyer"
    },
    {
      "text": "anti-submarine warfare",
      "page": "Anti-submarine_warfare"
    },
    {
      "text": "guided-missile destroyer",
      "page": "Guided-missile_destroyer"
    },
    {
      "text": "Aegis Combat System",
      "page": "Aegis_Combat_System"
    },
    {
      "text": "radar",
      "page": "Radar"
    },
    {
      "text": "missile",
      "page": "Missile"
    },
    {
      "text": "sonar",
      "page": "Sonar"
    },
    {
      "text": "ballistic missile",
      "page": "Ballistic_missile"
    },
    {
      "text": "Tomahawk",
      "page": "Tomahawk"
    },
    {
      "text": "air-independent propulsion",
      "page": "Air-independent_propulsion"
    },
    {
      "text": "nuclear",
      "page": "Nuclear"
    },
    {
      "text": "buoyancy",
      "page": "Buoyancy"
    },
    {
      "text": "Industrial Revolution",
      "page": "Industrial_Revolution"
    },
    {
      "text": "naval vessels",
      "page": "U28"
    },
    {
      "text": "corrosion",
      "page": "Corrosion"
    },
    {
      "text": "fatigue",
      "page": "Fatigue"
    },
    {
      "text": "1950s",
      "page": "1950s"
    },
    {
      "text": "volume",
      "page": "Volume"
    },
    {
      "text": "wave-making resistance",
      "page": "Wave-making_resistance"
    },
    {
      "text": "drag",
      "page": "Drag"
    },
    {
      "text": "rectangle",
      "page": "Rectangle"
    },
    {
      "text": "passenger",
      "page": "Passenger"
    },
    {
      "text": "stability",
      "page": "Stability"
    },
    {
      "text": "appendage",
      "page": "Appendage"
    },
    {
      "text": "Seawise Giant",
      "page": "Seawise_Giant"
    },
    {
      "text": "overall",
      "page": "Length_overall"
    },
    {
      "text": "beam",
      "page": "Beam"
    },
    {
      "text": "ore",
      "page": "Ore"
    },
    {
      "text": "grain",
      "page": "Grain"
    },
    {
      "text": "discharge",
      "page": "Discharge"
    },
    {
      "text": "uniform",
      "page": "Uniform"
    },
    {
      "text": "Ballast",
      "page": "Ballast"
    },
    {
      "text": "trim",
      "page": "Trim"
    },
    {
      "text": "seawater",
      "page": "Seawater"
    },
    {
      "text": "hydrodynamic stability",
      "page": "Hydrodynamic_stability"
    },
    {
      "text": "Panamax",
      "page": "Panamax"
    },
    {
      "text": "gravity",
      "page": "Gravity"
    },
    {
      "text": "the bridge",
      "page": "The_Bridge"
    },
    {
      "text": "access",
      "page": "Access"
    },
    {
      "text": "displacement",
      "page": "Displacement"
    },
    {
      "text": "International Association of Classification Societies",
      "page": "International_Association_of_Classification_Societies"
    },
    {
      "text": "Maritime Labour Convention",
      "page": "Maritime_Labour_Convention"
    },
    {
      "text": "fluids",
      "page": "Fluid"
    },
    {
      "text": "bilge",
      "page": "Bilge"
    },
    {
      "text": "fuel",
      "page": "Fuel"
    },
    {
      "text": "DNV",
      "page": "DNV"
    },
    {
      "text": "mechanical",
      "page": "Mechanical"
    },
    {
      "text": "efficiency",
      "page": "Efficiency"
    },
    {
      "text": "masts",
      "page": "Mast"
    },
    {
      "text": "horizontal",
      "page": "Horizontal"
    },
    {
      "text": "perpendicular",
      "page": "Perpendicular"
    },
    {
      "text": "Wärtsilä-Sulzer RTA96-C",
      "page": "Wärtsilä-Sulzer_RTA96-C"
    },
    {
      "text": "hybrid",
      "page": "Hybrid"
    },
    {
      "text": "Azipod",
      "page": "Azipod"
    },
    {
      "text": "diesel",
      "page": "Diesel"
    },
    {
      "text": "Washington State Ferries",
      "page": "Washington_State_Ferries"
    },
    {
      "text": "thrust",
      "page": "Thrust"
    },
    {
      "text": "control",
      "page": "Control"
    },
    {
      "text": "angle",
      "page": "Angle"
    },
    {
      "text": "CPP",
      "page": "CPP"
    },
    {
      "text": "energy density",
      "page": "Energy_density"
    },
    {
      "text": "MJ",
      "page": "MJ"
    },
    {
      "text": "kg",
      "page": "KG"
    },
    {
      "text": "marine diesel oil",
      "page": "Marine_diesel_oil"
    },
    {
      "text": "heavy fuel oil",
      "page": "Heavy_fuel_oil"
    },
    {
      "text": "fatty acid",
      "page": "Fatty_acid"
    },
    {
      "text": "FAME",
      "page": "FAME"
    },
    {
      "text": "density",
      "page": "Density"
    },
    {
      "text": "L",
      "page": "L'"
    },
    {
      "text": "propeller",
      "page": "Propeller"
    },
    {
      "text": "slipstream",
      "page": "Slipstream"
    },
    {
      "text": "horn",
      "page": "Horn"
    },
    {
      "text": "lift",
      "page": "Lift"
    },
    {
      "text": "tiller",
      "page": "Tiller"
    },
    {
      "text": "stator",
      "page": "Stator"
    },
    {
      "text": "position",
      "page": "Position"
    },
    {
      "text": "Global Positioning System",
      "page": "Global_Positioning_System"
    },
    {
      "text": "International Hydrographic Organization",
      "page": "International_Hydrographic_Organization"
    },
    {
      "text": "situational awareness",
      "page": "Situation_awareness"
    },
    {
      "text": "gyrocompass",
      "page": "Gyrocompass"
    },
    {
      "text": "PID",
      "page": "PID"
    },
    {
      "text": "autopilot",
      "page": "Autopilot"
    },
    {
      "text": "cognitive load",
      "page": "Cognitive_load"
    },
    {
      "text": "redundancy",
      "page": "Redundancy"
    },
    {
      "text": "overtaking",
      "page": "Overtaking"
    },
    {
      "text": "Archimedes' principle",
      "page": "Archimedes'_principle"
    },
    {
      "text": "acceleration due to gravity",
      "page": "Acceleration_due_to_gravity"
    },
    {
      "text": "metacentric height",
      "page": "Metacentric_height"
    },
    {
      "text": "GM",
      "page": "GM"
    },
    {
      "text": "heel",
      "page": "Heel"
    },
    {
      "text": "keel",
      "page": "Keel"
    },
    {
      "text": "KM",
      "page": "KM"
    },
    {
      "text": "formula",
      "page": "Formula"
    },
    {
      "text": "equilibrium",
      "page": "Equilibrium"
    },
    {
      "text": "torque",
      "page": "Torque"
    },
    {
      "text": "capsizing",
      "page": "Capsizing"
    },
    {
      "text": "immersion",
      "page": "Immersion"
    },
    {
      "text": "International Convention on Load Lines",
      "page": "International_Convention_on_Load_Lines"
    },
    {
      "text": "lightship",
      "page": "Lightship"
    },
    {
      "text": "weight",
      "page": "The_Weight"
    },
    {
      "text": "weight distribution",
      "page": "Weight_distribution"
    },
    {
      "text": "centroid",
      "page": "Centroid"
    },
    {
      "text": "fraction",
      "page": "Fraction"
    },
    {
      "text": "survivability",
      "page": "Survivability"
    },
    {
      "text": "tool",
      "page": "Tool"
    },
    {
      "text": "Froude number",
      "page": "Froude_number"
    },
    {
      "text": "gravitational acceleration",
      "page": "Gravitational_acceleration"
    },
    {
      "text": "waterline length",
      "page": "Waterline_length"
    },
    {
      "text": "scaling",
      "page": "Scaling"
    },
    {
      "text": "wave",
      "page": "The_Wave"
    },
    {
      "text": "transition",
      "page": "Transition"
    },
    {
      "text": "flow",
      "page": "Flow"
    },
    {
      "text": "hull speed",
      "page": "Hull_speed"
    },
    {
      "text": "engine power",
      "page": "Engine_power"
    },
    {
      "text": "force",
      "page": "Force"
    },
    {
      "text": "Cavitation",
      "page": "Cavitation"
    },
    {
      "text": "blades",
      "page": "Blade"
    },
    {
      "text": "erosion",
      "page": "Erosion"
    },
    {
      "text": "blade skew",
      "page": "Skew"
    },
    {
      "text": "rake",
      "page": "Rake"
    },
    {
      "text": "Computational fluid dynamics",
      "page": "Computational_fluid_dynamics"
    },
    {
      "text": "flow separation",
      "page": "Flow_separation"
    },
    {
      "text": "resistance",
      "page": "Resistance"
    },
    {
      "text": "bulbous bow",
      "page": "Bulbous_bow"
    },
    {
      "text": "waves",
      "page": "Waves"
    },
    {
      "text": "pitch",
      "page": "Pitch"
    },
    {
      "text": "rotation",
      "page": "Rotation"
    },
    {
      "text": "RAOs",
      "page": "Rao's"
    },
    {
      "text": "wave height",
      "page": "Wave_height"
    },
    {
      "text": "life-saving appliances",
      "page": "Life-saving_appliances"
    },
    {
      "text": "Chapter",
      "page": "Chapter"
    },
    {
      "text": "index",
      "page": "Index"
    },
    {
      "text": "survival",
      "page": "Survival"
    },
    {
      "text": "zoning",
      "page": "Zoning"
    },
    {
      "text": "smoke",
      "page": "Smoke"
    },
    {
      "text": "heat",
      "page": "Heat"
    },
    {
      "text": "accommodation",
      "page": "Accommodation"
    },
    {
      "text": "Watchkeeping",
      "page": "Watchkeeping"
    },
    {
      "text": "teamwork",
      "page": "Teamwork"
    },
    {
      "text": "port state control",
      "page": "Port_state_control"
    },
    {
      "text": "harmonized system",
      "page": "Harmonized_System"
    },
    {
      "text": "market analysis",
      "page": "Market_analysis"
    },
    {
      "text": "return on investment",
      "page": "Return_on_investment"
    },
    {
      "text": "shape",
      "page": "Shape"
    },
    {
      "text": "body",
      "page": "Body"
    },
    {
      "text": "profile",
      "page": "Profile"
    },
    {
      "text": "space",
      "page": "Space"
    },
    {
      "text": "conceptual design",
      "page": "Conceptual_design"
    },
    {
      "text": "3D modeling",
      "page": "3D_modeling"
    },
    {
      "text": "computer-aided design",
      "page": "Computer-aided_design"
    },
    {
      "text": "Siemens NX",
      "page": "Siemens_NX"
    },
    {
      "text": "3D",
      "page": "3D"
    },
    {
      "text": "engineering",
      "page": "Engineering"
    },
    {
      "text": "conceptual framework",
      "page": "Conceptual_framework"
    },
    {
      "text": "systems integration",
      "page": "Integration"
    },
    {
      "text": "piping",
      "page": "Piping"
    },
    {
      "text": "automation",
      "page": "Automation"
    },
    {
      "text": "ABS",
      "page": "ABS"
    },
    {
      "text": "management",
      "page": "Management"
    },
    {
      "text": "critical path method",
      "page": "Critical_path_method"
    },
    {
      "text": "dry",
      "page": "Dry"
    },
    {
      "text": "assembly",
      "page": "Assembly"
    },
    {
      "text": "Hyundai",
      "page": "Hyundai"
    },
    {
      "text": "Samsung Heavy Industries",
      "page": "Samsung_Heavy_Industries"
    },
    {
      "text": "keel laying",
      "page": "Keel_laying"
    },
    {
      "text": "dry dock",
      "page": "Dry_dock"
    },
    {
      "text": "slipway",
      "page": "Slipway"
    },
    {
      "text": "workshop",
      "page": "Workshop"
    },
    {
      "text": "World War II",
      "page": "World_War_II"
    },
    {
      "text": "arc welding",
      "page": "Arc_welding"
    },
    {
      "text": "gas metal arc welding",
      "page": "Gas_metal_arc_welding"
    },
    {
      "text": "gas tungsten arc welding",
      "page": "Gas_tungsten_arc_welding"
    },
    {
      "text": "concrete",
      "page": "Concrete"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "HD Hyundai Heavy Industries",
      "page": "HD_Hyundai_Heavy_Industries"
    },
    {
      "text": "orbital welding",
      "page": "Orbital_welding"
    },
    {
      "text": "laser",
      "page": "Laser"
    },
    {
      "text": "operational efficiency",
      "page": "Operational_efficiency"
    },
    {
      "text": "regulatory compliance",
      "page": "Regulatory_compliance"
    },
    {
      "text": "service life",
      "page": "Service_life"
    },
    {
      "text": "downtime",
      "page": "Downtime"
    },
    {
      "text": "biofouling",
      "page": "Biofouling"
    },
    {
      "text": "submerged arc welding",
      "page": "Submerged_arc_welding"
    },
    {
      "text": "fusion",
      "page": "Fusion"
    },
    {
      "text": "Cathodic protection",
      "page": "Cathodic_protection"
    },
    {
      "text": "zinc",
      "page": "Zinc"
    },
    {
      "text": "current",
      "page": "Current"
    },
    {
      "text": "cathode",
      "page": "Cathode"
    },
    {
      "text": "docking",
      "page": "Docking"
    },
    {
      "text": "exhaust gas",
      "page": "Exhaust_gas"
    },
    {
      "text": "scrubbers",
      "page": "Scrubbers"
    },
    {
      "text": "selective catalytic reduction",
      "page": "Selective_catalytic_reduction"
    },
    {
      "text": "NOx",
      "page": "NOx"
    },
    {
      "text": "Ultrasonic thickness measurement",
      "page": "Ultrasonic_thickness_measurement"
    },
    {
      "text": "plating",
      "page": "Plating"
    },
    {
      "text": "integrity",
      "page": "Integrity"
    },
    {
      "text": "resolution",
      "page": "Resolution"
    },
    {
      "text": "standard",
      "page": "Standard"
    },
    {
      "text": "class",
      "page": "Class"
    },
    {
      "text": "Drone",
      "page": "Drone"
    },
    {
      "text": "Bureau Veritas",
      "page": "Bureau_Veritas"
    },
    {
      "text": "predictive maintenance",
      "page": "Predictive_maintenance"
    },
    {
      "text": "Recycling",
      "page": "Recycling"
    },
    {
      "text": "process",
      "page": "Process"
    },
    {
      "text": "market",
      "page": "Market"
    },
    {
      "text": "Alang",
      "page": "Alang"
    },
    {
      "text": "health",
      "page": "Health"
    },
    {
      "text": "asbestos",
      "page": "Asbestos"
    },
    {
      "text": "insulation",
      "page": "Insulation"
    },
    {
      "text": "Basel Convention",
      "page": "Basel_Convention"
    },
    {
      "text": "informed consent",
      "page": "Informed_consent"
    },
    {
      "text": "Tonnage",
      "page": "Tonnage"
    },
    {
      "text": "size",
      "page": "Size"
    },
    {
      "text": "Gross tonnage",
      "page": "Gross_tonnage"
    },
    {
      "text": "proxy",
      "page": "Proxy"
    },
    {
      "text": "safety",
      "page": "Safety"
    },
    {
      "text": "coefficient",
      "page": "Coefficient"
    },
    {
      "text": "Net tonnage",
      "page": "Net_tonnage"
    },
    {
      "text": "cotton",
      "page": "Cotton"
    },
    {
      "text": "the 13th",
      "page": "The_13th"
    },
    {
      "text": "customs",
      "page": "Customs"
    },
    {
      "text": "gross register tonnage",
      "page": "Gross_register_tonnage"
    },
    {
      "text": "net register tonnage",
      "page": "Net_register_tonnage"
    },
    {
      "text": "canal",
      "page": "Canal"
    },
    {
      "text": "tax avoidance",
      "page": "Tax_avoidance"
    },
    {
      "text": "manning",
      "page": "Manning"
    },
    {
      "text": "hierarchy",
      "page": "Hierarchy"
    },
    {
      "text": "captain",
      "page": "Captain"
    },
    {
      "text": "master",
      "page": "Master"
    },
    {
      "text": "chief engineer",
      "page": "Chief_engineer"
    },
    {
      "text": "breakbulk cargo",
      "page": "Breakbulk_cargo"
    },
    {
      "text": "shear",
      "page": "Shear"
    },
    {
      "text": "resource allocation",
      "page": "Resource_allocation"
    },
    {
      "text": "seafarers",
      "page": "The_Seafarers"
    },
    {
      "text": "cross-cultural",
      "page": "Cross-cultural"
    },
    {
      "text": "carbon dioxide",
      "page": "Carbon_dioxide"
    },
    {
      "text": "invasive species",
      "page": "Invasive_species"
    },
    {
      "text": "light pollution",
      "page": "Light_pollution"
    },
    {
      "text": "operational risk",
      "page": "Operational_risk"
    },
    {
      "text": "SOx",
      "page": "SoX"
    },
    {
      "text": "combustion",
      "page": "Combustion"
    },
    {
      "text": "acid rain",
      "page": "Acid_rain"
    },
    {
      "text": "smog",
      "page": "Smog"
    },
    {
      "text": "eutrophication",
      "page": "Eutrophication"
    },
    {
      "text": "ozone",
      "page": "Ground-level_ozone"
    },
    {
      "text": "oil",
      "page": "Oil!"
    },
    {
      "text": "MARPOL Annex I",
      "page": "Marpol_Annex_I"
    },
    {
      "text": "ppm",
      "page": "PPM"
    },
    {
      "text": "species",
      "page": "Species"
    },
    {
      "text": "biodiversity",
      "page": "Biodiversity"
    },
    {
      "text": "ultraviolet",
      "page": "Ultraviolet"
    },
    {
      "text": "noise",
      "page": "Noise"
    },
    {
      "text": "pollution",
      "page": "Pollution"
    },
    {
      "text": "Noise",
      "page": "NOiSE"
    },
    {
      "text": "invertebrates",
      "page": "Invertebrate"
    },
    {
      "text": "Prince William Sound",
      "page": "Prince_William_Sound"
    },
    {
      "text": "marine pollution",
      "page": "Marine_pollution"
    },
    {
      "text": "garbage",
      "page": "Garbage"
    },
    {
      "text": "food",
      "page": "Food"
    },
    {
      "text": "marine life",
      "page": "Marine_life"
    },
    {
      "text": "ingestion",
      "page": "Ingestion"
    },
    {
      "text": "heavy metals",
      "page": "Heavy_metals"
    },
    {
      "text": "cable",
      "page": "Cable"
    },
    {
      "text": "soil",
      "page": "Soil"
    },
    {
      "text": "cadmium",
      "page": "Cadmium"
    },
    {
      "text": "Basel",
      "page": "Basel"
    },
    {
      "text": "personal protective equipment",
      "page": "Personal_protective_equipment"
    },
    {
      "text": "mesothelioma",
      "page": "Mesothelioma"
    },
    {
      "text": "South Asia",
      "page": "South_Asia"
    },
    {
      "text": "International Labour Organization",
      "page": "International_Labour_Organization"
    },
    {
      "text": "occupational safety and health",
      "page": "Occupational_safety_and_health"
    },
    {
      "text": "2024",
      "page": "2024"
    },
    {
      "text": "Chittagong",
      "page": "Chittagong"
    },
    {
      "text": "Bangladesh",
      "page": "Bangladesh"
    },
    {
      "text": "groundwater",
      "page": "Groundwater"
    },
    {
      "text": "ecosystem",
      "page": "Ecosystem"
    },
    {
      "text": "circular economy",
      "page": "Circular_economy"
    },
    {
      "text": "waste",
      "page": "Waste"
    },
    {
      "text": "light",
      "page": "Light"
    },
    {
      "text": "Electronics",
      "page": "Electronics"
    },
    {
      "text": "gold",
      "page": "Gold"
    },
    {
      "text": "leaching",
      "page": "Leaching"
    },
    {
      "text": "European Green Deal",
      "page": "European_Green_Deal"
    },
    {
      "text": "plasma gasification",
      "page": "Plasma_gasification"
    }
  ],
  "fetched_at": "2025-12-07T07:27:47.077767",
  "elapsed_ms": 820014
}