{
  "topic": "Shohei Ohtani",
  "title": "Shohei Ohtani",
  "slug": "shohei-ohtani",
  "grokipedia_slug": "Shohei_Ohtani",
  "grokipedia_url": "https://grokipedia.com/page/Shohei_Ohtani",
  "source": "grokipedia",
  "content": "# Shohei Ohtani\n\nShohei Ohtani (born July 5, 1994) is a Japanese professional baseball player who serves as a pitcher and designated hitter for the Los Angeles Dodgers of Major League Baseball (MLB). Renowned as a two-way superstar capable of elite performance both hitting and pitching, Ohtani has revolutionized modern baseball by reviving the rare archetype of a player who contributes significantly in both roles, drawing comparisons to Babe Ruth. In 2025, he batted .282 with 55 home runs and 102 RBIs while helping the Dodgers secure their second consecutive World Series championship.\n\nBorn in Oshu, Iwate Prefecture, Japan, Ohtani grew up in an athletic family; his father, Toru, played baseball in Japan's industrial league, and his mother was a competitive badminton player. He attended Hanamaki Higashi High School, where he starred as a two-way player, posting a 1.95 ERA with 209 strikeouts in 163 innings pitched and hitting .687 with 18 home runs as a senior. After high school, Ohtani was selected first overall by the Hokkaido Nippon-Ham Fighters in the 2012 Nippon Professional Baseball (NPB) draft, despite initially expressing interest in jumping directly to MLB.\n\nOhtani's five-season tenure with the Fighters from 2013 to 2017 established him as a NPB sensation, where he batted .274 with 48 home runs and posted a 2.52 ERA with 624 strikeouts in 543 innings as a pitcher. In 2016, he won the Pacific League MVP Award after going 10-4 with a 1.86 ERA and hitting 22 home runs, helping the Fighters capture the Japan Series title. Posted to MLB after the 2017 season, Ohtani signed a landmark contract with the Los Angeles Angels in December 2017 and made his debut on March 29, 2018.\n\nIn MLB, Ohtani earned the American League Rookie of the Year Award in 2018 after hitting .285 with 22 home runs and going 4-2 with a 3.31 ERA in 10 starts. He captured AL MVP honors in 2021 and 2023 with the Angels, becoming the first player to win the award as both a pitcher and hitter. Signing a record 10-year, $700 million contract with the Dodgers in December 2023, Ohtani transitioned to the National League and won the 2024 NL MVP unanimously after becoming the first player in MLB history to achieve 50 home runs and 50 stolen bases in a season. In 2025, he was named NLCS MVP and won his fourth MVP Award unanimously. Additionally, Ohtani earned MVP honors at the 2023 World Baseball Classic, leading Japan to victory.\n\n## Early years\n\n### Early life\n\nShohei Ohtani was born on July 5, 1994, in Mizusawa, Iwate Prefecture, Japan, a region now incorporated into the city of Ōshū.\n\nHe was the youngest of three children in a sports-focused family; his father, Toru Ohtani, was a former pitcher in Japan's industrial league who worked in car assembly, while his mother, Kayoko Ohtani, competed at a national level in badminton. Ohtani's older brother, Ryuta, also pursued baseball in local amateur leagues, and his older sister, Yuka, rounded out the household. The family lived a modest life in rural Iwate, a prefecture characterized by vast countryside, rice fields, and limited urban development, which shaped Ohtani's humble and grounded upbringing.\n\nFrom a young age, Ohtani was immersed in baseball through his father's influence, who played extensive catch sessions with his sons after long workdays and served as coach and manager for their elementary and junior high school teams. Toru began formal training with Ohtani around age 7, when he joined Little League practices, becoming a full member the following year at age 8; this regimen included maintaining a shared notebook to log performances, analyze weaknesses, and track improvements until Ohtani's fifth grade. The approach stressed relentless effort, with principles like running at full speed in every sprint, giving maximum energy during catch, and maintaining high vocal enthusiasm on the field.\n\nDespite the intensity of his baseball involvement, Ohtani's childhood included other pursuits that highlighted his natural athleticism, such as swimming competitively from kindergarten through fifth grade and playfully using his mother's badminton racket as a toddler. These early experiences in Iwate's serene, rural setting fostered a balanced foundation, leading into his high school years where competitive play would intensify.\n\n### Amateur career\n\nOhtani attended Hanamaki Higashi High School in Iwate Prefecture, Japan, from 2010 to 2013, where he decided to focus exclusively on baseball following rigorous family training that emphasized discipline and fundamentals.\n\nAs a junior in 2012, Ohtani posted an undefeated record on the mound with a low ERA and numerous strikeouts, while contributing offensively as a hitter in a two-way role that showcased his versatility. During the qualification for the Koshien tournament that year, he helped lead Hanamaki Higashi to the finals of the Tohoku regional tournament, though the team fell short of advancing to the national event. In his senior year of 2013, Ohtani continued to develop as both a pitcher and position player; by graduation, his fastball velocity had reached up to 100 mph, drawing widespread attention for his rare dual-threat potential.\n\nEntering the 2012 NPB draft, Ohtani expressed interest in pursuing an MLB career immediately and requested that Japanese teams not select him, but the Hokkaido Nippon-Ham Fighters chose him first overall, convincing him to join by promising to develop him as a two-way player in Japan to further hone his skills before transitioning abroad.\n\n## Japanese professional career\n\n### Early NPB seasons (2013–2014)\n\nShohei Ohtani began his professional career with the Hokkaido Nippon-Ham Fighters in Japan's Nippon Professional Baseball (NPB) Pacific League in 2013, shortly after graduating from high school where he had established himself as a two-way talent. As an 18-year-old rookie, Ohtani split time between pitching and outfield duties, appearing in 77 games as a hitter while making 13 pitching appearances. His rookie season showcased his versatility but also the adjustments required for professional play; he batted .238 with 3 home runs and 20 RBIs, primarily in right field, and on the mound went 3–0 with a 4.23 ERA over 61⅔ innings, allowing 33 walks against 46 strikeouts. Despite the modest numbers, his potential earned him a spot in the 2013 NPB All-Star Game, where he pitched and played the outfield in the same contest.\n\nIn 2014, Ohtani's second season, he demonstrated marked improvement, particularly as a pitcher, while continuing to balance dual roles amid a demanding schedule. He made 24 starts on the mound, achieving an 11–4 record with a 2.61 ERA across 155⅓ innings and 179 strikeouts, including three complete games and two shutouts—his first such milestones in professional baseball. Offensively, he appeared in 87 games, batting .274 with 10 home runs and 31 RBIs, often serving as the designated hitter or outfielder. This progress led to his second NPB All-Star selection and solidified his reputation as the league's premier two-way prospect. The Fighters, however, remained in the middle of the Pacific League pack, finishing sixth in 2013 with a 64–78–2 record and third in 2014 at 73–68–3, missing the postseason both years.\n\nThroughout these early seasons, Ohtani grappled with the physical and logistical challenges of maintaining a two-way role, including managing a heavy workload that limited his batting opportunities and occasional minor injuries, such as recurring leg cramps that impacted his hitting in 2014. These hurdles tested his endurance but also highlighted his adaptability, as he refined his approach under the guidance of Fighters manager Masataka Nashida, who supported the unconventional dual-role experiment. By the end of 2014, Ohtani's development had positioned him as a cornerstone for the team, though the Fighters' mid-table finishes underscored the competitive Pacific League environment.\n\n| Season | Role | Games | Record (Pitching) | ERA | IP | SO | BA | HR | RBI |\n|--------|------|-------|-------------------|-----|----|----|----|----|-----|\n| 2013   | Pitcher/Hitter | 13/77 | 3–0 | 4.23 | 61⅔ | 46 | .238 | 3 | 20 |\n| 2014   | Pitcher/Hitter | 24/87 | 11–4 | 2.61 | 155⅓ | 179 | .274 | 10 | 31 |\n\n### Peak NPB seasons (2015–2017)\n\nOhtani's 2015 season marked his emergence as an elite pitcher in the Pacific League for the Hokkaido Nippon-Ham Fighters. He compiled a 15–5 record with a league-leading 2.24 ERA and 196 strikeouts over 160⅔ innings in 23 starts, earning the Pacific League Pitcher Best Nine award for his outstanding performance. As a hitter, Ohtani appeared in 71 games primarily as a designated hitter, batting .202 with five home runs and 17 RBI in 109 at-bats, showcasing his growing two-way potential despite a focus on pitching development.\n\nThe 2016 campaign represented the pinnacle of Ohtani's NPB career, where he fully realized his dual-threat capabilities. On the mound, he went 10–4 with a 1.86 ERA and 174 strikeouts in 140 innings across 21 appearances, while at the plate he slashed .322/.416/.588 with 22 home runs and 67 RBI in 104 games. These contributions propelled the Fighters to the Japan Series title, defeating the Hiroshima Toyo Carp in six games, with Ohtani delivering key performances in both roles during the postseason. For his efforts, he became the first player in NPB history to achieve double-digit wins (10) and home runs (22) in the same season, earning Pacific League MVP honors along with Best Nine awards as both pitcher and designated hitter.\n\nIn 2017, injuries curtailed Ohtani's workload, limiting him to six pitching appearances where he posted a 3–2 record and 3.42 ERA with 31 strikeouts in 26⅓ innings before a thigh strain sidelined him early. Offensively, he remained productive in 66 games, batting .332 with eight home runs and 31 RBI in 202 at-bats, and was selected to his fifth straight NPB All-Star Game. Following the season, Ohtani requested and received permission from the Fighters to enter the MLB posting system, signaling the end of his Japanese professional career and his pursuit of opportunities in Major League Baseball.\n\n## Major League Baseball career\n\n### Los Angeles Angels tenure (2018–2020)\n\nShohei Ohtani signed with the Los Angeles Angels in December 2017 on a minor league contract with a $2.315 million signing bonus, marking the beginning of his six-year team control period under MLB's international signing rules. He made his MLB debut on March 29, 2018, against the Oakland Athletics, recording his first major league hit—a single off Oakland reliever Ryan Dull in the sixth inning. Ohtani's early performance generated significant media attention, with outlets dubbing him the \"Japanese Babe Ruth\" for his rare two-way abilities reminiscent of the legendary slugger's early career.\n\nIn his rookie season, Ohtani excelled as both a pitcher and designated hitter, appearing in 104 games at the plate while making 10 starts on the mound. As a hitter, he batted .285 with 22 home runs and 61 RBIs, including his first MLB home run—a three-run shot off Cleveland Indians starter Josh Tomlin on April 3, 2018, in his home debut at Angel Stadium. On the pitching side, he went 4–2 with a 3.31 ERA over 51⅔ innings, striking out 63 batters and earning praise for his 97.1 mph fastball velocity. His dual contributions culminated in Ohtani unanimously winning the American League Rookie of the Year Award, becoming the first player since 1918 to achieve such acclaim as a two-way player.\n\nOhtani's 2019 season was limited by a right elbow injury that required Tommy John surgery on October 1, 2018, performed by Dr. Neal ElAttrache, sidelining him from pitching for the entire year. Restricted to the designated hitter role, he played in 106 games, batting .286 with 18 home runs and 62 RBIs, surpassing his rookie totals in several offensive categories despite missing time for rehabilitation and a subsequent left knee surgery in September 2019 to address a bone spur. The Angels finished fourth in the AL West with a 72–90 record, as Ohtani's absence from the rotation highlighted the team's reliance on his versatility.\n\nThe 2020 season, shortened to 60 games due to the COVID-19 pandemic, brought further challenges for Ohtani, who attempted a two-way return but suffered a right elbow sprain after just two starts, totaling 1⅔ innings pitched with a 0.00 ERA before shutting down. At the plate, he struggled with a .190 batting average, 7 home runs, and 24 RBIs over 44 games, impacted by the elbow issue and an abbreviated spring training. The Angels ended third in the AL West with a 26–34 record, amid growing concerns over Ohtani's recurring injuries that tempered the initial excitement surrounding his arrival. Media coverage shifted from Babe Ruth comparisons to discussions of the physical toll of his two-way role and the Angels' limited support staff, underscoring the risks of his unprecedented workload.\n\n### Los Angeles Angels tenure (2021–2023)\n\nFollowing his recovery from Tommy John surgery and subsequent injuries that limited his two-way role in 2018–2020, Ohtani entered a dominant phase with the Los Angeles Angels from 2021 to 2023, establishing himself as baseball's premier two-way player and earning two unanimous American League Most Valuable Player Awards. Despite his individual brilliance, the Angels endured ongoing playoff droughts, finishing with losing records each year (77–85 in 2021, 73–89 in 2022, and 73–89 in 2023) and extending their postseason absence to nine seasons by 2023. Ohtani's performances often carried the team, but persistent rumors of his impending free agency after the 2023 season—fueled by the Angels' inability to contend—dominated discussions, with speculation linking him to multiple contenders.\n\nIn 2021, Ohtani fully embraced his dual role, making 23 starts on the mound for a 9–2 record, 3.18 ERA, and 156 strikeouts over 130.1 innings while slashing .257/.374/.592 with 46 home runs, 100 RBIs, and 103 runs scored in 155 games at the plate. He became the first player selected to the All-Star Game as both a pitcher and designated hitter, starting on the mound and batting leadoff for the American League in a historic performance that included a perfect first inning with a 100.2 mph fastball. Ohtani's breakout earned him the unanimous AL MVP, the first Japanese-born player to win the award, and he participated in the Home Run Derby, hitting a record-tying six homers of 500-plus feet before falling to Juan Soto in the first round.\n\nOhtani's 2022 season built on his momentum, as he logged career highs with 28 starts, a 15–9 record, 2.33 ERA, and a league-leading 219 strikeouts in 166 innings pitched. Offensively, he batted .273/.356/.519 with 34 home runs, 95 RBIs, and 11 stolen bases across 157 games, earning the Edgar Martinez Outstanding Designated Hitter Award despite finishing second in AL MVP voting to Aaron Judge. His two-way excellence highlighted the Angels' reliance on him, yet the team faltered amid injuries to key players like Mike Trout, missing the playoffs for the eighth straight year.\n\nBy 2023, Ohtani shifted primarily to hitting after elbow discomfort sidelined him from pitching after 23 starts (10–5, 3.14 ERA, 167 strikeouts in 132 innings), and a late-season oblique strain caused him to miss the final games. He still delivered an MVP-caliber campaign at the plate, batting .304/.412/.654 with 44 home runs (AL lead), 95 RBIs, 102 runs scored, a .412 on-base percentage (AL lead), and 1.066 OPS (AL lead) in 135 games. This unanimous second AL MVP—making him the first player to win the award unanimously twice—underscored his historic impact, though free agency speculation intensified as the Angels again missed the postseason.\n\n### Los Angeles Dodgers tenure (2024)\n\nFollowing his departure from the Los Angeles Angels as a free agent, Shohei Ohtani signed a record-breaking 10-year, $700 million contract with the Los Angeles Dodgers on December 9, 2023, which included $680 million in deferred payments to provide the team with greater financial flexibility under MLB's competitive balance tax rules. The deal, the largest in professional sports history at the time, underscored Ohtani's status as a transformative talent, with the deferrals—proposed by Ohtani himself—allowing the Dodgers to bolster their roster while committing to his long-term presence.\n\nOhtani's 2024 season with the Dodgers was limited to hitting due to recovery from ulnar collateral ligament (UCL) surgery on his right elbow, performed on September 19, 2023, to repair a tear sustained the previous year; the procedure was expected to allow unrestricted hitting by Opening Day but delay his return to pitching until 2025. His rehabilitation contributed to a limited spring training, where he skipped live batting practice and the Dodgers' opener against the San Diego Padres on February 22, though he progressed ahead of schedule and debuted in the Cactus League on March 1. In the regular season, Ohtani excelled as a designated hitter, batting .310 with 54 home runs (leading the National League), 130 RBIs, and 59 stolen bases over 159 games, becoming the first player in MLB history to achieve a 50-50 season with at least 50 home runs and 50 stolen bases—a milestone reached on September 19 against the Miami Marlins in a 6-for-6 performance that included three home runs and two steals.\n\nOhtani's offensive dominance propelled the Dodgers to a 98-64 record and their 11th National League West title in 12 seasons, securing a first-round bye in the playoffs. He capped the year by winning the National League Most Valuable Player Award unanimously on November 14, 2024, his third overall MVP and first in the NL, recognizing his league-leading 9.2 WAR and historic production as the first full-time designated hitter to earn the honor. In the postseason, the Dodgers advanced to the World Series, defeating the New York Yankees 4-1 for their eighth championship and first since 2020; Ohtani batted .222 with one home run during the five-game series.\n\n### Los Angeles Dodgers tenure (2025)\n\nIn 2025, Shohei Ohtani resumed two-way play for the Los Angeles Dodgers following his recovery from elbow surgery performed in 2023. As a batter, he appeared in 158 games, slashing .282/.392/.623 with 55 home runs, 102 RBIs, 172 hits, and a league-leading 146 runs scored. His 55 home runs ranked third in Major League Baseball and established a new single-season franchise record for the Dodgers, surpassing previous marks held by players like Shawn Green and Adrian Gonzalez. Ohtani also led the National League in on-base percentage (.392), slugging percentage (.623), and OPS (1.015), while pacing MLB in total bases (380). On the mound, he made 14 starts with a 1-1 record, 2.87 ERA, 47 innings pitched, 62 strikeouts, and a 1.04 WHIP, marking his first pitching appearances since 2023. His managed workload reflected ongoing caution after the surgery, limiting him to shorter outings early in the season.\n\nOhtani's season included notable milestones, such as achieving his 1,000th Major League Baseball hit on August 6, 2025, against the St. Louis Cardinals—a two-run home run in the third inning during a game in which he also pitched four innings and struck out eight batters. This performance highlighted his return to two-way duties, the first such appearance since his final Angels start in 2023. He encountered a minor hamstring issue in July that briefly affected his mobility during a start against the Cincinnati Reds on July 30, leading to an early exit after cramping, though he avoided a significant injury and returned promptly.\n\nThe Dodgers repeated as World Series champions in 2025, defeating the Toronto Blue Jays 4-3 in the Fall Classic, with Ohtani earning National League Championship Series MVP honors for his .357 average, three home runs, and four RBIs against the Milwaukee Brewers. In the postseason overall, Ohtani posted a .265 average with eight home runs and 14 RBIs across 17 games. His World Series performance was particularly dominant, slashing .333/.500/.778 with an OPS of 1.278 over seven games, featuring multiple multi-hit efforts and becoming the first player in World Series history to record two home runs and two doubles in a single game during Game 3. Ohtani won the National League MVP Award unanimously on November 14, 2025, his fourth overall and second consecutive with the Dodgers.\n\n## International career\n\n### 2012 WBSC U-18 Baseball World Cup\n\nShohei Ohtani was selected to the Japan national under-18 team for the 2012 IBAF 18U Baseball World Championship, held in Seoul, South Korea, from August 30 to September 8. As an 18-year-old pitcher from Hanamaki Higashi High School, the tournament provided his debut on the international stage, where he showcased his two-way abilities by pitching, hitting in the cleanup spot, and playing outfield. This event served as a key pre-Koshien showcase, highlighting Ohtani's potential and attracting scouts from Nippon Professional Baseball (NPB) teams ahead of the upcoming draft.\n\nOhtani appeared in two games as a starter, logging 10 1/3 innings with a 0–1 record and a 4.35 ERA. He struck out 16 batters, walked 8, and surrendered just 5 hits and 5 earned runs, demonstrating command with a fastball that reached 94 mph alongside secondary pitches. In his first start against Canada on August 31 at Mokdong Baseball Stadium, Ohtani pitched 3 1/3 innings, allowing 2 runs amid control issues that included several walks and a rally in the fourth inning, though Japan rallied late in a 10-inning loss. Offensively, he batted .324 (11-for-34), contributing significantly to Japan's lineup.\n\nDespite Ohtani's efforts, Japan struggled in the tournament, finishing fifth after a 3–0 loss to South Korea in the placement game on September 8 at Mokdong Stadium. The United States claimed the gold medal, defeating Canada in the final, while Chinese Taipei took bronze. Ohtani's performances underscored his raw talent as a high school prospect, though the team exited earlier than expected, providing valuable experience before his professional pursuits.\n\n### 2015 WBSC Premier12\n\nThe 2015 WBSC Premier12 marked the inaugural edition of the international baseball tournament organized by the World Baseball Softball Confederation (WBSC), held from November 8 to 21 across venues in Taiwan and Japan. Samurai Japan, with Shohei Ohtani making his senior international debut, navigated the round-robin stages and super round to reach the semifinals, where they suffered a 4-3 defeat to South Korea before claiming the bronze medal with an 11-1 rout of Mexico in the third-place game.\n\nOhtani balanced pitching and hitting duties in a two-way utility role for Japan, leveraging the breakout form from his 2015 Nippon Professional Baseball (NPB) season, in which he batted .274 with 22 home runs and posted an 11-4 record with a 2.24 ERA for the Hokkaido Nippon-Ham Fighters. On the mound, he excelled in two starts, combining for 13 scoreless innings, a 0.00 ERA, 21 strikeouts, three hits allowed, and two walks while earning a 1-0 record.\n\nKey moments included his tournament-opening start against South Korea on November 8 at Sapporo Dome, where Ohtani pitched six innings, surrendering two hits and two walks while fanning 10 batters—highlighted by a 100 mph fastball—and helping secure a 5-0 shutout. In the November 19 semifinal versus South Korea at Tokyo Dome, he tossed seven one-hit innings on 91 pitches, striking out 11 without allowing a run, though Japan's bullpen faltered in the ninth. Ohtani's versatility underscored his unique skill set, as he also contributed at the plate throughout the event.\n\nThis appearance represented Ohtani's first professional international competition, globally spotlighting his NPB prowess and two-way potential ahead of his MLB transition. His dominance earned him a spot on the WBSC Premier12 All-World Team as the pitcher with the best ERA, and he was later honored as the 2015 WBSC Baseball Player of the Year.\n\n### 2017 World Baseball Classic\n\nShohei Ohtani was named to Japan's roster for the 2017 World Baseball Classic as a two-way player, highlighting his status as an emerging ace for the national team amid his standout NPB performances. However, a right ankle injury sustained during the 2016 Japan Series forced him to withdraw before the tournament began, preventing any participation and marking the postponement of his World Baseball Classic debut.\n\nThe tournament, held from March 6 to 22, 2017, saw Japan compete without Ohtani's contributions. In Pool B at Tokyo Dome, Japan secured victories over Australia (4-1) and China (7-1), advancing to the second round. There, they overcame the Netherlands in 11 innings (8-6), defeated Cuba (8-5), and beat Israel (8-3) to reach the semifinals.\n\nIn the semifinals at Dodger Stadium on March 21, Japan faced the United States in a tight contest, ultimately losing 2-1 on a walk-off single by pinch-hitter Tommy Joseph in the ninth inning. The U.S. went on to win the final against Puerto Rico 8-0, claiming their first WBC title. Japan's runner-up finish underscored their depth, though Ohtani's managed workload in the ongoing NPB season—limited to 65 games that year due to recovery—emphasized the careful handling of his dual role.\n\n### 2023 World Baseball Classic\n\nThe 2023 World Baseball Classic took place from March 8 to 21, with the final held at loanDepot park in Miami, Florida. Japan advanced to the championship game after defeating Italy 9-3 in the semifinals and claimed the title with a 3-2 victory over the United States in a tense final. Shohei Ohtani served as a key leader for Team Japan, drawing on his experience from the 2017 tournament to guide the squad toward its third WBC championship.\n\nOhtani delivered a standout two-way performance throughout the tournament, pitching to a 1.86 ERA over 9⅔ innings with 11 strikeouts, a 2-0 record, and one save, while batting .435 with a .606 on-base percentage, one home run, four doubles, and 10 walks in seven games. In the final against the United States, Ohtani entered in the ninth inning with Japan leading 3-2, runners on first and second, and two outs; he struck out his Los Angeles Angels teammate Mike Trout on a slider to secure the victory and earn a save. Following the final out, Ohtani and Trout shared an emotional embrace at home plate, highlighting their friendship amid the intense rivalry.\n\nOhtani's contributions earned him the tournament MVP award, recognizing his dominance on both sides of the ball and his role in inspiring Japan's comeback from an early pool-stage loss to Cuba. This performance further elevated Ohtani's global profile ahead of his breakout 2023 Major League Baseball season.\n\n## Awards and achievements\n\n### NPB awards and honors\n\nDuring his five seasons with the Hokkaido Nippon-Ham Fighters in Nippon Professional Baseball (NPB), Shohei Ohtani earned numerous accolades that underscored his rare versatility as a two-way player, setting him apart in Japanese baseball history.\n\nIn 2013, his rookie season, Ohtani was named to the NPB All-Rookie Team after posting a 4-2 record with a 3.25 ERA in 11 starts as a pitcher while also contributing 10 home runs and 31 RBI as a hitter and outfielder.\n\nOhtani made his first NPB All-Star appearance in 2014, selected as a pitcher after leading the Pacific League with 179 strikeouts and a 2.61 ERA over 155 1/3 innings.\n\nIn 2015, he captured the Pacific League Best Nine Award as the top pitcher, having led the league in ERA with a 2.24 mark across 160 2/3 innings while striking out 196 batters.\n\nOhtani's 2016 season represented the pinnacle of his NPB career, culminating in the Pacific League Most Valuable Player Award, where he received 253 of 254 first-place votes for his dominant performance of 10 wins, a league-leading 1.86 ERA, and 174 strikeouts as a pitcher, complemented by a .322 batting average, 22 home runs, and 67 RBI in 104 games. He also earned Best Nine honors as both the top pitcher and designated hitter—the first player to win in two positions since Katsuya Nomura in 1974—highlighting his unprecedented impact on both sides of the ball. Additionally, Ohtani was selected for the NPB All-Star Game that year and won the Golden Glove Award as an outfielder for his defensive contributions in 65 games in the position.\n\nOhtani rounded out his NPB tenure with a third All-Star selection in 2017, appearing as a designated hitter amid a season where he focused more on hitting while recovering from injury.\n\nOverall, Ohtani's honors established him as a transformative figure in NPB, with his 2016 strikeout total contributing to his legacy as one of the league's most dominant pitchers during his era.\n\n### MLB awards and honors\n\nShohei Ohtani's Major League Baseball career is marked by a series of groundbreaking awards and honors, achieved through his rare proficiency as both a pitcher and hitter. As the first player in MLB history to win the Most Valuable Player (MVP) Award in both the American League (AL) and National League (NL), Ohtani has redefined two-way play, earning unanimous MVP selections multiple times and becoming the only player to sweep the BBWAA MVP, Silver Slugger, and All-Star honors in a season on more than one occasion. His accolades underscore his dominance, with voters recognizing contributions from both facets of his game, a feat unmatched since Babe Ruth's era.\n\nIn his 2018 rookie season with the Los Angeles Angels, Ohtani won the AL Rookie of the Year Award, becoming the first Japanese-born player to claim the honor and the fourth overall from Japan. He earned 25 of 30 first-place votes from the Baseball Writers' Association of America (BBWAA), edging out New York Yankees infielder Gleyber Torres and outfielder Miguel Andújar.\n\nOhtani's 2021 season elevated his profile further, as he captured the unanimous AL MVP Award, receiving all 30 first-place votes for his league-leading 46 home runs, 100 RBI, and 9-2 pitching record with a 3.18 ERA. He was selected to his first All-Star Game as the AL's starting designated hitter and pitcher—the first player ever chosen as a two-way All-Star—and won the Silver Slugger Award as the top-hitting DH in the AL.\n\nThe following year, in 2022, Ohtani earned his second consecutive All-Star selection and repeated as the AL Silver Slugger Award winner at DH, batting .273 with 34 home runs and 95 RBI while posting a 15-9 record with 166 strikeouts on the mound. His 166 strikeouts marked one of the highest totals by a two-way player in modern MLB history.\n\nOhtani dominated again in 2023, securing his second unanimous AL MVP Award with all 30 first-place votes for his .304 average, MLB-leading 44 home runs, and 95 RBI, alongside a 3.14 ERA in 132 innings pitched. He made his third straight All-Star appearance, won his third Silver Slugger as AL DH, and triumphed in the Home Run Derby with 28 long balls across three rounds.\n\nAfter signing with the Los Angeles Dodgers in 2024, Ohtani transitioned to full-time DH and won the unanimous NL MVP Award, the first for a primary designated hitter, highlighted by his MLB-record 50-50 season of home runs and stolen bases. He was named to the All-Star team for the fourth time, earned his fourth Silver Slugger as NL DH, and was nominated for the Roberto Clemente Award for his charitable efforts. The Dodgers' World Series victory that year marked Ohtani's first championship ring.\n\nIn 2025, Ohtani continued his excellence, earning his fifth All-Star selection and fifth consecutive Silver Slugger Award as the NL's top DH after leading the league in slugging percentage (.622) and OPS (1.014) with 55 home runs. He was named NLCS MVP, won his fourth MVP Award (third in the NL) unanimously, and helped the Dodgers repeat as World Series champions, securing Ohtani's second title in as many postseason appearances with the team.\n\n### Statistical records and milestones\n\nIn his 2016 season with the Hokkaido Nippon-Ham Fighters in Japan's Pacific League, Shohei Ohtani set records for strikeouts with 174 and adjusted ERA (ERA+) with 195, while becoming the first player in Nippon Professional Baseball (NPB) history to achieve at least 10 pitching wins (10-4 record) and 20 home runs (22) in the same season.\n\nOhtani's major league career with the Los Angeles Angels and Los Angeles Dodgers includes several landmark achievements. In 2021, he became the first player to demonstrate 40-40 potential as a two-way contributor, reaching 40 home runs before the end of August while also logging significant stolen bases and pitching innings. In 2023, he led the American League (AL) in home runs (44), on-base percentage (.412), and on-base plus slugging (OPS, 1.066). The following year, 2024, Ohtani made history as the first player to record 50 home runs (54) and 50 stolen bases (59) in a single season. During his inaugural campaign with the Dodgers in 2025, he established franchise records for home runs (55) and runs scored (146) in a single season, while leading the National League (NL) in on-base percentage, slugging percentage, and OPS (1.014).\n\nAcross his MLB tenure through 2025, Ohtani has amassed over 1,000 hits (1,050), a feat accomplished in just eight seasons. As a two-way player, he holds records such as the most strikeouts by a position player in a season and numerous combined pitching-hitting benchmarks, including the only instances of 40+ home runs with 100+ strikeouts in the same year. His career advanced metrics underscore this versatility, with a weighted runs created plus (wRC+) of 162 as a hitter—indicating 62% above league average production—and a fielding independent pitching (FIP) of 3.01 as a pitcher, reflecting strong underlying performance independent of defense.\n\nKey milestones include Ohtani's 100th MLB home run in 2021, which highlighted his rapid ascent as a power hitter, and his 300th career pitching strikeout in 2022, solidifying his dominance on the mound.\n\n| Season | Key Statistical Feat | League | Source |\n|--------|----------------------|--------|--------|\n| 2016 (NPB) | 174 K, 195 ERA+, 10 wins/20 HR | Pacific League | Baseball-Reference |\n| 2021 (MLB) | 40th HR milestone | AL | MLB.com |\n| 2023 (MLB) | Led in HR (44), OBP (.412), OPS (1.066) | AL | MLB.com |\n| 2024 (MLB) | First 50 HR/50 SB (54/59) | NL | MLB.com |\n| 2025 (MLB) | Dodgers records: 55 HR, 146 R; NL leads in OBP/SLG/OPS | NL | Baseball-Reference |\n\n## Player profile\n\n### Pitching repertoire and mechanics\n\nShohei Ohtani employs a diverse pitching arsenal that emphasizes velocity and deception, featuring a primary four-seam fastball clocked at 98.4 mph on average in 2025, used 38.8% of the time to set up his secondary offerings. His split-finger fastball, serving as his main out pitch, averages 90.3 mph with a 4.6% usage rate, exhibiting gyroscopic spin that minimizes visible movement for late deception against right-handed hitters. Complementing these are a sweeper at 85.0 mph (22.8% usage), slider at 88.1 mph (11.3%), cutter at 93.9 mph (6.6%), curveball at 78.6 mph (8.8%), and sinker at 96.2 mph (7.0%), allowing him to attack both sides of the plate effectively.\n\nOhtani's mechanics leverage his 6-foot-4 frame to generate power through a high release point and exceptional extension of 6.7 feet, ranking in the 71st percentile among pitchers, which enhances perceived velocity by several miles per hour. His arm slot measures 35 degrees, contributing to a fluid delivery that maintains balance and repeatability, with efficient hip-shoulder separation driving his fastball's explosiveness. The gyro spin on his splitter, achieved through a pronated grip and wrist action, further deceives batters by reducing traditional break while tunneling seamlessly with his fastball.\n\nIn his Nippon Professional Baseball (NPB) tenure with the Hokkaido Nippon-Ham Fighters from 2013 to 2017, Ohtani prioritized command and pitch location over raw velocity, averaging fastballs in the mid-90s mph range while developing his splitter as a signature pitch. Transitioning to Major League Baseball (MLB) with the Los Angeles Angels in 2018, he experienced a velocity surge post-Tommy John surgery recovery, pushing his four-seam fastball into the 97-100 mph range by 2020. His 2025 return to pitching for the Los Angeles Dodgers, following a second elbow surgery in 2023, featured increased slider usage to 11.3%, which became one of his most effective pitches for generating strikeouts that season.\n\nOhtani's strengths as a pitcher include a career strikeout rate of 11.4 per nine innings, driven by his high-velocity fastball and deceptive splitter, alongside a groundball tendency of approximately 43% that limits extra-base damage. However, he has occasionally struggled with control, issuing 3.1 walks per nine innings over his career, particularly when sequencing breaking pitches early in counts.\n\nDespite the demands of his two-way role, Ohtani's pitching mechanics have remained consistent and unaffected by his hitting workload, as evidenced by stable velocity and release points across starts in 2025, allowing him to maintain dominance without form degradation.\n\n### Batting, fielding, and baserunning\n\nOhtani bats left-handed and is renowned for his pull-oriented approach, directing nearly 48% of his batted balls to left field in 2024, which contributes to his exceptional power output. His batted ball profile features an average exit velocity of 94.9 mph in 2025, with a maximum exceeding 110 mph, and a hard-hit rate of 58.7%, enabling consistent extra-base production. Demonstrating strong plate discipline, Ohtani has drawn walks at an 11.8% career rate across 4,329 plate appearances in MLB. In recent seasons, he has optimized his launch angle, averaging around 12 degrees with a 35.6% sweet-spot rate in 2025, facilitating his league-leading home run totals.\n\nOhtani's batting evolution traces from a contact-oriented profile in NPB, where he posted a .282 average and 48 home runs over 414 games with the Hokkaido Nippon-Ham Fighters, to a power-dominant force in MLB, achieving a .282 career average and 280 home runs through 2025. This shift reflects adaptations to MLB pitching, emphasizing launch angle and exit velocity for greater slugging. As a two-way player, Ohtani incorporates swing mechanics that minimize strain on his pitching arm, prioritizing balance and rotational efficiency to sustain dual roles without compromising velocity or command on the mound.\n\nIn the field, Ohtani gained extensive outfield experience during his NPB tenure, primarily in right and left field, compiling a .988 fielding percentage across 2013–2014 with just one error in 84 games. His MLB outfield appearances were limited to seven games (six in right field, one in left) in 2021, with no errors recorded due to minimal chances. Post-2020, injuries and his designated hitter role have restricted fielding opportunities, though his career outfield fielding percentage remains near .990 when combining NPB and MLB play. Early career arm injuries, including Tommy John surgery in 2018, further curtailed defensive versatility.\n\nOhtani excels as a baserunner, leveraging above-average sprint speed of 28.0 feet per second in 2025—ranking in the 66th percentile—and sharp jumps for efficient steals. He led the National League with 59 stolen bases in 2024, achieving a historic 50-50 season of home runs and steals, and demonstrated 30-plus steal potential annually with 20 in 2025. His technique features acute takeoff angles and feet-first slides, enhancing success rates above 90% in recent years.\n\n## Off the field\n\n### Personal life\n\nShohei Ohtani was born on July 5, 1994, in Ōshū, Iwate Prefecture, Japan, to parents Toru and Kayoko Ohtani. His father, Toru, a former industrial league baseball player, introduced Ohtani to the sport at a young age, while his mother, Kayoko, a former badminton player, supported his early athletic pursuits. Ohtani maintains close ties with his family, including his older brother, Ryuta, an amateur baseball player who later became a coach and manager for a corporate team in Japan, and his older sister, Yuka.\n\nIn February 2024, Ohtani married Mamiko Tanaka, a former professional basketball player for Japan's national team and the Fujitsu Red Wave in the Women's Japan Basketball League. The couple welcomed their first child, a daughter, in April 2025. Ohtani has described the marriage as a personal milestone that aligns with his focus on family stability amid his demanding career.\n\nOhtani is bilingual in Japanese and English, often relying on an interpreter for daily communication and interviews to navigate cultural nuances in the U.S. His hobbies include playing video games, such as Clash Royale, which he credits with helping him bond with teammates and improve his social interactions early in his MLB career. He also enjoys golf, though he has openly admitted to struggling with the sport, and owns a Kooikerhondje named Decoy (Dekopin in Japanese, born June 18, 2023), whom he frequently features in lighthearted social media posts.\n\nOhtani has engaged in philanthropy, particularly supporting his hometown region of Iwate Prefecture affected by the 2011 Tōhoku earthquake and tsunami. In 2023, he donated approximately 60,000 youth baseball gloves to around 20,000 schools across Japan, aiming to promote the sport among children and foster community development in areas like Iwate. More recently, in January 2024, Ohtani and the Los Angeles Dodgers jointly donated $1 million to aid victims of the Noto Peninsula earthquake.\n\nDuring the MLB season, Ohtani resides in a $7.8 million mansion in La Cañada Flintridge, California, which he purchased in May 2024 to accommodate his professional commitments. He spends the off-season in Japan, returning to his roots in Ōshū, and has spoken about gradually adjusting to American life through routines like team interactions and exploring local culture.\n\nOff the field, Ohtani is known for his shy and reserved personality, preferring a structured daily routine centered on training and recovery over public socializing. He maintains a low-key presence on social media, using it sparingly to share family moments and avoid controversy.\n\n### Endorsements and media presence\n\nShohei Ohtani has established himself as one of the most marketable athletes in professional sports through a portfolio of high-profile endorsement deals. In 2023, he signed a multi-year partnership with New Balance, which includes his own signature shoe line and apparel collection featuring a personal logo designed to reflect his dual role as pitcher and hitter. That same year, Ohtani inked an endorsement agreement with the Japanese pharmaceutical company Kowa, promoting their sports medicine products, and extended his existing collaboration with Fanatics for trading cards and merchandise. These deals, along with partnerships with brands like Seiko, Hugo Boss, and Salesforce, have positioned Ohtani as MLB's premier endorser, blending his Japanese roots with global appeal.\n\nOhtani's endorsement earnings reflect his rising commercial value, surpassing $100 million in 2025 alone and contributing to total off-field income of $102.5 million that year, according to Forbes estimates. This marked a significant increase from prior years, with his 2024 endorsement portfolio helping him rank 13th on Forbes' list of the world's highest-paid athletes, the highest position for a Japanese-born player at the time. Overall, these agreements have generated over $60 million annually in recent years, outpacing many peers and establishing Ohtani as the first Japanese athlete to achieve such endorsement dominance in MLB.\n\nIn media, Ohtani is widely known by the nickname \"Sho-Time,\" a play on his first name and his electrifying on-field performances, which has been embraced by fans and broadcasters since his MLB debut. He has become an enduring icon in Japanese media, where outlets like Sports Nippon have covered him extensively since his NPB days, often dedicating full-time reporters to his games and drawing national broadcasts for his milestones. In the United States, coverage portrays him as a generational talent, with ESPN and other networks highlighting his two-way prowess as a transformative force in baseball, amplifying his visibility through features on his training regimen and cultural impact.\n\nOhtani's global fame surged following his pivotal role in Japan's 2023 World Baseball Classic victory, which attracted 34.2 million viewers across Asia and solidified his status as a regional hero. His 2024 signing with the Los Angeles Dodgers further elevated his U.S. profile, culminating in unprecedented World Series attention that boosted international viewership and Japanese tourism to Dodger Stadium. This shift has turned Ohtani into a bridge between Asian and American audiences, with his games routinely drawing bilingual media scrums and heightened social media engagement worldwide.\n\nOhtani's media presence has evolved dramatically from his Nippon Professional Baseball tenure, where he was a respected but relatively low-profile prospect outside Japan, to a global superstar after his 2018 MLB arrival with the Angels. Early NPB coverage focused on domestic achievements, but his U.S. debut sparked international frenzy, with Japanese national news leading broadcasts on his home runs and outlets like The New York Times detailing the influx of reporters tracking his every move. By the mid-2020s, this had matured into a multifaceted narrative emphasizing his barrier-breaking versatility and cross-cultural influence.\n\n### Controversies\n\nIn March 2024, a major controversy erupted involving Shohei Ohtani's longtime interpreter, Ippei Mizuhara, who was accused of stealing more than $16 million from Ohtani's personal bank account to cover his own illegal gambling debts with an unauthorized bookmaker. The scandal came to light during the Los Angeles Dodgers' season-opening series in Seoul, South Korea, when Mizuhara initially claimed Ohtani had voluntarily covered his debts as a favor, before recanting and admitting to the theft without Ohtani's knowledge. Federal authorities charged Mizuhara with bank fraud in April 2024, alleging he had impersonated Ohtani to authorize over 35 wire transfers totaling nearly $17 million between 2021 and 2024.\n\nOhtani, who had fired Mizuhara immediately upon learning of the betrayal, held an emotional press conference on March 25, 2024, denying any involvement in gambling or knowledge of the transfers, and stating he had been a victim of fraud. He fully cooperated with both Major League Baseball (MLB) investigators and federal authorities throughout the probe. In June 2024, MLB closed its investigation, formally clearing Ohtani of any wrongdoing and confirming he had no role in the illegal betting activities, with no disciplinary action taken against him.\n\nMizuhara pleaded guilty to one count of bank fraud and one count of subscribing to a false tax return on June 4, 2024, admitting he had placed approximately 19,000 bets—none on baseball—and used the stolen funds to pay off debts exceeding $40 million in losses. On February 6, 2025, U.S. District Judge John W. Holcomb sentenced Mizuhara to 57 months in federal prison, followed by three years of supervised release, and ordered him to pay $18.3 million in restitution to Ohtani. Mizuhara reported to prison in Pennsylvania in June 2025 to begin serving his term.\n\nIn the scandal's aftermath, Ohtani hired Will Ireton, a Dodgers employee fluent in Japanese and English, as his new interpreter in late March 2024, a role Ireton has maintained through Ohtani's continued success. The incident had no discernible negative impact on Ohtani's on-field performance, as he achieved a historic 50-home-run, 50-stolen-base season in 2024 and remained a top performer in 2025. Rather than damaging his reputation, the resolution reinforced Ohtani's image as an unwitting victim of betrayal by a close associate. No other significant controversies have marked Ohtani's career.",
  "external_references": [
    {
      "text": "Baseball-Reference",
      "url": "https://www.baseball-reference.com/register/player.fcgi?id=otani-000sho",
      "domain": "baseball-reference.com",
      "type": "named"
    },
    {
      "text": "MLB.com",
      "url": "https://www.mlb.com/news/shohei-ohtani-hits-40th-home-run-of-2021",
      "domain": "mlb.com",
      "type": "named"
    },
    {
      "text": "MLB.com",
      "url": "https://www.mlb.com/player/shohei-ohtani-660271",
      "domain": "mlb.com",
      "type": "named"
    },
    {
      "text": "MLB.com",
      "url": "https://www.mlb.com/news/2024-shohei-ohtani-home-run-stolen-base-tracker",
      "domain": "mlb.com",
      "type": "named"
    },
    {
      "text": "Baseball-Reference",
      "url": "https://www.baseball-reference.com/teams/LAD/2025.shtml",
      "domain": "baseball-reference.com",
      "type": "named"
    },
    {
      "text": "Famous Firsts Mlb History Babe Ruth Shohei Ohtani",
      "url": "https://www.espn.com/mlb/story/_/id/41304791/famous-firsts-mlb-history-babe-ruth-shohei-ohtani",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Aaron Judge Named Finalists Mvp Awards",
      "url": "https://www.espn.com/mlb/story/_/id/46839451/shohei-ohtani-aaron-judge-named-finalists-mvp-awards",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "A Look At The History Of Shohei Ohtani C262589034",
      "url": "https://www.mlb.com/news/a-look-at-the-history-of-shohei-ohtani-c262589034",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Otani Picked Japan Set Mlb",
      "url": "https://www.espn.com/mlb/story/_/id/8549680/shohei-otani-picked-japan-set-mlb",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "The Best Shohei Ohtani Highlights From Japan C262323444",
      "url": "https://www.mlb.com/cut4/the-best-shohei-ohtani-highlights-from-japan-c262323444",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Otani Named Pacific League Mvp Japan",
      "url": "https://www.espn.com/mlb/story/_/id/18155219/shohei-otani-named-pacific-league-mvp-japan",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Rookie Of The Year",
      "url": "https://www.mlb.com/awards/rookie-of-the-year",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Most Mlb Mvp Awards C294414636",
      "url": "https://www.mlb.com/news/most-mlb-mvp-awards-c294414636",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani New Contract Stats And Facts",
      "url": "https://www.mlb.com/news/shohei-ohtani-new-contract-stats-and-facts",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Wins 2025 Nl Mvp Award",
      "url": "https://www.mlb.com/news/shohei-ohtani-wins-2025-nl-mvp-award",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2023 World Baseball Classic Mvp All Tournament Team",
      "url": "https://www.mlb.com/news/2023-world-baseball-classic-mvp-all-tournament-team",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani",
      "url": "https://www.biography.com/athletes/a66027631/shohei-ohtani",
      "domain": "biography.com",
      "type": "citation"
    },
    {
      "text": "G01202",
      "url": "https://www.nippon.com/en/japan-topics/g01202/",
      "domain": "nippon.com",
      "type": "citation"
    },
    {
      "text": "014000c",
      "url": "https://mainichi.jp/english/articles/20171211/p2a/00m/0sp/014000c",
      "domain": "mainichi.jp",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani S High School Baseball Coach Instilled The Star S Humility 01j8z3ba6xym",
      "url": "https://www.si.com/high-school/baseball/shohei-ohtani-s-high-school-baseball-coach-instilled-the-star-s-humility-01j8z3ba6xym",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Shohei Otani Japanese High School Fireballer Opting Mlb",
      "url": "https://www.espn.com/mlb/story/_/id/8532919/shohei-otani-japanese-high-school-fireballer-opting-mlb",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Koshien Tournament Fastball",
      "url": "https://www.halosheaven.com/2020/6/30/21307661/shohei-ohtani-koshien-tournament-fastball",
      "domain": "halosheaven.com",
      "type": "citation"
    },
    {
      "text": "Two Way Player Shohei Otani Throws Strikes Smashes Home Runs Japan Next Big Export",
      "url": "https://www.espn.com/mlb/story/_/id/12912627/two-way-player-shohei-otani-throws-strikes-smashes-home-runs-japan-next-big-export",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "15027487",
      "url": "https://www.asahi.com/ajw/articles/15027487",
      "domain": "asahi.com",
      "type": "citation"
    },
    {
      "text": "Mlb Waiting For Posting Of Shohei Ohtani C208585722",
      "url": "https://www.mlb.com/news/mlb-waiting-for-posting-of-shohei-ohtani-c208585722",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Nippon Ham Fighters Select Japanese High School Sensation Shohei Otani",
      "url": "https://www.cbssports.com/mlb/news/nippon-ham-fighters-select-japanese-high-school-sensation-shohei-otani/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "3318",
      "url": "https://english.kyodonews.net/articles/-/3318",
      "domain": "english.kyodonews.net",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Is Next Baseball Star From Japan C164174962",
      "url": "https://www.mlb.com/news/shohei-ohtani-is-next-baseball-star-from-japan-c164174962",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Std P.html",
      "url": "https://npb.jp/bis/eng/2013/stats/std_p.html",
      "domain": "npb.jp",
      "type": "citation"
    },
    {
      "text": "Standings",
      "url": "http://bis.npb.or.jp/eng/2014/standings/",
      "domain": "bis.npb.or.jp",
      "type": "citation"
    },
    {
      "text": "Idp1 F.html",
      "url": "https://npb.jp/bis/eng/2015/stats/idp1_f.html",
      "domain": "npb.jp",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani",
      "url": "https://www.baseball-reference.com/bullpen/Shohei_Ohtani",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Npb Career.html",
      "url": "https://www.piece-of-japan.com/entertainment/baseball/shohei-ohtani-npb-career.html",
      "domain": "piece-of-japan.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Limited To Dh To Start 2017 C222251432",
      "url": "https://www.mlb.com/news/shohei-ohtani-limited-to-dh-to-start-2017-c222251432",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Otani A Two Way Player Says He Is Ready To Leave Japan For Mlb.html",
      "url": "https://www.nytimes.com/2017/11/11/sports/baseball/shohei-otani-a-two-way-player-says-he-is-ready-to-leave-japan-for-mlb.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Sign Los Angeles Angels",
      "url": "https://www.espn.com/mlb/story/_/id/21712038/shohei-ohtani-sign-los-angeles-angels",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Angels Babe Ruth Hitter Pitcher",
      "url": "https://www.theguardian.com/sport/2018/apr/09/shohei-ohtani-angels-babe-ruth-hitter-pitcher",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Hits First Major League Home Run C270714474",
      "url": "https://www.mlb.com/news/shohei-ohtani-hits-first-major-league-home-run-c270714474",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Ohtani Wins Al Rookie Of Year Award C300596276",
      "url": "https://www.mlb.com/news/ohtani-wins-al-rookie-of-year-award-c300596276",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani S Tommy John Surgery Successful C296823034",
      "url": "https://www.mlb.com/news/shohei-ohtani-s-tommy-john-surgery-successful-c296823034",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani 2019 Season Review",
      "url": "https://www.mlb.com/news/shohei-ohtani-2019-season-review",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani",
      "url": "https://www.espn.com/mlb/player/stats/_/id/39832/shohei-ohtani",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "511aa4cc 3e64 11e8 A7d1 E4efec6389f0 Story.html",
      "url": "https://www.washingtonpost.com/sports/every-day-is-the-craziest-inside-the-japanese-press-corps-tailing-shohei-ohtani/2018/04/12/511aa4cc-3e64-11e8-a7d1-e4efec6389f0_story.html",
      "domain": "washingtonpost.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Wins 2023 Al Mvp Award",
      "url": "https://www.mlb.com/news/shohei-ohtani-wins-2023-al-mvp-award",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Angels 2025 Season Preview Mike Trout Ron Washington",
      "url": "https://www.latimes.com/sports/angels/story/2025-03-24/angels-2025-season-preview-mike-trout-ron-washington",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Mlb 2023 Angels Future Shohei Ohtani Arte Moreno",
      "url": "https://www.espn.com/mlb/story/_/id/38192608/mlb-2023-angels-future-shohei-ohtani-arte-moreno",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Angels Move Ahead With Focus On Keeping Shohei Ohtani",
      "url": "https://www.mlb.com/news/angels-move-ahead-with-focus-on-keeping-shohei-ohtani",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Ohtansh01.shtml",
      "url": "https://www.baseball-reference.com/players/o/ohtansh01.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Ohtani To Start On Hill Bat Leadoff In 2021 All Star Game",
      "url": "https://www.mlb.com/news/ohtani-to-start-on-hill-bat-leadoff-in-2021-all-star-game",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Trade Mike Trout La Angels Mlb Baseball",
      "url": "https://www.theguardian.com/sport/2023/jul/25/shohei-ohtani-trade-mike-trout-la-angels-mlb-baseball",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Ucl Tear Magic Jeff Passan",
      "url": "https://www.espn.com/mlb/story/_/id/38249798/shohei-ohtani-ucl-tear-magic-jeff-passan",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Empty Locker Los Angeles Angels",
      "url": "https://www.theguardian.com/sport/2023/sep/16/shohei-ohtani-empty-locker-los-angeles-angels",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Join Dodgers 10 Year 700m Deal",
      "url": "https://www.espn.com/mlb/story/_/id/39076745/shohei-ohtani-join-dodgers-10-year-700m-deal",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Surgery Update",
      "url": "https://www.mlb.com/news/shohei-ohtani-surgery-update",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Spring Training 77ffa64fc6f80edb01b1842d05ee1a82",
      "url": "https://apnews.com/article/shohei-ohtani-spring-training-77ffa64fc6f80edb01b1842d05ee1a82",
      "domain": "apnews.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Reaches 50 Homers 50 Steals",
      "url": "https://www.mlb.com/news/shohei-ohtani-reaches-50-homers-50-steals",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2024.shtml",
      "url": "https://www.baseball-reference.com/teams/LAD/2024.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani 2024 Nl Mvp",
      "url": "https://www.mlb.com/news/shohei-ohtani-2024-nl-mvp",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2024 Ws.shtml",
      "url": "https://www.baseball-reference.com/postseason/2024_WS.shtml",
      "domain": "baseball-reference.com",
      "type": "citation"
    },
    {
      "text": "Home",
      "url": "https://www.wbsc.org/en/events/2012-18u-baseball-world-championship/home",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "Two Way Sensation Shohei Ohtani Continues To Make Baseball History",
      "url": "https://www.wbsc.org/en/news/two-way-sensation-shohei-ohtani-continues-to-make-baseball-history",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "Japanese High School Pitcher Shohei Otani Opts For Mlb Over Japan Professional Baseball",
      "url": "https://www.wbsc.org/en/events/2012-18u-baseball-world-championship/news/japanese-high-school-pitcher-shohei-otani-opts-for-mlb-over-japan-professional-baseball",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "Stats",
      "url": "https://www.wbsc.org/en/events/2012-18u-baseball-world-championship/stats?statsSection=pitching\\u0026teamId=496",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "Time Canada Took Shohei Ohtani Won 173548922.html",
      "url": "https://ca.sports.yahoo.com/news/time-canada-took-shohei-ohtani-won-173548922.html",
      "domain": "ca.sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Standings",
      "url": "https://www.wbsc.org/en/events/2012-18u-baseball-world-championship/standings",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "Home",
      "url": "https://www.wbsc.org/en/events/2015-premier12/home",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "2024 Premier12 Preview And Guide",
      "url": "https://www.mlb.com/news/2024-premier12-preview-and-guide",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "C 156788004",
      "url": "https://www.mlb.com/cut4/shohei-ohtani-premier-12-game-1/c-156788004",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "South Korea Rally In 9th To Defeat Japan 4 3 In Premier12 Semifinal",
      "url": "https://www.wbsc.org/en/events/2015-premier12/news/south-korea-rally-in-9th-to-defeat-japan-4-3-in-premier12-semifinal",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "2015 Wbsc Player Of The Year Shohei Othani Wins 2018 Mlb Al Rookie Of The Year",
      "url": "https://www.wbsc.org/en/news/2015-wbsc-player-of-the-year-shohei-othani-wins-2018-mlb-al-rookie-of-the-year",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Will Not Play In Wbc 2017 C215122990",
      "url": "https://www.mlb.com/news/shohei-ohtani-will-not-play-in-wbc-2017-c215122990",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Otani Says Pitch World Baseball Classic",
      "url": "https://www.espn.com/mlb/story/_/id/18597039/shohei-otani-says-pitch-world-baseball-classic",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "2017",
      "url": "https://www.mlb.com/world-baseball-classic/history/2017",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Overview.html",
      "url": "https://www.japan-baseball.jp/en/team/topteam/2017/wbc/overview.html",
      "domain": "japan-baseball.jp",
      "type": "citation"
    },
    {
      "text": "United States Japan",
      "url": "https://www.espn.com/world-baseball-classic/game/_/gameId/370801007/united-states-japan",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Japan Beats Israel Reaches Wbc 17 Semifinals C219421208",
      "url": "https://www.mlb.com/news/japan-beats-israel-reaches-wbc-17-semifinals-c219421208",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Strikes Out Mike Trout World Baseball Classic",
      "url": "https://www.mlb.com/news/shohei-ohtani-strikes-out-mike-trout-world-baseball-classic",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "World Baseball Classic Final Japan Vs Usa 2023",
      "url": "https://www.espn.com/mlb/story/_/id/35906234/world-baseball-classic-final-japan-vs-usa-2023",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Wants To Play For Japan In World Baseball Classic",
      "url": "https://www.mlb.com/news/shohei-ohtani-wants-to-play-for-japan-in-world-baseball-classic",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani World Baseball Classic.html",
      "url": "https://www.nytimes.com/2023/03/22/sports/baseball/shohei-ohtani-world-baseball-classic.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "World Baseball Classic Shohei Ohtani Awarded Wbc Mvp After Closing Out Championship In Japans Win Over Usa",
      "url": "https://www.cbssports.com/mlb/news/world-baseball-classic-shohei-ohtani-awarded-wbc-mvp-after-closing-out-championship-in-japans-win-over-usa/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Japan Usa World Baseball Classic.html",
      "url": "https://www.nytimes.com/2023/03/21/sports/baseball/japan-usa-world-baseball-classic.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Japans Shohei Ohtani Named Wbc Mvp After Historic Performance At Plate On Mound",
      "url": "https://www.sportsnet.ca/mlb/article/japans-shohei-ohtani-named-wbc-mvp-after-historic-performance-at-plate-on-mound/",
      "domain": "sportsnet.ca",
      "type": "citation"
    },
    {
      "text": "3119704",
      "url": "https://www.nbclosangeles.com/news/sports/how-japans-shohei-ohtani-dominated-the-2023-world-baseball-classic/3119704/",
      "domain": "nbclosangeles.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Faces Mlb Players In 2014 Japan All Star Series",
      "url": "https://www.mlb.com/news/shohei-ohtani-faces-mlb-players-in-2014-japan-all-star-series",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Otani Makes History Best Nine Selection Pitcher Dh",
      "url": "https://www.japantimes.co.jp/sports/2016/11/25/baseball/japanese-baseball/otani-makes-history-best-nine-selection-pitcher-dh/",
      "domain": "japantimes.co.jp",
      "type": "citation"
    },
    {
      "text": "Players To Win Mvp Awards With Multiple Teams",
      "url": "https://www.mlb.com/news/players-to-win-mvp-awards-with-multiple-teams",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "23 Al Mvp",
      "url": "https://bbwaa.com/23-al-mvp/",
      "domain": "bbwaa.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Named 2018 Al Rookie Of The Year Angels Two Way Phenom Beats Out Two Yankees",
      "url": "https://www.cbssports.com/mlb/news/shohei-ohtani-named-2018-al-rookie-of-the-year-angels-two-way-phenom-beats-out-two-yankees/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Yankees Fans Reality Check Shohei Ohtani Beat Miguel Andujar Al Rookie Year 065239328.html",
      "url": "https://sports.yahoo.com/yankees-fans-reality-check-shohei-ohtani-beat-miguel-andujar-al-rookie-year-065239328.html",
      "domain": "sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Wins 2021 Al Mvp Award",
      "url": "https://www.mlb.com/news/shohei-ohtani-wins-2021-al-mvp-award",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Los Angeles Angels Unanimously Wins Al Mvp",
      "url": "https://www.espn.com/mlb/story/_/id/32662673/shohei-ohtani-los-angeles-angels-unanimously-wins-al-mvp",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani American League Mvp Vote Angels",
      "url": "https://www.latimes.com/sports/angels/story/2021-11-18/shohei-ohtani-american-league-mvp-vote-angels",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Ohtani Takes It All Is American League Mvp Again",
      "url": "https://www.wbsc.org/en/news/ohtani-takes-it-all-is-american-league-mvp-again",
      "domain": "wbsc.org",
      "type": "citation"
    },
    {
      "text": "24 Nl Mvp",
      "url": "https://bbwaa.com/24-nl-mvp/",
      "domain": "bbwaa.com",
      "type": "citation"
    },
    {
      "text": "2024",
      "url": "https://www.mlb.com/awards/2024",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2025 Silver Slugger Award Winners",
      "url": "https://www.mlb.com/news/2025-silver-slugger-award-winners",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "2025 Mlb Awards Shohei Ohtani Mvp Dodgers Best Five Year Stretch Ever",
      "url": "https://www.espn.com/mlb/story/_/id/46835087/2025-mlb-awards-shohei-ohtani-mvp-dodgers-best-five-year-stretch-ever",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Regular Season",
      "url": "https://www.mlb.com/stats/national-league/ops/regular-season",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Stats",
      "url": "https://www.fangraphs.com/players/shohei-ohtani/19755/stats?position=DH",
      "domain": "fangraphs.com",
      "type": "citation"
    },
    {
      "text": "Stats",
      "url": "https://www.fangraphs.com/players/shohei-ohtani/19755/stats?position=P",
      "domain": "fangraphs.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani 660271",
      "url": "https://baseballsavant.mlb.com/savant-player/shohei-ohtani-660271?stats=statcast-r-pitching-mlb",
      "domain": "baseballsavant.mlb.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=OmkPsRKG67E",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Different Pitcher With Dodgers 2025",
      "url": "https://www.mlb.com/news/shohei-ohtani-different-pitcher-with-dodgers-2025",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Hitting Slump Pitching Risk Dodgers Brewers Nlcs",
      "url": "https://www.si.com/mlb/shohei-ohtani-hitting-slump-pitching-risk-dodgers-brewers-nlcs",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Aaron Judge Shohei Ohtani Numbers That Could Be World Series Difference",
      "url": "https://nypost.com/2024/10/25/sports/aaron-judge-shohei-ohtani-numbers-that-could-be-world-series-difference/",
      "domain": "nypost.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani 660271",
      "url": "https://baseballsavant.mlb.com/savant-player/shohei-ohtani-660271",
      "domain": "baseballsavant.mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani 660271",
      "url": "https://baseballsavant.mlb.com/savant-player/shohei-ohtani-660271?stats=statcast-r-histograms-mlb",
      "domain": "baseballsavant.mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtanis Swing Breakdown",
      "url": "https://winreality.com/blog/shohei-ohtanis-swing-breakdown/",
      "domain": "winreality.com",
      "type": "citation"
    },
    {
      "text": "Fielding",
      "url": "https://www.espn.com/mlb/player/stats/_/id/39832/category/fielding",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "An Underrated Portion Shohei Ohtani Game Speed",
      "url": "https://www.espn.com/mlb/story/_/id/24077020/an-underrated-portion-shohei-ohtani-game-speed",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "All About Shohei Ohtani Parents Kayoko Toru Ohtani 11837030",
      "url": "https://people.com/all-about-shohei-ohtani-parents-kayoko-toru-ohtani-11837030",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "79659574ac5305fc5e3c75da",
      "url": "https://www.sportingnews.com/us/mlb/news/shohei-ohtani-family-tree-wife-mamiko-tanaka-brother-ryuta/79659574ac5305fc5e3c75da",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "69012862268e3e9d6e8b45e6.html",
      "url": "https://www.marca.com/en/mlb/los-angeles-dodgers/2025/10/28/69012862268e3e9d6e8b45e6.html",
      "domain": "marca.com",
      "type": "citation"
    },
    {
      "text": "All About Mamiko Tanaka Shohei Ohtani Wife 11835732",
      "url": "https://people.com/all-about-mamiko-tanaka-shohei-ohtani-wife-11835732",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani And Wife Mamiko Tanakas Relationship Timeline",
      "url": "https://www.usmagazine.com/celebrity-news/news/shohei-ohtani-and-wife-mamiko-tanakas-relationship-timeline/",
      "domain": "usmagazine.com",
      "type": "citation"
    },
    {
      "text": "News It S Become Way Study Communication When Shohei Ohtani Revealed Video Games Helped Adapt Mlb",
      "url": "https://www.sportskeeda.com/baseball/news-it-s-become-way-study-communication-when-shohei-ohtani-revealed-video-games-helped-adapt-mlb",
      "domain": "sportskeeda.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Golf Struggles",
      "url": "https://www.mlb.com/news/shohei-ohtani-golf-struggles",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Dog Decoy Best Moments",
      "url": "https://www.mlb.com/news/shohei-ohtani-dog-decoy-best-moments",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "D00957",
      "url": "https://www.nippon.com/en/japan-topics/d00957/",
      "domain": "nippon.com",
      "type": "citation"
    },
    {
      "text": "Mlb Baseball News After Donating One Million To Earthquake Victims Shohei Ohtani Makes Another Impactful Donation To Benefit Japanese Children Los Angeles Dodgers",
      "url": "https://www.essentiallysports.com/mlb-baseball-news-after-donating-one-million-to-earthquake-victims-shohei-ohtani-makes-another-impactful-donation-to-benefit-japanese-children-los-angeles-dodgers/",
      "domain": "essentiallysports.com",
      "type": "citation"
    },
    {
      "text": "3304712",
      "url": "https://www.nbclosangeles.com/news/sports/mlb/shohei-ohtani-and-dodgers-are-donating-1-million-to-support-victims-of-japans-earthquakes/3304712/",
      "domain": "nbclosangeles.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani California Home Photos Gallery",
      "url": "https://www.realtor.com/news/celebrity-real-estate/shohei-ohtani-california-home-photos-gallery/",
      "domain": "realtor.com",
      "type": "citation"
    },
    {
      "text": "1985899184046694816",
      "url": "https://x.com/MLB/status/1985899184046694816",
      "domain": "x.com",
      "type": "citation"
    },
    {
      "text": "22801c4230f171d493c9ccb2",
      "url": "https://www.sportingnews.com/us/mlb/los-angeles-dodgers/news/shohei-ohtani-new-balance-contract-shoe-logo-apparel-dodgers/22801c4230f171d493c9ccb2",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "119994373.cms",
      "url": "https://timesofindia.indiatimes.com/sports/mlb/news/shohei-ohtanis-complete-endorsement-list-inside-mlbs-biggest-marketing-machine/articleshow/119994373.cms",
      "domain": "timesofindia.indiatimes.com",
      "type": "citation"
    },
    {
      "text": "Mlb Highest Paid Players 2023 Scherzer Judge Ohtani 1234717401",
      "url": "https://www.sportico.com/personalities/athletes/2023/mlb-highest-paid-players-2023-scherzer-judge-ohtani-1234717401/",
      "domain": "sportico.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani",
      "url": "https://www.forbes.com/profile/shohei-ohtani/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani 2025 Earnings Los Angeles Dodgers Contract 1234874646",
      "url": "https://www.sportico.com/personalities/athletes/2025/shohei-ohtani-2025-earnings-los-angeles-dodgers-contract-1234874646/",
      "domain": "sportico.com",
      "type": "citation"
    },
    {
      "text": "47559",
      "url": "https://english.kyodonews.net/articles/-/47559",
      "domain": "english.kyodonews.net",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Endorsements 100 Million Dodgers",
      "url": "https://www.truebluela.com/2025/3/20/24389937/shohei-ohtani-endorsements-100-million-dodgers",
      "domain": "truebluela.com",
      "type": "citation"
    },
    {
      "text": "What Is Los Angeles Dodgers Star Shohei Ohtanis Nickname In Mlb N",
      "url": "https://en.as.com/mlb/what-is-los-angeles-dodgers-star-shohei-ohtanis-nickname-in-mlb-n/",
      "domain": "en.as.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Japanese Media Coverage",
      "url": "https://www.latimes.com/sports/angels/story/2023-03-21/shohei-ohtani-japanese-media-coverage",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Keeping Shohei Ohtani",
      "url": "https://www.espn.com/mlb/story/_/id/38025130/keeping-shohei-ohtani",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "U S And Japan Shattering Viewership Baseball Records",
      "url": "https://worldbaseball.com/u-s-and-japan-shattering-viewership-baseball-records/",
      "domain": "worldbaseball.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani At The Center Of World Series International Reach",
      "url": "https://www.mlb.com/news/shohei-ohtani-at-the-center-of-world-series-international-reach",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Ohtani World Series Television Japan Us Hnk",
      "url": "https://www.cnn.com/2024/10/30/asia/ohtani-world-series-television-japan-us-hnk",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Los Angeles Angels Pitching",
      "url": "https://www.si.com/mlb/2018/04/17/shohei-ohtani-los-angeles-angels-pitching",
      "domain": "si.com",
      "type": "citation"
    },
    {
      "text": "Searching For Shohei Ohtani Inside The Japanese Medias Daily Grind",
      "url": "https://www.nytimes.com/athletic/966931/2019/05/07/searching-for-shohei-ohtani-inside-the-japanese-medias-daily-grind/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Media Coverage Of Shohei Ohtani Increasingly",
      "url": "https://robertwhiting.substack.com/p/media-coverage-of-shohei-ohtani-increasingly",
      "domain": "robertwhiting.substack.com",
      "type": "citation"
    },
    {
      "text": "Ippei Mizuhara Ex Interpreter Shohei Ohtani Pleads Guilty",
      "url": "https://www.espn.com/mlb/story/_/id/40277006/ippei-mizuhara-ex-interpreter-shohei-ohtani-pleads-guilty",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Gambling Scandal Explained Everything We Know As Ippei Mizuhara Pleads Guilty To Bank Fraud",
      "url": "https://www.cbssports.com/mlb/news/shohei-ohtani-gambling-scandal-explained-everything-we-know-as-ippei-mizuhara-pleads-guilty-to-bank-fraud/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Mlb Lifetime Ban Tucupita Marcano Gambling Suspends Four Others",
      "url": "https://www.latimes.com/sports/story/2024-06-04/mlb-lifetime-ban-tucupita-marcano-gambling-suspends-four-others",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Ippei Mizuhara Guilty Plea",
      "url": "https://www.mlb.com/news/ippei-mizuhara-guilty-plea",
      "domain": "mlb.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Gambling Scandal Mlb Officially Clears Dodgers Star After Investigation Into Interpreters Bets",
      "url": "https://www.cbssports.com/mlb/news/shohei-ohtani-gambling-scandal-mlb-officially-clears-dodgers-star-after-investigation-into-interpreters-bets/",
      "domain": "cbssports.com",
      "type": "citation"
    },
    {
      "text": "Ex Interpreter For Dodgers Star Shohei Ohtani Sentence Betting Case",
      "url": "https://www.cbsnews.com/losangeles/news/ex-interpreter-for-dodgers-star-shohei-ohtani-sentence-betting-case/",
      "domain": "cbsnews.com",
      "type": "citation"
    },
    {
      "text": "Ippei Mizuhara Sentencing",
      "url": "https://www.latimes.com/california/story/2025-02-06/ippei-mizuhara-sentencing",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "Ippei Mizuhara Shohei Ohtanis Former Interpreter Sentenced To 57 Months In Prison After 17 Million Theft 224636848.html",
      "url": "https://sports.yahoo.com/ippei-mizuhara-shohei-ohtanis-former-interpreter-sentenced-to-57-months-in-prison-after-17-million-theft-224636848.html",
      "domain": "sports.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Ex Ohtani Interpreter Ippei Mizuhara Federal Prison Pa",
      "url": "https://www.espn.com/mlb/story/_/id/45524244/ex-ohtani-interpreter-ippei-mizuhara-federal-prison-pa",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani Interpreter Ippei Mizuhara Prison",
      "url": "https://www.nytimes.com/athletic/6430511/2025/06/16/shohei-ohtani-interpreter-ippei-mizuhara-prison/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "3376531",
      "url": "https://www.nbclosangeles.com/news/sports/dodgers-secret-weapon-shohei-ohtani-new-interpreter-will-ireton/3376531/",
      "domain": "nbclosangeles.com",
      "type": "citation"
    },
    {
      "text": "Shohei Ohtani New Interpreter Will Ireton Dodgers",
      "url": "https://www.latimes.com/sports/dodgers/story/2024-03-27/shohei-ohtani-new-interpreter-will-ireton-dodgers",
      "domain": "latimes.com",
      "type": "citation"
    },
    {
      "text": "88eba4ed27110b5657847a88",
      "url": "https://www.sportingnews.com/us/mlb/los-angeles-dodgers/news/shohei-ohtani-gambling-scandal-mlb-investigation-dodgers-star-interpreter/88eba4ed27110b5657847a88",
      "domain": "sportingnews.com",
      "type": "citation"
    },
    {
      "text": "Has Shohei Ohtani Lived Up To Expectations",
      "url": "https://goldsea.com/article_details/has-shohei-ohtani-lived-up-to-expectations",
      "domain": "goldsea.com",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:14:31.104068",
  "elapsed_ms": 24043
}