{
  "topic": "Star Wars",
  "title": "_Star Wars_",
  "slug": "star-wars",
  "grokipedia_slug": "Star_Wars",
  "grokipedia_url": "https://grokipedia.com/page/Star_Wars",
  "source": "grokipedia",
  "content": "# _Star Wars_\n\n*Star Wars* is an epic space opera media franchise that depicts adventures in a distant galaxy, where the mystical energy field known as the Force binds all life and fuels conflicts between the noble Jedi Order and the malevolent Sith, alongside interstellar wars involving the Galactic Republic, the Empire, and the Rebel Alliance. Created by filmmaker George Lucas and produced by Lucasfilm, the franchise originated with the 1977 film *Star Wars* (later retitled *Star Wars: Episode IV – A New Hope*), which introduced core characters like Luke Skywalker, Princess Leia, Han Solo, and Darth Vader, and became the highest-grossing film of all time upon release, earning $775 million worldwide.\n\nThe original trilogy (*A New Hope* in 1977, *The Empire Strikes Back* in 1980, and *Return of the Jedi* in 1983) established the foundational mythology of redemption, heroism, and the balance of the Force, while the prequel trilogy (*The Phantom Menace* in 1999, *Attack of the Clones* in 2002, and *Revenge of the Sith* in 2005) explored the origins of key figures like Anakin Skywalker and the fall of the Republic. The sequel trilogy (*The Force Awakens* in 2015, *The Last Jedi* in 2017, and *The Rise of Skywalker* in 2019) concluded the Skywalker Saga, with spin-off films including *Rogue One: A Star Wars Story* (2016) and *Solo: A Star Wars Story* (2018) expanding the universe's lore. In 2012, The Walt Disney Company acquired Lucasfilm for $4.05 billion, leading to renewed expansion under president Kathleen Kennedy.\n\nBeyond cinema, *Star Wars* encompasses dozens of animated and live-action television series—such as *Star Wars: The Clone Wars* (2008–2020), *Star Wars Rebels* (2014–2018), *The Mandalorian* (2019–present), *The Book of Boba Fett* (2021–2022), *Obi-Wan Kenobi* (2022), *Andor* (2022–present), *Ahsoka* (2023–present), and *The Acolyte* (2024)—primarily streaming on Disney+, alongside novels, comic books, video games like *Star Wars Jedi: Fallen Order* (2019) and *Star Wars Outlaws* (2024), and theme park attractions at Walt Disney World and Disneyland. The theatrical films have collectively grossed over $10 billion at the global box office, making *Star Wars* the second-highest-grossing film franchise after the Marvel Cinematic Universe.\n\nThe franchise has profoundly shaped popular culture by reviving the space opera genre, revolutionizing toy marketing through innovative action figures that became collectibles, and inspiring advancements in visual effects and storytelling across entertainment. Its themes of good versus evil, drawn from mythology, serial adventures, and Eastern philosophy, have influenced generations, fostering a dedicated fanbase and spawning conventions like Star Wars Celebration while embedding terms like \"Jedi\" and \"the Force\" into everyday language.\n\n## Overview\n\n### Premise\n\nStar Wars is a sprawling space opera epic set in a distant galaxy, chronicling the conflict between a heroic Rebel Alliance and the tyrannical Galactic Empire, with the central narrative revolving around the Skywalker family and their connection to the mystical Force. The saga explores themes of rebellion, redemption, and the eternal struggle between light and darkness, unfolding across vast interstellar distances amid diverse worlds inhabited by humans, aliens, and sentient droids. Travel between these worlds occurs via hyperspace, a dimension allowing faster-than-light navigation through established routes that connect the galaxy's core systems to its remote frontiers.\n\nAt the heart of the Star Wars universe lies the Force, a mysterious energy field created by all forms of life that binds the galaxy together and permeates every aspect of existence. Sensitive individuals can harness the Force for extraordinary abilities, such as telekinesis, precognition, and enhanced physical prowess, but it possesses two opposing aspects: the light side, which promotes harmony, selflessness, and protection of life, and the dark side, which fuels aggression, fear, and domination. The Skywalker family lineage embodies this duality, with generations torn between these forces in their quest for balance.\n\nKey archetypes define the saga's conflicts, including the Jedi, an ancient order of Force-sensitive guardians who serve as peacekeepers, upholding justice and defending the innocent through discipline and wisdom. In opposition stand the Sith, their dark counterparts who embrace the Force's shadowy side to pursue power and conquest, often operating in secrecy with a rigid rule of two: a master and an apprentice locked in a cycle of betrayal and ambition. The universe teems with diverse alien species, from wise and resilient beings like the Twi'leks to formidable warriors like the Wookiees, alongside droids—mechanical beings ranging from loyal companions to formidable combatants—that play essential roles in society, warfare, and exploration.\n\nThe overarching lore traces the galaxy's political evolution from the Galactic Republic, a democratic union spanning over a thousand generations that relied on the Jedi for stability and was governed by a senate of elected representatives from myriad worlds. This era of relative peace crumbled into the rise of the Galactic Empire, a dictatorial regime that imposed order through military might, oppression, and fear, dismantling the Republic's ideals in favor of absolute control. Following the Empire's downfall, the New Republic emerged as a restorative government, seeking to rebuild unity and democracy while grappling with the scars of imperial tyranny and emerging threats.\n\n### Fictional universe\n\nThe Star Wars fictional universe encompasses a vast galaxy far, far away, structured around a chronological timeline divided into distinct eras that span thousands of years. These eras form the shared canon across all official media, providing a framework for the galaxy's history and conflicts. The timeline begins with ancient periods and progresses through pivotal shifts in power, culminating in modern struggles.\n\nThe earliest relevant era in the current canon is the High Republic, set approximately 100 to 500 years before the events of the original trilogy, during which the Galactic Republic flourished in relative peace and the Jedi Order reached the height of its influence as galactic guardians. This period of expansion and enlightenment contrasts with the subsequent Fall of the Jedi era, occurring about 32 to 19 years before the Battle of Yavin (BBY), marked by political intrigue, the outbreak of war, and the dramatic collapse of the Jedi Order alongside the rise of the Galactic Empire. Following this, the Reign of the Empire era spans from 19 BBY to 0 BBY, characterized by Imperial consolidation of power through authoritarian rule and suppression of dissent across the galaxy.\n\nThe timeline continues into the Age of Rebellion (5 BBY to 5 ABY), a time of escalating insurgency as the Rebel Alliance challenged Imperial dominance, leading to key victories that weakened the Empire's grip. This transitions to the New Republic era, beginning around 5 ABY, where efforts to restore democracy faced ongoing threats from Imperial remnants and emerging factions. Finally, the Rise of the First Order era, starting in 34 ABY, depicts the resurgence of a militaristic regime from the Unknown Regions, igniting new tensions with the fragile New Republic. The Force, a mystical energy field binding the galaxy together, permeates all eras, influencing events through its wielders on both light and dark sides.\n\nIn April 2014, following Disney's acquisition of Lucasfilm, the company established a unified canon for the Star Wars storyline, designating all films, the 2008–2020 animated series *Star Wars: The Clone Wars*, and subsequent official media as the primary continuity. Prior Expanded Universe content—such as novels, comics, and games produced before 2014—was rebranded as \"Legends,\" rendering it non-canon and separate from the official timeline to allow for a streamlined narrative.\n\nThe galaxy itself is a spiral structure approximately 120,000 light-years in diameter, divided into concentric regions radiating from the dense core: the Core Worlds, a cluster of highly developed, populous systems; the Colonies and Inner Rim, transitional zones of expansion; the Mid Rim, with emerging trade hubs; and the Outer Rim Territories, a rugged frontier of lawless worlds and untamed space. Beyond these lie Wild Space and the Unknown Regions, largely unmapped and hazardous. Interstellar travel relies on hyperspace lanes—precharted routes through alternate dimensions that enable faster-than-light jumps, connecting key systems and facilitating commerce, migration, and warfare. Iconic planets exemplify this structure: Coruscant, an ecumenopolis in the Core Worlds serving as the galactic capital with layers of cityscapes housing trillions; Tatooine, a barren desert world in the Outer Rim known for its twin suns and moisture farming communities; and Endor, a lush forest moon in the Outer Rim, site of diverse ecosystems and hidden bases.\n\nMajor conflicts define the timeline's turning points within this canon. The Clone Wars (22–19 BBY), a galaxy-spanning war between the Galactic Republic—bolstered by clone troopers—and the secessionist Confederacy of Independent Systems, eroded democratic institutions and set the stage for authoritarian transformation. The Galactic Civil War (0–5 ABY) pitted the Rebel Alliance against the Galactic Empire in a desperate bid for freedom, featuring asymmetric guerrilla tactics against overwhelming Imperial forces, culminating in the Empire's defeat. More recently, the First Order-Resistance War (34–35 ABY) erupted as the paramilitary First Order, a successor to Imperial ideology, launched aggressive incursions against the Resistance—a volunteer force dedicated to countering this threat and protecting the New Republic.\n\n## Development\n\n### George Lucas and early years\n\nGeorge Lucas, born in 1944 in Modesto, California, developed an early passion for filmmaking during his youth, influenced by classic adventure serials and innovative directors. His vision for *Star Wars* emerged in the early 1970s, drawing heavily from the pulp science fiction serials of *Flash Gordon*, which inspired the film's adventurous tone and visual style of heroic quests in exotic settings. Lucas also incorporated elements from Akira Kurosawa's samurai epics, particularly *The Hidden Fortress* (1958), which shaped the narrative structure featuring a princess, bickering retainers, and a journey across a war-torn landscape. Additionally, Joseph Campbell's *The Hero with a Thousand Faces* (1949) profoundly impacted Lucas, providing the mythological framework of the \"hero's journey\" that underpins the protagonist's arc of departure, initiation, and return.\n\nThe development of the 1977 film, originally titled *The Star Wars*, involved extensive script revisions over several years. Lucas began with a 1973 outline and produced multiple drafts between 1974 and 1976, evolving the story from a more philosophical space opera to a focused adventure emphasizing action, mythology, and special effects; key changes included streamlining the plot around a young hero's quest and introducing iconic elements like the Death Star.#:~:text=The%20film%20was%20a%20critical,worldwide%20on%20its%20initial%20release.) To achieve groundbreaking visual effects, Lucas founded Industrial Light \\u0026 Magic (ILM) in 1975 in Van Nuys, California, assembling a team led by John Dykstra to pioneer motion-control photography and model work that revolutionized cinematic spectacle. Casting sought relative unknowns to embody the characters' everyman qualities: Mark Hamill was selected as the farmboy hero Luke Skywalker after screen tests highlighting his earnestness; Harrison Ford, previously a carpenter on Lucas's *American Graffiti*, landed the roguish Han Solo for his charismatic improvisation; and Carrie Fisher, daughter of Debbie Reynolds and Eddie Fisher, was cast as the resilient Princess Leia at age 19, bringing poise and wit to the role.\n\nUpon its May 25, 1977, release, *Star Wars* shattered box office records, earning $460.9 million domestically and $775.4 million worldwide on an $11 million budget, surpassing *Jaws* (1975) as the highest-grossing film at the time and igniting a sci-fi renaissance.) At the 50th Academy Awards in 1978, it secured seven Oscars, including Best Visual Effects for the ILM team's innovations and Best Original Score for John Williams's sweeping orchestral composition, which blended Wagnerian leitmotifs with heroic fanfares. The film's success extended to merchandising, where Lucas retained rights after 20th Century Fox undervalued them; partnerships with Kenner Products launched action figures and toys that generated hundreds of millions by 1983, funding sequels and transforming tie-ins into a core industry pillar. Complementing this, the novelization *Star Wars: From the Adventures of Luke Skywalker*, credited to Lucas but ghostwritten by Alan Dean Foster based on an early script, became a bestseller upon its November 1976 release, expanding the universe's lore and boosting pre-film hype.\n\nBy 1983, with the release of *Return of the Jedi*, the original trilogy had cemented *Star Wars* as a cultural phenomenon, permeating global pop culture through toys, comics, and fan conventions while inspiring advancements in effects and storytelling that influenced generations of filmmakers.\n\n### Disney acquisition and expansion\n\nIn October 2012, The Walt Disney Company acquired Lucasfilm Ltd. for $4.05 billion in cash and stock, gaining full control of the Star Wars franchise and its associated intellectual properties. George Lucas, the franchise's creator, initially retained an advisory role to guide the transition, particularly for upcoming films like Episode VII. However, Lucas stepped down from his advisory position and effectively retired from active involvement in Lucasfilm by 2015, allowing Disney to steer the franchise independently under president Kathleen Kennedy.\n\nTo streamline storytelling across media, Lucasfilm initiated a canon reboot in April 2014, reclassifying the previous Expanded Universe—comprising novels, comics, and games produced since 1991—as non-canonical \"Legends\" material. This reset established a unified canon limited primarily to the six theatrical films and the animated series Star Wars: The Clone Wars, enabling fresh narratives unencumbered by prior extended lore. Concurrently, Kennedy formed the Lucasfilm Story Group in 2013 to oversee continuity, comprising writers and creatives who collaborate with filmmakers, authors, and game developers to ensure cohesive world-building.\n\nDisney's expansion strategy accelerated with the November 2019 launch of Disney+, which positioned Star Wars as a cornerstone of its streaming service and facilitated a surge in television production. Series such as The Mandalorian debuted as flagship content, leveraging the platform's exclusivity to explore new eras and characters, thereby shifting emphasis from theatrical releases toward serialized storytelling. Post-sequel trilogy, which concluded with The Rise of Skywalker in 2019, box office performance for subsequent Star Wars films like Solo (2018) declined sharply compared to the trilogy's peaks, prompting a pivot to smaller-scale anthologies and TV expansions over large-budget epics.\n\nAs of 2024-2025, Lucasfilm has emphasized select film projects amid production challenges, including the hiring of director Sharmeen Obaid-Chinoy to direct a film centered on Rey Skywalker (Daisy Ridley) rebuilding the Jedi Order, announced in late 2023. As of November 2025, it remains in pre-production with a writer hired in early 2025 but faces ongoing challenges and has no confirmed release date. Rian Johnson's planned trilogy, greenlit in 2017 following his work on The Last Jedi, has been canceled as of November 2025, with no formal outlines ever developed. The High Republic era, introduced in 2021 through novels and comics set centuries before the Skywalker saga, has seen continued focus with Phase III, which concluded in July 2025 via publications like Star Wars: The High Republic – Fear of the Jedi, exploring the Jedi Order at its zenith.\n\n## Films\n\n### Original trilogy\n\nThe original trilogy, comprising *Star Wars* (later subtitled *Episode IV: A New Hope*, 1977), *The Empire Strikes Back* (1980), and *Return of the Jedi* (1983), established the core narrative of the Rebel Alliance's fight against the Galactic Empire, introducing iconic characters like Luke Skywalker, Princess Leia Organa, Han Solo, Obi-Wan Kenobi, and Darth Vader. Directed primarily by George Lucas for the first and third films, with Irvin Kershner helming the second, these movies blended space opera adventure, mythic storytelling, and groundbreaking visual effects to create a cultural phenomenon that revolutionized blockbuster filmmaking.\n\nIn *Episode IV: A New Hope*, released on May 25, 1977, young moisture farmer Luke Skywalker is recruited by the exiled Jedi Obi-Wan Kenobi after discovering a message from captive Rebel leader Princess Leia Organa, who has stolen plans to the Empire's planet-destroying Death Star battle station. Joined by smuggler Han Solo and his Wookiee co-pilot Chewbacca, along with droids R2-D2 and C-3PO, Luke and Obi-Wan rescue Leia and evade Darth Vader's forces, ultimately delivering the plans to the Rebel Alliance base on Yavin 4. In a desperate assault, Luke uses the Force—guided by Obi-Wan's spirit—to destroy the Death Star, marking a pivotal victory for the Rebellion. Production faced significant challenges, including tight deadlines and limited budgets, prompting Lucas to found Industrial Light \\u0026 Magic (ILM) in 1975; ILM pioneered motion-control cinematography and detailed model work for space battles, setting new standards for visual effects in cinema.\n\n*Episode V: The Empire Strikes Back*, directed by Irvin Kershner and released on May 21, 1980, escalates the conflict as Imperial forces track the Rebels to the frozen planet Hoth, forcing a ground battle where snowspeeders confront massive AT-AT walkers. Separated from his allies, Luke crashes on the swampy world of Dagobah and begins Jedi training under the diminutive Master Yoda, learning to confront his fears and harness the Force. Meanwhile, Han Solo, Leia, and their companions flee to Cloud City on Bespin, seeking aid from old friend Lando Calrissian, only to face betrayal as Vader captures them to lure Luke. In a lightsaber duel atop a carbon-freezing chamber, Vader reveals himself as Luke's father, severing Luke's hand before the young Jedi escapes. Kershner, granted creative freedom by Lucas, infused the film with a darker, more introspective tone, emphasizing character development and emotional stakes while collaborating with ILM on innovative practical effects like the Hoth battle sequences and Yoda's puppetry.\n\n*Episode VI: Return of the Jedi*, directed by Richard Marquand and released on May 25, 1983, culminates the saga as the Rebels learn of a second, more powerful Death Star under construction near the forest moon of Endor, protected by an energy shield. Luke returns to confront Vader and the Emperor, seeking to redeem his father from the dark side, while Han, Leia, and the team infiltrate Endor to disable the shield generator, allying with the indigenous Ewoks—small, furry warriors who initially mistake droid C-3PO for a deity. The Ewoks' guerrilla tactics aid the Rebels in overcoming Imperial forces, allowing a fleet assault on the Death Star; Luke, refusing the Emperor's temptations, sparks Vader's redemption, who sacrifices himself to save his son, destroying the Emperor and the station in a massive explosion. Production incorporated extensive location shooting in California's redwood forests for Endor and advanced stop-motion for the space battle, building on ILM's prior innovations.\n\nThe original trilogy received widespread critical acclaim for its compelling storytelling, character arcs, and technical achievements, earning Rotten Tomatoes scores of 93% for *A New Hope*, 94% for *The Empire Strikes Back*, and 83% for *Return of the Jedi*. Collectively, the films grossed approximately $1.79 billion worldwide at the box office, with *A New Hope* alone earning $775 million. In 1997, to mark the 20th anniversary, Lucasfilm released Special Edition versions with updated visual effects, restored scenes, and enhancements like expanded Cloud City sequences and a CGI Jabba the Hutt in *A New Hope*, aimed at bridging to future installments while revitalizing theatrical interest.\n\n### Prequel trilogy\n\nThe prequel trilogy, consisting of *Star Wars: Episode I – The Phantom Menace* (1999), *Star Wars: Episode II – Attack of the Clones* (2002), and *Star Wars: Episode III – Revenge of the Sith* (2005), explores the fall of the Galactic Republic and the rise of the Galactic Empire, focusing on the tragic transformation of young Anakin Skywalker into Darth Vader. Written and directed by George Lucas, who returned to the director's chair for the first time since the original trilogy, these films depict events set decades before *A New Hope*, providing backstory to key characters like Obi-Wan Kenobi and revealing Anakin's origins as the prophesied Chosen One.\n\nIn *The Phantom Menace*, Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi are dispatched to negotiate with the Trade Federation, whose blockade of Naboo escalates into an invasion orchestrated by the Sith Lord Darth Sidious. Escaping to the planet's surface, they ally with Gungan exile Jar Jar Binks and discover nine-year-old slave Anakin Skywalker on Tatooine, whose unprecedented midi-chlorian count suggests he is the Chosen One destined to bring balance to the Force. The film culminates in a podrace on Tatooine that secures Anakin's freedom, followed by battles on Naboo where Qui-Gon is killed by Sith apprentice Darth Maul, and young Obi-Wan defeats the Sith in a duel. The character of Jar Jar Binks, a comedic Gungan, drew significant backlash for his mannerisms and dialogue, which some critics and fans perceived as stereotypical and disruptive to the tone, leading to intense online harassment of actor Ahmed Best.\n\n*Attack of the Clones* advances the story ten years later, as a Separatist crisis threatens the Republic amid assassination attempts on Senator Padmé Amidala, formerly Queen of Naboo. Assigned to protect her, Anakin Skywalker—now a Jedi Knight—develops a forbidden romance with Padmé, complicated by visions of his mother's death on Tatooine, where he slaughters Tusken Raiders in rage. Meanwhile, Obi-Wan uncovers a clone army on Kamino commissioned for the Republic, tracing it to a bounty hunter network and the planet Geonosis, where he is captured. The discovery sparks the Battle of Geonosis, igniting the Clone Wars between the Republic's clone troopers and the Separatist droid army led by Count Dooku, Sidious's new apprentice. This film marked a technical milestone as the first major motion picture shot entirely on digital video using Sony's HDW-F900 cameras, enabling advanced CGI integration for expansive battle sequences and environments.\n\nThe trilogy concludes with *Revenge of the Sith*, set three years into the Clone Wars, where Obi-Wan and Anakin rescue Chancellor Palpatine from General Grievous, leader of the Separatist droid forces. Anakin's growing attachment to the pregnant Padmé and nightmares of her death make him vulnerable to Palpatine's manipulations, who reveals himself as Darth Sidious and tempts Anakin with dark side knowledge to prevent tragedy. Appointed to the Jedi Council but denied Master status, Anakin spies on the Chancellor, leading to the Council's discovery of Sidious's plot. In a pivotal turn, Anakin aids Sidious in killing Mace Windu, pledges loyalty as Darth Vader, and executes Order 66, a command that prompts the clone troopers to betray and slaughter the Jedi Order across the galaxy. Vader then leads the purge on the Jedi Temple before confronting Obi-Wan on Mustafar, resulting in his severe injuries and cybernetic reconstruction. The film adopts a darker tone, emphasizing Anakin's descent into villainy and the Republic's transformation into the Empire.\n\nProduced with heavy reliance on computer-generated imagery (CGI) by Industrial Light \\u0026 Magic, the prequels pushed visual effects boundaries, with over 2,000 effects shots per film compared to fewer than 400 in the originals, allowing for fully digital worlds like Coruscant and massive battles. Lucas's directorial return emphasized his vision of political intrigue and tragedy, though the dialogue—often described as stiff and expository—faced widespread criticism for undermining emotional depth, particularly in romantic scenes between Anakin and Padmé. Despite mixed critical reception, with Rotten Tomatoes scores of 52% for *The Phantom Menace*, 65% for *Attack of the Clones*, and 80% for *Revenge of the Sith*, the trilogy grossed approximately $2.55 billion worldwide, demonstrating strong commercial success driven by fan anticipation and merchandising.\n\n### Sequel trilogy\n\nThe sequel trilogy, comprising the final three installments of the Skywalker saga, continues the epic narrative established in the original and prequel trilogies, introducing a new generation of heroes and villains amid the ongoing conflict between the Resistance and the resurgent First Order. Directed by J.J. Abrams for the first and third films and Rian Johnson for the second, the trilogy explores themes of legacy, redemption, and the balance of the Force while reintroducing legacy characters such as Luke Skywalker in pivotal roles. Released between 2015 and 2019 under Lucasfilm's oversight following Disney's 2012 acquisition, the films marked a creative shift toward ensemble storytelling and visual spectacle, though they sparked significant debate among fans regarding narrative direction and continuity.\n\n*Star Wars: Episode VII – The Force Awakens* (2015), directed by J.J. Abrams, reignites the saga thirty years after *Return of the Jedi*, with the galaxy threatened by the First Order, a successor to the Empire led by the masked warrior Kylo Ren. The story centers on new heroes Rey, a resourceful scavenger on the desert planet Jakku; Finn, a stormtrooper who defects from the First Order; and Poe Dameron, a skilled Resistance pilot, as they join forces with smuggler Han Solo to locate Luke Skywalker and thwart the First Order's superweapon, Starkiller Base, which drains stars to unleash devastating energy blasts. Co-written by Abrams, Lawrence Kasdan, and Michael Arndt, the film blends practical effects with cutting-edge digital visuals to evoke the original trilogy's spirit while establishing Kylo Ren—revealed as Han and Leia's son, Ben Solo—as a complex antagonist torn by his dark side allegiance.\n\n*Star Wars: Episode VIII – The Last Jedi* (2017), directed and written by Rian Johnson, subverts expectations by delving into failure, doubt, and the deconstruction of Jedi mythology. Rey travels to the remote planet Ahch-To to recruit a reclusive Luke Skywalker for the Resistance's fight against the First Order, only to find him disillusioned and unwilling to return; meanwhile, she forms an unprecedented Force bond with Kylo Ren, blurring lines between light and dark as she trains under Luke's reluctant guidance. The narrative splits into parallel threads, including Vice Admiral Holdo’s desperate hyperspace pursuit of the First Order fleet and a mutiny led by Poe Dameron, culminating in the harrowing throne room battle aboard Snoke's flagship where Kylo's betrayal reshapes the power dynamics. Infused with humor through elements like the avian porgs on Ahch-To and comic relief from characters such as BB-8, the film emphasizes philosophical depth over straightforward heroism, produced by Kathleen Kennedy.\n\n*Star Wars: Episode IX – The Rise of Skywalker* (2019), directed by J.J. Abrams and co-written with Chris Terrio, concludes the saga with a high-stakes quest to confront the resurrected Emperor Palpatine, who commands a massive Sith fleet from the hidden world of Exegol. Rey grapples with her lineage tied to the Sith as she leads the Resistance alongside Finn, Poe, and a redeemed Kylo Ren—now turning back to the light as Ben Solo—against the Final Order's armada in an epic space battle featuring countless starships and Force dyad connections. The film ties up loose threads from the previous entries, emphasizing sacrifice and unity, with Abrams returning to helm production alongside Kennedy and Michelle Rejwan after Johnson's standalone approach. It grossed over $1 billion worldwide, contributing to the trilogy's total earnings of approximately $4.4 billion.\n\nThe sequel trilogy's reception was polarizing, with critics generally praising the visual effects and performances but dividing fans over creative choices, particularly Rian Johnson's subversion of tropes in *The Last Jedi*, which earned a 91% critics score on Rotten Tomatoes contrasted against a 42% audience score, fueling debates on canon consistency and character arcs like Luke's portrayal. *The Force Awakens* received broad acclaim (93% critics, 86% audience), revitalizing the franchise, while *The Rise of Skywalker* faced criticism for rushed plotting and the abrupt return of Palpatine (51% critics, 86% audience), exacerbating fan divisions on narrative coherence across the trilogy. Despite commercial success totaling $4.4 billion globally, these debates highlighted tensions between innovation and fidelity to established lore, diminishing enthusiasm among some die-hard fans.\n\n### Anthology films\n\nThe anthology films in the Star Wars franchise consist of standalone feature-length stories set within the broader universe but independent of the main Skywalker saga, allowing for exploration of side characters and events. These productions emphasize self-contained narratives, often delving into the gritty underbelly of galactic conflict or personal origins, and represent Lucasfilm's effort to diversify storytelling beyond the core trilogies. Released under the \"A Star Wars Story\" banner, they prioritize heist-like missions or character backstories while maintaining ties to established lore.\n\n*Rogue One: A Star Wars Story* (2016), directed by Gareth Edwards, centers on a team of Rebel spies led by Jyn Erso who undertake a desperate heist to steal the plans for the Empire's superweapon, the Death Star. The film underwent extensive reshoots supervised by screenwriter Tony Gilroy, who reworked significant portions including the ending to align with Lucasfilm's vision. Produced on a budget of approximately $280 million, it grossed over $1.05 billion worldwide, marking a commercial success that highlighted the appeal of war-focused tales in the franchise. A notable sequence features Darth Vader in a climactic cameo, directly linking to the original trilogy's opening.\n\n*Solo: A Star Wars Story* (2018) explores the early life of smuggler Han Solo, depicting his aspirations to become a pilot amid Imperial oppression, his alliance with Chewbacca, and encounters in the criminal underworld that shape his roguish persona. Originally helmed by Phil Lord and Christopher Miller, the production faced creative clashes leading to their dismissal after principal photography; Ron Howard was brought in to direct reshoots, fundamentally altering the tone to a more grounded adventure. With a budget exceeding $300 million, it earned $393 million globally, underperforming expectations due in part to production turmoil and audience fatigue following prior Star Wars releases.\n\nThese anthology entries expanded the Star Wars universe by emphasizing gritty war elements and character-driven exploits without the saga's overarching prophecy constraints, appealing to adult audiences seeking mature themes like espionage and moral ambiguity. *Rogue One* in particular garnered praise for its intense, battle-heavy depiction of the Rebellion's sacrifices, satisfying fans' desire for gravitas in the franchise. While *Solo* received mixed reviews for its uneven execution despite strong performances, both films demonstrated the potential for spin-offs to enrich the lore through focused, non-episodic narratives.\n\n### Upcoming films\n\nAs of November 2025, Lucasfilm has no Star Wars theatrical films scheduled for release that year, though multiple projects received updates and announcements at Star Wars Celebration 2025 in April. The pipeline emphasizes a mix of sequels to live-action series, Skywalker Saga continuations, and standalone stories exploring new eras, with production underway on the nearest entry.\n\n**The Mandalorian \\u0026 Grogu**, directed by Jon Favreau, serves as a direct continuation of the Disney+ series *The Mandalorian*, following bounty hunter Din Djarin (Pedro Pascal) and his young charge Grogu in adventures set after the events of *Return of the Jedi*. The film features additional cast including Sigourney Weaver and Jeremy Allen White voicing Rotta the Hutt, and entered production in 2024 with a release date of May 22, 2026.\n\nThe **New Jedi Order** film, directed by Sharmeen Obaid-Chinoy, stars Daisy Ridley reprising her role as Rey from the sequel trilogy, depicting her efforts to rebuild the Jedi Order approximately 15 years after *The Rise of Skywalker*. This project, which extends the Skywalker Saga's endpoint, remains in development without a confirmed release date or further casting announcements as of November 2025.\n\n**Dawn of the Jedi**, helmed by James Mangold, explores the prehistoric origins of the Force, centering on the first humans to harness its power around 25,000 years before the Skywalker Saga. The film is in early development stages, with no release date, cast, or production timeline disclosed yet.\n\nAmong other announced projects, Taika Waititi's untitled film is in the script development phase, aiming for a fresh take on the franchise without specified plot details or timeline. Shawn Levy's *Star Wars: Starfighter*, revealed at Star Wars Celebration 2025, stars Ryan Gosling as a new pilot in a standalone story set after *The Rise of Skywalker*, with production slated to begin in fall 2025 and a release on May 28, 2027; additional cast includes Mia Goth, Matt Smith, and Amy Adams. A Lando Calrissian film starring Donald Glover, originally developed as a series before converting to a movie, focuses on the character's earlier exploits and remains in development with an unknown status and release. Meanwhile, Rian Johnson's planned trilogy has stalled, with the director confirming in 2025 that it progressed no further beyond initial concepts.\n\nAdditional projects in development include an untitled film directed by Dave Filoni, serving as a climactic story tying together the Mandalorian-era series such as *The Mandalorian*, *Ahsoka*, and *The Book of Boba Fett*, set after *Return of the Jedi*, with no release date announced. Simon Kinberg's trilogy, intended as Episodes X–XII of the Skywalker Saga and set after *The Rise of Skywalker* with new characters, is also in early development without a timeline. Patty Jenkins' *Rogue Squadron*, focusing on new X-wing pilots, has reportedly returned to active development, though details remain limited.\n\n## Television\n\n### Animated series\n\nThe animated series within the Star Wars franchise utilize varied animation styles, including 3D CGI and anime, to explore untold stories across the galaxy's timeline, contributing significantly to the official canon by introducing new characters and deepening lore.\n\n*Star Wars: The Clone Wars*, running from 2008 to 2020 across seven seasons, depicts the conflicts of the Clone Wars era between *Episode II: Attack of the Clones* and *Episode III: Revenge of the Sith*, with supervising director Dave Filoni overseeing its production by Lucasfilm Animation. The series introduces Ahsoka Tano as Anakin Skywalker's Padawan, a Togruta Jedi who becomes a pivotal figure in subsequent Star Wars narratives. Episodes typically run about 22 minutes and blend action, character development, and moral dilemmas faced by Jedi and clone troopers against Separatist forces.\n\n*Star Wars Rebels*, airing from 2014 to 2018 over four seasons, is set in the years following *Revenge of the Sith*, chronicling the early formation of the Rebel Alliance against the Galactic Empire. Produced by Lucasfilm Animation, it follows a ragtag crew aboard the Ghost, including the blind Jedi Kanan Jarrus voiced by Freddie Prinze Jr., as they undertake sabotage missions and evade Imperial forces. The series emphasizes themes of hope and resistance, introducing elements like the Inquisitors that tie into the original trilogy.\n\n*Star Wars: The Bad Batch*, spanning 2021 to 2024 with three seasons, centers on an elite squad of genetically enhanced clone troopers who defect after Order 66, navigating a post-Republic galaxy filled with bounty hunters and Imperial experiments. The show, also from Lucasfilm Animation, prioritizes high-octane action sequences and survival challenges, directly continuing storylines from *The Clone Wars*.\n\n*Star Wars Resistance*, airing from 2018 to 2020 over two seasons, is set in the aftermath of the original trilogy and follows young pilots training for the Resistance against the First Order. Produced by Lucasfilm Animation, it features 2D animation and ties into sequel trilogy lore, including early appearances by Poe Dameron.\n\nOther animated entries include the anthology series *Star Wars: Visions*, which debuted in 2021 and continued with volumes in 2023 and 2025, featuring original shorts from Japanese anime studios that reimagine Star Wars lore in non-canonical, stylistically diverse formats. Complementing these are short-form series like *Tales of the Jedi* (2022) and *Tales of the Empire* (2024), each comprising six animated vignettes exploring Jedi and Imperial perspectives during the prequel and original trilogy eras, supervised by Dave Filoni. For younger audiences, *Star Wars: Young Jedi Adventures* (premiering 2023) ties into the High Republic era, following padawans learning the Force about 200 years before *The Phantom Menace*.\n\nThese series have filled critical timeline gaps in the Star Wars canon, such as the interwar periods and early Rebellion, while characters like Ahsoka Tano have crossed over into live-action productions. On Disney+, the animated offerings have collectively drawn millions of global views, enhancing the franchise's accessibility across age groups.\n\n### Live-action series\n\nThe live-action series produced for Disney+ mark a significant evolution in the Star Wars franchise, shifting from cinematic spectacles to serialized storytelling with expansive budgets and interconnected narratives that expand the galaxy's lore. These shows, often helmed by high-profile creators like Jon Favreau and Dave Filoni, emphasize character-driven arcs, practical effects blended with cutting-edge virtual production techniques, and ties to the broader saga, including crossovers between series and references to the films. With production costs frequently surpassing $200 million per season for flagship entries, they leverage massive sets, elaborate VFX, and star-studded casts to deliver immersive experiences that rival theatrical releases.\n\nThe Mandalorian, which premiered in November 2019 and concluded its three-season run in 2023, follows a lone bounty hunter navigating the outer reaches of the galaxy after the Empire's fall, protecting a mysterious young alien known as \"Baby Yoda\" or Grogu. Created by Jon Favreau, the series introduced groundbreaking virtual production using LED walls for realistic environments, and Grogu's debut sparked a global merchandising and cultural phenomenon, boosting Disney+ subscriptions significantly. Its high-stakes episodic structure and cameos from legacy characters like Luke Skywalker underscored the interconnected nature of the post-Return of the Jedi era.\n\nThe Book of Boba Fett, a 2021-2022 spin-off from The Mandalorian, centers on the titular clone bounty hunter claiming territory as a crime lord on Tatooine, exploring his survival after the Sarlacc pit and his alliance with Fennec Shand. Starring Temuera Morrison and Ming-Na Wen, the seven-episode season delves into underworld power struggles but received mixed reviews for its pacing and fan-service heavy episodes, including crossovers with Din Djarin and Grogu that advanced the larger Mandalorian storyline. Despite criticisms, it achieved strong viewership, with its finale drawing 1.5 million U.S. households on premiere day.\n\nObi-Wan Kenobi, the 2022 limited series, reunites Ewan McGregor as the exiled Jedi Master in a tale set 10 years after Revenge of the Sith, focusing on his mission to rescue young Leia Organa from Imperial forces led by the Inquisitors. Directed by Deborah Chow, it highlights McGregor's return alongside Hayden Christensen as Darth Vader, emphasizing themes of loss and redemption while introducing Inquisitor Reva (Moses Ingram) as a key antagonist hunting surviving Jedi. The six-episode arc addressed plot gaps from the prequel films and garnered praise for its emotional depth and action sequences.\n\nAndor, debuting in 2022 with its second and final season concluding in May 2025, serves as a gritty prequel to Rogue One, chronicling Cassian Andor's radicalization into a rebel spy amid rising Imperial oppression. Created by Tony Gilroy, the series adopts a political thriller tone, foregrounding espionage, moral ambiguity, and societal unrest over lightsaber duels, earning acclaim as one of the franchise's most mature entries. Season 2, spanning four years leading to Rogue One, featured intense ensemble performances from Diego Luna and new cast members like Ben Mendelsohn, culminating in high viewership peaks of 830 million minutes in its final weeks.\n\nSubsequent series further weave the live-action tapestry, with Ahsoka launching in 2023 to explore the former Jedi's quest involving Grand Admiral Thrawn and Ezra Bridger, starring Rosario Dawson and achieving premiere viewership comparable to The Mandalorian's third season at 829 million minutes. Skeleton Crew, a 2024-2025 family-oriented adventure following four children lost in the galaxy and aided by Jude Law's enigmatic figure, emphasized youthful exploration but underperformed in viewership, with its premiere drawing under 382 million viewing minutes according to Nielsen data—the lowest for any Star Wars Disney+ series debut. The Acolyte, set in the High Republic era during 2024, depicted a Jedi Master's investigation into dark-side crimes but was canceled after one season amid mixed reception and lower-than-expected viewership. These productions collectively set viewership benchmarks for Disney+, with interconnected arcs like Thrawn's threat linking Ahsoka to future narratives.\n\n### Specials and shorts\n\nThe Star Wars Holiday Special, a 98-minute musical variety program produced by CBS, aired once on November 17, 1978, and centered on Chewbacca's family celebrating the Wookiee holiday of Life Day amid Imperial interference. Featuring appearances by the original cast including Mark Hamill, Harrison Ford, and Carrie Fisher, alongside guest stars like Bea Arthur and Art Carney, the special incorporated comedy sketches, musical performances, and an animated segment introducing the bounty hunter Boba Fett. It drew an estimated 13 million viewers but faced immediate backlash for its disjointed structure and dated 1970s television style, with creator George Lucas publicly disavowing it due to lack of creative control and vowing it would never be rereleased officially. Despite the panning, its cult status endures among fans for its historical significance as the franchise's first foray into holiday-themed content.\n\nDecades later, Disney+ revived the holiday special format with more playful entries in the Lego Star Wars series, beginning with *The Lego Star Wars Holiday Special* on November 17, 2020. This 44-minute CGI-animated production follows Rey, Kylo Ren, and other saga characters on a multiverse-spanning quest to understand the Force during Life Day celebrations, blending parody with timeline mash-ups for humorous effect. It earned praise for its accessible humor and visual creativity, achieving a 74% approval rating on Rotten Tomatoes based on 58 reviews.\n\nThe Lego franchise continued with seasonal specials like *Lego Star Wars: Terrifying Tales*, a 48-minute Halloween anthology released on October 1, 2021. Set after *The Rise of Skywalker*, it depicts Poe Dameron and BB-8 crash-landing on Mustafar, where they hear three eerie stories from Darth Vader's servant Vaneé involving characters such as Ben Solo, Darth Maul, and Luke Skywalker, framed by a quest for ancient Sith artifacts. The special balanced scares with comedy, receiving positive feedback for its family-oriented thrills and 100% Tomatometer score from limited critics.\n\nIn 2024, *Lego Star Wars: Rebuild the Galaxy* expanded the format into a four-episode animated miniseries totaling about 88 minutes, premiering on Disney+ on September 13. The story follows nerf-herder Sig Greebling, who activates a Jedi artifact that swaps roles across the galaxy—turning heroes into villains and vice versa—prompting a chaotic adventure with reimagined versions of Darth Jar Jar and Emperor Palpatine as a bantha. Celebrated for its inventive \"what if\" parodies and voice cameos from Tony Revolori and Mark Hamill, it secured a 100% Rotten Tomatoes rating from nine reviews, highlighting its role in refreshing Lego's Star Wars humor.\n\nOther one-off shorts include the animated *Obi-Wan Kenobi* entry from the *Star Wars Galaxy of Adventures* collection, a three-minute summary of the Jedi Master's life and battles released on October 28, 2020, which recaps his journey from padawan to exile on Tatooine. More recently, *Star Wars: Tales of the Underworld*, a set of six original animated shorts totaling around 60 minutes, debuted on Disney+ on May 4, 2025. Focusing on crime syndicates beyond Jedi and Sith conflicts, the anthology splits into stories about former Sith assassin Asajj Ventress navigating bounty hunting post-Order 66 and veteran gunslinger Cad Bane mentoring a young Boba Fett in underworld dealings. It earned acclaim for deepening criminal elements of the galaxy, with particular praise for the tense Cad Bane arcs.\n\nThe experimental anthology *Star Wars: Visions Volume 3* further diversified shorts with nine anime episodes from studios like Kamikaze Douga and Production I.G., released on Disney+ on October 29, 2025, for a combined runtime of approximately 120 minutes. Drawing on Japanese animation styles, the volume explores non-canon tales such as a Mandalorian-inspired samurai story and a Force-sensitive orphan's origin, emphasizing visual innovation over saga ties. Reception was generally positive for its artistic ambition, with a 100% Rotten Tomatoes score from 16 reviews, though some noted pacing inconsistencies in individual segments.\n\n## Other media\n\n### Literature\n\nThe Star Wars literary franchise encompasses a vast array of novels, young adult books, and short stories that expand the universe beyond the films, beginning with the 1976 novelization of *A New Hope*. Ghostwritten by Alan Dean Foster and credited to George Lucas, this paperback—published by Ballantine Books ahead of the film's release—introduced key elements like midi-chlorians and provided deeper backstory for characters such as Obi-Wan Kenobi, selling millions and setting the stage for tie-in publishing.\n\nDuring the Del Rey publishing era from 1977 to 2014, dozens of original novels and series formed the Expanded Universe (EU), later rebranded as Legends following Disney's 2012 acquisition of Lucasfilm. This period included young reader series like *Junior Jedi Knights* (1995–1997), a six-book set by Nancy Richardson and Rebecca Moesta focusing on Anakin and Jacen Solo's adventures at Luke Skywalker's Jedi academy, emphasizing themes of friendship and temptation by the dark side.\n\nThe seminal Legends storyline, the Thrawn trilogy (1991–1993) by Timothy Zahn, revitalized the franchise with *Heir to the Empire*, *Dark Force Rising*, and *The Last Command*, introducing the Chiss Grand Admiral Thrawn as a strategic Imperial threat against the New Republic, and selling over 15 million copies combined. Another major Legends arc, the 19-volume *New Jedi Order* series (1999–2003), depicted an extragalactic invasion by the Yuuzhan Vong, resulting in widespread Jedi casualties and reshaping the galaxy, with contributions from authors like James Luceno and Troy Denning. These works were declared non-canon in 2014 to align with new film continuities.\n\nIn the current canon, established post-2014, novels integrate directly with films and series, prioritizing cohesive storytelling. Zahn's Thrawn adaptations include the 2017–2019 trilogy (*Thrawn*, *Alliances*, *Treason*), reimagining the character's rise in the Empire, followed by the prequel *Thrawn Ascendancy* trilogy (2020–2021), all exploring his tactical genius and alien heritage.\n\nThe multimedia *Star Wars: The High Republic* initiative, launched in 2021, has produced over 20 canon novels by 2025 across adult, young adult, and middle-grade formats, set 200 years before *The Phantom Menace* and chronicling the Jedi's golden age amid threats from the Nihil marauders. Key entries include Charles Soule’s *Light of the Jedi* (2021), Claudia Gray’s *Into the Dark* (2021, Phase I), and ongoing Phase III releases like George Mann’s *Trials of the Jedi* (spring 2025), highlighting Jedi exploration, hyperspace beacons, and emerging darkness.\n\nUpcoming canon works include *Master of Evil* (November 2025) by Adam Christopher, a Darth Vader-centered novel delving into his post-Revenge of the Sith psyche, dark rituals, and quest for immortality amid Imperial hunts.\n\nStar Wars novels have collectively sold over 160 million copies worldwide, with authors like Zahn and Gray driving enduring popularity through character-driven narratives that probe Force philosophy and galactic conflicts.\n\n### Comics\n\nStar Wars comics have been a cornerstone of the franchise's expanded universe since 1977, when Marvel Comics launched the first adaptation of the original film just before its theatrical release. Marvel held the license until 1986, producing 138 issues that closely followed the movie's storyline before venturing into original tales. In 1991, Dark Horse Comics acquired the rights and dominated the medium for over two decades, releasing hundreds of issues that built the expansive Legends continuity until the license expired in 2014.\n\nFollowing Disney's acquisition of Lucasfilm, Marvel regained the license in 2015, shifting all new publications to official canon under Lucasfilm's oversight. The flagship Star Wars series relaunched that year, alongside spin-offs exploring various eras, with ongoing runs continuing to expand the lore through serialized graphic narratives. Dark Horse returned in 2022 with select all-ages titles, complementing Marvel's output while maintaining canon alignment for its contributions. Notable among these is the 2025 Star Wars series by writer Alex Segura and artist Phil Noto, set in the post-Return of the Jedi New Republic era, delving into the galaxy's reconstruction after the Empire's fall.\n\nKey canon series have spotlighted iconic characters and untapped timelines, such as the multiple Darth Vader runs: the 2015-2016 volume by Kieron Gillen and Salvador Larroca, which follows Vader's immediate post-A New Hope machinations against rivals seeking to exploit his vulnerabilities; the 2017-2018 Dark Lord of the Sith by Charles Soule, tracing his early Imperial hunts for Force-sensitive artifacts; and the ongoing 2020 series by Greg Pak, where Vader pursues revenge against those who concealed Luke Skywalker's upbringing. The High Republic Adventures, published by IDW (in partnership with Dark Horse elements post-2022), written by Daniel José Older with artists like Harvey Tolibao, chronicles young Jedi padawans' exploits 200 years before The Phantom Menace, emphasizing themes of exploration and unity. Recent releases like the 2024-2025 Battle of Jakku miniseries by Alex Segura, illustrated by Leonard Kirk and others, depict the Galactic Civil War's climactic endgame, bridging the original and sequel trilogies through Luke Skywalker's emerging Jedi Order and Imperial holdouts.\n\nThese comics, totaling over a thousand issues across publishers, have profoundly shaped Star Wars lore by visually deepening side characters and untold stories, such as Qi'ra's ascent as Crimson Dawn's leader in the 2021-2022 Crimson Reign miniseries by Charles Soule, where she orchestrates a galaxy-spanning plot against the Sith from the shadows. Artists like Larroca and Noto have brought dynamic, cinematic panels to life, enhancing emotional depth and action sequences that tie into broader multimedia narratives, including brief novel crossovers for shared universe cohesion.\n\n### Video games\n\nThe video game adaptations of Star Wars began shortly after the release of the original film in 1977, with the first licensed title being *Star Wars: The Empire Strikes Back* in 1982, a side-scrolling shooter for the Atari 2600 and Intellivision developed by Parker Brothers that recreated the Battle of Hoth using simple vector-style graphics. This game marked the entry of the franchise into interactive entertainment, emphasizing vehicular combat over narrative depth due to hardware limitations of the era. Subsequent early titles included the 1983 arcade game *Star Wars* by Atari, a cockpit simulator allowing players to pilot an X-wing in trench runs against the Death Star, which became a commercial hit and influenced future space combat simulations. From 1983 to 1993, developers like Atari, Parker Brothers, and Ubisoft produced around a dozen licensed games across platforms including the NES and Commodore 64, focusing on action, racing, and platforming interpretations of the original trilogy, though none achieved the lasting impact of later entries.\n\nIn 1993, LucasArts (formerly Lucasfilm Games) assumed direct control over Star Wars video game development and publishing, ushering in a golden age that lasted until 2013 and produced over 50 titles spanning genres from flight simulators to role-playing games. The era's breakthrough was the *X-Wing* series starting in 1993, a space combat simulator by Totally Games that let players command Rebel starfighters in authentic battles, praised for its tactical depth and immersive storytelling tied to the films. First-person shooters like *Star Wars: Dark Forces* (1995), developed in-house by LucasArts, introduced Kyle Katarn as a protagonist and pioneered 3D environments in the franchise, evolving into the *Jedi Knight* subseries with lightsaber duels and moral choices. The pinnacle of this period was *Star Wars: Knights of the Old Republic* (2003), an RPG by BioWare published by LucasArts, set 4,000 years before the films and renowned for its branching narrative, character development, and influence on Western RPG design, earning widespread acclaim as a franchise high point.\n\nFollowing Disney's acquisition of Lucasfilm in 2012, Electronic Arts (EA) secured the exclusive licensing rights in 2013, shifting focus to high-budget, multi-platform releases starting in 2014 that emphasized online multiplayer and cinematic single-player experiences. The *Star Wars Battlefront* reboot (2015) by DICE revived the classic multiplayer shooter series with large-scale battles across iconic locations like Hoth and Endor, supporting up to 40 players and integrating film-inspired modes without a traditional single-player campaign. Its sequel, *Star Wars Battlefront II* (2017), addressed criticisms by adding a substantial story mode and progression system, though initial loot box controversies led to revisions that improved its reception and longevity. Single-player titles gained prominence with *Star Wars Jedi: Fallen Order* (2019) by Respawn Entertainment, a souls-like action-adventure following Jedi Padawan Cal Kestis, which sold over 10 million units and revitalized narrative-driven gameplay in the canon timeline. The sequel, *Star Wars Jedi: Survivor* (2023), continued Cal's story with expanded exploration and combat, achieving commercial success with millions of players and surpassing its predecessor's engagement metrics. Overall, EA's Star Wars portfolio has generated more than $5 billion in net bookings through sales, microtransactions, and live services as of 2024.\n\nAs of November 2025, the franchise's gaming landscape includes ongoing support for mobile titles like *Star Wars: Hunters* (2024) by Zynga, a free-to-play arena shooter featuring original characters in multiplayer battles across galactic arenas. Upcoming projects reflect diversification, with *Star Wars Eclipse* by Quantic Dream delayed from its 2021 announcement and now targeting a post-2025 release, promising a branching narrative action-adventure in the High Republic era with multiple playable protagonists. Ubisoft's open-world action-adventure *Star Wars Outlaws* (2024) explores the underworld between *The Empire Strikes Back* and *Return of the Jedi*, setting the stage for potential expansions or sequels, while a rumored third *Jedi* installment from Respawn is in early development, building on the series' success.\n\n### Audio and music\n\nThe music of the Star Wars franchise, primarily composed by John Williams, has become synonymous with epic orchestral scores that define its cinematic identity. Williams composed the scores for all nine main saga films, starting with the original 1977 film *Star Wars* (later subtitled *A New Hope*), for which he won the Academy Award for Best Original Score in 1978. His work earned additional Oscar nominations for *The Empire Strikes Back* (1980), *Return of the Jedi* (1983), *The Phantom Menace* (1999), *Attack of the Clones* (2002), *Revenge of the Sith* (2005), *The Force Awakens* (2015), *The Last Jedi* (2017), and *The Rise of Skywalker* (2019). Iconic themes such as the \"Imperial March,\" introduced in *The Empire Strikes Back* to represent Darth Vader, premiered in 1980 and have since become cultural staples, frequently performed in concert halls and integrated into popular media.\n\nStar Wars soundtracks have been released as albums since 1977, with Williams' compositions forming the core, often featuring leitmotifs that recur across films to underscore character arcs and narrative tension. Notable releases include the 1999 soundtrack for *The Phantom Menace*, which highlighted the choral \"Duel of the Fates\" as a single that charted internationally and won a Grammy for Best Instrumental Composition. Subsequent composers have expanded the auditory palette; for instance, Michael Giacchino scored the 2016 anthology film *Rogue One: A Star Wars Story*, blending Williams-inspired orchestration with modern electronic elements in tracks like the main theme, released on Walt Disney Records. These albums have collectively sold tens of millions of copies worldwide, establishing Star Wars scores as among the best-selling film soundtracks in history.\n\nBeyond film scores, Star Wars has a rich tradition of audio productions, including audiobooks and radio dramas that adapt stories for auditory immersion. Audible offers over 60 canon audiobooks, narrated by actors like Marc Thompson and featuring sound effects and full casts to dramatize novels such as *Thrawn* by Timothy Zahn, aligning with the official timeline established by Lucasfilm. Earlier radio adaptations include National Public Radio's dramatizations of the original trilogy: *Star Wars* aired from March to May 1981, *The Empire Strikes Back* from February to April 1983, and *Return of the Jedi* in late 1996, expanding on the films with additional scenes and sound design produced under George Lucas's supervision.\n\nIn 2025, new audio releases continued to enrich the franchise. The score for *Andor* Season 2, composed by Nicholas Britell and Brandon Roberts, was issued in four volumes starting April 25, coinciding with the season's Disney+ premiere, emphasizing tense, minimalist motifs to complement the series' espionage themes. Similarly, *Star Wars: Visions* Volume 3, an anthology of nine anime shorts released on Disney+ in October, featured original soundtracks by composers including Towa Tei for episodes like \"The Song of Four Wings,\" available digitally from Walt Disney Records on October 31.\n\n### Theme parks and attractions\n\nStar Wars: Galaxy's Edge, a fully immersive 14-acre themed land, debuted at Disneyland in Anaheim, California, on May 31, 2019, and at Disney's Hollywood Studios in Walt Disney World, Florida, on August 29, 2019. Set on the remote planet Batuu, a lively outpost on the galaxy's edge, the land allows guests to step into the Star Wars universe through interactive elements like customizable droids, lightsaber-building workshops, and encounters with characters from the Resistance and First Order. The flagship attraction, Star Wars: Rise of the Resistance, a multi-ride experience involving transport ships, interrogations, and a massive AT-AT battle, opened on December 5, 2019, at Disney's Hollywood Studios and on January 17, 2020, at Disneyland. This groundbreaking ride, spanning multiple structures and using advanced trackless vehicles and projection mapping, has been hailed as one of the most innovative theme park attractions, immersing riders in a narrative battle against the First Order.\n\nBeyond Galaxy's Edge, longstanding Star Wars attractions have anchored the franchise's presence in Disney parks since the 1980s. Star Tours – The Adventures Continue, a motion simulator ride simulating a chaotic hyperspace journey with randomized scenes featuring characters from across the saga, originated at Disneyland on January 9, 1987, as the first major collaboration between Disney and George Lucas. Updated in 2011 to include footage from prequels, sequels, and spin-offs, it operates at Disney's Hollywood Studios, Disneyland, Tokyo Disneyland, and formerly at Disneyland Paris until 2016. Seasonal overlays like Hyperspace Mountain transform the classic Space Mountain roller coaster into a Star Wars-themed thrill ride, with TIE fighters and X-wing dogfights projected inside the track; it first appeared at Disneyland on November 16, 2015, during the Season of the Force event and has since run at Tokyo Disneyland and Disneyland Paris. These attractions extend the Star Wars lore internationally, with Tokyo Disneyland featuring ongoing Star Tours updates, including new segments with characters like Din Djarin and Ahsoka Tano debuting in April 2025.\n\nSpecial events have historically amplified Star Wars immersion at Disney parks. Star Wars Weekends, an annual celebration at Disney's Hollywood Studios from 1997 to 2015, featured celebrity appearances, parades, fireworks, and behind-the-scenes panels, drawing fans for its blend of live entertainment and interactive experiences like Jedi Training Academy. The event was discontinued in 2015 to prioritize the permanent Galaxy's Edge expansion. In 2025, Galaxy's Edge saw operational updates, including the shift of Oga's Cantina—a bustling alien bar serving themed cocktails—to a walk-up, first-come-first-served model at Disneyland starting August 19, eliminating advance reservations to improve accessibility. Meanwhile, construction began in September 2025 on enhancements at Disney's Hollywood Studios' Galaxy's Edge, signaling ongoing evolution of the land.\n\nGalaxy's Edge integrates deeply with Star Wars lore through the Play Disney Parks mobile app, which transforms smartphones into virtual datapads for interactive storytelling. Guests can scan cargo crates to reveal hidden Resistance messages, tune into First Order transmissions, or participate in outpost control missions that influence shared narrative outcomes across the park, fostering a role-playing game-like experience tied to Batuu's canonical history. This app-based layer enhances immersion without requiring additional hardware. Annual attendance at parks hosting Galaxy's Edge underscores its draw; Disney's Hollywood Studios welcomed 10.3 million visitors in 2023, with Galaxy's Edge as a primary magnet, while Disneyland saw 17.3 million, reflecting the land's role in boosting overall park traffic.\n\n### Merchandising\n\nThe merchandising of *Star Wars* has been a cornerstone of its commercial success, generating billions in revenue through licensing deals that span toys, collectibles, apparel, and more. The franchise's early licensing agreements set a precedent for blockbuster tie-ins, beginning with Kenner Products, which secured the rights to produce action figures ahead of the 1977 film's release. Due to production delays, Kenner offered \"Early Bird\" certificates for holiday delivery, capitalizing on the film's hype. In 1978 alone, Kenner sold over 40 million *Star Wars* toys, achieving $100 million in revenue from an initial investment of just $100,000. This explosive start not only rescued Kenner from near-bankruptcy but also funded further *Star Wars* film productions.\n\nFollowing the original trilogy's conclusion, *Star Wars* toys entered a hiatus until Hasbro acquired Kenner in 1991 and relaunched the line in 1995 with *The Power of the Force* series, reviving collector interest through premium figures and vehicles. Hasbro has since maintained the primary toy license under Disney's ownership, producing lines like *The Black Series* for adult collectors and *The Vintage Collection* for nostalgic play. The acquisition of Lucasfilm by Disney in 2012 amplified this momentum, with *Star Wars* merchandising contributing to an estimated $29 billion in lifetime sales as part of the franchise's overall $46.7 billion revenue. Disney's consumer products segment, including *Star Wars* licensing, generated $5.3 billion in 2023, underscoring the brand's enduring profitability.\n\nMerchandising spans diverse categories, with toys dominating through partners like Hasbro and Lego. Lego *Star Wars* sets, launched in 1999, remain among the theme's best-sellers, with intricate builds like the Ultimate Collector Series Millennium Falcon driving popularity and resale values exceeding £173,000 for rare editions. Collectibles include Funko Pop! vinyl figures, which feature hundreds of *Star Wars* characters and have become staples for fans, often bundled with exclusives from retailers like Amazon and BoxLunch. Apparel lines, such as hoodies and t-shirts from Disney Store collections, emphasize iconic motifs and tie into seasonal events like Star Wars Day.\n\nIn 2024 and 2025, merchandising aligned closely with new content releases. Hasbro's *The Black Series* introduced 6-inch figures for *Star Wars: Skeleton Crew*, including characters like Neel (At Attin), KB (At Attin), Fern, and pirate captain Brutus, with premium articulation and accessories priced at $24.99 each. For *The High Republic* era, merchandise focused on apparel and posters, such as group-themed t-shirts and San Diego Comic-Con exclusives featuring Jedi characters. Fan conventions like Star Wars Celebration and San Diego Comic-Con amplify these efforts through tie-ins, offering limited-edition items like action figures, jewelry, and Displate posters exclusive to attendees.\n\n## Themes and influences\n\n### Core themes\n\nThe core themes of the *Star Wars* saga revolve around philosophical and narrative motifs that explore human nature, power dynamics, and the interplay between individual choices and larger cosmic forces. Created by George Lucas, these themes underscore the franchise's enduring appeal, drawing from internal story elements to examine moral dichotomies and personal growth across the Skywalker saga and beyond.\n\nCentral to *Star Wars* is the motif of good versus evil, embodied in the eternal struggle between the light and dark sides of the Force. George Lucas has described this as an internal conflict, stating, \"We all have good and evil inside of us and that we can choose which way we want the balance to go,\" emphasizing personal agency in navigating moral temptations. The balance of the Force represents equilibrium disrupted by the dark side, with the light side inherently stable; as Lucas clarified, the saga's philosophy posits that good triumphs over evil to restore harmony, as seen in Anakin Skywalker's fall to Darth Vader and his eventual redemption. Vader's arc exemplifies this theme, where his return to the light through compassion for his son Luke illustrates redemption as a rejection of greed and fear, fulfilling the prophecy of the Chosen One who brings balance by destroying the Sith.\n\nFamily and destiny form another foundational motif, particularly through the Skywalker lineage, which traces a multi-generational saga of inherited power and self-determination. Lucas highlighted the redemptive power of familial bonds, noting that \"Ultimately Vader is redeemed by his children… that’s what life is all about, is procreating and raising children,\" positioning family as a counterforce to isolation and corruption. The Skywalker bloodline, from Anakin's conception amid midi-chlorian prophecy to Luke and Leia's roles in confronting their father's legacy, underscores destiny not as rigid fate but as shaped by choices, with Lucas affirming, \"You have control over your destiny… you have many paths to walk down.\" This theme recurs in narratives like *Return of the Jedi*, where Luke's refusal to kill Vader breaks the cycle of patricidal violence, affirming that lineage imposes burdens yet allows for chosen paths toward heroism.\n\nThe saga's portrayal of imperialism and rebellion highlights anti-authoritarian undertones, depicting the Galactic Empire as a tyrannical regime oppressive to diverse worlds, contrasted with the Rebel Alliance's fight for autonomy. Lucas modeled the Empire after fascist structures, drawing visual and thematic parallels to authoritarian control, where stormtroopers and the Death Star symbolize dehumanizing conformity and totalitarianism. This motif emphasizes hope in underdogs, as rebels like Leia Organa and Han Solo embody resilience against imperial might, with the destruction of oppressive symbols like the Death Star representing collective victory over domination. The narrative arc from republic to empire in the prequels further illustrates how corruption erodes democracy, reinforcing rebellion as a moral imperative for freedom.\n\nFinally, *Star Wars* juxtaposes technology and mysticism, exploring how mechanical advancements intersect with spiritual intuition. Droids like R2-D2 and C-3PO challenge notions of humanity, displaying loyalty, humor, and emotion that blur lines between artificial and organic life, serving as companions in a galaxy dominated by hyperdrives and blasters. Lightsabers symbolize this tension as elegant, Force-attuned weapons that require mystical training over mere machinery, evoking chivalric tradition amid futuristic warfare. This duality critiques overreliance on tech—evident in the Empire's mechanical atrocities—while elevating the Force as an intuitive counterbalance, fostering themes of wonder and ethical use of innovation.\n\n### Historical and mythological influences\n\nGeorge Lucas drew significant inspiration from comparative mythologist Joseph Campbell's concept of the monomyth, outlined in his 1949 book *The Hero with a Thousand Faces*, which posits a universal narrative structure of the hero's journey involving departure, initiation, and return. Lucas has stated that Campbell's framework provided the blueprint for Luke Skywalker's arc in the original *Star Wars* trilogy, transforming ancient mythic patterns into a modern space opera. In a 1988 interview with Bill Moyers, Lucas credited Campbell directly, noting how the scholar's ideas helped him structure the protagonist's transformation from an ordinary youth to a galactic savior.\n\nThe franchise's narrative also reflects historical parallels to 20th-century conflicts, particularly the Vietnam War, where the Rebel Alliance's guerrilla tactics against the Galactic Empire echo the Viet Cong's insurgency against U.S. forces. Lucas conceived the story amid the war's turmoil, viewing the rebels as underdogs resisting imperial overreach, much like Vietnamese fighters using terrain and ingenuity against a technological superior. For the Empire's aesthetics, Lucas incorporated elements from World War II, modeling Imperial officers' uniforms and Darth Vader's helmet after German Army attire to evoke authoritarian menace, while the stormtroopers' name derives from Nazi paramilitary units. The Emperor Palpatine's rise from chancellor mirrors Adolf Hitler's ascent, underscoring themes of democratic erosion into dictatorship.\n\nCinematically, Akira Kurosawa's 1958 film *The Hidden Fortress* profoundly shaped *Star Wars: Episode IV – A New Hope*, with its plot of a princess, loyal general, and comic-relief peasants escorting a vital MacGuffin through enemy territory paralleling Princess Leia, Obi-Wan Kenobi, and C-3PO/R2-D2's journey. Lucas has praised Kurosawa's epic scope and character perspectives, particularly the lowly viewpoint that humanizes grand adventures. Western films, especially those of director John Ford, influenced the rugged, frontier-like depiction of Tatooine and Han Solo's archetype as a roguish smuggler akin to a space cowboy, blending moral ambiguity with reluctant heroism.\n\nBeyond these, the barren desert world of Tatooine evokes Arrakis from Frank Herbert's 1965 novel *Dune*, a harsh planet central to interstellar politics and survival, though Lucas did not publicly acknowledge this parallel. The pacing and cliffhanger structure of the saga also stem from 1930s-1940s World War II-era adventure serials like *Flash Gordon*, which Lucas sought to homage after failing to secure remake rights, infusing the films with serialized excitement and heroic escapism.\n\n## Cultural impact\n\n### Industry influence\n\nThe founding of Industrial Light \\u0026 Magic (ILM) by George Lucas in 1975 revolutionized visual effects in filmmaking, particularly through the development of motion-control cinematography for *Star Wars: Episode IV - A New Hope*. This technology enabled precise, repeatable camera movements over miniature models, allowing for dynamic space battle sequences like the Death Star trench run that were unprecedented in their fluidity and realism. ILM's innovations set industry standards, influencing subsequent films and earning multiple Academy Awards for visual effects, while establishing practical effects pipelines that blended miniatures, matte paintings, and optical compositing.\n\nThe prequel trilogy further advanced effects standards by pioneering extensive computer-generated imagery (CGI), marking a shift from predominantly practical techniques to digital integration. In *Star Wars: Episode III - Revenge of the Sith* (2005), ILM delivered over 2,000 VFX shots, including fully CGI environments and characters like General Grievous, which pushed hardware and software boundaries and normalized hybrid workflows across Hollywood. This evolution not only reduced production timelines but also democratized complex effects, inspiring studios to invest in digital tools and training programs.\n\n*Star Wars* pioneered the modern franchise model, emphasizing blockbuster sequels and merchandising synergy to sustain long-term revenue. The original trilogy's sequential releases—*The Empire Strikes Back* (1980) and *Return of the Jedi* (1983)—demonstrated how serialized storytelling could build audience loyalty, generating billions in ticket sales and licensing deals for toys, apparel, and media tie-ins that accounted for up to 70% of the franchise's early profits. This approach directly influenced the Marvel Cinematic Universe (MCU), where Disney applied similar interconnected narratives and cross-media promotion, as noted by Marvel Studios president Kevin Feige, who credited *Star Wars* for shaping the studio's phased rollout and universe-building strategy.\n\nThe launch of Disney+ in 2019 marked a pivotal streaming pivot for *Star Wars*, with exclusive series like *The Mandalorian* driving subscriber growth and contributing to the platform's path to profitability. By 2024, Disney's direct-to-consumer division, bolstered by *Star Wars* content, reported $6.4 billion in quarterly revenue, with shows like *Andor* alone generating over $300 million in subscriber value through increased engagement and retention. This success amplified the franchise's $2-3 billion annual merchandising ecosystem, reinforcing integrated content strategies across film, TV, and consumer products.\n\nIn 2025, *Star Wars* continues to influence industry trends through VR integrations and debates over AI in effects production. Titles like *Star Wars: Beyond Victory*, a Quest VR experience, immerse users in interactive podracing narratives, expanding transmedia storytelling and prompting investments in mixed-reality hardware. Meanwhile, ILM's AI experiments, highlighted in a TED Talk by Lucasfilm's Rob Bredow, explore generative tools for creature design and dynamic visuals, sparking ethical discussions on job displacement versus creative acceleration in VFX pipelines—though early demos faced criticism for inconsistent quality.\n\n### Fan culture and academia\n\nStar Wars fandom has fostered a vibrant ecosystem of participatory creativity, with fanfiction serving as a cornerstone of expressive engagement. On Archive of Our Own (AO3), the \"Star Wars - All Media Types\" tag encompasses over 200,000 works as of 2025, reflecting the franchise's expansive narrative potential and fans' desire to explore untold stories across timelines and characters. Cosplay represents another key facet, transforming fans into embodiments of the saga's icons through intricate costumes that emphasize community and performance; this practice gained prominence through groups like the 501st Legion, a worldwide organization founded in 1997 that specializes in Imperial-era attire and participates in charitable events. Star Wars Celebration, the franchise's flagship convention, has convened fans annually or biennially since its inception in 1999 in Denver, Colorado, offering panels, exhibits, and cosplay showcases that unite thousands in shared enthusiasm.\n\nFan communities thrive both offline and online, cultivating deep social bonds while occasionally navigating internal tensions. The 501st Legion, with its emphasis on high-quality costuming and troop appearances at events, exemplifies organized fandom, operating independently but in alignment with Lucasfilm guidelines to promote positive representation. Online forums and social media platforms host robust discussions, from lore debates to creative collaborations, though the release of the Sequel Trilogy (2015–2019) sparked significant controversies, including criticisms of narrative inconsistencies, character arcs, and perceived deviations from established canon that divided long-time enthusiasts. These divides highlight the passionate investment of fans, who often engage in heated yet productive dialogues about the franchise's direction.\n\nScholarly interest in Star Wars has grown substantially, positioning the saga as a lens for examining broader cultural and social issues. Academic analyses frequently apply feminist frameworks to characters like Rey, the Sequel Trilogy protagonist, portraying her as a symbol of empowerment and agency in a traditionally male-dominated hero's journey; for instance, studies highlight how Rey's arc challenges gender norms while critiquing merchandising disparities that underrepresented female leads. Postcolonial theory has been employed to dissect the Galactic Empire's imperial dynamics, interpreting its expansionist policies and alien subjugation as allegories for real-world colonialism, with works like the edited volume *Postcolonial Star Wars* exploring power structures across films, television, and expanded media. Dedicated scholarship appears in peer-reviewed outlets, such as articles in *Journal of Popular Culture* that apply postcolonial lenses to rebellion narratives in series like *Andor*.\n\nIn 2025, fan films have experienced a notable resurgence, with independent productions like *Darkness Emerging* and *The Last Order* garnering widespread acclaim for their visual effects and storytelling, often distributed via platforms like YouTube to fill gaps in official content. Academic discourse has similarly intensified around the High Republic era, emphasizing its diverse casts and inclusive world-building; events such as university courses on race and rebellion in Star Wars, alongside calls for papers on political themes in the Disney era, underscore growing institutional focus on these elements. This intersection of fan-driven creation and rigorous analysis continues to enrich the franchise's legacy, with collectors often integrating rare merchandise into cosplay displays for immersive personal archives.",
  "external_references": [
    {
      "text": "The Force",
      "url": "https://www.starwars.com/databank/the-force",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Our Story",
      "url": "https://www.lucasfilm.com/who-we-are/our-story/",
      "domain": "lucasfilm.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Movies And Series Guide",
      "url": "https://www.starwars.com/news/star-wars-movies-and-series-guide",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars",
      "url": "https://www.the-numbers.com/movies/franchise/Star-Wars",
      "domain": "the-numbers.com",
      "type": "citation"
    },
    {
      "text": "Highest Grossing Film Franchises Series",
      "url": "https://www.statista.com/statistics/317408/highest-grossing-film-franchises-series/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "How Star Wars Revolutionized Entertainment",
      "url": "https://airandspace.si.edu/stories/editorial/how-star-wars-revolutionized-entertainment",
      "domain": "airandspace.si.edu",
      "type": "citation"
    },
    {
      "text": "375862402 The Impact Of Star Wars On The English Language Star Wars Derived Words And Constructions In Present Day English Corpora",
      "url": "https://www.researchgate.net/publication/375862402_The_impact_of_Star_Wars_on_the_English_language_Star_Wars_-derived_words_and_constructions_in_present-day_English_corpora",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "Galactic Empire",
      "url": "https://www.starwars.com/databank/galactic-empire",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "The New Republic",
      "url": "https://www.starwars.com/databank/the-new-republic",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Galaxy Map",
      "url": "https://www.starwars.com/star-wars-galaxy-map",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Jedi Order",
      "url": "https://www.starwars.com/databank/jedi-order",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Sith",
      "url": "https://www.starwars.com/databank/sith",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Galactic Republic",
      "url": "https://www.starwars.com/databank/galactic-republic",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Eras",
      "url": "https://www.starwars.com/eras",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "The Legendary Star Wars Expanded Universe Turns A New Page",
      "url": "https://www.starwars.com/news/the-legendary-star-wars-expanded-universe-turns-a-new-page",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Coruscant",
      "url": "https://www.starwars.com/databank/coruscant",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Clone Wars",
      "url": "https://www.starwars.com/series/star-wars-the-clone-wars",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Battles That Changed The Galaxy Announce",
      "url": "https://www.starwars.com/news/star-wars-battles-that-changed-the-galaxy-announce",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "The Resistance",
      "url": "https://www.starwars.com/databank/the-resistance",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.usf.edu/cgi/viewcontent.cgi?article=1265\\u0026context=etd",
      "domain": "digitalcommons.usf.edu",
      "type": "citation"
    },
    {
      "text": "Mythology Of Star Wars George Lucas",
      "url": "https://billmoyers.com/content/mythology-of-star-wars-george-lucas/",
      "domain": "billmoyers.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Ep Iv A New Hope (1977",
      "url": "https://www.the-numbers.com/movie/Star-Wars-Ep-IV-A-New-Hope-(1977",
      "domain": "the-numbers.com",
      "type": "citation"
    },
    {
      "text": "How This Visual Effects Studio Transformed Movies Forever 180980392",
      "url": "https://www.smithsonianmag.com/smart-news/how-this-visual-effects-studio-transformed-movies-forever-180980392/",
      "domain": "smithsonianmag.com",
      "type": "citation"
    },
    {
      "text": "New Again Star Wars",
      "url": "https://www.interviewmagazine.com/film/new-again-star-wars",
      "domain": "interviewmagazine.com",
      "type": "citation"
    },
    {
      "text": "1978",
      "url": "https://www.oscars.org/oscars/ceremonies/1978",
      "domain": "oscars.org",
      "type": "citation"
    },
    {
      "text": "Star Wars Merchandising Empire",
      "url": "https://airandspace.si.edu/stories/editorial/star-wars-merchandising-empire",
      "domain": "airandspace.si.edu",
      "type": "citation"
    },
    {
      "text": "31165 May The 4th Star Wars Day Alan Dean Foster George Lucas",
      "url": "https://www.inverse.com/entertainment/31165-may-the-4th-star-wars-day-alan-dean-foster-george-lucas",
      "domain": "inverse.com",
      "type": "citation"
    },
    {
      "text": "Disney To Acquire Lucasfilm Ltd",
      "url": "https://thewaltdisneycompany.com/disney-to-acquire-lucasfilm-ltd/",
      "domain": "thewaltdisneycompany.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Expanded Universe Lucasfilm Story Group",
      "url": "https://www.polygon.com/2014/4/25/5653858/star-wars-expanded-universe-lucasfilm-story-group",
      "domain": "polygon.com",
      "type": "citation"
    },
    {
      "text": "Disney Launches Today And A New Era Of Disney Entertainment Begins",
      "url": "https://thewaltdisneycompany.com/disney-launches-today-and-a-new-era-of-disney-entertainment-begins/",
      "domain": "thewaltdisneycompany.com",
      "type": "citation"
    },
    {
      "text": "Fr3125251845",
      "url": "https://www.boxofficemojo.com/franchise/fr3125251845/",
      "domain": "boxofficemojo.com",
      "type": "citation"
    },
    {
      "text": "Three New Star Wars Movies Announced Including Daisy Ridley Return As Rey",
      "url": "https://nerdist.com/article/three-new-star-wars-movies-announced-including-daisy-ridley-return-as-rey/",
      "domain": "nerdist.com",
      "type": "citation"
    },
    {
      "text": "Star Wars New Jedi Order Writer 1236116641",
      "url": "https://www.hollywoodreporter.com/movies/movie-news/star-wars-new-jedi-order-writer-1236116641/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Rey Star Wars Movie Challenges Daisy Ridley Update",
      "url": "https://thedirect.com/article/rey-star-wars-movie-challenges-daisy-ridley-update",
      "domain": "thedirect.com",
      "type": "citation"
    },
    {
      "text": "Rian Johnson Star Wars Trilogy Very Conceptual Knives Out 1236459163",
      "url": "https://variety.com/2025/film/news/rian-johnson-star-wars-trilogy-very-conceptual-knives-out-1236459163/",
      "domain": "variety.com",
      "type": "citation"
    },
    {
      "text": "Rian Johnson Finally Confirms His Star Wars Trilogy Is Dead",
      "url": "https://thatparkplace.com/rian-johnson-finally-confirms-his-star-wars-trilogy-is-dead/",
      "domain": "thatparkplace.com",
      "type": "citation"
    },
    {
      "text": "The Final Phase Of The Star Wars High Republic Era Begins In February 2025 With Fear Of The Jedi",
      "url": "https://comic-watch.com/news/the-final-phase-of-the-star-wars-high-republic-era-begins-in-february-2025-with-fear-of-the-jedi",
      "domain": "comic-watch.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The High Republic The Finale 2025 1",
      "url": "https://www.marvel.com/comics/issue/123265/star_wars_the_high_republic_-_the_finale_2025_1",
      "domain": "marvel.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Episode Iv A New Hope",
      "url": "https://www.starwars.com/films/star-wars-episode-iv-a-new-hope",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Episode V The Empire Strikes Back",
      "url": "https://www.starwars.com/films/star-wars-episode-v-the-empire-strikes-back",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Episode Vi Return Of The Jedi",
      "url": "https://www.starwars.com/films/star-wars-episode-vi-return-of-the-jedi",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Visual Effects",
      "url": "https://www.lucasfilm.com/what-we-do/visual-effects/",
      "domain": "lucasfilm.com",
      "type": "citation"
    },
    {
      "text": "Interviewing Kershner A Conversation With The Director Of The Empire Strikes Back",
      "url": "https://www.starwars.com/news/interviewing-kershner-a-conversation-with-the-director-of-the-empire-strikes-back",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "All Star Wars Movies Ranked",
      "url": "https://editorial.rottentomatoes.com/guide/all-star-wars-movies-ranked/",
      "domain": "editorial.rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Plotsummary",
      "url": "https://www.imdb.com/title/tt0120915/plotsummary/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Ahmed Best Interview Jar Jar Binks The Phantom Menace The Mandalorian",
      "url": "https://www.theguardian.com/tv-and-radio/2023/jul/28/star-wars-ahmed-best-interview-jar-jar-binks-the-phantom-menace-the-mandalorian",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Jar Jar Binks Actor Star Wars Ahmed Best.html",
      "url": "https://www.nytimes.com/2024/05/03/movies/jar-jar-binks-actor-star-wars-ahmed-best.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Plotsummary",
      "url": "https://www.imdb.com/title/tt0121765/plotsummary/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Saga Chronicles Star Wars Attack Of The Clones Mike Blanchard",
      "url": "https://www.starwars.com/news/saga-chronicles-star-wars-attack-of-the-clones-mike-blanchard",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Plotsummary",
      "url": "https://www.imdb.com/title/tt0121766/plotsummary/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Episode Iii Revenge Of The Sith",
      "url": "https://www.rottentomatoes.com/m/star_wars_episode_iii_revenge_of_the_sith",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Special Effects",
      "url": "https://www.studiobinder.com/blog/star-wars-special-effects/",
      "domain": "studiobinder.com",
      "type": "citation"
    },
    {
      "text": "George Lucas Defends Star Wars Dialogue 20201218",
      "url": "https://theplaylist.net/george-lucas-defends-star-wars-dialogue-20201218/",
      "domain": "theplaylist.net",
      "type": "citation"
    },
    {
      "text": "Star Wars Episode I The Phantom Menace",
      "url": "https://www.rottentomatoes.com/m/star_wars_episode_i_the_phantom_menace",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Episode Ii Attack Of The Clones",
      "url": "https://www.rottentomatoes.com/m/star_wars_episode_ii_attack_of_the_clones",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Episode Vii",
      "url": "https://www.lucasfilm.com/productions/episode-vii/",
      "domain": "lucasfilm.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Last Jedi",
      "url": "https://www.lucasfilm.com/productions/star-wars-the-last-jedi/",
      "domain": "lucasfilm.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Rise Of Skywalker",
      "url": "https://www.lucasfilm.com/productions/star-wars-the-rise-of-skywalker/",
      "domain": "lucasfilm.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Rise Of Skywalker",
      "url": "https://www.rottentomatoes.com/m/star_wars_the_rise_of_skywalker",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Rise Of Skywalker Billion Dollars Box Office 1203456857",
      "url": "https://variety.com/2020/film/news/star-wars-rise-of-skywalker-billion-dollars-box-office-1203456857/",
      "domain": "variety.com",
      "type": "citation"
    },
    {
      "text": "Upcoming New Star Wars Movies 2025 Tv Shows Release Dates",
      "url": "https://www.ign.com/articles/upcoming-new-star-wars-movies-2025-tv-shows-release-dates",
      "domain": "ign.com",
      "type": "citation"
    },
    {
      "text": "Upcoming Star Wars Movies",
      "url": "https://www.gamesradar.com/upcoming-star-wars-movies/",
      "domain": "gamesradar.com",
      "type": "citation"
    },
    {
      "text": "Every Upcoming Star Wars Movie And Series With Key Details And Dates",
      "url": "https://editorial.rottentomatoes.com/article/every-upcoming-star-wars-movie-and-series-with-key-details-and-dates/",
      "domain": "editorial.rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Everything Star Wars On Disney Plus",
      "url": "https://www.starwars.com/news/everything-star-wars-on-disney-plus",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Rebels",
      "url": "https://www.starwars.com/series/star-wars-rebels",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Bad Batch",
      "url": "https://www.starwars.com/series/star-wars-the-bad-batch",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Resistance",
      "url": "https://www.starwars.com/series/star-wars-resistance",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Visions",
      "url": "https://www.starwars.com/series/star-wars-visions",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Tales Of The Jedi",
      "url": "https://www.starwars.com/series/tales-of-the-jedi",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Tales Of The Empire",
      "url": "https://www.starwars.com/series/tales-of-the-empire",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Young Jedi Adventures",
      "url": "https://www.starwars.com/series/star-wars-young-jedi-adventures",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Ahsoka Series Premiere Ratings Disney Plus 1235577215",
      "url": "https://www.hollywoodreporter.com/tv/tv-news/ahsoka-series-premiere-ratings-disney-plus-1235577215/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Volume House Of The Dragon Stage Mandalorian 1235244158",
      "url": "https://www.hollywoodreporter.com/business/digital/volume-house-of-the-dragon-stage-mandalorian-1235244158/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Disney Analysis Ratings Box Office 1236011620",
      "url": "https://www.hollywoodreporter.com/tv/tv-news/star-wars-disney-analysis-ratings-box-office-1236011620/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Baby Yoda Represents Past Present Future Hollywood 1263588",
      "url": "https://www.hollywoodreporter.com/movies/movie-features/baby-yoda-represents-past-present-future-hollywood-1263588/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Mandalorian Vfx Supervisor Reveals How Baby Yoda Was Created 1301650",
      "url": "https://www.hollywoodreporter.com/movies/movie-news/mandalorian-vfx-supervisor-reveals-how-baby-yoda-was-created-1301650/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Book Of Boba Fett Review 1235068044",
      "url": "https://www.hollywoodreporter.com/tv/tv-reviews/book-of-boba-fett-review-1235068044/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Book Of Boba Fett Review 1235144365",
      "url": "https://variety.com/2021/tv/reviews/book-of-boba-fett-review-1235144365/",
      "domain": "variety.com",
      "type": "citation"
    },
    {
      "text": "The Book Of Boba Fett Finale Viewership Audience 1234933527",
      "url": "https://deadline.com/2022/02/the-book-of-boba-fett-finale-viewership-audience-1234933527/",
      "domain": "deadline.com",
      "type": "citation"
    },
    {
      "text": "Obi Wan Kenobi Review Disney Plus Leia 1235279832",
      "url": "https://variety.com/2022/tv/reviews/obi-wan-kenobi-review-disney-plus-leia-1235279832/",
      "domain": "variety.com",
      "type": "citation"
    },
    {
      "text": "Obi Wan Kenobi Star Wars Limited Series",
      "url": "https://news.disney.com/obi-wan-kenobi-star-wars-limited-series",
      "domain": "news.disney.com",
      "type": "citation"
    },
    {
      "text": "Obi Wan Kenobi Star Wars Fixing Film Plot Holes 1235158027",
      "url": "https://www.hollywoodreporter.com/tv/tv-features/obi-wan-kenobi-star-wars-fixing-film-plot-holes-1235158027/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Andor Season 2 Review Disney Star Wars 1236372979",
      "url": "https://variety.com/2025/tv/reviews/andor-season-2-review-disney-star-wars-1236372979/",
      "domain": "variety.com",
      "type": "citation"
    },
    {
      "text": "Andor Season 2 Review Disney Plus Star Wars 1236195861",
      "url": "https://www.hollywoodreporter.com/tv/tv-reviews/andor-season-2-review-disney-plus-star-wars-1236195861/",
      "domain": "hollywoodreporter.com",
      "type": "citation"
    },
    {
      "text": "Andor Viewership Record Nielsen Charts The Four Seasons 1236425175",
      "url": "https://deadline.com/2025/06/andor-viewership-record-nielsen-charts-the-four-seasons-1236425175/",
      "domain": "deadline.com",
      "type": "citation"
    },
    {
      "text": "Nielsen Data For Skeleton Crew Less Than 382m",
      "url": "https://www.reddit.com/r/StarWarsLeaks/comments/1hy3o8t/nielsen_data_for_skeleton_crew_less_than_382m/",
      "domain": "reddit.com",
      "type": "citation"
    },
    {
      "text": "The Acolyte Canceled No Season 2 Star Wars Disney Plus 1236044233",
      "url": "https://deadline.com/2024/08/the-acolyte-canceled-no-season-2-star-wars-disney-plus-1236044233/",
      "domain": "deadline.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Holiday Special 1978 Review 1106979",
      "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/star-wars-holiday-special-1978-review-1106979/",
      "domain": "rollingstone.com",
      "type": "citation"
    },
    {
      "text": "The Infamous Star Wars Holiday Special",
      "url": "https://www.saturdayeveningpost.com/2020/11/the-infamous-star-wars-holiday-special/",
      "domain": "saturdayeveningpost.com",
      "type": "citation"
    },
    {
      "text": "The Lego Star Wars Holiday Special Disney Plus Announce",
      "url": "https://www.starwars.com/news/the-lego-star-wars-holiday-special-disney-plus-announce",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Tt12885438",
      "url": "https://www.imdb.com/title/tt12885438/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Lego Star Wars Holiday Special",
      "url": "https://www.rottentomatoes.com/m/lego_star_wars_holiday_special",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=a4Xyiun4LXs",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Tt15164924",
      "url": "https://www.imdb.com/title/tt15164924/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Lego Star Wars Terrifying Tales",
      "url": "https://www.rottentomatoes.com/m/lego_star_wars_terrifying_tales",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=TTYx1ETg9lo",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Tt32306451",
      "url": "https://www.imdb.com/title/tt32306451/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "Lego Star Wars Rebuild The Galaxy",
      "url": "https://www.rottentomatoes.com/tv/lego_star_wars_rebuild_the_galaxy",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=YJEUAe-dcGo",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Tales Of The Underworld Announce",
      "url": "https://www.starwars.com/news/tales-of-the-underworld-announce",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=GkywNANueew",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Review Star Wars Tales Of The Underworld",
      "url": "https://theholofiles.com/2025/05/04/review-star-wars-tales-of-the-underworld/",
      "domain": "theholofiles.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Visions Volume 3 Cast Announce",
      "url": "https://www.starwars.com/news/star-wars-visions-volume-3-cast-announce",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Visions Volume 3 Review",
      "url": "https://www.ign.com/articles/star-wars-visions-volume-3-review",
      "domain": "ign.com",
      "type": "citation"
    },
    {
      "text": "S03",
      "url": "https://www.rottentomatoes.com/tv/star_wars_visions/s03",
      "domain": "rottentomatoes.com",
      "type": "citation"
    },
    {
      "text": "Check Out Over 40 Years Of Star Wars A New Hope Novelization Covers",
      "url": "https://www.starwars.com/news/check-out-over-40-years-of-star-wars-a-new-hope-novelization-covers",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Disney Publishing Worldwide And Random House Announce Relaunch Of Star Wars Adult Fiction Line",
      "url": "https://www.starwars.com/news/disney-publishing-worldwide-and-random-house-announce-relaunch-of-star-wars-adult-fiction-line",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Every Star Wars The High Republic Book And Comic Series",
      "url": "https://www.starwars.com/news/every-star-wars-the-high-republic-book-and-comic-series",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Master Of Evil By Adam Christopher",
      "url": "https://www.penguinrandomhouse.com/books/762382/star-wars-master-of-evil-by-adam-christopher/",
      "domain": "penguinrandomhouse.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Celebration 2025 Lucasfilm Publishing Panel",
      "url": "https://www.starwars.com/news/star-wars-celebration-2025-lucasfilm-publishing-panel",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Lucasfilm And Marvel Entertainment Join Forces To Publish Star Wars Comics And Graphic Novels",
      "url": "https://www.starwars.com/news/lucasfilm-and-marvel-entertainment-join-forces-to-publish-star-wars-comics-and-graphic-novels",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Dark Horse Comics Announce",
      "url": "https://www.starwars.com/news/dark-horse-comics-announce",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Marvel Star Wars Issue 1 Announce",
      "url": "https://www.starwars.com/news/marvel-star-wars-issue-1-announce",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Darth Vader 2015 2016",
      "url": "https://www.marvel.com/comics/series/19379/darth_vader_2015_2016",
      "domain": "marvel.com",
      "type": "citation"
    },
    {
      "text": "Darth Vader 2017 2018",
      "url": "https://www.marvel.com/comics/series/23095/darth_vader_2017_2018",
      "domain": "marvel.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Darth Vader 2020 Present",
      "url": "https://www.marvel.com/comics/series/28376/star_wars_darth_vader_2020_present",
      "domain": "marvel.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Battle Of Jakku Comic Trilogy Continues In Republic Under Siege",
      "url": "https://www.marvel.com/articles/comics/star-wars-the-battle-of-jakku-comic-trilogy-continues-in-republic-under-siege",
      "domain": "marvel.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Crimson Reign 2021 2022",
      "url": "https://www.marvel.com/comics/series/33279/star_wars_crimson_reign_2021_2022",
      "domain": "marvel.com",
      "type": "citation"
    },
    {
      "text": "Tt0296869",
      "url": "https://www.imdb.com/title/tt0296869/",
      "domain": "imdb.com",
      "type": "citation"
    },
    {
      "text": "History List Of All Retro Older Star Wars Video Games",
      "url": "https://poggers.com/blogs/games/history-list-of-all-retro-older-star-wars-video-games",
      "domain": "poggers.com",
      "type": "citation"
    },
    {
      "text": "Ign Presents The History Of Star Wars Games",
      "url": "https://www.ign.com/articles/2008/09/10/ign-presents-the-history-of-star-wars-games",
      "domain": "ign.com",
      "type": "citation"
    },
    {
      "text": "1100 6419998",
      "url": "https://www.gamespot.com/articles/the-history-of-star-wars-video-games-part-1-1982-1998/1100-6419998/",
      "domain": "gamespot.com",
      "type": "citation"
    },
    {
      "text": "A Brief History Of Star Wars Games",
      "url": "https://www.ign.com/articles/a-brief-history-of-star-wars-games",
      "domain": "ign.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Dark Forces",
      "url": "https://www.gamespot.com/star-wars-dark-forces/",
      "domain": "gamespot.com",
      "type": "citation"
    },
    {
      "text": "Best Star Wars Games",
      "url": "https://www.ign.com/articles/best-star-wars-games",
      "domain": "ign.com",
      "type": "citation"
    },
    {
      "text": "Ea Earnings Strong Star Wars Jedi Survivor Launch Heralds New Core Franchise",
      "url": "https://www.morningstar.com/stocks/ea-earnings-strong-star-wars-jedi-survivor-launch-heralds-new-core-franchise",
      "domain": "morningstar.com",
      "type": "citation"
    },
    {
      "text": "Respawn S Star Wars Jedi Franchise Tops 40 Million Players",
      "url": "https://www.gamedeveloper.com/business/respawn-s-star-wars-jedi-franchise-tops-40-million-players",
      "domain": "gamedeveloper.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Games 2025 Eclipse Kotor Remake Jedi 3 Bitreactor Hunters",
      "url": "https://gamerant.com/star-wars-games-2025-eclipse-kotor-remake-jedi-3-bitreactor-hunters/",
      "domain": "gamerant.com",
      "type": "citation"
    },
    {
      "text": "starwarseclipse.com",
      "url": "https://www.starwarseclipse.com/",
      "domain": "starwarseclipse.com",
      "type": "citation"
    },
    {
      "text": "Upcoming Star Wars Games",
      "url": "https://www.gamesradar.com/upcoming-star-wars-games/",
      "domain": "gamesradar.com",
      "type": "citation"
    },
    {
      "text": "Awards",
      "url": "https://www.johnwilliams.org/reference/awards",
      "domain": "johnwilliams.org",
      "type": "citation"
    },
    {
      "text": "John Williams Best Movie Soundtracks",
      "url": "https://www.classicfm.com/composers/williams/john-williams-best-movie-soundtracks/",
      "domain": "classicfm.com",
      "type": "citation"
    },
    {
      "text": "1pyd3vteofv29ewx4dfapm",
      "url": "https://open.spotify.com/track/1Pyd3VTEoFV29ewX4DfaPM",
      "domain": "open.spotify.com",
      "type": "citation"
    },
    {
      "text": "6h5p1llfhcyyhnsvdlghjt",
      "url": "https://open.spotify.com/album/6h5p1LLfhcyYHnSVdlghJT",
      "domain": "open.spotify.com",
      "type": "citation"
    },
    {
      "text": "Index.php",
      "url": "https://www.jwfan.com/forums/index.php?/topic/34024-how-many-records-of-williamss-music-have-been-sold-thus-far/",
      "domain": "jwfan.com",
      "type": "citation"
    },
    {
      "text": "Article Best Star Wars Audiobooks",
      "url": "https://www.audible.com/blog/article-best-star-wars-audiobooks",
      "domain": "audible.com",
      "type": "citation"
    },
    {
      "text": "May The 4th Star Wars Day Npr Drama",
      "url": "https://www.npr.org/2022/05/04/1096555142/may-the-4th-star-wars-day-npr-drama",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Andor Season 2 Soundtrack Every Song 3857702",
      "url": "https://www.nme.com/news/tv/andor-season-2-soundtrack-every-song-3857702",
      "domain": "nme.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Visions Volume 3 Soundtracks To Be Released",
      "url": "https://filmmusicreporter.com/2025/10/30/star-wars-visions-volume-3-soundtracks-to-be-released/",
      "domain": "filmmusicreporter.com",
      "type": "citation"
    },
    {
      "text": "Opening Dates For Star Wars Galaxys Edge At Disneyland And Disneys Hollywood Studios",
      "url": "https://d23.com/opening-dates-for-star-wars-galaxys-edge-at-disneyland-and-disneys-hollywood-studios/",
      "domain": "d23.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Rise Of The Resistance Opening Date Announced For Walt Disney World And Disneyland",
      "url": "https://coasternation.com/star-wars-rise-of-the-resistance-opening-date-announced-for-walt-disney-world-and-disneyland/",
      "domain": "coasternation.com",
      "type": "citation"
    },
    {
      "text": "Rise Resistance Opens Disneyland",
      "url": "https://www.visitcalifornia.com/now/rise-resistance-opens-disneyland/",
      "domain": "visitcalifornia.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Rise Resistance Opening Date",
      "url": "https://www.disneytouristblog.com/star-wars-rise-resistance-opening-date/",
      "domain": "disneytouristblog.com",
      "type": "citation"
    },
    {
      "text": "Star Tours",
      "url": "https://disneyland.disney.go.com/attractions/disneyland/star-tours/",
      "domain": "disneyland.disney.go.com",
      "type": "citation"
    },
    {
      "text": "Star Tours",
      "url": "https://disneyparks.fandom.com/wiki/Star_Tours",
      "domain": "disneyparks.fandom.com",
      "type": "citation"
    },
    {
      "text": "2087035668376077",
      "url": "https://www.facebook.com/groups/magickeydisneyland/posts/2087035668376077/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "183",
      "url": "https://www.tokyodisneyresort.jp/en/tdl/attraction/detail/183/",
      "domain": "tokyodisneyresort.jp",
      "type": "citation"
    },
    {
      "text": "Star Wars Weekends.htm",
      "url": "https://www.wdwmagic.com/events/star-wars-weekends.htm",
      "domain": "wdwmagic.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Weekends",
      "url": "https://en.wikipedia.org/wiki/Star_Wars_Weekends",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Breaking Ogas Cantina At Disneyland Ending Reservations",
      "url": "https://wdwnt.com/2025/08/breaking-ogas-cantina-at-disneyland-ending-reservations/",
      "domain": "wdwnt.com",
      "type": "citation"
    },
    {
      "text": "Disney World Begins Expansion Of Iconic Star Wars Galaxys Edge Ab1",
      "url": "https://insidethemagic.net/2025/09/disney-world-begins-expansion-of-iconic-star-wars-galaxys-edge-ab1/",
      "domain": "insidethemagic.net",
      "type": "citation"
    },
    {
      "text": "Star Wars Galaxys Edge Play App",
      "url": "https://disneyworld.disney.go.com/attractions/hollywood-studios/star-wars-galaxys-edge-play-app/",
      "domain": "disneyworld.disney.go.com",
      "type": "citation"
    },
    {
      "text": "Disney Most Attended Theme Parks Annual Report October 23 2025",
      "url": "https://mickeyvisit.com/disney-most-attended-theme-parks-annual-report-october-23-2025/",
      "domain": "mickeyvisit.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Merchandise A Phenomenon Bigger Than The Movies",
      "url": "https://www.cllct.com/sports-collectibles/memorabilia/star-wars-merchandise-a-phenomenon-bigger-than-the-movies",
      "domain": "cllct.com",
      "type": "citation"
    },
    {
      "text": "Reaching For The Stars How Merchandising Became The Film Industry S Golden Ticket Blog.html",
      "url": "https://www.citma.org.uk/resources/reaching-for-the-stars-how-merchandising-became-the-film-industry-s-golden-ticket-blog.html",
      "domain": "citma.org.uk",
      "type": "citation"
    },
    {
      "text": "102443 Most Successful Action Figure Range",
      "url": "https://www.guinnessworldrecords.com/world-records/102443-most-successful-action-figure-range",
      "domain": "guinnessworldrecords.com",
      "type": "citation"
    },
    {
      "text": "Vintage Star Wars Toys",
      "url": "https://public.com/learn/vintage-star-wars-toys",
      "domain": "public.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Toys Jason Fry",
      "url": "https://www.starwars.com/news/star-wars-toys-jason-fry",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars The Brand Saga Continues",
      "url": "https://www.licenseglobal.com/retail-news-trends/-star-wars-the-brand-saga-continues",
      "domain": "licenseglobal.com",
      "type": "citation"
    },
    {
      "text": "Revenue And Operating Income Of Disneys Consumer Products Business",
      "url": "https://www.statista.com/chart/30950/revenue-and-operating-income-of-disneys-consumer-products-business/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "Best Selling Brick Sets",
      "url": "https://www.webuybricks.co.uk/blog/best-selling-brick-sets/",
      "domain": "webuybricks.co.uk",
      "type": "citation"
    },
    {
      "text": "Star Wars",
      "url": "https://funko.com/fandoms/scifi/star-wars/",
      "domain": "funko.com",
      "type": "citation"
    },
    {
      "text": "Star Wars",
      "url": "https://www.disneystore.com/franchises/star-wars/",
      "domain": "disneystore.com",
      "type": "citation"
    },
    {
      "text": "F99905x42",
      "url": "https://www.hasbropulse.com/product/star-wars-the-black-series-neel-at-attin/F99905X42",
      "domain": "hasbropulse.com",
      "type": "citation"
    },
    {
      "text": "F99915x42",
      "url": "https://www.hasbropulse.com/product/star-wars-the-black-series-kb-at-attin/F99915X42",
      "domain": "hasbropulse.com",
      "type": "citation"
    },
    {
      "text": "Hasbro Unveils New Skeleton Crew And Other Star Wars Black Series And Vintage Collection Figures At Nycc.html",
      "url": "https://www.starwarsnewsnet.com/2024/10/hasbro-unveils-new-skeleton-crew-and-other-star-wars-black-series-and-vintage-collection-figures-at-nycc.html",
      "domain": "starwarsnewsnet.com",
      "type": "citation"
    },
    {
      "text": "02199743 5177 4e65 95aa 5654fa130076",
      "url": "https://www.amazon.com/stores/StarWars/page/02199743-5177-4E65-95AA-5654FA130076",
      "domain": "amazon.com",
      "type": "citation"
    },
    {
      "text": "Star Wars San Diego Comic Con Exclusives 2025",
      "url": "https://www.starwars.com/news/star-wars-san-diego-comic-con-exclusives-2025",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Sdcc 2025 News",
      "url": "https://thepopinsider.com/star-wars-sdcc-2025-news/",
      "domain": "thepopinsider.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://irl.umsl.edu/cgi/viewcontent.cgi?article=1226\\u0026context=urs",
      "domain": "irl.umsl.edu",
      "type": "citation"
    },
    {
      "text": "Send",
      "url": "https://etd.ohiolink.edu/acprod/odb_etd/ws/send_file/send?accession=bgsu1555689565560614\\u0026disposition=inline",
      "domain": "etd.ohiolink.edu",
      "type": "citation"
    },
    {
      "text": "Empire This Is Reflections On The Star Wars Saga And Everyday Empire",
      "url": "https://s-usih.org/2015/12/empire-this-is-reflections-on-the-star-wars-saga-and-everyday-empire/",
      "domain": "s-usih.org",
      "type": "citation"
    },
    {
      "text": "George Lucas Reveals Why Star Wars Is Fantasy Not Sci Fi Ty95",
      "url": "https://may4bewithyou.com/george-lucas-reveals-why-star-wars-is-fantasy-not-sci-fi-ty95/",
      "domain": "may4bewithyou.com",
      "type": "citation"
    },
    {
      "text": "Mythic Discovery Within The Inner Reaches Of Outer Space Joseph Campbell Meets George Lucas Part I",
      "url": "https://www.starwars.com/news/mythic-discovery-within-the-inner-reaches-of-outer-space-joseph-campbell-meets-george-lucas-part-i",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "The Real History That Inspired Star Wars",
      "url": "https://www.history.com/news/the-real-history-that-inspired-star-wars",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "Akira Kurosawa Star Wars Influence",
      "url": "https://www.starwars.com/news/akira-kurosawa-star-wars-influence",
      "domain": "starwars.com",
      "type": "citation"
    },
    {
      "text": "George Lucas",
      "url": "https://www.spacewesterns.com/sideshow/george-lucas/",
      "domain": "spacewesterns.com",
      "type": "citation"
    },
    {
      "text": "Dune Star Wars Frank Herbert George Lucas",
      "url": "https://www.polygon.com/24075067/dune-star-wars-frank-herbert-george-lucas",
      "domain": "polygon.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Inspired By Flash Gordon Buck Rogers",
      "url": "https://movieweb.com/star-wars-inspired-by-flash-gordon-buck-rogers/",
      "domain": "movieweb.com",
      "type": "citation"
    },
    {
      "text": "Star Wars A Force For Innovation",
      "url": "https://vfxvoice.com/star-wars-a-force-for-innovation/",
      "domain": "vfxvoice.com",
      "type": "citation"
    },
    {
      "text": "Practical Effects Vs Cgi How Star Wars Evolved From Miniatures To The Volume",
      "url": "https://confusingmiddle.com/2025/10/31/practical-effects-vs-cgi-how-star-wars-evolved-from-miniatures-to-the-volume/",
      "domain": "confusingmiddle.com",
      "type": "citation"
    },
    {
      "text": "A Breakdown Of The Visual Effects Used In The Star Wars Franchise",
      "url": "https://platt.edu/blog/a-breakdown-of-the-visual-effects-used-in-the-star-wars-franchise/",
      "domain": "platt.edu",
      "type": "citation"
    },
    {
      "text": "How Star Wars Changed The Special Effects Industry",
      "url": "https://www.theneweconomy.com/business/how-star-wars-changed-the-special-effects-industry",
      "domain": "theneweconomy.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Technology",
      "url": "https://www.pieratts.com/blog/star-wars-technology",
      "domain": "pieratts.com",
      "type": "citation"
    },
    {
      "text": "Avengers Infinity War Marvel Vs Star Wars Disney",
      "url": "https://observer.com/2018/05/avengers-infinity-war-marvel-vs-star-wars-disney/",
      "domain": "observer.com",
      "type": "citation"
    },
    {
      "text": "Marvel Studios Kevin Feige Explains How Star Wars Influenced The Studio And Its Films A160024",
      "url": "https://comicbookmovie.com/sci_fi/star-wars/marvel-studios-kevin-feige-explains-how-star-wars-influenced-the-studio-and-its-films-a160024",
      "domain": "comicbookmovie.com",
      "type": "citation"
    },
    {
      "text": "Disney Turns A Quarterly Profit In Streaming For The First Time.html",
      "url": "https://www.starwarsnewsnet.com/2024/08/disney-turns-a-quarterly-profit-in-streaming-for-the-first-time.html",
      "domain": "starwarsnewsnet.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Andor Revenue Disney Plus",
      "url": "https://www.thewrap.com/star-wars-andor-revenue-disney-plus/",
      "domain": "thewrap.com",
      "type": "citation"
    },
    {
      "text": "The 2019 Star Wars Business Report Toys",
      "url": "https://entertainmentstrategyguy.com/2020/05/04/the-2019-star-wars-business-report-toys/",
      "domain": "entertainmentstrategyguy.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Beyond Victory Review Quest 3",
      "url": "https://www.roadtovr.com/star-wars-beyond-victory-review-quest-3/",
      "domain": "roadtovr.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Tech News Beyond Victory Future Tech Trends",
      "url": "https://additionalknowledge.com/2025/04/19/star-wars-tech-news-beyond-victory-future-tech-trends/",
      "domain": "additionalknowledge.com",
      "type": "citation"
    },
    {
      "text": "Ai Replacing Human Artists Star Wars Ted Talk",
      "url": "https://www.goodgoodgood.co/articles/ai-replacing-human-artists-star-wars-ted-talk",
      "domain": "goodgoodgood.co",
      "type": "citation"
    },
    {
      "text": "Star Wars Showcase Ai Special Effects Disaster",
      "url": "https://futurism.com/star-wars-showcase-ai-special-effects-disaster",
      "domain": "futurism.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Changed Visual Effects Ai Is Doing It Again",
      "url": "https://rogerwong.me/2025/05/star-wars-changed-visual-effects-ai-is-doing-it-again",
      "domain": "rogerwong.me",
      "type": "citation"
    },
    {
      "text": "501st.com",
      "url": "https://www.501st.com/",
      "domain": "501st.com",
      "type": "citation"
    },
    {
      "text": "Star Wars Celebration",
      "url": "https://en.wikipedia.org/wiki/Star_Wars_Celebration",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "501st Legion %28fan Organization%29",
      "url": "https://starwars.fandom.com/wiki/501st_Legion_%28fan_organization%29",
      "domain": "starwars.fandom.com",
      "type": "citation"
    },
    {
      "text": "What Went Wrong With The Star Wars Sequels",
      "url": "https://bennettrcoles.com/what-went-wrong-with-the-star-wars-sequels/",
      "domain": "bennettrcoles.com",
      "type": "citation"
    },
    {
      "text": "14680777.2017.1313291",
      "url": "https://www.tandfonline.com/doi/abs/10.1080/14680777.2017.1313291",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "978 1 5275 5030 8",
      "url": "https://cambridgescholars.com/product/978-1-5275-5030-8/",
      "domain": "cambridgescholars.com",
      "type": "citation"
    },
    {
      "text": "Jpcu.70003",
      "url": "https://onlinelibrary.wiley.com/doi/pdf/10.1111/jpcu.70003",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Watch",
      "url": "https://www.youtube.com/watch?v=RKv0qdCVxcU",
      "domain": "youtube.com",
      "type": "citation"
    },
    {
      "text": "Starwars Spring25 Navarro",
      "url": "https://ethnicstudies.calpoly.edu/more_news/starwars-spring25-navarro",
      "domain": "ethnicstudies.calpoly.edu",
      "type": "citation"
    },
    {
      "text": "Cfp Edited Volume On Star Wars And Politics In The Disney Era",
      "url": "https://call-for-papers.sas.upenn.edu/cfp/2025/07/28/cfp-edited-volume-on-star-wars-and-politics-in-the-disney-era",
      "domain": "call-for-papers.sas.upenn.edu",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "space opera",
      "page": "Space_opera"
    },
    {
      "text": "media franchise",
      "page": "Media_franchise"
    },
    {
      "text": "galaxy",
      "page": "Galaxy"
    },
    {
      "text": "the Force",
      "page": "The_Force"
    },
    {
      "text": "Sith",
      "page": "Sith"
    },
    {
      "text": "Galactic Republic",
      "page": "Galactic_Republic"
    },
    {
      "text": "Empire",
      "page": "Empire"
    },
    {
      "text": "Rebel Alliance",
      "page": "Rebel_Alliance"
    },
    {
      "text": "George Lucas",
      "page": "George_Lucas"
    },
    {
      "text": "Lucasfilm",
      "page": "Lucasfilm"
    },
    {
      "text": "Luke Skywalker",
      "page": "Luke_Skywalker"
    },
    {
      "text": "Princess Leia",
      "page": "Princess_Leia"
    },
    {
      "text": "Han Solo",
      "page": "Han_Solo"
    },
    {
      "text": "Darth Vader",
      "page": "Darth_Vader"
    },
    {
      "text": "The Empire Strikes Back",
      "page": "The_Empire_Strikes_Back"
    },
    {
      "text": "Return of the Jedi",
      "page": "Return_of_the_Jedi"
    },
    {
      "text": "The Walt Disney Company",
      "page": "The_Walt_Disney_Company"
    },
    {
      "text": "Kathleen Kennedy",
      "page": "Kathleen_Kennedy"
    },
    {
      "text": "Star Wars Rebels",
      "page": "Star_Wars_Rebels"
    },
    {
      "text": "The Mandalorian",
      "page": "The_Mandalorian"
    },
    {
      "text": "The Book of Boba Fett",
      "page": "The_Book_of_Boba_Fett"
    },
    {
      "text": "Obi-Wan Kenobi",
      "page": "Obi-Wan_Kenobi"
    },
    {
      "text": "Andor",
      "page": "Andor"
    },
    {
      "text": "Ahsoka",
      "page": "Ahsoka"
    },
    {
      "text": "Star Wars Outlaws",
      "page": "Star_Wars_Outlaws"
    },
    {
      "text": "Walt Disney World",
      "page": "Walt_Disney_World"
    },
    {
      "text": "Disneyland",
      "page": "Disneyland"
    },
    {
      "text": "box office",
      "page": "Box_office"
    },
    {
      "text": "Marvel Cinematic Universe",
      "page": "Marvel_Cinematic_Universe"
    },
    {
      "text": "popular culture",
      "page": "Popular_culture"
    },
    {
      "text": "visual effects",
      "page": "Visual_effects"
    },
    {
      "text": "Eastern philosophy",
      "page": "Eastern_philosophy"
    },
    {
      "text": "Star Wars Celebration",
      "page": "Star_Wars_Celebration"
    },
    {
      "text": "Jedi",
      "page": "Jedi"
    },
    {
      "text": "Galactic Empire",
      "page": "Galactic_empire"
    },
    {
      "text": "Skywalker family",
      "page": "Skywalker_family"
    },
    {
      "text": "hyperspace",
      "page": "Hyperspace"
    },
    {
      "text": "dimension",
      "page": "Dimension"
    },
    {
      "text": "faster-than-light",
      "page": "Faster-than-light"
    },
    {
      "text": "navigation",
      "page": "Navigation"
    },
    {
      "text": "telekinesis",
      "page": "Telekinesis"
    },
    {
      "text": "precognition",
      "page": "Precognition"
    },
    {
      "text": "balance",
      "page": "Balance"
    },
    {
      "text": "the New Republic",
      "page": "The_New_Republic"
    },
    {
      "text": "fictional universe",
      "page": "Fictional_universe"
    },
    {
      "text": "eras",
      "page": "Eras"
    },
    {
      "text": "canon",
      "page": "Canon"
    },
    {
      "text": "framework",
      "page": "Framework"
    },
    {
      "text": "Expanded Universe",
      "page": "Expanded_universe"
    },
    {
      "text": "comics",
      "page": "Comics"
    },
    {
      "text": "narrative",
      "page": "Narrative"
    },
    {
      "text": "Interstellar travel",
      "page": "Interstellar_travel"
    },
    {
      "text": "Coruscant",
      "page": "Coruscant"
    },
    {
      "text": "ecumenopolis",
      "page": "Ecumenopolis"
    },
    {
      "text": "Tatooine",
      "page": "Tatooine"
    },
    {
      "text": "desert",
      "page": "Desert"
    },
    {
      "text": "twin suns",
      "page": "Twin_Suns"
    },
    {
      "text": "forest",
      "page": "Forest"
    },
    {
      "text": "clone troopers",
      "page": "Clone_trooper"
    },
    {
      "text": "First Order",
      "page": "First-order"
    },
    {
      "text": "1973",
      "page": "1973"
    },
    {
      "text": "Death Star",
      "page": "Death_Star"
    },
    {
      "text": "Industrial Light \\u0026 Magic",
      "page": "Industrial_Light_\\u0026_Magic"
    },
    {
      "text": "Van Nuys",
      "page": "Van_Nuys"
    },
    {
      "text": "California",
      "page": "California"
    },
    {
      "text": "John Dykstra",
      "page": "John_Dykstra"
    },
    {
      "text": "Mark Hamill",
      "page": "Mark_Hamill"
    },
    {
      "text": "Harrison Ford",
      "page": "Harrison_Ford"
    },
    {
      "text": "American Graffiti",
      "page": "American_Graffiti"
    },
    {
      "text": "Carrie Fisher",
      "page": "Carrie_Fisher"
    },
    {
      "text": "Debbie Reynolds",
      "page": "Debbie_Reynolds"
    },
    {
      "text": "Eddie Fisher",
      "page": "Eddie_Fisher"
    },
    {
      "text": "Jaws",
      "page": "Jaws"
    },
    {
      "text": "50th Academy Awards",
      "page": "50th_Academy_Awards"
    },
    {
      "text": "Kenner Products",
      "page": "Kenner_Products"
    },
    {
      "text": "novelization",
      "page": "Novelization"
    },
    {
      "text": "Alan Dean Foster",
      "page": "Alan_Dean_Foster"
    },
    {
      "text": "Kennedy",
      "page": "Kennedy"
    },
    {
      "text": "Solo",
      "page": "Solo"
    },
    {
      "text": "Sharmeen Obaid-Chinoy",
      "page": "Sharmeen_Obaid-Chinoy"
    },
    {
      "text": "Daisy Ridley",
      "page": "Daisy_Ridley"
    },
    {
      "text": "Order",
      "page": "Order"
    },
    {
      "text": "Star Wars: The High Republic",
      "page": "Star_Wars:_The_High_Republic"
    },
    {
      "text": "Wookiee",
      "page": "Wookiee"
    },
    {
      "text": "Chewbacca",
      "page": "Chewbacca"
    },
    {
      "text": "R2-D2",
      "page": "R2-D2"
    },
    {
      "text": "C-3PO",
      "page": "C-3PO"
    },
    {
      "text": "Yavin",
      "page": "Yavin"
    },
    {
      "text": "Irvin Kershner",
      "page": "Irvin_Kershner"
    },
    {
      "text": "Hoth",
      "page": "Hoth"
    },
    {
      "text": "Dagobah",
      "page": "Dagobah"
    },
    {
      "text": "Yoda",
      "page": "Yoda"
    },
    {
      "text": "Lando Calrissian",
      "page": "Lando_Calrissian"
    },
    {
      "text": "the film",
      "page": "The_Film"
    },
    {
      "text": "puppetry",
      "page": "Puppetry"
    },
    {
      "text": "Richard Marquand",
      "page": "Richard_Marquand"
    },
    {
      "text": "Rebels",
      "page": "R.E.B.E.L.S."
    },
    {
      "text": "shield",
      "page": "Shield"
    },
    {
      "text": "Emperor",
      "page": "Emperor"
    },
    {
      "text": "Han",
      "page": "Han"
    },
    {
      "text": "deity",
      "page": "Deity"
    },
    {
      "text": "Imperial",
      "page": "Imperial"
    },
    {
      "text": "Chosen One",
      "page": "The_Chosen_One"
    },
    {
      "text": "Clone Wars",
      "page": "Clone_Wars"
    },
    {
      "text": "Chancellor",
      "page": "Chancellor"
    },
    {
      "text": "General Grievous",
      "page": "General_Grievous"
    },
    {
      "text": "Mace Windu",
      "page": "Mace_Windu"
    },
    {
      "text": "Order 66",
      "page": "Order_66"
    },
    {
      "text": "computer-generated imagery",
      "page": "Computer-generated_imagery"
    },
    {
      "text": "CGI",
      "page": "CGI"
    },
    {
      "text": "critical reception",
      "page": "Shy_Guy"
    },
    {
      "text": "Rotten Tomatoes",
      "page": "Rotten_Tomatoes"
    },
    {
      "text": "merchandising",
      "page": "Merchandising"
    },
    {
      "text": "prequel",
      "page": "Prequel"
    },
    {
      "text": "Resistance",
      "page": "Resistance"
    },
    {
      "text": "J.J. Abrams",
      "page": "J._J._Abrams"
    },
    {
      "text": "Rian Johnson",
      "page": "Rian_Johnson"
    },
    {
      "text": "2012",
      "page": "2012"
    },
    {
      "text": "Kylo Ren",
      "page": "Kylo_Ren"
    },
    {
      "text": "Jakku",
      "page": "Jakku"
    },
    {
      "text": "stormtrooper",
      "page": "Stormtrooper"
    },
    {
      "text": "Poe Dameron",
      "page": "Poe_Dameron"
    },
    {
      "text": "Lawrence Kasdan",
      "page": "Lawrence_Kasdan"
    },
    {
      "text": "Michael Arndt",
      "page": "Michael_Arndt"
    },
    {
      "text": "Holdo",
      "page": "Vice-Admiral_Holdo"
    },
    {
      "text": "mutiny",
      "page": "Mutiny"
    },
    {
      "text": "BB-8",
      "page": "BB-8"
    },
    {
      "text": "Chris Terrio",
      "page": "Chris_Terrio"
    },
    {
      "text": "Finn",
      "page": "Finn"
    },
    {
      "text": "franchise",
      "page": "Franchise"
    },
    {
      "text": "Palpatine",
      "page": "Palpatine"
    },
    {
      "text": "the trilogy",
      "page": "The_Trilogy"
    },
    {
      "text": "universe",
      "page": "Universe"
    },
    {
      "text": "saga",
      "page": "Saga"
    },
    {
      "text": "Gareth Edwards",
      "page": "Gareth_Edwards"
    },
    {
      "text": "Rebel",
      "page": "Rebel"
    },
    {
      "text": "Jyn Erso",
      "page": "Jyn_Erso"
    },
    {
      "text": "heist",
      "page": "Heist"
    },
    {
      "text": "Tony Gilroy",
      "page": "Tony_Gilroy"
    },
    {
      "text": "Phil Lord and Christopher Miller",
      "page": "Phil_Lord_and_Christopher_Miller"
    },
    {
      "text": "production",
      "page": "Production"
    },
    {
      "text": "principal photography",
      "page": "Principal_photography"
    },
    {
      "text": "Howard",
      "page": "Ron_Howard"
    },
    {
      "text": "Jon Favreau",
      "page": "Jon_Favreau"
    },
    {
      "text": "Pedro Pascal",
      "page": "Pedro_Pascal"
    },
    {
      "text": "Grogu",
      "page": "Grogu"
    },
    {
      "text": "Sigourney Weaver",
      "page": "Sigourney_Weaver"
    },
    {
      "text": "Jeremy Allen White",
      "page": "Jeremy_Allen_White"
    },
    {
      "text": "James Mangold",
      "page": "James_Mangold"
    },
    {
      "text": "Dave Filoni",
      "page": "Dave_Filoni"
    },
    {
      "text": "Rogue Squadron",
      "page": "Rogue_Squadron"
    },
    {
      "text": "Lucasfilm Animation",
      "page": "Lucasfilm_Animation"
    },
    {
      "text": "Japanese",
      "page": "Japanese"
    },
    {
      "text": "anime",
      "page": "Anime"
    },
    {
      "text": "Rebellion",
      "page": "Rebellion"
    },
    {
      "text": "Ahsoka Tano",
      "page": "Ahsoka_Tano"
    },
    {
      "text": "bounty hunter",
      "page": "Bounty_hunter"
    },
    {
      "text": "spin-off",
      "page": "Spin-off"
    },
    {
      "text": "Sarlacc",
      "page": "Sarlacc"
    },
    {
      "text": "Fennec Shand",
      "page": "Fennec_Shand"
    },
    {
      "text": "Temuera Morrison",
      "page": "Temuera_Morrison"
    },
    {
      "text": "Ming-Na Wen",
      "page": "Ming-Na_Wen"
    },
    {
      "text": "Ewan McGregor",
      "page": "Ewan_McGregor"
    },
    {
      "text": "Deborah Chow",
      "page": "Deborah_Chow"
    },
    {
      "text": "Hayden Christensen",
      "page": "Hayden_Christensen"
    },
    {
      "text": "Moses Ingram",
      "page": "Moses_Ingram"
    },
    {
      "text": "Rogue One",
      "page": "Rogue_One"
    },
    {
      "text": "political thriller",
      "page": "Political_thriller"
    },
    {
      "text": "espionage",
      "page": "Espionage"
    },
    {
      "text": "lightsaber",
      "page": "Lightsaber"
    },
    {
      "text": "Diego Luna",
      "page": "Diego_Luna"
    },
    {
      "text": "Ben Mendelsohn",
      "page": "Ben_Mendelsohn"
    },
    {
      "text": "Grand Admiral Thrawn",
      "page": "Grand_Admiral_Thrawn"
    },
    {
      "text": "Ezra Bridger",
      "page": "Ezra_Bridger"
    },
    {
      "text": "Rosario Dawson",
      "page": "Rosario_Dawson"
    },
    {
      "text": "Skeleton Crew",
      "page": "Skeleton_crew"
    },
    {
      "text": "Jude",
      "page": "Jude"
    },
    {
      "text": "CBS",
      "page": "CBS"
    },
    {
      "text": "Bea Arthur",
      "page": "Bea_Arthur"
    },
    {
      "text": "Art Carney",
      "page": "Art_Carney"
    },
    {
      "text": "Boba Fett",
      "page": "Boba_Fett"
    },
    {
      "text": "historical significance",
      "page": "Historical_significance"
    },
    {
      "text": "Lego Star Wars",
      "page": "Lego_Star_Wars"
    },
    {
      "text": "The Lego Star Wars Holiday Special",
      "page": "The_Lego_Star_Wars_Holiday_Special"
    },
    {
      "text": "parody",
      "page": "Parody"
    },
    {
      "text": "Ben Solo",
      "page": "Ben_Solo"
    },
    {
      "text": "Darth Maul",
      "page": "Darth_Maul"
    },
    {
      "text": "miniseries",
      "page": "Miniseries"
    },
    {
      "text": "Tony Revolori",
      "page": "Tony_Revolori"
    },
    {
      "text": "Asajj Ventress",
      "page": "Asajj_Ventress"
    },
    {
      "text": "Cad Bane",
      "page": "Cad_Bane"
    },
    {
      "text": "Production I.G",
      "page": "Production_I.G"
    },
    {
      "text": "samurai",
      "page": "Samurai"
    },
    {
      "text": "Ballantine Books",
      "page": "Ballantine_Books"
    },
    {
      "text": "tie-in",
      "page": "Tie-in"
    },
    {
      "text": "Thrawn trilogy",
      "page": "Thrawn_trilogy"
    },
    {
      "text": "Timothy Zahn",
      "page": "Timothy_Zahn"
    },
    {
      "text": "Troy Denning",
      "page": "Troy_Denning"
    },
    {
      "text": "Zynga",
      "page": "Zynga"
    },
    {
      "text": "free-to-play",
      "page": "Free-to-play"
    },
    {
      "text": "arena shooter",
      "page": "Arena_shooter"
    },
    {
      "text": "Quantic Dream",
      "page": "Quantic_Dream"
    },
    {
      "text": "Duel of the Fates",
      "page": "Duel_of_the_Fates"
    },
    {
      "text": "single",
      "page": "Single"
    },
    {
      "text": "Michael Giacchino",
      "page": "Michael_Giacchino"
    },
    {
      "text": "Walt Disney Records",
      "page": "Walt_Disney_Records"
    },
    {
      "text": "Nicholas Britell",
      "page": "Nicholas_Britell"
    },
    {
      "text": "Towa Tei",
      "page": "Towa_Tei"
    },
    {
      "text": "Anaheim, California",
      "page": "Anaheim,_California"
    },
    {
      "text": "Disney's Hollywood Studios",
      "page": "Disney's_Hollywood_Studios"
    },
    {
      "text": "Florida",
      "page": "Florida"
    },
    {
      "text": "outpost",
      "page": "Outpost"
    },
    {
      "text": "projection mapping",
      "page": "Projection_mapping"
    },
    {
      "text": "Star Tours – The Adventures Continue",
      "page": "Star_Tours_–_The_Adventures_Continue"
    },
    {
      "text": "motion simulator",
      "page": "Motion_simulator"
    },
    {
      "text": "Tokyo Disneyland",
      "page": "Tokyo_Disneyland"
    },
    {
      "text": "Disneyland Paris",
      "page": "Disneyland_Paris"
    },
    {
      "text": "Space Mountain",
      "page": "Space_Mountain"
    },
    {
      "text": "Star Tours",
      "page": "Star_Tours"
    },
    {
      "text": "interactive storytelling",
      "page": "Interactive_storytelling"
    },
    {
      "text": "role-playing",
      "page": "Role-playing"
    },
    {
      "text": "canonical",
      "page": "Canonical"
    },
    {
      "text": "precedent",
      "page": "Precedent"
    },
    {
      "text": "1977",
      "page": "1977"
    },
    {
      "text": "Hasbro",
      "page": "Hasbro"
    },
    {
      "text": "revenue",
      "page": "Revenue"
    },
    {
      "text": "Lego",
      "page": "Lego"
    },
    {
      "text": "Millennium Falcon",
      "page": "Millennium_Falcon"
    },
    {
      "text": "Funko",
      "page": "Funko"
    },
    {
      "text": "Amazon",
      "page": "Amazon"
    },
    {
      "text": "Disney Store",
      "page": "Disney_Store"
    },
    {
      "text": "Star Wars Day",
      "page": "Star_Wars_Day"
    },
    {
      "text": "San Diego Comic-Con",
      "page": "San_Diego_Comic-Con"
    },
    {
      "text": "human nature",
      "page": "Human_nature"
    },
    {
      "text": "lineage",
      "page": "Lineage"
    },
    {
      "text": "self-determination",
      "page": "Self-determination"
    },
    {
      "text": "family",
      "page": "Family"
    },
    {
      "text": "counterforce",
      "page": "Counterforce"
    },
    {
      "text": "prophecy",
      "page": "Prophecy"
    },
    {
      "text": "imperialism",
      "page": "Imperialism"
    },
    {
      "text": "corruption",
      "page": "Corruption"
    },
    {
      "text": "democracy",
      "page": "Democracy"
    },
    {
      "text": "moral imperative",
      "page": "Moral_imperative"
    },
    {
      "text": "freedom",
      "page": "Freedom"
    },
    {
      "text": "humanity",
      "page": "Humanity"
    },
    {
      "text": "loyalty",
      "page": "Loyalty"
    },
    {
      "text": "emotion",
      "page": "Emotion"
    },
    {
      "text": "wonder",
      "page": "Wonder"
    },
    {
      "text": "Vietnam War",
      "page": "Vietnam_War"
    },
    {
      "text": "World War II",
      "page": "World_War_II"
    },
    {
      "text": "German Army",
      "page": "German_Army"
    },
    {
      "text": "paramilitary",
      "page": "Paramilitary"
    },
    {
      "text": "dictatorship",
      "page": "Dictatorship"
    },
    {
      "text": "The Hidden Fortress",
      "page": "The_Hidden_Fortress"
    },
    {
      "text": "MacGuffin",
      "page": "MacGuffin"
    },
    {
      "text": "Western",
      "page": "Western"
    },
    {
      "text": "John Ford",
      "page": "John_Ford"
    },
    {
      "text": "space cowboy",
      "page": "Space_Cowboy"
    },
    {
      "text": "Arrakis",
      "page": "Arrakis"
    },
    {
      "text": "Dune",
      "page": "The_Dune"
    },
    {
      "text": "cliffhanger",
      "page": "Cliffhanger"
    },
    {
      "text": "Flash Gordon",
      "page": "Flash_Gordon"
    },
    {
      "text": "escapism",
      "page": "Escapism"
    },
    {
      "text": "Academy Awards",
      "page": "Academy_Awards"
    },
    {
      "text": "matte",
      "page": "Matte"
    },
    {
      "text": "compositing",
      "page": "Compositing"
    },
    {
      "text": "Hollywood",
      "page": "Hollywood"
    },
    {
      "text": "blockbuster",
      "page": "Blockbuster"
    },
    {
      "text": "Marvel Studios",
      "page": "Marvel_Studios"
    },
    {
      "text": "Kevin Feige",
      "page": "Kevin_Feige"
    },
    {
      "text": "2024",
      "page": "2024"
    },
    {
      "text": "direct-to-consumer",
      "page": "Direct-to-consumer"
    },
    {
      "text": "VR",
      "page": "VR"
    },
    {
      "text": "AI",
      "page": "Ai"
    },
    {
      "text": "transmedia storytelling",
      "page": "Transmedia_storytelling"
    },
    {
      "text": "TED",
      "page": "TED"
    },
    {
      "text": "Archive of Our Own",
      "page": "Archive_of_Our_Own"
    },
    {
      "text": "Cosplay",
      "page": "Cosplay"
    },
    {
      "text": "501st Legion",
      "page": "501st_Legion"
    },
    {
      "text": "YouTube",
      "page": "YouTube"
    }
  ],
  "fetched_at": "2025-12-07T07:24:52.335846",
  "elapsed_ms": 645273
}