{
  "topic": "Sun",
  "title": "Sun",
  "slug": "sun",
  "grokipedia_slug": "Sun",
  "grokipedia_url": "https://grokipedia.com/page/Sun",
  "source": "grokipedia",
  "content": "# Sun\n\nThe Sun is the star at the center of the Solar System, a G2V spectral class main-sequence star—commonly known as a yellow dwarf—composed primarily of hydrogen (92.1%) and helium (7.8%), with trace amounts of heavier elements, and powered by nuclear fusion in its core where temperatures reach 15 million degrees Celsius. It formed approximately 4.6 billion years ago from a collapsing molecular cloud and is currently in the stable middle phase of its life cycle, expected to expand into a red giant in about 5 billion years before shedding its outer layers and becoming a white dwarf.\n\nWith an equatorial diameter of about 1.392 million kilometers—roughly 109 times that of Earth—the Sun's immense mass of 1.989 × 10³⁰ kilograms accounts for over 99.8% of the total mass in the Solar System, gravitationally binding eight planets, dwarf planets, asteroids, comets, and other objects in their orbits. Its mean distance from Earth is 149.6 million kilometers (1 astronomical unit), and it rotates differentially, with an equatorial period of 26.8 days compared to 36 days at the poles. The Sun's photosphere, its visible \"surface,\" maintains an average temperature of 5,500°C, emitting light across the electromagnetic spectrum, while its corona extends millions of kilometers into space at temperatures up to 2 million degrees Celsius.\n\nAs the primary source of energy for the Solar System, the Sun drives Earth's climate, weather patterns, ocean currents, and seasons through solar radiation and influences phenomena like auroras via interactions with Earth's magnetic field and the solar wind—a stream of charged particles emanating from the corona at speeds around 400 km/s. Its luminosity of 3.83 × 10²⁶ watts powers photosynthesis and sustains life on Earth, while dynamic features such as sunspots, solar flares, and coronal mass ejections occur in an approximately 11-year magnetic activity cycle, affecting space weather and satellite operations. Ongoing NASA missions, including the Parker Solar Probe, continue to study these processes to better understand the Sun's influence on the heliosphere and beyond.\n\n## Naming and Cultural Significance\n\n### Etymology\n\nThe English word \"sun\" originates from Old English *sunne*, a feminine noun denoting the celestial body, which evolved from Proto-Germanic *\\*sunnǭ*. This Germanic form traces back to the Proto-Indo-European (PIE) root *\\*sāwel-*, meaning \"the sun,\" with an alternative variant *\\*s(u)wen-* incorporating a suffix *-en-*. The term retained its basic form through Middle English as *sonne* and has remained stable into Modern English, reflecting a long continuity in Indo-European linguistic traditions.\n\nIn other Indo-European languages, cognates of this PIE root appear prominently. Latin *sol*, meaning \"the sun\" or \"sunlight,\" derives directly from *\\*sāwel-*, influencing Romance languages such as French *soleil* (from Vulgar Latin diminutive *\\*soliculus*). Ancient Greek *hēlios* (ἥλιος), referring to both the sun and its personified deity, stems from the same root *\\*séh₂wel-*, a variant emphasizing the solar entity. Similarly, Sanskrit *sū́ryaḥ*, the name of the sun god and the celestial body, comes from PIE *\\*súryos*, a derivative of *\\*sāwel-*, highlighting the root's widespread attestation across ancient Indo-European branches.\n\nIn astronomical terminology, \"Sun\" evolved into a proper noun in English by the modern era, particularly with the heliocentric model's adoption, where it specifically denotes our star as distinct from other suns. This usage, capitalized as \"the Sun,\" became standardized in scientific writing, as recommended by the International Astronomical Union (IAU) to treat it as a unique identifier within the solar system. These linguistic derivations often intersect with cultural symbolism, where names like Helios and Sūrya embody divine attributes in mythology.\n\n### Religious and Mythological Aspects\n\nThe Sun has held a prominent place in religious and mythological traditions across cultures, often personified as a deity embodying creation, vitality, and divine power. In ancient Egyptian mythology, Ra was revered as the supreme sun god and creator who emerged from the primordial waters of Nun to form the world, sailing across the sky in a solar barque by day and navigating the underworld by night to ensure cosmic order and renewal. Similarly, in Greek mythology, Helios represented the personification of the Sun, depicted as a youthful god driving a chariot pulled by fiery horses across the heavens, symbolizing the unyielding cycle of day and light that illuminated both mortal and divine realms. In Aztec cosmology, Tonatiuh served as the fifth and current sun god, whose era demanded human sacrifices to sustain his movement and prevent the world's destruction, reflecting the Sun's role as a fierce warrior demanding tribute for existence. Hindu traditions venerated Surya as the radiant solar deity, one of the Adityas born from the sage Kashyapa, who traversed the sky in a chariot drawn by seven horses, bestowing health, prosperity, and enlightenment upon devotees. In East Asian mythology, Amaterasu is the Japanese Shinto sun goddess and mythical ancestress of the Imperial House, while in Norse tradition, Sól personifies the sun as a goddess driving a chariot across the sky.)\n\nRituals and festivals centered on the Sun underscored its life-giving essence and seasonal rhythms. Ancient cultures worldwide marked solstices with ceremonies to honor the Sun's return, such as communal gatherings at megalithic sites to align with its path, invoking blessings for fertility and harvest. In the Inca Empire, the Inti Raymi festival celebrated the winter solstice in honor of Inti, the sun god and ancestor of the rulers, featuring processions, offerings of gold and llamas, and ritual dances at Cusco's Sacsayhuamán fortress to ensure the Sun's rebirth and agricultural abundance. Even in Abrahamic religions, the Sun appears in sacred texts as a divine sign; the Bible portrays it as a symbol of God's covenant and judgment, as in Malachi 4:2 where the \"Sun of Righteousness\" arises with healing, while the Quran describes the sun as a radiant lamp (Quran 71:16) and instructs against prostrating to it or the moon, emphasizing worship of Allah the Creator (Quran 41:37).\n\nSymbolically, the Sun permeates creation myths, life cycles, and eschatological narratives, representing origins, renewal, and ultimate judgment. In Egyptian lore, Ra's self-creation from chaos established the Sun as the primordial force birthing land, sky, and humanity from his tears. Across Mesoamerican traditions, the Sun embodied cyclical existence, as in the Aztec Legend of the Five Suns where each era's destruction and rebirth by solar deities mirrored the perpetual renewal of life through death. In eschatology, the Sun's darkening foretold apocalyptic transformation; biblical visions in Revelation 6:12 depict the Sun turning black as sackcloth during the end times, signifying divine intervention and the dawn of eternal light. These motifs highlight the Sun's universal archetype as a beacon of hope amid transience, guiding souls through existence toward cosmic resolution.\n\n## Physical Characteristics\n\n### Size and Mass\n\nThe Sun's equatorial radius measures 695,700 kilometers, which is approximately 109 times that of Earth's radius. This gives the Sun a diameter of about 1,391,400 kilometers, roughly equivalent to 109 Earth diameters or 10 times the diameter of Jupiter, the largest planet in the Solar System. These dimensions establish the Sun as the dominant physical presence in the Solar System, far exceeding the scale of any planetary body.\n\nThe Sun's mass is 1.989 × 10^{30} kilograms, accounting for 99.86% of the total mass of the Solar System and enabling its gravitational dominance that maintains the orbits of all planets, asteroids, and other objects. This immense mass, equivalent to about 333,000 Earth masses, underscores the Sun's central role in dictating the system's dynamical structure.\n\nThe mean density of the Sun is 1.408 grams per cubic centimeter, less than a quarter of Earth's average density due to its gaseous composition despite the extreme internal pressures. At its surface, the gravitational acceleration is 274 meters per second squared, approximately 28 times stronger than Earth's surface gravity.\n\nThe Sun's volume totals 1.412 × 10^{18} cubic kilometers, sufficient to encompass about 1.3 million spheres the size and volume of Earth, highlighting its vast interior scale relative to terrestrial bodies.\n\n### Rotation and Age\n\nThe Sun exhibits differential rotation, with its equatorial regions completing a sidereal rotation in approximately 25 days, while higher latitudes near the poles take about 35 days. This variation in rotational speed across latitudes arises from the Sun's gaseous nature, allowing different parts of its surface to rotate at distinct rates.\n\nThe age of the Sun is estimated at approximately 4.6 billion years, primarily determined through radiometric dating of meteorites, which provide a record of the solar system's formation. Helioseismology, the study of solar oscillations, further supports this age by confirming models of the Sun's internal evolution that align with the observed seismic frequencies.\n\nThe Sun's angular momentum, stemming from its overall rotation, contributes to the dynamo process that generates and maintains its global magnetic field through interactions between rotation and convective motions. In comparison to other stars, the Sun rotates relatively slowly for its mass and age; younger Sun-like stars often exhibit rotation periods of just a few days, while older counterparts rotate even more leisurely, reflecting a general slowdown over stellar lifetimes due to angular momentum loss via stellar winds.\n\n## Chemical Composition\n\n### Elemental Makeup\n\nThe Sun's elemental composition is primarily determined from observations of its photosphere, the visible surface layer, which serves as a proxy for the overall makeup due to convective mixing. Hydrogen dominates as the most abundant element, comprising approximately 74.38% of the Sun's mass and 92.4% of the atoms by number, while helium accounts for about 24.23% by mass and 7.6% by number. These two elements together make up over 98.6% of the Sun's total mass, reflecting the primordial composition from the solar nebula where fusion processes have not significantly altered the bulk ratios yet.\n\nHeavier elements, collectively termed metals in astrophysics, constitute the remaining 1.39% by mass, with key contributors including oxygen at ~0.58%, carbon at ~0.26%, and neon at ~0.17%. The table below summarizes the abundances of the primary elements:\n\n| Element  | Mass Fraction (%) | Number Fraction (%) |\n|----------|-------------------|---------------------|\n| Hydrogen | 74.38             | 92.4                |\n| Helium   | 24.23             | 7.6                 |\n| Oxygen   | 0.58              | 0.045               |\n| Carbon   | 0.26              | 0.027               |\n| Neon     | 0.17              | 0.011               |\n\nThese values are derived from spectroscopic analysis of absorption lines in the solar spectrum, where the strengths and wavelengths of lines from specific elements reveal their relative abundances under local thermodynamic equilibrium assumptions, refined with 3D atmospheric models and non-local thermodynamic equilibrium corrections. The 2021 update by Asplund et al. slightly increased the metallicity relative to prior estimates, aiding but not fully resolving helioseismology discrepancies.\n\nThe metallicity, denoted as Z and defined as the mass fraction of all elements heavier than helium (Z = 1 - X - Y, where X and Y are hydrogen and helium mass fractions), stands at 0.0139 for the present-day photosphere. This parameter is crucial for modeling stellar evolution and is based on the solar abundance standard established and updated by Asplund et al. through iterative improvements in atomic data, model atmospheres, and observational techniques.\n\n### Isotopic Variations\n\nThe deuterium-to-hydrogen (D/H) ratio in the protosolar nebula, preserved in the Sun's composition, is approximately 2.0 × 10^{-5}, reflecting the primordial abundance from Big Bang nucleosynthesis. This value is inferred from measurements in Jupiter's atmosphere as a proxy, where deuterium is not significantly processed in the stellar interior due to its rapid destruction via proton capture during the Sun's formation. The consistency of this ratio across solar system bodies underscores its role as a tracer of early universe conditions, unaltered by subsequent stellar evolution in the Sun's outer layers.\n\nThe helium-3 to helium-4 (³He/⁴He) ratio in the Sun's photosphere and solar wind is elevated to about 4.5 × 10^{-4} compared to the protosolar value of roughly 1.7 × 10^{-4}, primarily due to the production of ³He as an intermediate in the proton-proton chain fusion reactions occurring in the solar core. This enhancement results from the outward mixing of core-processed material to the surface over the Sun's lifetime, with direct measurements from solar wind samples confirming the current surface abundance. The observed ratio provides a key observable for validating the efficiency of hydrogen burning in standard solar models.\n\nFor heavier elements, isotopic variations such as the carbon-12 to carbon-13 (¹²C/¹³C) ratio in the solar photosphere are around 90–93, arising from gravitational diffusion, radiative acceleration, and convective mixing that differentially transport isotopes from the interior to the surface. This value, slightly higher than the terrestrial ratio of 89, indicates minor fractionation effects during solar evolution or inheritance from the protosolar disk, with spectroscopic observations of molecular lines yielding precise constraints.\n\nThese isotopic ratios play a vital role in solar interior modeling by influencing the mean molecular weight gradient and opacity, which determine the sound speed profile and convective zone depth. Helioseismology data, including global oscillation frequencies, impose tight constraints on these compositions, revealing tensions such as the need for higher surface helium abundance (Y ≈ 0.25) than predicted by diffusion models to match observed p-mode frequencies. Resolving these discrepancies refines our understanding of element settling and transport processes in the Sun.\n\n## Internal Structure\n\n### Core\n\nThe core of the Sun is its central region, extending from the center to approximately 20-25% of the solar radius, or about 150,000 to 175,000 kilometers. This densely packed zone reaches temperatures of around 15 million Kelvin and densities of about 150 grams per cubic centimeter, conditions extreme enough to enable sustained nuclear fusion. These properties, inferred from solar models and helioseismology, make the core the powerhouse of the Sun, where over 99% of its energy is produced.\n\nThe primary energy source in the core is the proton-proton chain (pp-chain), a series of nuclear fusion reactions that converts hydrogen into helium. In this process, the Sun fuses approximately 620 million metric tons of hydrogen into helium every second, releasing vast amounts of energy while converting only about 0.7% of the hydrogen's mass into other forms. The net reaction of the pp-chain is:\n\n$$\n4\\, ^{1}\\\text{H} \\rightarrow \\, ^{4}\\\text{He} + 2\\\text{e}^{+} + 2\\\nu_{e} + \\\text{energy (26.7 MeV)}\n$$\n\nThis equation represents the overall transformation, where four protons (hydrogen nuclei) fuse to form one helium-4 nucleus, two positrons, two electron neutrinos, and energy equivalent to 26.7 mega-electronvolts per reaction, primarily in the form of gamma rays and kinetic energy. The pp-chain dominates in stars like the Sun due to their relatively low core temperatures, accounting for nearly all fusion energy generation.\n\nA key byproduct of the pp-chain is the production of electron neutrinos, which stream outward from the core at nearly the speed of light. Observations in the late 20th century revealed fewer solar neutrinos than predicted by standard solar models, posing the \"solar neutrino problem.\" This discrepancy was resolved by the discovery of neutrino oscillations, in which electron neutrinos transform into muon or tau neutrinos en route to Earth, as confirmed by experiments like Super-Kamiokande and the Sudbury Neutrino Observatory. These findings not only validated solar fusion models but also established that neutrinos have mass. The energy from core fusion is subsequently transported to the Sun's outer layers via radiative and convective processes.\n\n### Radiative and Convective Zones\n\nThe radiative zone of the Sun occupies the region from approximately 0.25 to 0.7 solar radii (about 175,000 to 490,000 km from the center), where energy produced by fusion in the core is transported outward through radiative diffusion. In this stable layer, high-energy photons, primarily gamma rays and X-rays, propagate via a random walk process, repeatedly scattering off ions and electrons in the dense plasma due to high opacity from ionized metals and hydrogen. This diffusion takes an estimated 170,000 years for a typical photon to traverse the zone, as the mean free path is short—on the order of millimeters—resulting in billions of absorptions and re-emissions. The temperature in the radiative zone decreases from roughly 7 million K at its base to 2 million K at the top, with density dropping from 20 g/cm³ to 0.2 g/cm³; the temperature gradient follows approximately ∇T ∝ 1/r² to balance the radiative flux in hydrostatic equilibrium.\n\nOpacity plays a crucial role in the radiative zone, arising from bound-free and free-free transitions in the partially ionized plasma, which sustains the subadiabatic temperature gradient and prevents convective instability. Above the radiative zone lies the convective zone, spanning from 0.7 to 1.0 solar radii (roughly 200,000 km below the surface to the photosphere), where energy transport shifts to convection due to increasing opacity from heavier elements like carbon and oxygen that trap heat. Here, the plasma behaves like a boiling fluid, with hot, less dense material rising in convection cells while cooler material sinks, efficiently carrying heat outward at speeds up to several meters per second; this process manifests as granulation patterns visible on the solar surface. The temperature gradient in the convective zone approximates the adiabatic gradient, ensuring efficient mixing and a near-neutral stability, with temperatures falling from 2 million K at the base to about 5,700 K at the top.\n\nSeparating these zones is the tachocline, a thin shear layer approximately 0.05 solar radii thick (~35,000 km) at the base of the convective zone, characterized by strong radial differential rotation and compositional gradients. This transitional region, where nearly solid-body rotation in the radiative interior meets differential rotation in the convective envelope, is critical for the solar dynamo, as the shear generates and amplifies the magnetic field through magnetohydrodynamic instabilities. Helioseismic observations confirm the tachocline's thinness and latitudinal variation, with its dynamics influencing the 11-year solar cycle.\n\n## Solar Atmosphere\n\n### Photosphere\n\nThe photosphere is the visible \"surface\" of the Sun, representing the opaque layer from which most of the Sun's emitted light escapes to space, defining the apparent solar disk and radius of approximately 696,000 km. This layer is relatively thin, with a thickness ranging from about 100 to 400 km, making it a minuscule fraction—less than 0.1%—of the Sun's total radius. The temperature in the photosphere varies with depth and location but averages around 5,778 K at the effective temperature, corresponding to the layer where optical depth is about two-thirds, with surface values typically between 5,500 and 6,000 K. Energy generated in the Sun's core and transported through the radiative and convective zones below emerges here as visible radiation, primarily in the form of blackbody emission peaking in the green-yellow wavelengths.\n\nA prominent feature of the photosphere is granulation, which arises from convective motions in the underlying zone where hot plasma rises in bright, cellular updrafts and cooler material descends in darker intergranular lanes. These granules are roughly 1,000 km in diameter—comparable to the width of the continental United States—and each persists for about 8 to 20 minutes before evolving, creating a mottled, rice-grain-like pattern visible through high-resolution telescopes. The bright granule centers are hotter by about 200–300 K than the surrounding lanes due to the upward flow of plasma at speeds of 1–2 km/s, while the dark lanes mark regions of downward motion and radiative cooling. This convection drives the photosphere's dynamic texture, with millions of granules covering the solar disk at any time.\n\nLimb darkening is observed as a gradual decrease in the photosphere's brightness toward the solar limb, or edge of the disk, where the intensity can drop to about 30–40% of the center value in visible light. This effect occurs because lines of sight near the limb pass obliquely through the photosphere, sampling cooler, higher-altitude layers with lower temperatures along the path, in contrast to the near-vertical view at disk center that probes deeper, hotter regions. The phenomenon provides evidence for the temperature gradient in the photosphere, increasing from about 4,400 K at the top to 6,600 K at the bottom.\n\nSunspots appear as temporary dark patches on the photosphere, covering less than 1% of the surface on average but increasing during solar maximum, with umbral temperatures around 3,700–4,200 K compared to the surrounding photosphere's 5,700 K, making them appear darker despite emitting some light. These regions, typically 10,000–50,000 km across and lasting days to weeks, result from strong magnetic fields inhibiting convection and are more prevalent at mid-latitudes during the 11-year solar cycle.\n\n### Chromosphere and Corona\n\nThe chromosphere forms the lower part of the Sun's upper atmosphere, extending above the photosphere from approximately 2,000 to 10,000 km in thickness due to its dynamic, filamentary structures. Temperatures in this layer rise irregularly from about 4,000 K near its base to 20,000 K or higher at the top, creating a region of intense atomic excitation and emission lines. This temperature increase occurs over a relatively thin zone compared to the Sun's radius, marking a departure from the cooler photospheric base.\n\nProminent features in the chromosphere include spicules, which are short-lived, needle-like jets of plasma rising up to 10,000 km above the photosphere with speeds of 10–30 km/s, contributing to mass and energy transport into higher layers. Prominences, or filaments when viewed against the disk, are denser, cooler plasma structures suspended in the chromosphere by magnetic fields, often arching hundreds of thousands of kilometers and lasting days to weeks. These features highlight the chromosphere's turbulent nature, driven by convection and magnetic interactions.\n\nThe corona, the outermost layer of the solar atmosphere, extends several million kilometers from the chromosphere, gradually merging into the interplanetary medium. Its plasma reaches temperatures of 1–3 million K, far exceeding the underlying layers, with an extremely low density of about 10^{-15} g/cm³ in the inner regions. Key structures include coronal holes, large dark regions of open magnetic field lines with lower density and faster plasma outflow, typically at the poles, and bright streamers, elongated dense formations aligned with closed magnetic loops that trace the heliospheric current sheet.\n\nA central puzzle in solar physics is the coronal heating problem: despite decreasing density, the corona's temperature rises dramatically above the chromosphere, requiring non-thermal energy input to balance radiative losses. Proposed mechanisms include dissipation of magnetohydrodynamic waves, such as Alfvén waves propagating from below, and frequent small-scale magnetic reconnections known as nanoflares, each releasing energy equivalent to a fraction of a large flare but occurring ubiquitously. NASA's Parker Solar Probe, with close approaches as near as 3.8 million miles from the Sun as of 2025, has provided in-situ observations supporting these mechanisms through measurements of plasma waves and magnetic structures. These processes provide the excess energy, estimated at about 200 W/m² in the low corona, without relying on conduction alone.\n\nObservations of the chromosphere and corona are challenging due to the photosphere's brightness, but the chromosphere appears as a pinkish layer during total solar eclipses, visible for seconds in hydrogen-alpha emission at 656 nm. The corona, best seen in white light during eclipses or via coronagraphs, is routinely imaged in extreme ultraviolet and X-rays from space missions like the Solar Dynamics Observatory, revealing its hot, structured plasma invisible from the ground.\n\n## Extended Solar Environment\n\n### Heliosphere\n\nThe heliosphere is a vast, comet-shaped magnetic bubble created by the Sun's magnetic field and plasma, enveloping the Solar System and providing a shield against most galactic cosmic rays and the local interstellar medium (LISM). This region extends asymmetrically, with a compressed leading edge facing the oncoming interstellar flow and an elongated tail in the opposite direction. The solar wind carries the Sun's rotating magnetic field outward, imprinting it onto the heliosphere's structure and forming the heliospheric current sheet (HCS), a thin, wavy surface that separates sectors of opposite magnetic polarity, akin to an extended solar magnetic equator. Surrounding the HCS are polar lobes, broad regions dominated by field lines of a single polarity—northern and southern—extending along the heliosphere's axis and contributing to its overall bipolar configuration.\n\nThe heliosphere's outer boundaries are defined by key interfaces observed in situ by NASA's Voyager spacecraft. The termination shock occurs where the solar wind decelerates from supersonic to subsonic speeds upon colliding with the LISM, located at an average distance of approximately 90 AU from the Sun; Voyager 1 crossed this boundary at 94 AU in 2004, while Voyager 2 encountered it at about 84 AU in 2007, highlighting the structure's asymmetry. Beyond the termination shock lies the heliosheath, a broad, turbulent layer of compressed solar wind plasma that extends to the heliopause, the outermost boundary where the solar influence wanes and interstellar plasma dominates, situated at roughly 120 AU; Voyager 1 traversed the heliopause at 121 AU in 2012, and Voyager 2 at 119 AU in 2018. These measurements confirm the heliosphere's dynamic scale, with the termination shock's position varying due to solar cycle fluctuations and interstellar pressures.\n\nThe heliosphere's interaction with the LISM compresses its structure on the sunward side, forming a bow wave ahead of the termination shock, while the interstellar magnetic field—estimated at approximately 0.5 nT—drapes around the heliopause, enhancing asymmetry and influencing plasma flows. This encounter modulates particle populations: pickup ions from ionized interstellar neutrals dominate thermal pressures in the heliosheath, slowing the solar wind by up to 20% by 80 AU, while galactic cosmic rays experience reduced flux within the heliosphere due to magnetic scattering and absorption. The resulting particle gradients, observed by Voyager, reveal a foreshock region of accelerated particles ahead of the termination shock, extending tens of AU and spanning energies from keV to MeV.\n\nAs of 2025, missions like the Interstellar Boundary Explorer (IBEX) and Voyager continue to refine our understanding of the heliosphere's outer reaches, along with the recently launched Interstellar Mapping and Acceleration Probe (IMAP) on September 24, 2025. IBEX has mapped a narrow \"ribbon\" of enhanced energetic neutral atom (ENA) emissions, a curved band about 20° wide encircling the sky beyond the heliopause, with recent analyses linking its temporal variations to solar wind dynamics and suggesting origins in secondary ENA production outside the heliosphere. Additionally, IBEX observations depict the heliotail—the anti-sunward extension—as comprising two distinct lobes (port and starboard) rather than a uniform structure, broader and flatter than anticipated, tilted by the interstellar magnetic field and filled with slow solar wind at low latitudes. Voyager's ongoing data from the heliosheath and beyond corroborate these remote mappings, revealing unexpected low-speed flows near the heliopause.\n\n### Solar Wind\n\nThe solar wind is a continuous stream of charged particles emanating from the Sun's corona, consisting primarily of plasma that expands outward into interplanetary space. This flow originates mainly from coronal holes, where open magnetic field lines allow plasma to escape the Sun's gravitational pull without being confined by closed magnetic loops. At Earth's distance (1 AU), the solar wind typically has a density of about 5 particles per cubic centimeter.\n\nThe composition of the solar wind is dominated by protons, which make up approximately 95% of the ions, along with about 4% alpha particles (helium nuclei) and trace amounts of heavier ions and electrons to maintain charge neutrality. Its speed varies significantly, ranging from 300 to 800 km/s, with an average around 400 km/s; faster streams, often exceeding 500 km/s, arise from polar coronal holes, while slower flows near 400 km/s emerge from equatorial regions near the streamer belt. These variations in speed lead to distinct types of solar wind: the fast wind, which is steadier and originates from cooler, less dense coronal regions, and the slow wind, which is more variable and associated with hotter, denser plasma near active regions.\n\nAs the solar wind expands radially while the Sun rotates approximately every 27 days (as viewed from Earth), the embedded magnetic field lines become wound into a spiral configuration known as the Parker spiral. This helical structure results from the outward advection of the radial magnetic field combined with the azimuthal shearing due to solar rotation, creating a pattern where field lines trail outward like an Archimedean spiral. Interactions between fast and slow wind streams produce corotating interaction regions (CIRs), where the faster plasma compresses the slower ahead of it, forming boundaries with enhanced density and magnetic field strength that persist over multiple solar rotations. The solar wind ultimately shapes the heliosphere, the bubble of solar-influenced space surrounding the solar system.\n\n## Energy Output\n\n### Solar Radiation\n\nThe Sun's total luminosity, representing the total radiant energy emitted per second across all wavelengths, is measured at 3.828 × 10^{26} watts. This immense energy output originates from nuclear fusion processes in the core and propagates outward through the radiative and convective zones before escaping as electromagnetic radiation. At Earth's mean orbital distance of approximately 1 astronomical unit (AU), this luminosity results in the solar constant, or total solar irradiance (TSI), of 1,361.6 ± 0.3 W/m² as measured by the Total and Spectral Solar Irradiance Sensor (TSIS-1) during the 2019 solar minimum. These values establish the scale of solar energy flux available to power Earth's climate system.\n\nThe Sun's radiation can be approximated as that of a blackbody, with an effective temperature of 5,772 K derived from integrating the observed spectral irradiance to match the total luminosity. This effective temperature characterizes the surface from which the Sun would radiate the same total energy if it were a perfect blackbody emitter. According to the Stefan-Boltzmann law, the luminosity \\(L\\) relates to the effective temperature \\(T\\) and solar radius \\(R\\) (approximately 6.96 × 10^8 m) by the equation\n\n\\[\nL = 4\\pi R^2 \\sigma T^4,\n\\]\n\nwhere \\(\\sigma = 5.670 \\\times 10^{-8}\\) W m^{-2} K^{-4} is the Stefan-Boltzmann constant. To derive this, the total power radiated by a blackbody sphere is obtained by multiplying the surface flux \\(\\sigma T^4\\) (from integrating Planck's law over all wavelengths and solid angles) by the surface area \\(4\\pi R^2\\), yielding the intrinsic luminosity independent of distance. Substituting the measured \\(L\\), \\(R\\), and \\(\\sigma\\) confirms \\(T \\approx 5,772\\) K, validating the blackbody model for the Sun's overall energy output while acknowledging deviations due to atmospheric layers and spectral lines.\n\nSolar irradiance exhibits small variations tied to the 11-year solar cycle, with total solar irradiance fluctuating by about 0.1% between solar minimum and maximum, corresponding to roughly 1 W/m² change at Earth. These cyclic changes are driven by magnetic activity, including sunspots that temporarily reduce output in visible wavelengths but are offset by facular brightenings. Shorter-term variations occur in ultraviolet (UV) and X-ray bands, where irradiance can vary by factors of 2–10 over days due to flares and active regions, though these contribute minimally (\\u003c0.01%) to the total energy flux. Such modulations influence stratospheric chemistry and ionospheric dynamics but have limited direct impact on global surface temperatures.\n\nThe Sun's energy is distributed across the electromagnetic spectrum, with approximately 8% in ultraviolet wavelengths (\\u003c400 nm), 44% in the visible range (400–700 nm), and 48% in the infrared (\\u003e700 nm) for the extraterrestrial spectrum. This breakdown reflects the blackbody peak near 500 nm in the green-yellow visible light, essential for photosynthesis, while infrared dominates the thermal component and UV drives photochemical reactions in Earth's upper atmosphere. Measurements from space-based spectrometers confirm this partitioning, with the visible and near-infrared together comprising over 90% of the total irradiance.\n\n### Luminosity and Spectrum\n\nThe Sun's absolute bolometric magnitude is 4.74, representing its intrinsic brightness integrated over all wavelengths when viewed from a standard distance of 10 parsecs. This value is defined by the International Astronomical Union (IAU) zero point for bolometric magnitudes, corresponding to a total luminosity of 3.828 × 10²⁶ W. From Earth, at an average distance of 1 astronomical unit, the Sun's apparent visual magnitude is -26.74, making it by far the brightest object in the nighttime sky and dominating the daytime illumination.\n\nThe Sun's spectrum features a continuous distribution of radiation that closely follows Planck's law for blackbody thermal emission, with an effective temperature of approximately 5772 K. Superimposed on this continuum are thousands of dark absorption lines, known as Fraunhofer lines, which interrupt the otherwise smooth emission profile. These lines, first cataloged in detail by Joseph von Fraunhofer in the early 19th century, include prominent examples such as the H-alpha line at 656.3 nm from hydrogen. They arise from the absorption of specific wavelengths by cooler gas in the Sun's outer atmosphere (photosphere and chromosphere), where atoms and ions selectively remove photons at discrete energies matching their electronic transitions.\n\nIn stellar classification, the Sun is designated as a G2V star, indicating a main-sequence dwarf of spectral type G2 (yellowish-white) with luminosity class V (dwarf). This places it among G-type stars, which constitute about 7.6% of main-sequence stars in the solar neighborhood and are characterized by surface temperatures between 5200 K and 6000 K. As a G2V star, the Sun is currently in the stable hydrogen-fusion phase of its evolution on the main sequence, a stage it has occupied for about 4.6 billion years.\n\n## Magnetic Phenomena\n\n### Sunspots and Cycles\n\nSunspots are temporary dark regions on the Sun's photosphere, appearing as cooler areas compared to the surrounding surface, with temperatures in the umbra ranging from 3500 to 4500 K. These features consist of a central dark umbra, where magnetic fields are strongest and convection is suppressed, surrounded by a lighter penumbra where fields are weaker and partially allow heat transport. Sunspots typically emerge in bipolar groups, following Joy's law, where pairs are tilted such that the leading spot (in the direction of solar rotation) lies closer to the equator than the trailing spot, with the tilt angle increasing with latitude. This systematic orientation arises from the Coriolis force acting on rising magnetic flux tubes in the convection zone.\n\nThe Sun's magnetic activity manifests in an approximately 11-year solar cycle, characterized by rising and falling numbers of sunspots, which corresponds to a 22-year full magnetic cycle due to periodic reversals of the global magnetic field polarity. Hale's polarity rules govern sunspot magnetisms: in each hemisphere, the leading spots of a bipolar group have the opposite polarity to those in the other hemisphere, and this configuration reverses from one 11-year cycle to the next, completing the 22-year pattern. The spatial distribution of sunspots is visualized in the butterfly diagram, which plots spot latitudes over time and reveals an equatorward migration of activity bands, starting near 35° latitude at cycle onset and drifting toward the equator by maximum, driven by the underlying dynamo process.\n\nHistorical periods of anomalously low sunspot activity, such as the Maunder minimum from 1645 to 1715, provide analogs for grand solar minima, during which sunspot numbers dropped dramatically, possibly linked to suppressed dynamo action. For the current Solar Cycle 25, which began in December 2019, predictions initially forecasted a peak sunspot number of 115 in July 2025, but updated assessments indicate the maximum phase was reached around October 2024 with a smoothed sunspot number of 137 to 173, potentially extending into 2025 or beyond; as of November 2025, activity remains high with indications of a possible second peak.\n\nThese cyclic phenomena are explained by the α-Ω dynamo model, a mean-field theory where the α effect (from helical turbulence) generates poloidal fields from toroidal ones, and the Ω effect (from differential rotation) shears toroidal fields from poloidal ones, leading to oscillatory regeneration of the magnetic field. In this framework, the cycle length is approximated as arising from the propagation speed of dynamo waves, balancing the generation rates of α and Ω against magnetic diffusion, typically yielding periods around 11 years for solar parameters without requiring detailed nonlinear saturation.\n\n### Flares and Coronal Mass Ejections\n\nSolar flares are sudden, intense bursts of radiation from the Sun's atmosphere, primarily observed as peaks in X-ray emission. These events occur when intense magnetic fields in the corona become twisted and stressed, leading to magnetic reconnection—a process where oppositely directed magnetic field lines break and reconnect, rapidly converting stored magnetic energy into thermal and kinetic energy, as well as accelerated particles and electromagnetic radiation. The Geostationary Operational Environmental Satellite (GOES) system classifies flares based on their peak X-ray flux in the 1–8 Å wavelength band, with categories ranging from A (weakest, ~10^{-8} W/m²) to X (strongest, ≥10^{-4} W/m²), where each class represents a tenfold increase in intensity; subclasses from 1 to 9 further denote finer gradations within A through M classes, while X-class flares have no upper limit. For example, the most powerful recorded flare, an X28 event in 2003, released approximately 10^{32} erg of energy, though typical flares range from 10^{24} to 10^{32} erg total, with the energy partitioned into radiation across the spectrum from radio waves to gamma rays.\n\nCoronal mass ejections (CMEs) are massive expulsions of magnetized plasma from the Sun's corona, often triggered by the same magnetic reconnection processes that drive flares, ejecting up to billions of tons (around 10^{12} kg) of material into space. These events form expanding clouds threaded by intense magnetic fields, propagating at speeds from 250 km/s (slow) to over 3,000 km/s (fast), with typical velocities between 400 and 2,000 km/s. CMEs are categorized by their apparent angular width as observed from Earth: partial CMEs (narrower ejections), partial halos (width \\u003e120° but \\u003c360°), and full halos (360°, appearing to surround the Sun and often Earth-directed). Explosive CMEs typically originate from active regions with sunspots, while others arise from erupting prominences when magnetic flux reconfigures.\n\nAt solar maximum, flares and CMEs occur frequently, with an average of 2–3 CMEs per day, though flare rates can reach up to 20 per day during peaks..gov/nmp/st5/SCIENCE/cme.html) The kinetic energy in a typical CME ranges from 10^{28} to 10^{32} erg, comparable to large flares, highlighting their role in redistributing solar magnetic energy..gov/api/citations/20230001177/downloads/ms.pdf) Recent observations in 2025, including multiple X- and M-class flares from active region AR 14274 in early November, have produced full-halo CMEs that underscore ongoing high solar activity.\n\nLaunched in 2018, NASA's Parker Solar Probe has provided unprecedented close-range data on these phenomena through its orbits approaching within 3.8 million miles of the solar surface, revealing switchbacks—abrupt reversals in the solar wind's magnetic field likely generated by reconnection near the Sun—as common features that may contribute to coronal heating. In July 2025, Parker captured images of nascent CMEs, showing plasma bursts initiating their journey, enhancing models of eruption dynamics.\n\n## Evolutionary History\n\n### Formation and Pre-Main Sequence\n\nThe Sun originated from the gravitational collapse of a dense fragment within a giant molecular cloud of gas and dust, primarily composed of hydrogen and helium with trace heavier elements, approximately 4.6 billion years ago. This process was initiated by the Jeans instability, a gravitational perturbation in the interstellar medium where local density fluctuations exceed the cloud's thermal pressure support, leading to fragmentation and runaway contraction of sub-regions. As the fragment collapsed, conservation of angular momentum caused it to rotate faster and flatten into a rotating disk, concentrating most of the mass—about 99.8%—at the center to form the protosolar core while the outer material coalesced into a protoplanetary disk.\n\nDuring the subsequent T Tauri phase, lasting roughly a few million years, the young Sun transitioned from a fully embedded protostar to a more exposed pre-main-sequence star, surrounded by its protoplanetary disk. This phase was marked by intense accretion from the disk onto the stellar surface, accompanied by powerful stellar winds driven by magnetic activity and coronal heating, which expelled much of the remaining envelope of gas and dust. These outflows, analogous to enhanced versions of the modern solar wind, played a key role in dispersing the natal material and shaping the early solar environment, while the disk provided the reservoir for eventual planet formation.\n\nThe pre-main-sequence evolution proceeded along the Hayashi track, a nearly vertical path on the Hertzsprung-Russell diagram where the fully convective protostar contracted under gravitational forces, leading to a gradual decrease in surface temperature and luminosity over tens of millions of years. This contraction phase, dominated by Kelvin-Helmholtz energy release from gravitational potential, also resulted in spin-up of the young Sun due to the shrinking moment of inertia, increasing its rotation rate significantly compared to its current value. By the end of this stage, core temperatures reached about 10 million Kelvin, igniting hydrogen fusion and marking the onset of the main-sequence phase.\n\nKey evidence supporting this formation timeline derives from calcium-aluminum-rich inclusions (CAIs) found in primitive meteorites, which represent the oldest solid materials in the Solar System and have been dated to 4,567.3 ± 0.2 million years ago using uranium-lead isotope chronometry, aligning precisely with the inferred birth of the Sun. Furthermore, the Sun's surface lithium abundance is depleted by a factor of about 140 relative to meteoritic values, a signature of deep convective mixing during the fully convective pre-main-sequence contraction that transported lithium to hotter interior layers where it was destroyed. This depletion pattern matches theoretical models of solar-mass stars and corroborates the protostar's early evolutionary history.\n\n### Main Sequence and Future Phases\n\nThe Sun is currently in its main sequence phase, a stable period of hydrogen fusion in its core that defines the longest stage of its life cycle for stars of its mass. This phase began approximately 4.6 billion years ago after the Sun's formation and is expected to last a total of about 10 billion years, powered by the proton-proton chain reaction converting hydrogen into helium. As a G2V spectral type star on the Hertzsprung-Russell diagram, the Sun occupies the main sequence band where its luminosity and temperature are maintained by this core fusion process, providing the equilibrium between gravitational contraction and radiative pressure.\n\nRoughly halfway through this phase, the Sun's core retains about 70% of its original hydrogen content, with the remainder fused into helium, gradually increasing the core's density and temperature over time. This ongoing fusion releases energy that sustains the Sun's current size, surface temperature of around 5,500 K, and luminosity, ensuring long-term stability for the inner Solar System. Models indicate that the core's hydrogen exhaustion will mark the end of this phase in approximately 5 billion years, after which structural changes will accelerate.\n\nFollowing core hydrogen depletion, the Sun will contract and heat its core while the surrounding shell ignites hydrogen fusion, causing the outer layers to expand dramatically into a red giant phase beginning in about 5 billion years. During this expansion, the Sun's radius will grow to roughly the distance of Earth's current orbit (about 1 AU), potentially engulfing the inner planets including Mercury, Venus, and possibly Earth, while its surface cools to red hues and luminosity increases by factors of thousands.\n\nIn the dense, degenerate core of this red giant, accumulated helium will ignite suddenly in a helium flash—a rapid thermal runaway fusion event producing carbon and oxygen via the triple-alpha process—stabilizing the star temporarily on the horizontal branch of the Hertzsprung-Russell diagram. This phase will last about 100 million years, during which the Sun fuses helium at a steady rate.\n\nAs helium in the core depletes, further shell burning will cause additional expansion into the asymptotic giant branch, leading to intense mass loss through stellar winds that eject the outer envelope as a planetary nebula, revealing the hot core. The Sun will ultimately shed 30-50% of its mass during these late stages, leaving behind a white dwarf remnant with about half its original mass, composed primarily of carbon and oxygen, which will cool over trillions of years without further fusion.\n\n## Position and Motion\n\n### Within the Solar System\n\nThe Sun dominates the Solar System by comprising approximately 99.86% of its total mass, which allows for the stable gravitational binding of all orbiting bodies from Mercury to the distant Oort Cloud. This mass concentration, centered in the Sun's core, positions the system's barycenter—the common center of mass—very close to the Sun's geometric center, typically within a few solar radii. However, perturbations primarily from Jupiter, the most massive planet, cause the barycenter to wobble slightly, occasionally extending just beyond the Sun's photosphere by about 7% of its radius when Jupiter is at opposition.\n\nThe Sun's gravitational field governs planetary orbits according to Kepler's three laws, which describe elliptical paths with the Sun at one focus, equal areas swept in equal times, and orbital periods squared proportional to semi-major axes cubed—principles derived from observations and later explained by Newton's law of universal gravitation. These laws apply because the Sun's mass vastly exceeds that of the planets, ensuring their motion approximates two-body orbits around the central star. The extent of this dominance is defined by the Sun's Hill sphere, a region approximately 1 parsec (about 3.26 light-years) in radius where the Sun's gravity prevails over tidal perturbations from the Milky Way's gravitational field; within this boundary, objects like comets in the Oort Cloud maintain long-term stability, marking the Solar System's outer limit.\n\nThis configuration arose during the Solar System's formation from a collapsing molecular cloud about 4.6 billion years ago, where the Sun captured nearly all the mass into its core, enabling the protoplanetary disk to form and planets to accrete in stable, Keplerian orbits without significant disruption. In comparison, observations of exoplanetary systems around Sun-like (G-type) stars reveal that roughly half may host rocky planets in habitable zones, suggesting such mass-dominant central stars commonly support multi-planet architectures analogous to our own.\n\n### Galactic Orbit and Neighborhood\n\nThe Sun orbits the center of the Milky Way galaxy at an average distance of approximately 8.2 kiloparsecs (about 27,000 light-years), traveling at a speed of roughly 230 kilometers per second relative to the galactic center. This motion completes one full revolution, known as a galactic year, in about 230 million years.\n\nThe solar system resides within the Local Bubble, a low-density cavity in the interstellar medium spanning roughly 1,000 light-years across, sculpted by the explosions of approximately 15 supernovae over the past 10 to 20 million years. This hot, tenuous region, with gas temperatures exceeding 1 million Kelvin, surrounds the Sun and influences its local environment, including potential perturbations to the Oort cloud from supernova shock waves that could eject small particles or alter orbits of distant cometary bodies.\n\nPositioned in the Orion Arm (also called the Orion Spur), a minor spiral feature between the Sagittarius and Perseus arms, the Sun's immediate stellar neighborhood includes the nearest star, Proxima Centauri, at 4.24 light-years away, part of the Alpha Centauri system. Within 50 light-years, there are approximately 1,500 known stars, predominantly low-mass red dwarfs, forming a sparse but dynamic local cluster.\n\nAs the Sun traverses the galaxy, its passages through denser spiral arms expose the solar system to elevated cosmic ray fluxes from increased supernova activity and star formation, potentially modulating interstellar radiation levels over tens of millions of years. The heliosphere, the Sun's protective bubble of solar wind, interacts with the diffuse gas in the Local Bubble, shaping the influx of interstellar particles.\n\n## Historical Observations\n\n### Ancient and Pre-Modern Understanding\n\nAncient civilizations developed early empirical understandings of the Sun through systematic observations, often integrating astronomical data with philosophical and practical concerns. Babylonian astronomers maintained detailed records of solar eclipses on clay tablets dating back to at least 747 BCE, using these to predict celestial events and interpret omens. In ancient Greece, Anaxagoras (c. 500–428 BCE) proposed that solar eclipses occur when the Moon passes between the Earth and the Sun, correctly identifying the Moon as a reflector of sunlight rather than a luminous body itself. Around 280 BCE, Aristarchus of Samos advanced a heliocentric model, suggesting that the Earth and planets orbit the Sun, with the Earth also rotating on its axis to explain day and night; this idea, however, was largely overshadowed by the prevailing geocentric framework. In contrast, Claudius Ptolemy's Almagest (c. 150 CE) formalized a geocentric system where the Sun and planets revolve around a stationary Earth, incorporating epicycles to account for observed motions and dominating Western astronomy for over a millennium.\n\nThe heliocentric concept experienced a revival in the early modern period with Nicolaus Copernicus, who in his 1543 work *De revolutionibus orbium coelestium* argued for a Sun-centered universe, positing that the Earth's annual orbit around the Sun explains the apparent retrograde motion of planets and seasonal variations. This model simplified celestial mechanics compared to Ptolemy's but faced resistance due to inconsistencies with prevailing Aristotelian physics and religious doctrines. By the early 17th century, telescopic observations began revealing the Sun's dynamic nature. In 1610, Galileo Galilei reported the first detailed telescopic views of sunspots—dark, transient features on the solar surface—using a projected image to avoid eye damage, thereby challenging the Aristotelian notion of the heavens as perfect and unchanging.\n\nDebates over sunspots ensued among European astronomers. David Fabricius and his son Johannes published the first account in 1611, asserting the spots were solar phenomena rather than stars transiting the Sun's disk. Christoph Scheiner, observing independently from 1611, initially proposed they were small satellites orbiting the Sun but later conceded their solar origin after extensive drawings and analysis, engaging in a published dispute with Galileo over their nature and implications for celestial imperfection. In 1672, Isaac Newton advanced optical understanding of sunlight in his letter to the Royal Society, demonstrating through prism experiments that white sunlight comprises a spectrum of colors, laying foundational insights into the Sun's composition as a source of composite light.\n\nNon-Western cultures also contributed sophisticated solar observations. The ancient Maya developed interlocking calendars, including the 365-day *haab'* aligned with the solar year, enabling precise tracking of solstices, equinoxes, and agricultural cycles through architectural alignments like those at Chichén Itzá. In China, astronomers recorded solar phenomena as early as 800 BCE, including sunspots described as \"black spots\" in historical annals and aurora-like events possibly linked to solar flares, such as red vapors noted in 139 BCE, providing the earliest systematic naked-eye data on solar variability.\n\n### Modern Scientific Developments\n\nIn the early 19th century, Joseph von Fraunhofer systematically studied dark lines in the solar spectrum, independently rediscovering them in 1814 and mapping over 500 such features with precise wavelength measurements using his innovative spectroscope. These absorption lines, later named Fraunhofer lines, provided the first detailed spectral map of sunlight, laying the groundwork for quantitative solar spectroscopy. By 1859, Gustav Kirchhoff and Robert Bunsen identified these lines as resulting from atomic absorption in the Sun's cooler outer layers, where elements like hydrogen and sodium selectively absorb specific wavelengths from the hotter interior's continuous emission spectrum. Their experiments demonstrated that the dark solar lines matched bright emission lines produced by the same elements in laboratory flames, establishing spectroscopy as a tool for remote chemical analysis of celestial bodies.\n\nSystematic observations of sunspots revealed periodic variations, with Samuel Heinrich Schwabe announcing in 1843, after 17 years of daily records, an approximately 10-year cycle in sunspot numbers, marking the first confirmation of solar cyclic activity. Schwabe's data, spanning 1826 to 1843, showed maxima and minima in spot counts, initially suggesting a period closer to 10 years but later refined to about 11 years through extended monitoring. In 1913, George Ellery Hale extended this understanding by discovering magnetic fields in sunspots and establishing Hale's polarity law, which states that sunspots in each hemisphere exhibit opposite magnetic polarities during a cycle, reversing between cycles. Using the Zeeman effect observed at Mount Wilson Observatory, Hale measured fields up to several thousand gauss, linking sunspot formation to solar magnetism and explaining the 22-year full magnetic cycle.\n\nTheoretical models of the solar interior advanced in the 1910s with Karl Schwarzschild's application of general relativity, developing the first exact interior solution for a spherically symmetric, incompressible fluid star in 1916, which approximated the Sun's structure under gravitational equilibrium. This work, building on Einstein's 1915 field equations, provided a relativistic framework for stellar interiors, predicting density and pressure profiles without singularities at the center. The origins of helioseismology emerged in the 1960s when Robert Leighton, Robert Noyes, and George Simon detected global oscillations on the solar surface in 1962, measuring Doppler shifts in spectral lines that revealed 5-minute velocity variations across granules. These p-mode oscillations, interpreted as standing acoustic waves propagating through the interior, enabled ground-based inferences of density, temperature, and rotation profiles, validating and refining earlier models like Schwarzschild's.\n\nSolar neutrino detection began in 1968 at the Homestake Mine, where Raymond Davis Jr. used a chlorine-based radiochemical detector to capture electron neutrinos from proton-proton fusion in the solar core, measuring a flux of about 0.3 to 0.5 solar neutrino units—roughly one-third the value predicted by standard solar models. This \"solar neutrino problem\" persisted for decades, challenging theories of nuclear fusion rates and solar composition. Resolution came in 2001 with the Sudbury Neutrino Observatory (SNO), where Q. R. Ahmad and collaborators detected all neutrino flavors via neutral-current reactions on deuterium, confirming the total ^8B neutrino flux matched predictions at (5.44 ± 0.99) × 10^6 cm^{-2} s^{-1} while showing electron neutrinos comprised only about one-third, indicating neutrino flavor oscillations en route to Earth. This ground-based experiment reconciled solar models with observations, affirming the Sun's core as a pp-chain dominated fusion reactor.\n\n### Space-Based Missions\n\nSpace-based missions have revolutionized our understanding of the Sun by providing continuous, high-resolution observations free from Earth's atmospheric interference. These spacecraft, often joint efforts between agencies like NASA and ESA, employ advanced instruments to probe the solar interior, atmosphere, and heliosphere, revealing phenomena such as coronal mass ejections (CMEs) and the origins of the solar wind. Key missions since the 1990s have built upon ground-based observations to deliver unprecedented data on solar dynamics and their impacts on space weather.\n\nThe Solar and Heliospheric Observatory (SOHO), launched in 1995 as a collaboration between NASA and ESA, remains a cornerstone for solar monitoring. Positioned at the Sun-Earth L1 Lagrange point, SOHO's Large Angle and Spectrometric Coronagraph (LASCO) has imaged over 30,000 CMEs since its inception, enabling detailed studies of their structure, speed, and evolution as they propagate through the corona. Additionally, instruments like the Global Oscillation at Low Frequency (GOLF) and the Michelson Doppler Imager (MDI) have advanced helioseismology by analyzing solar oscillations to map the Sun's internal structure, including its convection zone and rotation patterns. SOHO's longevity, extended multiple times, continues to provide real-time alerts for space weather events affecting Earth.\n\nLaunched in 2010, NASA's Solar Dynamics Observatory (SDO) offers unparalleled high-resolution imaging of the Sun's atmosphere across multiple wavelengths. Its Atmospheric Imaging Assembly (AIA) captures solar activity at resolutions up to 0.5 arcseconds every 12 seconds, revealing fine-scale structures in flares, prominences, and coronal loops. The Helioseismic and Magnetic Imager (HMI) on SDO maps the Sun's magnetic field with vector magnetograms, tracking the evolution of sunspots and active regions to model magnetic reconnection processes. By 2025, SDO's decade-plus dataset has been instrumental in correlating magnetic field changes with solar eruptions, enhancing predictions of geomagnetic storms.\n\nNASA's Parker Solar Probe, launched in 2018, has achieved the closest approaches to the Sun of any spacecraft, reaching perihelia of about 3.8 million miles (equivalent to roughly 8.5 solar radii) during its 24th orbit in June 2025. Equipped with instruments like the Wide-field Imager for Solar Probe (WISPR), it directly samples the solar corona and wind, providing in-situ measurements that trace the acceleration and heating mechanisms of the solar wind streams. Parker has also confirmed the existence of a dust-free zone within approximately 0.2 AU of the Sun, where solar heating vaporizes interplanetary dust, reshaping models of the inner heliosphere.\n\nThe Solar Orbiter, a joint ESA-NASA mission launched in 2020, uniquely observes the Sun from high inclinations, achieving polar views for the first time in June 2025. Its suite of remote-sensing and in-situ instruments, including the Polarimetric and Helioseismic Imager (PHI), measures plasma and magnetic fields close to the Sun, linking surface activity to heliospheric structures. These observations have yielded insights into the solar dynamo, revealing how polar magnetic fields reverse and drive the 11-year cycle through differential rotation.\n\nIndia's Aditya-L1, launched by ISRO in September 2023, represents the nation's first dedicated solar mission and is positioned at the Sun-Earth L1 point for uninterrupted observations. The Visible Emission Line Coronagraph (VELC) instrument focuses on the chromosphere and corona, imaging dynamic events like spicules and prominences in visible and UV light to study mass and energy transport in the solar atmosphere. By November 2025, Aditya-L1's data has complemented international efforts by providing multi-wavelength views of chromospheric heating mechanisms.\n\n## Direct Observation and Effects\n\n### Safe Viewing Methods\n\nDirect observation of the Sun poses significant risks to the eyes, primarily from ultraviolet (UV) and intense blue light, which can cause irreversible retinal damage or solar retinopathy without immediate pain, leading to potential vision loss. The only exception is during the brief totality phase of a total solar eclipse, when the Sun's disk is fully obscured by the Moon; at all other times, including partial eclipses or annular eclipses, unaided viewing—even for a few seconds—must be avoided to prevent severe injury.\n\nSafe methods for direct viewing rely on certified solar filters that comply with the ISO 12312-2 international standard, such as eclipse glasses or handheld solar viewers, which block at least 99.999% of visible light and nearly all UV and infrared radiation. These filters must be inspected for damage before use and sourced from reputable manufacturers; ordinary sunglasses, household glass, or unverified films like exposed camera film are inadequate and dangerous. For indirect observation, pinhole projectors offer a simple, filter-free alternative: sunlight passes through a small hole (e.g., in an index card or colander) onto a shaded surface, projecting an image of the Sun's disk, which can be enlarged using a box setup with aluminum foil and white paper. Telescopes or binoculars require full-aperture solar filters, such as Mylar or neutral density (ND) types, securely mounted at the front end to prevent concentrated sunlight from damaging equipment or eyes; eyepiece filters are unsafe as they can shatter from heat.\n\nDuring solar eclipses, safe practices emphasize timing and protection: use eclipse glasses or viewers throughout partial phases, removing them only during confirmed totality to avoid glimpsing the Sun's photosphere. Phenomena like Baily's beads—brief flashes of sunlight through lunar valleys—and the diamond ring effect—a bright point of light amid the solar corona—are visible just before and after totality but must be observed through ISO-compliant filters to prevent eye damage, as even these fleeting appearances carry intense light. Smartphone apps from NASA or astronomical societies provide precise local timings for eclipse phases to guide safe transitions. For professional and advanced amateur observations, hydrogen-alpha (H-alpha) filters tuned to the 656.3 nm wavelength allow viewing of the chromosphere, including solar prominences and filaments, but require dedicated solar telescopes with energy-rejection pre-filters to block excess UV and infrared; double-stacked H-alpha etalons enhance contrast while maintaining safety, though setups must come from certified suppliers to avoid thermal risks. Amateur H-alpha systems, such as personal solar telescopes, enable detailed visual or imaging of prominences but demand strict adherence to infrared and UV blocking standards.\n\n### Visual Phenomena and Impacts\n\nThe Sun produces a variety of striking visual phenomena observable from Earth, primarily through the interaction of its light with atmospheric particles. Solar halos, appearing as luminous rings encircling the Sun, form when sunlight refracts through hexagonal ice crystals suspended in high-altitude cirrus clouds, bending the light by approximately 22 degrees to create the common 22-degree halo. Parhelia, commonly known as sun dogs, manifest as bright spots on either side of the Sun, resulting from the same refraction process in plate-shaped ice crystals aligned horizontally, often accompanied by colorful arcs or tails. Rainbows arise from the dispersion and internal reflection of sunlight within spherical water droplets in the atmosphere, separating white light into its spectral colors and forming an arc opposite the Sun's position. Crepuscular rays, or \"God rays,\" occur when sunlight streams through gaps in clouds or between atmospheric layers, with the rays appearing to converge due to perspective, enhanced by scattering of light by air molecules and particles.\n\nThese solar emissions also exert profound impacts on Earth's magnetosphere and atmosphere. Auroras, the vibrant polar lights, are triggered when charged particles from coronal mass ejections (CMEs)—often following solar flares—interact with Earth's magnetic field and collide with atmospheric gases, exciting them to emit light in greens, reds, and purples primarily near the poles. The Van Allen radiation belts, two doughnut-shaped zones of energetic particles trapped by Earth's magnetic field, are dynamically influenced by solar activity; the outer belt, composed largely of solar-origin electrons and protons, expands and intensifies during periods of high solar wind from CMEs, posing risks to satellites and astronauts. Solar irradiance, the total energy output from the Sun reaching Earth, modulates global climate by driving atmospheric and oceanic circulations; variations in total solar irradiance, though small (about 0.1% over an 11-year cycle), contribute to long-term temperature fluctuations and patterns like the El Niño-Southern Oscillation.\n\nSpace weather events stemming from solar activity can disrupt technological systems on Earth. Geomagnetic storms, induced by CMEs interacting with Earth's magnetosphere, are quantified by the Kp index, a global measure of magnetic field disturbances ranging from 0 (calm) to 9 (extreme), with storms at Kp ≥ 5 causing widespread effects. These storms can induce geomagnetically induced currents in power grids, leading to blackouts, as seen in the March 1989 Quebec event where a severe storm caused a nine-hour power failure affecting six million people due to transformer overloads. Satellites experience disruptions from enhanced radiation and drag in the swollen upper atmosphere during such storms, potentially shortening mission lifespans or causing communication failures.\n\nBiologically, sunlight is essential for human health but carries risks from its ultraviolet (UV) components. UVB radiation from the Sun penetrates the skin to convert 7-dehydrocholesterol into previtamin D3, which isomerizes to vitamin D3, supporting calcium absorption and bone health; adequate exposure (about 10-30 minutes midday several times a week) suffices for most people without supplementation. However, excessive UV exposure increases skin cancer risk, with non-melanoma types like basal and squamous cell carcinomas linked to cumulative UVB doses, while melanoma correlates with intense, intermittent exposures. The UV index, a scale from 0 to 11+ forecasting erythemally weighted UV irradiance, guides protective measures; indices above 3 indicate moderate risk, prompting shade-seeking and sunscreen use to mitigate DNA damage in skin cells.",
  "external_references": [
    {
      "text": "Sun Lithograph.pdf",
      "url": "https://www.nasa.gov/wp-content/uploads/2009/12/sun_lithograph.pdf",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sun1.html",
      "url": "https://imagine.gsfc.nasa.gov/science/objects/sun1.html",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "En",
      "url": "https://spaceplace.nasa.gov/all-about-the-sun/en/",
      "domain": "spaceplace.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sun",
      "url": "https://science.nasa.gov/sun/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sun",
      "url": "https://www.etymonline.com/word/sun",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Science Diction Sun",
      "url": "https://www.sciencefriday.com/articles/science-diction-sun/",
      "domain": "sciencefriday.com",
      "type": "citation"
    },
    {
      "text": "Sol",
      "url": "https://www.etymonline.com/word/sol",
      "domain": "etymonline.com",
      "type": "citation"
    },
    {
      "text": "Sun And Moon In Celtic And Indo European",
      "url": "https://www.academia.edu/112253717/_Sun_and_Moon_in_Celtic_and_Indo_European",
      "domain": "academia.edu",
      "type": "citation"
    },
    {
      "text": "What Is The Suns Name",
      "url": "https://earthsky.org/space/what-is-the-suns-name/",
      "domain": "earthsky.org",
      "type": "citation"
    },
    {
      "text": "Ra Egyptian God",
      "url": "https://www.britannica.com/topic/Ra-Egyptian-god",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Gregory Nagy Homer And Greek Myth",
      "url": "https://chs.harvard.edu/curated-article/gregory-nagy-homer-and-greek-myth/",
      "domain": "chs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Cultures Aztec 4.html",
      "url": "https://ecuip.lib.uchicago.edu/diglib/science/cultural_astronomy/cultures_aztec-4.html",
      "domain": "ecuip.lib.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "65011",
      "url": "https://www.metmuseum.org/art/collection/search/65011",
      "domain": "metmuseum.org",
      "type": "citation"
    },
    {
      "text": "Amaterasu",
      "url": "https://www.britannica.com/topic/Amaterasu",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "S%c3%b3l (germanic Mythology",
      "url": "https://en.wikipedia.org/wiki/S%C3%B3l_(Germanic_mythology",
      "domain": "en.wikipedia.org",
      "type": "citation"
    },
    {
      "text": "Folklore",
      "url": "https://solar-center.stanford.edu/folklore/",
      "domain": "solar-center.stanford.edu",
      "type": "citation"
    },
    {
      "text": "Inti Raymi",
      "url": "https://www.britannica.com/topic/Inti-Raymi",
      "domain": "britannica.com",
      "type": "citation"
    },
    {
      "text": "Sun Righteousness",
      "url": "https://worship.calvin.edu/resources/articles/sun-righteousness",
      "domain": "worship.calvin.edu",
      "type": "citation"
    },
    {
      "text": "16",
      "url": "https://quran.com/71/16",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "37",
      "url": "https://quran.com/41/37",
      "domain": "quran.com",
      "type": "citation"
    },
    {
      "text": "Iscrst.htm",
      "url": "https://www2.nau.edu/~gaud/bio301/content/iscrst.htm",
      "domain": "www2.nau.edu",
      "type": "citation"
    },
    {
      "text": "Cultures Egypt 4.html",
      "url": "https://ecuip.lib.uchicago.edu/diglib/science/cultural_astronomy/cultures_egypt-4.html",
      "domain": "ecuip.lib.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Ominous New Interpretation Of Aztec Sun Stone",
      "url": "https://www.floridamuseum.ufl.edu/science/ominous-new-interpretation-of-aztec-sun-stone/",
      "domain": "floridamuseum.ufl.edu",
      "type": "citation"
    },
    {
      "text": "Darkness Light Lord Elements Israelite Theophanies",
      "url": "https://rsc.byu.edu/ascending-mountain-lord/darkness-light-lord-elements-israelite-theophanies",
      "domain": "rsc.byu.edu",
      "type": "citation"
    },
    {
      "text": "Sunfact.html",
      "url": "https://nssdc.gsfc.nasa.gov/planetary/factsheet/sunfact.html",
      "domain": "nssdc.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Facts",
      "url": "https://science.nasa.gov/sun/facts/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sun By The Numbers",
      "url": "https://solarsystem.nasa.gov/sun-by-the-numbers/",
      "domain": "solarsystem.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Solar Rotation Varies By Latitude",
      "url": "https://www.nasa.gov/image-article/solar-rotation-varies-by-latitude/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "19720018160.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/19720018160/downloads/19720018160.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "20010111093.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/20010111093/downloads/20010111093.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Schrijvercarolusj Sh.pdf",
      "url": "https://hires.gsfc.nasa.gov/si/documents/SchrijverCarolusJ-SH.pdf",
      "domain": "hires.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "4page1.pdf",
      "url": "https://spacemath.gsfc.nasa.gov/sun/4Page1.pdf",
      "domain": "spacemath.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Aa40445 21.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2021/09/aa40445-21/aa40445-21.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "Aa50115 24.html",
      "url": "https://www.aanda.org/articles/aa/abs/2024/08/aa50115-24/aa50115-24.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "226328947 The Abundance Of 3he In The Solar Wind A Constraint For Models Of Solar Evolution",
      "url": "https://www.researchgate.net/publication/226328947_The_abundance_of_3He_in_the_solar_wind_-_A_constraint_for_models_of_solar_evolution",
      "domain": "researchgate.net",
      "type": "citation"
    },
    {
      "text": "S41467 018 03093 3",
      "url": "https://www.nature.com/articles/s41467-018-03093-3",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Interior.shtml",
      "url": "https://solarscience.msfc.nasa.gov/interior.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Solar Energy",
      "url": "https://education.nationalgeographic.org/resource/solar-energy/",
      "domain": "education.nationalgeographic.org",
      "type": "citation"
    },
    {
      "text": "Fusion.pdf",
      "url": "https://www.astro.princeton.edu/~gk/A403/fusion.pdf",
      "domain": "astro.princeton.edu",
      "type": "citation"
    },
    {
      "text": "Solving The Mystery Of The Missing Neutrinos",
      "url": "https://www.nobelprize.org/prizes/themes/solving-the-mystery-of-the-missing-neutrinos/",
      "domain": "nobelprize.org",
      "type": "citation"
    },
    {
      "text": "Superk Sun.html",
      "url": "https://heasarc.gsfc.nasa.gov/docs/objects/heapow/archive/solar_system/superk_sun.html",
      "domain": "heasarc.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Anatomy Of Sun",
      "url": "https://www.nasa.gov/image-article/anatomy-of-sun/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Solmodel.pdf",
      "url": "https://cos.colorado.edu/~kevinf/PAPERS/solmodel.pdf",
      "domain": "cos.colorado.edu",
      "type": "citation"
    },
    {
      "text": "Layers Of The Sun",
      "url": "https://science.nasa.gov/blogs/the-sun-spot/2023/09/26/layers-of-the-sun/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Surface.shtml",
      "url": "https://solarscience.msfc.nasa.gov/surface.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sunfacts.htm",
      "url": "https://radiojove.gsfc.nasa.gov/education/sun/basics/material/sunfacts.htm",
      "domain": "radiojove.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Chapter 3.pdf",
      "url": "https://www.swpc.noaa.gov/sites/default/files/images/u33/Chapter_3.pdf",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "4715",
      "url": "https://svs.gsfc.nasa.gov/4715/",
      "domain": "svs.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Ap230222.html",
      "url": "https://apod.nasa.gov/apod/ap230222.html",
      "domain": "apod.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Feature1.shtml",
      "url": "https://solarscience.msfc.nasa.gov/feature1.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Question17.html",
      "url": "https://starchild.gsfc.nasa.gov/docs/StarChild/questions/question17.html",
      "domain": "starchild.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sunspots",
      "url": "https://science.nasa.gov/sun/sunspots/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Anatomy Of The Sun",
      "url": "https://www.esa.int/ESA_Multimedia/Images/2020/01/Anatomy_of_the_Sun",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "Chromos.shtml",
      "url": "https://solarscience.msfc.nasa.gov/chromos.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "20120015710.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/20120015710/downloads/20120015710.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "What Solar Prominence",
      "url": "https://www.nasa.gov/image-article/what-solar-prominence/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "En",
      "url": "https://spaceplace.nasa.gov/sun-corona/en/",
      "domain": "spaceplace.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Pdf",
      "url": "https://iopscience.iop.org/article/10.1086/430465/pdf",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Feature3.shtml",
      "url": "https://solarscience.msfc.nasa.gov/feature3.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Nasas Parker Solar Probe And The Curious Case Of The Hot Corona",
      "url": "https://www.nasa.gov/science-research/heliophysics/nasas-parker-solar-probe-and-the-curious-case-of-the-hot-corona/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Parker Solar Probe",
      "url": "https://science.nasa.gov/mission/parker-solar-probe/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "2000ja000120",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2000JA000120",
      "domain": "agupubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "S2090123212000896",
      "url": "https://www.sciencedirect.com/science/article/pii/S2090123212000896",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Acbd4e",
      "url": "https://iopscience.iop.org/article/10.3847/2041-8213/acbd4e",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Interstellar Mapping And Acceleration Probe Imap",
      "url": "https://science.nasa.gov/mission/interstellar-mapping-and-acceleration-probe-imap/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Ada36a",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/ada36a",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Featured Image A Ribbon Around The Heliosphere",
      "url": "https://aasnova.org/2025/03/14/featured-image-a-ribbon-around-the-heliosphere/",
      "domain": "aasnova.org",
      "type": "citation"
    },
    {
      "text": "Ibex Spacecraft Images The Heliotail The Last Region Of The Solar System Boundary Be Seen Revealing Unexpected Structure",
      "url": "https://www.swri.org/newsroom/press-releases/ibex-spacecraft-images-the-heliotail-the-last-region-of-the-solar-system-boundary-be-seen-revealing-unexpected-structure",
      "domain": "swri.org",
      "type": "citation"
    },
    {
      "text": "What Is The Solar Wind",
      "url": "https://science.nasa.gov/sun/what-is-the-solar-wind/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "2021je007049",
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2021JE007049",
      "domain": "agupubs.onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Solarwind.shtml",
      "url": "https://solarscience.msfc.nasa.gov/SolarWind.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Solar Wind",
      "url": "https://www.swpc.noaa.gov/phenomena/solar-wind",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Solarmag.html",
      "url": "https://cosmicopia.gsfc.nasa.gov/solarmag.html",
      "domain": "cosmicopia.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "20050244854.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/20050244854/downloads/20050244854.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Science",
      "url": "https://earth.gsfc.nasa.gov/climate/projects/solar-irradiance/science",
      "domain": "earth.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12254092",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12254092/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Radiation",
      "url": "https://physics.info/radiation/",
      "domain": "physics.info",
      "type": "citation"
    },
    {
      "text": "Climate Change Incoming Sunlight",
      "url": "https://www.climate.gov/news-features/understanding-climate/climate-change-incoming-sunlight",
      "domain": "climate.gov",
      "type": "citation"
    },
    {
      "text": "1510.06262",
      "url": "https://arxiv.org/abs/1510.06262",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "Sun4spec.htm",
      "url": "https://pwg.gsfc.nasa.gov/stargaze/Sun4spec.htm",
      "domain": "pwg.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "19960012480.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/19960012480/downloads/19960012480.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "20140016714.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/20140016714/downloads/20140016714.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "19960001025.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/19960001025/downloads/19960001025.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "2014uptonhathaway.pdf",
      "url": "https://solarscience.msfc.nasa.gov/papers/hathadh/2014UptonHathaway.pdf",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "20140003231.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/20140003231/downloads/20140003231.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sunspotcycle.shtml",
      "url": "https://solarscience.msfc.nasa.gov/SunspotCycle.shtml",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Hathawaywilson2004.pdf",
      "url": "https://solarscience.msfc.nasa.gov/papers/hathadh/HathawayWilson2004.pdf",
      "domain": "solarscience.msfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Noaa Forecasts Quicker Stronger Peak Solar Activity",
      "url": "https://www.swpc.noaa.gov/news/noaa-forecasts-quicker-stronger-peak-solar-activity",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Nasa Noaa Sun Reaches Maximum Phase In 11 Year Solar Cycle",
      "url": "https://science.nasa.gov/science-research/heliophysics/nasa-noaa-sun-reaches-maximum-phase-in-11-year-solar-cycle/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "1248319113763006",
      "url": "https://www.facebook.com/Futurescience101/posts/the-sun-might-be-hitting-a-surprise-second-peak-%25EF%25B8%258F-recent-solar-storms-in-novembe/1248319113763006/",
      "domain": "facebook.com",
      "type": "citation"
    },
    {
      "text": "0704.2345",
      "url": "https://arxiv.org/pdf/0704.2345",
      "domain": "arxiv.org",
      "type": "citation"
    },
    {
      "text": "19930066495",
      "url": "https://ntrs.nasa.gov/citations/19930066495",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Solar Storms And Flares",
      "url": "https://science.nasa.gov/sun/solar-storms-and-flares/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Frame1.htm",
      "url": "https://hesperia.gsfc.nasa.gov/sftheory/frame1.htm",
      "domain": "hesperia.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Coronal Mass Ejections",
      "url": "https://www.swpc.noaa.gov/phenomena/coronal-mass-ejections",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Gopal2009sungeosphere4.pdf",
      "url": "https://cdaw.gsfc.nasa.gov/publications/gopal/gopal2009SunGeosphere4.pdf",
      "domain": "cdaw.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "https://www.jpl.[nasa](/page/NASA",
      "url": "https://www.jpl.[nasa](/page/NASA",
      "domain": "unknown",
      "type": "citation"
    },
    {
      "text": "https://ntrs.[nasa](/page/NASA",
      "url": "https://ntrs.[nasa](/page/NASA",
      "domain": "unknown",
      "type": "citation"
    },
    {
      "text": "One Cme Passed More Way",
      "url": "https://www.swpc.noaa.gov/news/one-cme-passed-more-way",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Psp Close Approach Images",
      "url": "https://www.nasaspaceflight.com/2025/07/psp-close-approach-images/",
      "domain": "nasaspaceflight.com",
      "type": "citation"
    },
    {
      "text": "20110007799.pdf",
      "url": "https://ntrs.nasa.gov/api/citations/20110007799/downloads/20110007799.pdf",
      "domain": "ntrs.nasa.gov",
      "type": "citation"
    },
    {
      "text": "The Sun Was Born When A Dense Gas Cloud Collapsed 4 6 Billion Years Ago 226862",
      "url": "https://theconversation.com/the-sun-was-born-when-a-dense-gas-cloud-collapsed-4-6-billion-years-ago-226862",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "T Tauri Stars",
      "url": "https://www.cfa.harvard.edu/news/t-tauri-stars",
      "domain": "cfa.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Henyey Hayashi Tracks",
      "url": "https://astrobites.org/2024/05/05/henyey_hayashi_tracks/",
      "domain": "astrobites.org",
      "type": "citation"
    },
    {
      "text": "Aa28260 16.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2017/03/aa28260-16/aa28260-16.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "324277",
      "url": "https://iopscience.iop.org/article/10.1086/324277",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Stars1.html",
      "url": "https://imagine.gsfc.nasa.gov/science/objects/stars1.html",
      "domain": "imagine.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sun",
      "url": "https://education.nationalgeographic.org/resource/sun/",
      "domain": "education.nationalgeographic.org",
      "type": "citation"
    },
    {
      "text": "Types",
      "url": "https://science.nasa.gov/universe/stars/types/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "22.04%253a Further Evolution Of Stars",
      "url": "https://phys.libretexts.org/Bookshelves/Astronomy__Cosmology/Astronomy_1e_%28OpenStax%29/22%253A_Stars_from_Adolescence_to_Old_Age/22.04%253A_Further_Evolution_of_Stars",
      "domain": "phys.libretexts.org",
      "type": "citation"
    },
    {
      "text": "Mass Loss In Dying Stars",
      "url": "https://aasnova.org/2016/07/26/mass-loss-in-dying-stars/",
      "domain": "aasnova.org",
      "type": "citation"
    },
    {
      "text": "Barycenter",
      "url": "https://spaceplace.nasa.gov/barycenter/",
      "domain": "spaceplace.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Can Two Planets Orbit Each Other",
      "url": "https://airandspace.si.edu/stories/editorial/can-two-planets-orbit-each-other",
      "domain": "airandspace.si.edu",
      "type": "citation"
    },
    {
      "text": "Orbits And Keplers Laws",
      "url": "https://science.nasa.gov/solar-system/orbits-and-keplers-laws/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "About Half Of Sun Like Stars Could Host Rocky Potentially Habitable Planets",
      "url": "https://science.nasa.gov/universe/exoplanets/about-half-of-sun-like-stars-could-host-rocky-potentially-habitable-planets/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Orbital Period Of The Sun In The Milky Way Galaxy",
      "url": "https://public.nrao.edu/ask/orbital-period-of-the-sun-in-the-milky-way-galaxy/",
      "domain": "public.nrao.edu",
      "type": "citation"
    },
    {
      "text": "1000 Light Year Wide Bubble Surrounding Earth Source All Nearby Young Stars",
      "url": "https://www.cfa.harvard.edu/news/1000-light-year-wide-bubble-surrounding-earth-source-all-nearby-young-stars",
      "domain": "cfa.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Ad596e",
      "url": "https://iopscience.iop.org/article/10.3847/1538-4357/ad596e",
      "domain": "iopscience.iop.org",
      "type": "citation"
    },
    {
      "text": "Spots Waves And Wind A Solar Science Timeline Full Text",
      "url": "https://www.nasa.gov/history/spots-waves-and-wind-a-solar-science-timeline-full-text/",
      "domain": "nasa.gov",
      "type": "citation"
    },
    {
      "text": "Ancient Greek Astronomy And Cosmology",
      "url": "https://www.loc.gov/collections/finding-our-place-in-the-cosmos-with-carl-sagan/articles-and-essays/modeling-the-cosmos/ancient-greek-astronomy-and-cosmology",
      "domain": "loc.gov",
      "type": "citation"
    },
    {
      "text": "Beforecopernicus.html",
      "url": "https://physics.weber.edu/schroeder/ua/BeforeCopernicus.html",
      "domain": "physics.weber.edu",
      "type": "citation"
    },
    {
      "text": "Copernican9.html",
      "url": "https://www.pas.rochester.edu/~blackman/ast104/copernican9.html",
      "domain": "pas.rochester.edu",
      "type": "citation"
    },
    {
      "text": "Orbitshistory",
      "url": "https://earthobservatory.nasa.gov/features/OrbitsHistory",
      "domain": "earthobservatory.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sunspots.html",
      "url": "http://galileo.library.rice.edu/sci/observations/sunspots.html",
      "domain": "galileo.library.rice.edu",
      "type": "citation"
    },
    {
      "text": "Physicshistory.cfm",
      "url": "https://www.aps.org/publications/apsnews/201503/physicshistory.cfm",
      "domain": "aps.org",
      "type": "citation"
    },
    {
      "text": "Early Observations Sunspots Scheiner Galileo",
      "url": "https://www.vaticanobservatory.org/education/early-observations-sunspots-scheiner-galileo/",
      "domain": "vaticanobservatory.org",
      "type": "citation"
    },
    {
      "text": "Pmc4360081",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4360081/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Calendar System",
      "url": "https://maya.nmai.si.edu/calendar/calendar-system",
      "domain": "maya.nmai.si.edu",
      "type": "citation"
    },
    {
      "text": "020913.html",
      "url": "https://solar.physics.montana.edu/ypop/Nuggets/2002/020913/020913.html",
      "domain": "solar.physics.montana.edu",
      "type": "citation"
    },
    {
      "text": "Pmc5127895",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5127895/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Joseph Von Fraunhofer.html",
      "url": "https://www.fraunhofer.de/en/about-fraunhofer/profile-structure/chronicles/joseph-von-fraunhofer.html",
      "domain": "fraunhofer.de",
      "type": "citation"
    },
    {
      "text": "Tools Spectroscopy.htm",
      "url": "https://history.aip.org/exhibits/cosmology/tools/tools-spectroscopy.htm",
      "domain": "history.aip.org",
      "type": "citation"
    },
    {
      "text": "Robert Bunsen And Gustav Kirchhoff",
      "url": "https://www.sciencehistory.org/education/scientific-biographies/robert-bunsen-and-gustav-kirchhoff/",
      "domain": "sciencehistory.org",
      "type": "citation"
    },
    {
      "text": "Whschwab.htm",
      "url": "https://pwg.gsfc.nasa.gov/earthmag/whschwab.htm",
      "domain": "pwg.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Abstract",
      "url": "https://ui.adsabs.harvard.edu/abs/1962ApJ...135..474L/abstract",
      "domain": "ui.adsabs.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Physrevlett.20.1205",
      "url": "https://link.aps.org/doi/10.1103/PhysRevLett.20.1205",
      "domain": "link.aps.org",
      "type": "citation"
    },
    {
      "text": "Physrevlett.87.071301",
      "url": "https://link.aps.org/doi/10.1103/PhysRevLett.87.071301",
      "domain": "link.aps.org",
      "type": "citation"
    },
    {
      "text": "Soho",
      "url": "https://science.nasa.gov/mission/soho/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Soho",
      "url": "https://www.eoportal.org/satellite-missions/soho",
      "domain": "eoportal.org",
      "type": "citation"
    },
    {
      "text": "Soho Overview2",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/SOHO_overview2",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "sdo.gsfc.nasa.gov",
      "url": "https://sdo.gsfc.nasa.gov/",
      "domain": "sdo.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Sdo",
      "url": "https://www.eoportal.org/satellite-missions/sdo",
      "domain": "eoportal.org",
      "type": "citation"
    },
    {
      "text": "4124",
      "url": "https://svs.gsfc.nasa.gov/4124/",
      "domain": "svs.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Nasas Parker Solar Probe Makes History With Closest Pass To Sun",
      "url": "https://science.nasa.gov/science-research/heliophysics/nasas-parker-solar-probe-makes-history-with-closest-pass-to-sun/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Nasas Parker Solar Probe Snaps Closest Ever Images To Sun",
      "url": "https://science.nasa.gov/science-research/heliophysics/nasas-parker-solar-probe-snaps-closest-ever-images-to-sun/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Solar Orbiter Gets World First Views Of The Sun S Poles",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/Solar_Orbiter/Solar_Orbiter_gets_world-first_views_of_the_Sun_s_poles",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "Solar Orbiter Overview",
      "url": "https://www.esa.int/Science_Exploration/Space_Science/Solar_Orbiter_overview",
      "domain": "esa.int",
      "type": "citation"
    },
    {
      "text": "Aa38467 20.html",
      "url": "https://www.aanda.org/articles/aa/full_html/2020/10/aa38467-20/aa38467-20.html",
      "domain": "aanda.org",
      "type": "citation"
    },
    {
      "text": "Aditya L1.html",
      "url": "https://www.isro.gov.in/Aditya_L1.html",
      "domain": "isro.gov.in",
      "type": "citation"
    },
    {
      "text": "Aditya L1 Suit.html",
      "url": "https://www.isro.gov.in/Aditya_L1_SUIT.html",
      "domain": "isro.gov.in",
      "type": "citation"
    },
    {
      "text": "Safety",
      "url": "https://science.nasa.gov/eclipses/safety/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Eye Safety",
      "url": "https://eclipse.aas.org/eye-safety",
      "domain": "eclipse.aas.org",
      "type": "citation"
    },
    {
      "text": "Optics Filters",
      "url": "https://eclipse.aas.org/eye-safety/optics-filters",
      "domain": "eclipse.aas.org",
      "type": "citation"
    },
    {
      "text": "What To Expect",
      "url": "https://science.nasa.gov/eclipses/future-eclipses/eclipse-2024/what-to-expect/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Hydrogen Alpha Solar Observing Program",
      "url": "https://www.astroleague.org/hydrogen-alpha-solar-observing-program/",
      "domain": "astroleague.org",
      "type": "citation"
    },
    {
      "text": "Ap110110.html",
      "url": "https://apod.nasa.gov/apod/ap110110.html",
      "domain": "apod.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Ap181221.html",
      "url": "https://apod.nasa.gov/apod/ap181221.html",
      "domain": "apod.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Apod Search",
      "url": "https://apod.nasa.gov/cgi-bin/apod/apod_search?tquery=rainbow",
      "domain": "apod.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Ap190624.html",
      "url": "https://apod.nasa.gov/apod/ap190624.html",
      "domain": "apod.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Auroras",
      "url": "https://science.nasa.gov/sun/auroras/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Aurora Tutorial",
      "url": "https://www.swpc.noaa.gov/content/aurora-tutorial",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Van Allen Belts",
      "url": "https://science.nasa.gov/biological-physical/stories/van-allen-belts/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "3048",
      "url": "https://svs.gsfc.nasa.gov/3048/",
      "domain": "svs.gsfc.nasa.gov",
      "type": "citation"
    },
    {
      "text": "What Is The Suns Role In Climate Change",
      "url": "https://science.nasa.gov/earth/climate-change/what-is-the-suns-role-in-climate-change/",
      "domain": "science.nasa.gov",
      "type": "citation"
    },
    {
      "text": "Geomagnetic Storms",
      "url": "https://www.swpc.noaa.gov/phenomena/geomagnetic-storms",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Planetary K Index",
      "url": "https://www.swpc.noaa.gov/products/planetary-k-index",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Space Weather And Safety",
      "url": "https://www.noaa.gov/space-weather-and-safety",
      "domain": "noaa.gov",
      "type": "citation"
    },
    {
      "text": "Swx Booklet.pdf",
      "url": "https://www.swpc.noaa.gov/sites/default/files/images/u33/swx_booklet.pdf",
      "domain": "swpc.noaa.gov",
      "type": "citation"
    },
    {
      "text": "Nbk278935",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK278935/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/skin-cancer/sun-safety/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Radiation Protecting Against Skin Cancer",
      "url": "https://www.who.int/news-room/questions-and-answers/item/radiation-protecting-against-skin-cancer",
      "domain": "who.int",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "star",
      "page": "Star+"
    },
    {
      "text": "spectral",
      "page": "Spectral"
    },
    {
      "text": "class",
      "page": "Class"
    },
    {
      "text": "hydrogen",
      "page": "Hydrogen"
    },
    {
      "text": "helium",
      "page": "Helium"
    },
    {
      "text": "nuclear fusion",
      "page": "Nuclear_fusion"
    },
    {
      "text": "molecular cloud",
      "page": "Molecular_cloud"
    },
    {
      "text": "life cycle",
      "page": "Life_cycle"
    },
    {
      "text": "red giant",
      "page": "Red_giant"
    },
    {
      "text": "white dwarf",
      "page": "White_dwarf"
    },
    {
      "text": "Earth's magnetic field",
      "page": "Earth's_magnetic_field"
    },
    {
      "text": "solar wind",
      "page": "Solar_wind"
    },
    {
      "text": "corona",
      "page": "Corona"
    },
    {
      "text": "photosynthesis",
      "page": "Photosynthesis"
    },
    {
      "text": "Earth",
      "page": "Earth"
    },
    {
      "text": "space weather",
      "page": "Space_weather"
    },
    {
      "text": "NASA",
      "page": "NASA"
    },
    {
      "text": "Parker Solar Probe",
      "page": "Parker_Solar_Probe"
    },
    {
      "text": "heliosphere",
      "page": "Heliosphere"
    },
    {
      "text": "Old English",
      "page": "Old_English"
    },
    {
      "text": "noun",
      "page": "Noun"
    },
    {
      "text": "celestial",
      "page": "Celestial"
    },
    {
      "text": "the sun",
      "page": "The_Sun"
    },
    {
      "text": "suffix",
      "page": "Suffix"
    },
    {
      "text": "Middle English",
      "page": "Middle_English"
    },
    {
      "text": "Modern English",
      "page": "Modern_English"
    },
    {
      "text": "modern era",
      "page": "Modern_era"
    },
    {
      "text": "International Astronomical Union",
      "page": "International_Astronomical_Union"
    },
    {
      "text": "unique identifier",
      "page": "Unique_identifier"
    },
    {
      "text": "Helios",
      "page": "Helios"
    },
    {
      "text": "deity",
      "page": "Deity"
    },
    {
      "text": "ancient Egyptian mythology",
      "page": "Egyptian_mythology"
    },
    {
      "text": "Ra",
      "page": "Ra"
    },
    {
      "text": "Nun",
      "page": "Nun"
    },
    {
      "text": "solar barque",
      "page": "Solar_barque"
    },
    {
      "text": "Greek mythology",
      "page": "Greek_mythology"
    },
    {
      "text": "chariot",
      "page": "Chariot"
    },
    {
      "text": "Surya",
      "page": "Surya"
    },
    {
      "text": "solar deity",
      "page": "Solar_deity"
    },
    {
      "text": "Adityas",
      "page": "Adityas"
    },
    {
      "text": "Kashyapa",
      "page": "Kashyapa"
    },
    {
      "text": "Amaterasu",
      "page": "Amaterasu"
    },
    {
      "text": "Shinto",
      "page": "Shinto"
    },
    {
      "text": "goddess",
      "page": "Goddess"
    },
    {
      "text": "Norse",
      "page": "Norse"
    },
    {
      "text": "fertility",
      "page": "Fertility"
    },
    {
      "text": "harvest",
      "page": "Harvest"
    },
    {
      "text": "Inca Empire",
      "page": "Inca_Empire"
    },
    {
      "text": "Inti Raymi",
      "page": "Inti_Raymi"
    },
    {
      "text": "winter solstice",
      "page": "Winter_solstice"
    },
    {
      "text": "Inti",
      "page": "Inti"
    },
    {
      "text": "Sacsayhuamán",
      "page": "Sacsayhuamán"
    },
    {
      "text": "Abrahamic religions",
      "page": "Abrahamic_religions"
    },
    {
      "text": "Bible",
      "page": "Bible"
    },
    {
      "text": "symbol",
      "page": "Symbol"
    },
    {
      "text": "covenant",
      "page": "Covenant"
    },
    {
      "text": "Malachi",
      "page": "Malachi"
    },
    {
      "text": "Quran",
      "page": "Quran"
    },
    {
      "text": "lamp",
      "page": "Lamp"
    },
    {
      "text": "moon",
      "page": "Moon"
    },
    {
      "text": "worship",
      "page": "Worship"
    },
    {
      "text": "Allah",
      "page": "Allah"
    },
    {
      "text": "Egyptian",
      "page": "Egyptian"
    },
    {
      "text": "primordial",
      "page": "Primordial"
    },
    {
      "text": "sky",
      "page": "Sky"
    },
    {
      "text": "humanity",
      "page": "Humanity"
    },
    {
      "text": "sackcloth",
      "page": "Sackcloth"
    },
    {
      "text": "archetype",
      "page": "Archetype"
    },
    {
      "text": "Jupiter",
      "page": "Jupiter"
    },
    {
      "text": "mass",
      "page": "Mass"
    },
    {
      "text": "planets",
      "page": "The_Planets"
    },
    {
      "text": "density",
      "page": "Density"
    },
    {
      "text": "gravitational acceleration",
      "page": "Gravitational_acceleration"
    },
    {
      "text": "surface gravity",
      "page": "Surface_gravity"
    },
    {
      "text": "differential rotation",
      "page": "Differential_rotation"
    },
    {
      "text": "rotation",
      "page": "Rotation"
    },
    {
      "text": "radiometric dating",
      "page": "Radiometric_dating"
    },
    {
      "text": "solar",
      "page": "Solar"
    },
    {
      "text": "angular momentum",
      "page": "Angular_momentum"
    },
    {
      "text": "dynamo",
      "page": "Dynamo"
    },
    {
      "text": "magnetic field",
      "page": "Magnetic_field"
    },
    {
      "text": "photosphere",
      "page": "Photosphere"
    },
    {
      "text": "proxy",
      "page": "Proxy"
    },
    {
      "text": "element",
      "page": "Element"
    },
    {
      "text": "fusion",
      "page": "Fusion"
    },
    {
      "text": "astrophysics",
      "page": "Astrophysics"
    },
    {
      "text": "neon",
      "page": "Neon"
    },
    {
      "text": "thermodynamic equilibrium",
      "page": "Thermodynamic_equilibrium"
    },
    {
      "text": "metallicity",
      "page": "Metallicity"
    },
    {
      "text": "stellar evolution",
      "page": "Stellar_evolution"
    },
    {
      "text": "atomic",
      "page": "Atomic"
    },
    {
      "text": "observational techniques",
      "page": "Observational_techniques"
    },
    {
      "text": "helium-3",
      "page": "Helium-3"
    },
    {
      "text": "helium-4",
      "page": "Helium-4"
    },
    {
      "text": "solar core",
      "page": "Solar_core"
    },
    {
      "text": "key",
      "page": "Key"
    },
    {
      "text": "carbon-12",
      "page": "Carbon-12"
    },
    {
      "text": "carbon-13",
      "page": "Carbon-13"
    },
    {
      "text": "the surface",
      "page": "The_Surface"
    },
    {
      "text": "fractionation",
      "page": "Fractionation"
    },
    {
      "text": "evolution",
      "page": "Evolution"
    },
    {
      "text": "inheritance",
      "page": "Inheritance"
    },
    {
      "text": "gradient",
      "page": "Gradient"
    },
    {
      "text": "Helioseismology data",
      "page": "Data"
    },
    {
      "text": "global",
      "page": "Global"
    },
    {
      "text": "oscillation",
      "page": "Oscillation"
    },
    {
      "text": "diffusion",
      "page": "Diffusion"
    },
    {
      "text": "solar radius",
      "page": "Solar_radius"
    },
    {
      "text": "Kelvin",
      "page": "Kelvin"
    },
    {
      "text": "energy",
      "page": "Energy"
    },
    {
      "text": "electron",
      "page": "Electron"
    },
    {
      "text": "speed of light",
      "page": "Speed_of_light"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "solar neutrino",
      "page": "Solar_neutrino"
    },
    {
      "text": "muon",
      "page": "Muon"
    },
    {
      "text": "tau",
      "page": "Tau"
    },
    {
      "text": "Super-Kamiokande",
      "page": "Super-Kamiokande"
    },
    {
      "text": "Sudbury Neutrino Observatory",
      "page": "Sudbury_Neutrino_Observatory"
    },
    {
      "text": "the core",
      "page": "The_Core"
    },
    {
      "text": "photon",
      "page": "Photon"
    },
    {
      "text": "random walk",
      "page": "Random_walk"
    },
    {
      "text": "scattering",
      "page": "Scattering"
    },
    {
      "text": "plasma",
      "page": "Plasma"
    },
    {
      "text": "mean free path",
      "page": "Mean_free_path"
    },
    {
      "text": "K",
      "page": "K"
    },
    {
      "text": "temperature gradient",
      "page": "Temperature_gradient"
    },
    {
      "text": "radiative flux",
      "page": "Radiative_flux"
    },
    {
      "text": "hydrostatic equilibrium",
      "page": "Hydrostatic_equilibrium"
    },
    {
      "text": "convection",
      "page": "Convection"
    },
    {
      "text": "elements",
      "page": "Fifth_Element"
    },
    {
      "text": "heat",
      "page": "Heat"
    },
    {
      "text": "boiling",
      "page": "Boiling"
    },
    {
      "text": "process",
      "page": "Process"
    },
    {
      "text": "granulation",
      "page": "Granulation"
    },
    {
      "text": "stability",
      "page": "Stability"
    },
    {
      "text": "shear",
      "page": "Shear"
    },
    {
      "text": "solar cycle",
      "page": "Solar_cycle"
    },
    {
      "text": "space",
      "page": "Space"
    },
    {
      "text": "radius",
      "page": "Radius"
    },
    {
      "text": "effective temperature",
      "page": "Effective_temperature"
    },
    {
      "text": "optical depth",
      "page": "Optical_depth"
    },
    {
      "text": "core",
      "page": "Core"
    },
    {
      "text": "granules",
      "page": "Granule"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "radiative cooling",
      "page": "Radiative_cooling"
    },
    {
      "text": "solar maximum",
      "page": "Solar_maximum"
    },
    {
      "text": "chromosphere",
      "page": "Chromosphere"
    },
    {
      "text": "interplanetary medium",
      "page": "Interplanetary_medium"
    },
    {
      "text": "coronal holes",
      "page": "Coronal_hole"
    },
    {
      "text": "heliospheric current sheet",
      "page": "Heliospheric_current_sheet"
    },
    {
      "text": "solar physics",
      "page": "Solar_physics"
    },
    {
      "text": "temperature",
      "page": "Temperature"
    },
    {
      "text": "waves",
      "page": "Waves"
    },
    {
      "text": "hydrogen-alpha",
      "page": "Hydrogen-alpha"
    },
    {
      "text": "extreme ultraviolet",
      "page": "Extreme_ultraviolet"
    },
    {
      "text": "Solar Dynamics Observatory",
      "page": "Solar_Dynamics_Observatory"
    },
    {
      "text": "interstellar medium",
      "page": "Interstellar_medium"
    },
    {
      "text": "leading edge",
      "page": "Leading_edge"
    },
    {
      "text": "interstellar",
      "page": "Interstellar"
    },
    {
      "text": "rotating magnetic field",
      "page": "Rotating_magnetic_field"
    },
    {
      "text": "magnetic polarity",
      "page": "Polarity"
    },
    {
      "text": "magnetic equator",
      "page": "Equator"
    },
    {
      "text": "axis",
      "page": "Axis"
    },
    {
      "text": "bipolar",
      "page": "Bipolar"
    },
    {
      "text": "bow wave",
      "page": "Bow_wave"
    },
    {
      "text": "nT",
      "page": "NT"
    },
    {
      "text": "absorption",
      "page": "Absorption"
    },
    {
      "text": "foreshock",
      "page": "Foreshock"
    },
    {
      "text": "Interstellar Boundary Explorer",
      "page": "Interstellar_Boundary_Explorer"
    },
    {
      "text": "IBEX",
      "page": "Ibex"
    },
    {
      "text": "Interstellar Mapping and Acceleration Probe",
      "page": "Interstellar_Mapping_and_Acceleration_Probe"
    },
    {
      "text": "Archimedean spiral",
      "page": "Archimedean_spiral"
    },
    {
      "text": "electromagnetic radiation",
      "page": "Electromagnetic_radiation"
    },
    {
      "text": "astronomical unit",
      "page": "Astronomical_unit"
    },
    {
      "text": "solar constant",
      "page": "Solar_constant"
    },
    {
      "text": "solar irradiance",
      "page": "Solar_irradiance"
    },
    {
      "text": "solar minimum",
      "page": "Solar_minimum"
    },
    {
      "text": "solar energy",
      "page": "Solar_energy"
    },
    {
      "text": "climate system",
      "page": "Climate_system"
    },
    {
      "text": "ultraviolet",
      "page": "Ultraviolet"
    },
    {
      "text": "X-ray",
      "page": "X-ray"
    },
    {
      "text": "visible range",
      "page": "Visible_range"
    },
    {
      "text": "infrared",
      "page": "Infrared"
    },
    {
      "text": "visible light",
      "page": "Visible_light"
    },
    {
      "text": "visible",
      "page": "Visible"
    },
    {
      "text": "irradiance",
      "page": "Irradiance"
    },
    {
      "text": "magnitude",
      "page": "Magnitude"
    },
    {
      "text": "brightness",
      "page": "Brightness"
    },
    {
      "text": "luminosity",
      "page": "Luminosity"
    },
    {
      "text": "Planck's law",
      "page": "Planck's_law"
    },
    {
      "text": "continuum",
      "page": "Continuum"
    },
    {
      "text": "Fraunhofer lines",
      "page": "Fraunhofer_lines"
    },
    {
      "text": "Joseph von Fraunhofer",
      "page": "Joseph_von_Fraunhofer"
    },
    {
      "text": "19th century",
      "page": "19th_century"
    },
    {
      "text": "stellar classification",
      "page": "Stellar_classification"
    },
    {
      "text": "main-sequence",
      "page": "Main_sequence"
    },
    {
      "text": "sunspots",
      "page": "Sunspot"
    },
    {
      "text": "cycle",
      "page": "Cycle"
    },
    {
      "text": "hemisphere",
      "page": "Hemisphere"
    },
    {
      "text": "butterfly diagram",
      "page": "Butterfly_diagram"
    },
    {
      "text": "latitudes",
      "page": "Latitude"
    },
    {
      "text": "mean-field theory",
      "page": "Mean-field_theory"
    },
    {
      "text": "toroidal",
      "page": "Toroidal"
    },
    {
      "text": "saturation",
      "page": "Saturation"
    },
    {
      "text": "radiation",
      "page": "Radiation"
    },
    {
      "text": "magnetic fields",
      "page": "The_Magnetic_Fields"
    },
    {
      "text": "magnetic reconnection",
      "page": "Magnetic_reconnection"
    },
    {
      "text": "Geostationary Operational Environmental Satellite",
      "page": "Geostationary_Operational_Environmental_Satellite"
    },
    {
      "text": "flare",
      "page": "Flare"
    },
    {
      "text": "magnetic flux",
      "page": "Magnetic_flux"
    },
    {
      "text": "kinetic energy",
      "page": "Kinetic_energy"
    },
    {
      "text": "2025",
      "page": "2025"
    },
    {
      "text": "active region",
      "page": "Active_region"
    },
    {
      "text": "Parker",
      "page": "Parker"
    },
    {
      "text": "gravitational collapse",
      "page": "Gravitational_collapse"
    },
    {
      "text": "Jeans instability",
      "page": "Jeans_instability"
    },
    {
      "text": "protoplanetary disk",
      "page": "Protoplanetary_disk"
    },
    {
      "text": "embedded",
      "page": "Embedded"
    },
    {
      "text": "protostar",
      "page": "Protostar"
    },
    {
      "text": "pre-main-sequence star",
      "page": "Pre-main-sequence_star"
    },
    {
      "text": "Hayashi track",
      "page": "Hayashi_track"
    },
    {
      "text": "gravitational potential",
      "page": "Gravitational_potential"
    },
    {
      "text": "moment of inertia",
      "page": "Moment_of_inertia"
    },
    {
      "text": "lithium",
      "page": "Lithium"
    },
    {
      "text": "AU",
      "page": "AU"
    },
    {
      "text": "Venus",
      "page": "Venus"
    },
    {
      "text": "luminosity",
      "page": "luminosity"
    },
    {
      "text": "asymptotic giant branch",
      "page": "Asymptotic_giant_branch"
    },
    {
      "text": "planetary nebula",
      "page": "Planetary_nebula"
    },
    {
      "text": "Oort Cloud",
      "page": "Oort_cloud"
    },
    {
      "text": "barycenter",
      "page": "Center_of_mass"
    },
    {
      "text": "Newton's law of universal gravitation",
      "page": "Newton's_law_of_universal_gravitation"
    },
    {
      "text": "Hill sphere",
      "page": "Hill_sphere"
    },
    {
      "text": "parsec",
      "page": "Parsec"
    },
    {
      "text": "Milky Way",
      "page": "Milky_Way"
    },
    {
      "text": "galactic center",
      "page": "Galactic_Center"
    },
    {
      "text": "galactic year",
      "page": "Galactic_year"
    },
    {
      "text": "supernovae",
      "page": "Supernova"
    },
    {
      "text": "Orion Arm",
      "page": "Orion_Arm"
    },
    {
      "text": "Sagittarius",
      "page": "Sagittarius"
    },
    {
      "text": "Perseus",
      "page": "Perseus"
    },
    {
      "text": "Proxima Centauri",
      "page": "Proxima_Centauri"
    },
    {
      "text": "cosmic ray",
      "page": "Cosmic_ray"
    },
    {
      "text": "star formation",
      "page": "Star_formation"
    },
    {
      "text": "ancient Greece",
      "page": "Ancient_Greece"
    },
    {
      "text": "Anaxagoras",
      "page": "Anaxagoras"
    },
    {
      "text": "sunlight",
      "page": "Sunlight"
    },
    {
      "text": "Aristarchus of Samos",
      "page": "Aristarchus_of_Samos"
    },
    {
      "text": "Almagest",
      "page": "Almagest"
    },
    {
      "text": "millennium",
      "page": "Millennium"
    },
    {
      "text": "universe",
      "page": "Universe"
    },
    {
      "text": "orbit",
      "page": "Orbit"
    },
    {
      "text": "celestial mechanics",
      "page": "Celestial_mechanics"
    },
    {
      "text": "Aristotelian physics",
      "page": "Aristotelian_physics"
    },
    {
      "text": "17th century",
      "page": "17th_century"
    },
    {
      "text": "1610",
      "page": "1610"
    },
    {
      "text": "Johannes",
      "page": "Johannes"
    },
    {
      "text": "solar phenomena",
      "page": "Solar_phenomena"
    },
    {
      "text": "nature",
      "page": "Nature"
    },
    {
      "text": "Isaac Newton",
      "page": "Isaac_Newton"
    },
    {
      "text": "spectrum",
      "page": "Spectrum"
    },
    {
      "text": "composition",
      "page": "Composition"
    },
    {
      "text": "Maya",
      "page": "Maya"
    },
    {
      "text": "Chichén Itzá",
      "page": "Chichen_Itza"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "spectroscope",
      "page": "Spectroscopy"
    },
    {
      "text": "Gustav Kirchhoff",
      "page": "Gustav_Kirchhoff"
    },
    {
      "text": "Robert Bunsen",
      "page": "Robert_Bunsen"
    },
    {
      "text": "emission spectrum",
      "page": "Emission_spectrum"
    },
    {
      "text": "general relativity",
      "page": "General_relativity"
    },
    {
      "text": "fluid",
      "page": "Fluid"
    },
    {
      "text": "1916",
      "page": "1916"
    },
    {
      "text": "acoustic waves",
      "page": "Acoustic_wave"
    },
    {
      "text": "spacecraft",
      "page": "Spacecraft"
    },
    {
      "text": "Solar and Heliospheric Observatory",
      "page": "Solar_and_Heliospheric_Observatory"
    },
    {
      "text": "SOHO",
      "page": "Soho"
    },
    {
      "text": "Lagrange point",
      "page": "Lagrange_point"
    },
    {
      "text": "Coronagraph",
      "page": "Coronagraph"
    },
    {
      "text": "GOLF",
      "page": "Golf"
    },
    {
      "text": "convection zone",
      "page": "Convection_zone"
    },
    {
      "text": "wind",
      "page": "Wind"
    },
    {
      "text": "trace",
      "page": "Trace"
    },
    {
      "text": "acceleration",
      "page": "Acceleration"
    },
    {
      "text": "mechanisms",
      "page": "Crank"
    },
    {
      "text": "AU",
      "page": ".au"
    },
    {
      "text": "Solar Orbiter",
      "page": "Solar_Orbiter"
    },
    {
      "text": "PHI",
      "page": "Phi"
    },
    {
      "text": "Aditya-L1",
      "page": "Aditya-L1"
    },
    {
      "text": "ISRO",
      "page": "ISRO"
    },
    {
      "text": "blue light",
      "page": "Blue_Light"
    },
    {
      "text": "retinal",
      "page": "Retinal"
    },
    {
      "text": "solar retinopathy",
      "page": "Retinopathy"
    },
    {
      "text": "phase",
      "page": "Phase"
    },
    {
      "text": "solar eclipse",
      "page": "Solar_eclipse"
    },
    {
      "text": "eclipse",
      "page": "Eclipse"
    },
    {
      "text": "solar viewers",
      "page": "Solar_viewer"
    },
    {
      "text": "sunglasses",
      "page": "Sunglasses"
    },
    {
      "text": "index card",
      "page": "Index_card"
    },
    {
      "text": "colander",
      "page": "Colander"
    },
    {
      "text": "box",
      "page": "Box"
    },
    {
      "text": "binoculars",
      "page": "Binoculars"
    },
    {
      "text": "ND",
      "page": "ND"
    },
    {
      "text": "eyepiece",
      "page": "Eyepiece"
    },
    {
      "text": "Baily's beads",
      "page": "Baily's_beads"
    },
    {
      "text": "imaging",
      "page": "Imaging"
    },
    {
      "text": "cirrus",
      "page": "Cirrus"
    },
    {
      "text": "dispersion",
      "page": "Dispersion"
    },
    {
      "text": "reflection",
      "page": "Reflection"
    },
    {
      "text": "water",
      "page": "Water"
    },
    {
      "text": "Crepuscular rays",
      "page": "Crepuscular_rays"
    },
    {
      "text": "magnetosphere",
      "page": "Magnetosphere"
    },
    {
      "text": "climate",
      "page": "Climate"
    },
    {
      "text": "Kp",
      "page": "Kp"
    },
    {
      "text": "geomagnetically induced currents",
      "page": "Geomagnetically_induced_current"
    },
    {
      "text": "Quebec",
      "page": "Quebec"
    },
    {
      "text": "transformer",
      "page": "Transformer"
    },
    {
      "text": "drag",
      "page": "Drag"
    },
    {
      "text": "health",
      "page": "Health"
    },
    {
      "text": "7-dehydrocholesterol",
      "page": "7-Dehydrocholesterol"
    },
    {
      "text": "exposure",
      "page": "Exposure"
    },
    {
      "text": "skin cancer",
      "page": "Skin_cancer"
    },
    {
      "text": "melanoma",
      "page": "Melanoma"
    },
    {
      "text": "sunscreen",
      "page": "Sunscreen"
    }
  ],
  "fetched_at": "2025-12-07T07:23:36.334902",
  "elapsed_ms": 569272
}