{
  "topic": "Supreme Court",
  "title": "Supreme Court of the United States",
  "slug": "supreme-court",
  "grokipedia_slug": "Supreme_Court_of_the_United_States",
  "grokipedia_url": "https://grokipedia.com/page/Supreme_Court_of_the_United_States",
  "source": "grokipedia",
  "content": "# Supreme Court of the United States\n\nThe Supreme Court of the United States is the highest tribunal in the federal judiciary, vested with the judicial power under Article III of the U.S. Constitution to decide cases arising under the Constitution, federal laws, and treaties. Established by the Judiciary Act of 1789, it initially comprised one chief justice and five associate justices, but Congress fixed the number at nine in 1869, with justices serving lifetime appointments subject to good behavior. Nominated by the president and confirmed by the Senate, the current Court under Chief Justice John Roberts features a 6-3 conservative majority, reflecting patterns of partisan appointment that have intensified ideological divides in its jurisprudence.  \n\nThe Court holds original jurisdiction over disputes between states or involving foreign diplomats and appellate jurisdiction over lower federal and state court decisions, though it grants certiorari to fewer than 2% of petitions annually. Its defining power of judicial review, first asserted in *Marbury v. Madison* (1803), enables invalidation of laws or executive actions conflicting with the Constitution, a mechanism not explicitly stated in the founding document but derived from first principles of constitutional supremacy. Landmark rulings have reshaped national policy on issues from slavery in *Dred Scott v. Sandford* (1857) to desegregation in *Brown v. Board of Education* (1954), federal commerce authority, and abortion rights—overturned in *Dobbs v. Jackson Women's Health Organization* (2022)—often amplifying executive or legislative overreach while inviting accusations of overstepping democratic processes.  \n\nControversies persist over ethics, recusal standards, and leak scandals, such as the 2022 draft opinion disclosure, underscoring tensions between the Court's insulation from political pressure—intended to safeguard impartiality—and public perceptions of elite capture or bias, particularly given systemic influences in legal academia favoring expansive federal power. Despite such critiques, the institution's endurance stems from its causal role in enforcing limited government and separation of powers, though outcomes hinge on interpretive philosophies ranging from originalism to living constitutionalism.\n\n## Historical Development\n\n### Establishment under the Constitution (1789–1800)\n\nArticle III, Section 1 of the United States Constitution, ratified in 1788, vested \"the judicial Power of the United States\" in \"one supreme Court, and in such inferior Courts as the Congress may from time to time ordain and establish.\" This provision outlined the Court's tenure for life during good behavior, compensation protection, and jurisdiction over cases arising under federal law, treaties, admiralty, controversies between states or citizens of different states, and matters involving ambassadors or foreign states. However, the Constitution left the Court's precise structure, size, and procedures undefined, delegating implementation to Congress.\n\nThe First Congress addressed this gap with the Judiciary Act of 1789, enacted on September 24, 1789, which organized the federal judiciary by establishing the Supreme Court with one chief justice and five associate justices, totaling six members. The Act granted the Court original jurisdiction in cases affecting ambassadors, public ministers, and those where a state was a party, aligning with Article III, while appellate jurisdiction extended to appeals from state supreme courts and federal circuit courts on law and fact. It also created 13 district courts and three circuit courts, requiring Supreme Court justices to ride circuit twice annually to preside over these lower tribunals, a burdensome duty that later contributed to resignations.\n\nPresident George Washington nominated John Jay of New York as the first chief justice on September 24, 1789, with Jay taking the oath of office on October 19, 1789, in New York City, the temporary national capital. The associate justices nominated included John Rutledge of South Carolina, William Cushing of Massachusetts, Robert H. Harrison of Maryland (who declined due to health), James Wilson of Pennsylvania, and John Blair of Virginia; Harrison's seat remained vacant until filled by Thomas Johnson in 1791. The Court convened for its first session on February 1, 1790, in the Merchants' Exchange on Broad Street in New York, with only Jay, Cushing, Wilson, and Blair present, as Rutledge arrived later; procedural rules were adopted, but no cases were argued due to the docket's early stage. Sessions continued irregularly, hampered by justices' circuit obligations and travel difficulties, with the Court relocating to Philadelphia in 1791 after the capital's move.\n\nEarly operations yielded few substantive decisions, as the Court focused on administrative matters and circuit supervision; the first case docketed, *Van Staphorst v. Maryland* (1790), settled before argument. A landmark exception was *Chisholm v. Georgia* (1793), where a South Carolina citizen sued Georgia for unpaid Revolutionary War supplies; in a 4-1 ruling, the Court held that states lacked sovereign immunity against out-of-state citizens under Article III, affirming federal judicial supremacy over state claims of sovereignty. This decision, authored separately by Justices Jay, Wilson, Blair, and Cushing, provoked backlash, prompting the Eleventh Amendment's ratification in 1795 to bar federal suits against states by citizens of other states or foreigners. Chief Justice Jay resigned in 1795 following his diplomatic mission to Britain, succeeded briefly by John Rutledge as chief (who served only months before Senate rejection) and then Oliver Ellsworth until 1800; the Court's size remained at six justices amid these transitions. By 1800, the institution had solidified its role but operated modestly, issuing fewer than a dozen opinions amid circuit demands and political neutrality efforts.\n\n### Expansion of Judicial Power (1801–1860)\n\nJohn Marshall's appointment as the fourth Chief Justice on January 20, 1801, by President John Adams initiated an era of judicial assertiveness that elevated the Supreme Court's role within the federal government. Prior to Marshall, the Court had operated with limited influence, convening in modest quarters and issuing few significant opinions. Marshall, serving until his death in 1835, led the Court in issuing landmark rulings that interpreted the Constitution to expand federal authority and judicial oversight.\n\nThe foundational expansion occurred in *Marbury v. Madison* (1803), where the Court invalidated Section 13 of the Judiciary Act of 1789 as unconstitutional, thereby establishing judicial review—the power to declare acts of Congress void if they conflicted with the Constitution. This decision arose from President Thomas Jefferson's refusal to deliver judicial commissions signed by Adams, with William Marbury seeking a writ of mandamus. Chief Justice Marshall's opinion asserted that it was the judiciary's duty to say what the law is, positioning the Court as the ultimate interpreter of constitutional limits on legislative and executive actions.\n\nSubsequent Marshall Court decisions reinforced federal supremacy. In *McCulloch v. Maryland* (1819), the Court upheld Congress's authority to charter the Second Bank of the United States under the Necessary and Proper Clause, ruling that states could not tax federal operations due to the Supremacy Clause. This broad interpretation of implied powers strengthened the national government's capacity to enact measures essential to enumerated ends. Similarly, *Gibbons v. Ogden* (1824) defined the Commerce Clause to encompass navigation and interstate trade, invalidating a New York steamboat monopoly and affirming exclusive federal regulation over commerce \"among the several states.\" These rulings curtailed state interference and expanded the federal domain, with Marshall emphasizing a nationalistic reading of the Constitution.\n\nUnder Chief Justice Roger B. Taney, appointed in 1836, the Court shifted toward greater deference to states in economic matters but continued to wield interpretive power. Taney's opinions, such as in *Charles River Bridge v. Warren Bridge* (1837), limited vested rights in charters to promote competition, reflecting a pro-development stance while asserting judicial limits on state-granted monopolies. However, *Dred Scott v. Sandford* (1857) exemplified the Court's ongoing expansion of its role, with a 7-2 majority holding that persons of African descent lacked citizenship and that Congress could not prohibit slavery in territories, effectively nullifying the Missouri Compromise of 1820. Taney argued this interpretation followed from the Constitution's original meaning, though the decision provoked widespread criticism for overreaching into political questions. Collectively, these precedents from 1801 to 1860 entrenched the judiciary as a counterweight to Congress and the states, fostering a durable framework for constitutional adjudication despite enforcement challenges, such as President Andrew Jackson's defiance in Native American removal cases.\n\n### Civil War, Reconstruction, and Industrial Era (1861–1910)\n\nThe Supreme Court navigated profound constitutional challenges during the Civil War, initially under Chief Justice Roger B. Taney, whose tenure ended with his death on October 12, 1864. Taney's circuit court ruling in *Ex parte Merryman* (May 28, 1861) declared President Abraham Lincoln's unilateral suspension of habeas corpus unconstitutional, asserting that only Congress held such authority under Article I, Section 9 of the Constitution; however, the executive branch disregarded the order, highlighting tensions between judicial and presidential war powers. The Court's full bench avoided direct confrontation with Lincoln's actions, deciding few war-related cases amid the conflict's disruptions, which reduced its caseload and prompted recusals due to Southern justices' absences or sympathies.\n\nFollowing Taney's death, President Lincoln appointed Salmon P. Chase as Chief Justice on December 6, 1864, elevating him to lead a Court reshaped by five Lincoln appointees who generally supported Union policies. In the *Prize Cases* (decided February 1863, argued under Taney but resolved under Chase), a 5-4 majority upheld Lincoln's April 1861 naval blockade of Southern ports as a valid exercise of executive war powers, rejecting claims that rebellion required a formal congressional declaration of war; Justice Robert Grier's opinion reasoned that insurrection triggered inherent presidential authority to treat rebels as belligerents, enabling captures of neutral vessels trading with the Confederacy. This decision affirmed broad executive discretion in emergencies, influencing later interpretations of commander-in-chief powers without endorsing unlimited suspension of civil liberties.\n\nPostwar Reconstruction under the Chase Court (1864–1873) tested the Court's role in enforcing the 13th, 14th, and 15th Amendments amid efforts to integrate freed slaves and rebuild the Union. In *Texas v. White* (April 12, 1869), the Court unanimously held that the Union was \"indissoluble\" and secession ordinances void, affirming Congress's authority to reorganize rebel states while rejecting Texas's suit to reclaim U.S. bonds as it lacked standing during rebellion. The landmark *Slaughter-House Cases* (April 14, 1873), consolidating challenges by Louisiana butchers against a state-granted slaughtering monopoly, produced a 5-4 ruling that sharply confined the 14th Amendment's Privileges or Immunities Clause to federal citizenship rights (e.g., interstate travel, habeas), excluding most state-level economic liberties or protections against state discrimination; Justice Samuel Miller's majority opinion prioritized states' traditional police powers, effectively neutralizing the amendment's potential as a broad shield for individual rights against state action.\n\nThe Waite Court (1874–1888), led by Chief Justice Morrison R. Waite appointed by Ulysses S. Grant, continued limiting Reconstruction's egalitarian aims while addressing emerging industrial disputes. The *Civil Rights Cases* (October 16, 1883) invalidated the Civil Rights Act of 1875 in an 8-1 decision, ruling that the 14th Amendment authorized Congress to remedy state deprivations of rights but not private discrimination in public accommodations; Justice Joseph Bradley's opinion distinguished \"state action\" from individual conduct, enabling widespread private segregation and undermining federal civil rights enforcement. In *Munn v. Illinois* (1877), the Court upheld state regulation of grain elevator rates under common-law principles that public utilities affecting public interest could be subject to legislative control, marking an early endorsement of state economic intervention despite railroad industry challenges.\n\nUnder the Fuller Court (1888–1910), with Chief Justice Melville W. Fuller nominated by Grover Cleveland, the justices increasingly prioritized property rights and laissez-faire economics amid rapid industrialization, immigration, and corporate consolidation, while entrenching racial hierarchies. *Pollock v. Farmers' Loan \\u0026 Trust Co.* (May 20, 1895) declared the federal income tax provisions of the 1894 Wilson–Gorman Tariff Act unconstitutional in a 5-4 vote, classifying unapportioned direct taxes on incomes from property as violating Article I, Section 9; Chief Justice Fuller's opinion distinguished income from realty as a direct tax requiring apportionment among states by population, prompting the 16th Amendment's eventual ratification in 1913. Antitrust enforcement saw mixed results: *United States v. E. C. Knight Co.* (1895) limited the Sherman Antitrust Act to interstate commerce, exempting a sugar trust's manufacturing monopoly as intrastate \"production,\" but *Northern Securities Co. v. United States* (March 14, 1904) dissolved a railroad holding company in a 5-4 ruling, interpreting stock acquisitions as restraining trade under the Act and bolstering Theodore Roosevelt's trust-busting.\n\nRacial jurisprudence solidified segregation in *Plessy v. Ferguson* (May 18, 1896), where a 7-1 majority upheld Louisiana's Separate Car Act mandating racial separation in rail travel, deeming it constitutional under the \"separate but equal\" doctrine so long as facilities were substantively equivalent; Justice Henry Billings Brown's opinion invoked state police powers and rejected claims of inherent inequality in segregation, with Justice John Marshall Harlan's lone dissent arguing its arbitrariness violated equal protection. The era's economic due process culminated in *Lochner v. New York* (1905), invalidating a state law limiting bakers' work hours to 10 per day in a 5-4 decision; Justice Rufus Peckham's majority framed the statute as unjustified interference with freedom of contract under the 14th Amendment's Due Process Clause, prioritizing individual liberty over purported health regulations absent clear evidence of abuse. These rulings reflected the Court's deference to state autonomy in social matters and federalism in commerce, fostering industrial growth but curtailing civil rights expansions and regulatory reforms. The Judiciary Act of 1869 stabilized membership at nine justices, enduring to the present.\n\n### Progressive Reforms and New Deal Challenges (1911–1945)\n\nDuring the Progressive Era extending into the 1920s, the Supreme Court continued to apply the Lochner doctrine, emphasizing freedom of contract under the Due Process Clause of the Fourteenth Amendment to invalidate state economic regulations. In *Adkins v. Children's Hospital* (1923), a 5-3 majority struck down a District of Columbia minimum wage law for women and children, holding it interfered with liberty of contract absent a clear police power justification. The Court upheld some reforms, such as in *Muller v. Oregon* (1908, with influence persisting), protecting women's hours based on health differences, but broadly scrutinized labor laws like those prohibiting yellow-dog contracts in *Coppage v. Kansas* (1915). This jurisprudence reflected judicial resistance to progressive interventions in market relations, prioritizing individual economic liberty over collective regulatory aims.\n\nThe Great Depression intensified conflicts as President Franklin D. Roosevelt's New Deal programs, enacted from 1933, expanded federal economic controls, prompting constitutional challenges. In *A.L.A. Schechter Poultry Corp. v. United States* (1935), the Court unanimously invalidated the National Industrial Recovery Act (NIRA), ruling its delegation of legislative power to the executive excessive and its application to intrastate poultry slaughtering beyond Congress's commerce authority. Subsequent decisions, including *United States v. Butler* (1936) striking down the Agricultural Adjustment Act for improper federal coercion of states, reinforced limits on federal power, with the conservative \"Four Horsemen\" justices (Van Devanter, McReynolds, Sutherland, Butler) often prevailing against the liberal bloc.\n\nFacing repeated invalidations, Roosevelt proposed the Judicial Procedures Reform Bill on February 5, 1937, to add up to six justices for those over 70 who did not retire, aiming to secure New Deal support amid a 6-3 conservative majority. The plan sparked backlash, dubbed \"court-packing,\" and failed in the Senate by July 1937, but correlated with a doctrinal shift. In *West Coast Hotel Co. v. Parrish* (March 1937), a 5-4 decision upheld Washington's minimum wage law for women, with Justice Roberts joining the majority to overrule *Adkins*, deferring to legislative economic judgments during crisis. This \"switch in time that saved nine\" extended to *NLRB v. Jones \\u0026 Laughlin Steel Corp.* (1937), affirming the National Labor Relations Act's protection of collective bargaining as within interstate commerce.\n\nBy the early 1940s, under Chief Justice Harlan F. Stone (appointed 1941), the Court sustained most remaining New Deal measures, including Social Security provisions in *Helvering v. Davis* (1937) and fair labor standards in *United States v. Darby* (1941), marking abandonment of Lochner-era scrutiny for greater deference to congressional economic regulation. This evolution reflected pragmatic adaptation to national emergencies, though critics attributed it partly to political pressure from the packing threat rather than pure constitutional reasoning.\n\n### Mid-Century Rights Revolution and Backlash (1946–1980)\n\nThe Vinson Court, serving from 1946 to 1953 under Chief Justice Fred M. Vinson, laid preliminary groundwork for civil rights advancements by invalidating judicial enforcement of racially restrictive housing covenants in *Shelley v. Kraemer* (1948), ruling that such state action violated the Equal Protection Clause of the Fourteenth Amendment. The Court also addressed higher education segregation, finding in *Sweatt v. Painter* (1950) that the University of Texas's separate law school for Black students failed to provide equal educational opportunities due to tangible deficiencies in faculty, facilities, and prestige. These decisions signaled a cautious shift toward scrutinizing racial discrimination, though the Court upheld \"separate but equal\" under *Plessy v. Ferguson* in related elementary education challenges, reflecting internal divisions and deference to Southern states.\n\nThe Warren Court, beginning in 1953 with Earl Warren's appointment as Chief Justice, accelerated a \"rights revolution\" through landmark rulings expanding federal protections against state encroachments on civil liberties and equality. In *Brown v. Board of Education* (1954), the unanimous decision declared segregated public schools inherently unequal, overturning *Plessy* and mandating desegregation \"with all deliberate speed,\" though implementation faced widespread resistance via \"massive resistance\" campaigns in the South. The Court further incorporated Bill of Rights guarantees to the states via the Fourteenth Amendment's Due Process Clause, including the right to counsel in felony cases (*Gideon v. Wainwright*, 1963), protection against coerced confessions (*Miranda v. Arizona*, 1966), and exclusion of illegally obtained evidence (*Mapp v. Ohio*, 1961). Reapportionment decisions like *Baker v. Carr* (1962) and *Reynolds v. Sims* (1964) enforced \"one person, one vote\" principles, invalidating malapportioned legislatures that diluted urban and minority voting power. First Amendment expansions included *New York Times Co. v. Sullivan* (1964), which raised the bar for public officials to prove libel by requiring \"actual malice.\"\n\nThis era provoked significant backlash, as critics argued the Court's activism undermined federalism, democratic majorities, and law enforcement efficacy by prioritizing individual rights over state authority and public order. Conservative politicians, including Barry Goldwater in his 1964 presidential campaign, decried decisions like *Miranda* for \"coddling criminals,\" fueling a narrative of judicial overreach that contributed to Warren's resignation in 1969 amid personal and political pressure. Richard Nixon capitalized on this discontent during his 1968 campaign, pledging to appoint \"strict constructionists\" to restore balance, a promise fulfilled with the nominations of Warren Burger as Chief Justice in 1969, Harry Blackmun in 1970, Lewis Powell in 1971, and William Rehnquist in 1971, following rejections of Clement Haynsworth and G. Harrold Carswell amid Senate scrutiny over ethics and ideology.\n\nUnder the early Burger Court (1969–1980), the ideological shift moderated some Warren-era expansions while preserving others, reflecting the new justices' incremental conservatism. Criminal procedure rulings narrowed *Miranda*'s scope, as in *Harris v. New York* (1970), allowing impeachment use of non-*Miranda*-warned statements, and limited Fourth Amendment remedies in *United States v. Calandra* (1974). Yet the Court upheld privacy rights in *Griswold v. Connecticut* extensions, culminating in *Roe v. Wade* (1973), which recognized a constitutional right to abortion based on unenumerated liberty interests, drawing further conservative ire for lacking textual basis. Affirmative action faced limits in *Regents of the University of California v. Bakke* (1978), striking racial quotas in medical school admissions as reverse discrimination while permitting race as a factor, highlighting ongoing tensions between equality principles and color-blind merit. This period marked a partial retrenchment, with the Court issuing 1,200 opinions from 1969 to 1980, often splitting 5–4 on rights issues, as Nixon's appointees joined holdovers like William O. Douglas and Thurgood Marshall in fragile coalitions.\n\n### Conservative Realignment (1981–present)\n\nThe conservative realignment of the Supreme Court commenced under President Ronald Reagan, who sought to appoint justices adhering to originalist and textualist interpretive methods to counteract the expansive judicial doctrines established during the Warren and Burger Courts. Reagan's first appointee, Sandra Day O'Connor, received her commission on September 21, 1981, following her nomination to replace retiring Justice Potter Stewart. In 1986, amid the retirement of Chief Justice Warren Burger, Reagan elevated Associate Justice William Rehnquist to Chief Justice, commissioning him on September 26, 1986, and simultaneously appointed Antonin Scalia to the vacated associate seat on the same date. These moves replaced moderate and liberal-leaning justices with reliable conservatives, shifting the Court's ideological balance incrementally rightward.\n\nReagan's subsequent nominations faced setbacks that tempered the initial momentum. After nominating Robert Bork, a prominent originalist, in 1987 to replace retiring Justice Lewis Powell, the Senate rejected Bork on October 23, 1987, by a 58-42 vote amid intense partisan opposition. Reagan then nominated Douglas Ginsburg, who withdrew amid controversy over past marijuana use, leading to Anthony Kennedy's confirmation on February 18, 1988. Kennedy, while generally conservative, proved more moderate on social issues, preserving a swing vote dynamic. President George H.W. Bush continued the effort, appointing David Souter on October 18, 1990, to replace retiring Justice William Brennan, and Clarence Thomas on October 23, 1991, following Thurgood Marshall's retirement; Thomas emerged as a steadfast originalist, but Souter aligned more closely with liberal justices over time.\n\nThe Rehnquist Court (1986–2005) advanced conservative priorities, including bolstering federalism and limiting Congress's commerce power, as seen in decisions curtailing expansive federal regulatory authority, though it upheld core liberal precedents like abortion rights in Planned Parenthood v. Casey (1992). President George W. Bush's appointments of John Roberts as Chief Justice on September 29, 2005, replacing Rehnquist, and Samuel Alito on January 31, 2006, succeeding Sandra Day O'Connor, entrenched a reliable conservative bloc of five justices when joined by Scalia, Thomas, and Kennedy. Presidents Bill Clinton and Barack Obama countered with liberal appointments—Ruth Bader Ginsburg (August 10, 1993), Stephen Breyer (August 3, 1994), Sonia Sotomayor (August 8, 2009), and Elena Kagan (August 7, 2010)—maintaining ideological tension but not restoring a liberal majority.\n\nThe decisive acceleration occurred during President Donald Trump's tenure, yielding three appointments that forged a 6–3 conservative supermajority. Neil Gorsuch received his commission on April 10, 2017, filling Scalia's seat after his death in February 2016, preserving the 5–4 conservative edge on key issues. Brett Kavanaugh succeeded Kennedy upon his retirement, commissioned October 6, 2018, solidifying conservative control over constitutional interpretation. Amy Coney Barrett's appointment on October 27, 2020, following Ginsburg's death on September 18, 2020, expanded the majority to six conservatives against three liberals. President Joe Biden's nomination of Ketanji Brown Jackson on June 30, 2022, to replace retiring Breyer, substituted one liberal for another without altering the balance.\n\nThis realignment manifested in landmark decisions overturning long-standing liberal precedents and curbing administrative overreach. In Dobbs v. Jackson Women's Health Organization (June 24, 2022), the Court held 6–3 that the Constitution does not confer a right to abortion, explicitly overruling Roe v. Wade (1973) and Casey. Students for Fair Admissions, Inc. v. President and Fellows of Harvard College (June 29, 2023) ended race-based affirmative action in higher education admissions by a 6–3 vote, rejecting diversity justifications under the Equal Protection Clause. Loper Bright Enterprises v. Raimondo (June 28, 2024) discarded the Chevron deference doctrine (1984), ruling 6–3 that courts must independently interpret statutes rather than defer to agency views, limiting the administrative state's influence. Trump v. United States (July 1, 2024) granted former presidents presumptive immunity for official acts, a 6–3 decision reshaping executive accountability. These rulings reflect a judicial pivot toward textual fidelity, state sovereignty, and restraint on unelected bureaucracies, correcting what conservative jurists describe as prior doctrinal excesses, though critics from academia and mainstream media often frame them as partisan overreaches amid noted left-leaning biases in those institutions. As of October 2025, the Roberts Court remains a 6–3 conservative majority, with no retirements altering the composition.\n\n## Constitutional Foundation and Jurisdiction\n\n### Article III and Judicial Review\n\nArticle III of the United States Constitution establishes the judicial branch of the federal government by vesting \"the judicial Power of the United States... in one supreme Court, and in such inferior Courts as the Congress may from time to time ordain and establish.\" Federal judges, including those of the Supreme Court, hold their offices \"during good Behaviour,\" providing lifetime tenure absent misconduct, and receive compensation that \"shall not be diminished during their Continuance in Office\" to ensure independence from executive or legislative influence.\n\nSection 2 delineates the scope of federal judicial power, extending to \"all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority,\" as well as cases involving ambassadors, admiralty, controversies with the United States as a party, disputes between states, between a state and citizens of another state, between citizens of different states, and certain land grant claims or foreign entities. The Supreme Court holds original jurisdiction in cases affecting ambassadors, public ministers, consuls, or where a state is a party; in other enumerated cases, it exercises appellate jurisdiction \"both as to Law and Fact, with such Exceptions, and under such Regulations as the Congress shall make.\" Trials for crimes, except impeachments, require a jury in the state of commission, or as Congress directs if outside a state. Section 3 defines treason narrowly as levying war against the United States or adhering to its enemies by giving aid and comfort, requiring two witnesses or confession for conviction, with Congress setting punishment but prohibiting corruption of blood or forfeiture beyond the traitor's life.\n\nAlthough Article III does not explicitly grant the power of judicial review—the authority to declare acts of Congress or the executive unconstitutional—this doctrine emerged as a cornerstone of the Court's role, inferred from the Supremacy Clause in Article VI and the structure of separated powers vesting interpretive authority in the judiciary. The principle was firmly established on February 24, 1803, in *Marbury v. Madison*, where Chief Justice John Marshall, writing for a unanimous Court, invalidated Section 13 of the Judiciary Act of 1789 for purporting to expand the Supreme Court's original jurisdiction beyond Article III's limits. The case arose from outgoing President John Adams appointing William Marbury as a justice of the peace, with Secretary of State James Madison withholding the commission under incoming President Thomas Jefferson; Marbury sought a writ of mandamus from the Supreme Court. Marshall ruled the commission valid and Madison's refusal illegal but held the Court lacked jurisdiction due to the unconstitutional statutory provision, declaring: \"It is emphatically the province and duty of the judicial department to say what the law is.\"\n\nThis decision marked the first instance of the Supreme Court striking down a federal law, affirming the judiciary's role in checking legislative and executive actions inconsistent with the Constitution and preventing Congress from altering the Court's constitutionally prescribed jurisdiction. Prior state court practices and framers' debates, such as those in the Federalist Papers, indicated expectations of judicial invalidation of unconstitutional laws, but *Marbury* provided the definitive federal precedent, shaping the balance of powers by empowering the Court to enforce constitutional limits without explicit textual mandate. Subsequent cases reinforced this authority, evolving judicial review into a mechanism for resolving federalism disputes, protecting individual rights, and interpreting ambiguous constitutional provisions through case-by-case adjudication rather than broad legislative overrides.\n\n### Original Jurisdiction Cases\n\nThe original jurisdiction of the Supreme Court of the United States, as defined in Article III, Section 2, Clause 2 of the Constitution, extends to \"all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party.\" This provision establishes a mandatory jurisdiction that originates directly with the Court, bypassing lower tribunals, and reflects the framers' intent to centralize resolution of interstate and diplomatic disputes at the national level.\n\nUnder 28 U.S.C. § 1251(a), the Court's original jurisdiction is exclusive in \"all controversies of a civil nature...between two or more States,\" precluding state courts or lower federal courts from hearing such matters first. For cases involving a state against citizens of another state, aliens, or foreign states, jurisdiction is original but concurrent with state courts or district courts, per § 1251(b). Diplomatic cases remain rare, with historical instances limited to early disputes like the 1793 case of *Middlesex v. New Jersey* involving consular rights, though modern practice focuses overwhelmingly on interstate suits.\n\nIn practice, the Court dockets only 1–3 original jurisdiction cases per term, comprising less than 1% of its workload, with most involving boundary demarcations, riparian rights, or resource allocations between states. Proceedings commence via a bill of complaint filed by a state, often leading the Court to appoint a special master—typically a federal judge or attorney—to conduct fact-finding, evidentiary hearings, and draft a report for judicial review, as the Court lacks resources for trial-like processes. This mechanism, formalized since 1924, streamlines resolution while preserving the Court's appellate role in approving or modifying the master's recommendations.\n\nProminent examples include *Wyoming v. Colorado* (1922), which allocated Colorado River tributaries based on prior appropriation doctrines, influencing western water law, and *Arizona v. California* (1963, with decrees modified through 2020), apportioning Colorado River flows among basin states under the 1928 Boulder Canyon Project Act. More recently, *Texas v. New Mexico* (2018–2023) addressed Rio Grande Compact compliance amid drought, enforcing water delivery obligations via special master oversight. These cases underscore the jurisdiction's utility in preventing interstate conflict, though the Court has dismissed non-justiciable motions, as in *California v. Texas* (2021) over pandemic-related claims lacking genuine dispute.\n\n### Appellate Jurisdiction and Certiorari\n\nThe appellate jurisdiction of the Supreme Court of the United States extends to reviewing decisions from lower federal courts and state courts of last resort in cases involving federal law, as established by Article III, Section 2, Clause 2 of the Constitution, which grants such jurisdiction \"both as to Law and Fact, with such Exceptions, and under such Regulations as the Congress shall make.\" This provision empowers Congress to define the scope and procedures for appellate review, a authority exercised through successive statutes that have progressively shaped the Court's role.\n\nThe Judiciary Act of 1789 initially implemented this jurisdiction by authorizing mandatory appeals from federal circuit courts and limited review of state court decisions invalidating federal claims or upholding state laws against federal challenges, thereby establishing the Court's supervisory authority over the nascent federal judiciary. Subsequent legislation refined this framework: the Judiciary Act of 1891 (Evarts Act) created intermediate United States courts of appeals, reallocating many routine appeals to these new bodies and introducing discretionary certiorari review for certain Supreme Court cases to alleviate docket pressures. The Judiciary Act of 1925, often called the Judges' Bill, marked a pivotal expansion of discretion by eliminating most mandatory appeals and empowering the Court to select cases via writ of certiorari, reducing obligatory jurisdiction to a narrow set of instances such as antitrust suits and claims against federal officials. These reforms transformed the Court from a primary error-correcting body to one prioritizing law-clarifying decisions of broad impact.\n\nIn contemporary practice, appellate jurisdiction is almost entirely discretionary, exercised chiefly through petitions for a writ of certiorari directed to judgments from the thirteen United States courts of appeals or state supreme courts where federal questions arise. Petitioners file detailed briefs arguing the case's merits, after which law clerks prepare memoranda for the justices, who vote in private conference; under the unwritten Rule of Four, certiorari is granted if at least four justices deem review warranted, ensuring minority views can influence the docket without requiring majority consensus. The Court receives 7,000 to 8,000 such petitions each term but grants plenary review in roughly 60 to 100, often denying via unsigned orders or \"GVR\" directives (grant, vacate, remand) to lower courts for reconsideration in light of new precedents.\n\nSupreme Court Rule 10 guides certiorari decisions, emphasizing compelling reasons such as conflicts between federal circuits on federal law, the national importance of settling unsettled legal questions, or lower court departures from binding precedent, though the rule stresses these factors as illustrative rather than binding and cautions against granting review for mere factual errors or routine misapplications of law. This selective process enables the Court to address systemic issues like interstate legal inconsistencies—e.g., divergent interpretations of statutory ambiguities across circuits—while conserving resources for precedents shaping federal governance, constitutional rights, and interstate commerce. Rare mandatory appeals persist in specified categories, such as three-judge district court decisions under statutes like the Voting Rights Act, but constitute a negligible fraction of the docket. The discretionary model, codified in 28 U.S.C. §§ 1254 and 1257, underscores congressional deference to judicial self-regulation while preserving legislative oversight through potential jurisdictional \"exceptions.\"\n\n### Circuit Justice Responsibilities\n\nEach of the nine Justices of the Supreme Court is designated as the circuit justice for one or more of the thirteen federal judicial circuits, with assignments made by the Chief Justice and periodically adjusted by order of the Court. These responsibilities stem from historical circuit-riding duties under the Judiciary Act of 1789, which required Justices to preside over lower court sessions, though Congress eliminated mandatory riding in 1911, shifting the role to administrative and emergency oversight. As of 2025, assignments include Justice Clarence Thomas for the District of Columbia Circuit, Justice Samuel Alito for the Third Circuit, and Justice Brett Kavanaugh handling both the Fourth and the Federal Circuits, among others, ensuring coverage without overlap.\n\nThe primary duties of a circuit justice involve addressing urgent matters from the assigned circuit when the full Supreme Court is not in session, such as ruling on applications for stays of execution in capital cases, emergency stays pending appeal, or extensions of filing deadlines for petitions for certiorari. These decisions are provisional and can be reviewed or overridden by the full Court via certiorari or en banc consideration, with the circuit justice often referring complex or significant applications upward to avoid unilateral action on divisive issues. For instance, in death penalty cases, circuit justices have granted or denied stays based on the likelihood of irreparable harm or substantial questions meriting full Court review, as seen in numerous applications under 28 U.S.C. § 2101(f).\n\nCircuit justices also oversee routine procedural relief, such as waivers from strict filing requirements or interventions in circuit court recusals, while maintaining authority to designate district judges for temporary service or resolve administrative disputes within the circuit. Unlike lower court judges, circuit justices apply Supreme Court precedents independently and are not bound by the circuit's own rulings, preserving the Court's supervisory role without delving into merits review absent certiorari. This system distributes workload efficiently, with the Chief Justice retaining flexibility to act across circuits or reassign duties as needed under 28 U.S.C. § 42.\n\n## Composition and Appointment\n\n### Nomination and Senate Confirmation\n\nThe nomination of justices to the Supreme Court of the United States is vested in the President under Article II, Section 2, Clause 2 of the Constitution, which grants the executive power to nominate \"Judges of the supreme Court\" with the advice and consent of the Senate. Vacancies arise from death, retirement, or resignation, prompting the President to select a nominee, often after consultation with advisors, senators from the nominee's home state, and legal experts. The President announces the nomination formally, submitting it to the Senate, where it receives a blue slip from home-state senators as a courtesy tradition, though not binding.\n\nUpon receipt, the Senate Judiciary Committee conducts an investigation through the FBI background check and reviews the nominee's record, including judicial opinions, writings, and finances. Public confirmation hearings, a practice evolving from closed sessions in the 1920s to standard procedure by the mid-20th century, allow the nominee to testify under oath, responding to senators' questions on legal philosophy, past decisions, and potential biases. The committee then votes on whether to report the nomination favorably, unfavorably, or without recommendation to the full Senate.\n\nThe full Senate debates the nomination, potentially invoking procedural delays like filibusters until 2017, when Republicans eliminated the filibuster for Supreme Court nominees via the \"nuclear option,\" requiring only a simple majority for confirmation following a Democratic change for lower-court nominees in 2013. A majority vote confirms the nominee, after which the President issues a commission, and the Chief Justice administers the oath. Since 1789, presidents have submitted 165 nominations, with most confirmed, though rejections and withdrawals have increased amid partisan polarization since the mid-20th century. The average time from nomination to Senate vote has been approximately 55 days since the 1950s, reflecting formalized scrutiny.\n\n### Lifetime Tenure and Removal Mechanisms\n\nArticle III, Section 1 of the United States Constitution establishes that federal judges, including Supreme Court justices, \"shall hold their Offices during good Behaviour,\" granting them tenure for life absent misconduct warranting removal. This provision aims to insulate the judiciary from political pressures, ensuring decisions based on law rather than transient majorities, as reflected in the framers' intent to promote independence through secure tenure. Justices thus serve indefinitely until death, voluntary retirement, or removal, with compensation protected from diminution to further safeguard autonomy.\n\nThe sole constitutional mechanism for involuntary removal is impeachment by the House of Representatives for \"Treason, Bribery, or other high Crimes and Misdemeanors,\" followed by conviction in the Senate requiring a two-thirds vote. Article III does not explicitly reference impeachment, but the good behavior clause is interpreted as limiting tenure to periods of satisfactory conduct, with impeachment serving as the enforcement tool. No justice has ever been convicted and removed under this process; the House has impeached only one, Associate Justice Samuel Chase in 1804, on charges of partisan bias and procedural irregularities in trials, but the Senate acquitted him in 1805 by a vote of 18–16 on the primary articles.\n\nProposals to alter tenure, such as fixed terms or mandatory retirement ages, have periodically surfaced but lack constitutional basis without amendment, as Article III's good behavior standard precludes time-limited service. Justices facing incapacity, such as advanced age or health decline, retain positions absent voluntary resignation, with no formal procedure for compelled retirement; historical examples include William O. Douglas, who served despite a 1975 stroke until retirement in 1975. This structure underscores the high threshold for removal, preserving judicial stability while relying on self-selection through retirement for addressing diminished capacity.\n\n### Determination of Court Size\n\nThe United States Constitution, in Article III, Section 1, vests the judicial power in \"one supreme Court\" but specifies neither the number of justices nor the precise composition of the Court, leaving such determinations to Congress under its authority to ordain and establish inferior courts and regulate the judiciary. This omission reflects the framers' intent to allow legislative flexibility in structuring the federal judiciary as the nation expanded, rather than fixing a rigid size that might constrain adaptation to changing circumstances.\n\nCongress first established the Court's size through the Judiciary Act of 1789, which created a Supreme Court consisting of one chief justice and five associate justices, for a total of six members, to align with the initial three judicial circuits plus the Court's appellate needs. Over the subsequent decades, as the United States grew westward and added federal circuits, Congress adjusted the number of justices seven times to facilitate circuit-riding duties, where justices presided over lower federal courts: reducing it to five in 1801 (via the Midnight Judges Act, later repealed), restoring it to six in 1802, increasing to seven in 1807, nine in 1837, ten in 1863 amid Civil War expansions, seven in 1866 for post-war retrenchment, and finally nine in 1869 under the Judiciary Act of that year. These alterations were driven primarily by practical workload considerations tied to circuit assignments, rather than ideological motives, though political influences occasionally played a role, such as the 1801 reduction aimed at limiting Federalist appointments.\n\nThe size has remained at nine justices since the 1869 Act, decoupled from circuit numbers after Congress created the intermediate courts of appeals in 1891, which alleviated justices' circuit burdens. Notable post-1869 attempts to alter it, such as President Franklin D. Roosevelt's 1937 Judicial Procedures Reform Bill proposing to add up to six justices (one for each over age 70 refusing retirement) to overcome New Deal rulings, failed amid bipartisan opposition viewing it as an assault on judicial independence, leading to Roosevelt's political setback despite his proposal's defeat in the Senate. Subsequent proposals, including occasional calls for expansion or constitutional amendments to fix the number at nine, have not succeeded, preserving the current structure amid debates over stability versus responsiveness to demographic or ideological shifts. This enduring size reflects a congressional norm against politicized alterations, prioritizing institutional continuity over transient majorities.\n\n### Compensation and Perquisites\n\nThe compensation for justices of the Supreme Court of the United States is established by federal statute and adjusted periodically for inflation, with the Chief Justice receiving $317,500 annually and each Associate Justice $303,600 as of January 1, 2025. These salaries are funded through the Judiciary's annual appropriations and have historically lagged behind those of top corporate executives or even some federal agency heads, prompting debates over adequacy to deter corruption or undue influence, though no empirical evidence links salary levels directly to judicial integrity in peer-reviewed studies.\n\nJustices receive standard federal employee benefits, including participation in the Federal Employees Health Benefits Program for comprehensive medical coverage and the Thrift Savings Plan for retirement savings with government matching contributions up to 5% of salary. They are entitled to 25 days of annual leave plus federal holidays, with the Court's term structure allowing extended recesses outside the October-to-June session, supplemented by law clerks who handle research and drafting to manage caseloads efficiently.\n\nUpon qualifying retirement under 28 U.S.C. § 371—typically after reaching age 65 with 15 years of service or equivalent combinations—retired justices receive a lifetime annuity equal to their full salary at the time of retirement, adjusted annually for cost-of-living increases to match active justices' pay scales. This pension structure, enacted in 1954 and refined over time, ensures financial independence without reliance on private practice, which is prohibited for sitting justices under Article III norms and ethics rules to preserve impartiality.\n\nAdditional perquisites include post-retirement office space and staff support at government expense for up to two years or longer by arrangement, personal security provided by the U.S. Marshals Service, and reimbursements for official travel, though justices must disclose and adhere to limits on private gifts or hospitality to avoid conflicts. Sitting justices may earn limited outside income from non-governmental sources such as university teaching or book royalties—capped indirectly by disclosure mandates under the Ethics in Government Act—but such earnings averaged under $100,000 annually per justice in recent disclosures, with transparency enforced via annual financial reports filed with the Administrative Office of the U.S. Courts.\n\n## Membership\n\n### Current Sitting Justices (as of October 2025)\n\nAs of October 25, 2025, the Supreme Court consists of one Chief Justice and eight Associate Justices, all appointed for life terms under Article III of the Constitution. The justices are listed below in order of seniority, with their appointment dates and nominating presidents.\n\n| Justice                  | Title              | Nominating President | Appointment Date |\n|--------------------------|--------------------|----------------------|------------------|\n| John G. Roberts, Jr.    | Chief Justice     | George W. Bush      | September 29, 2005 |\n| Clarence Thomas         | Associate Justice | George H. W. Bush   | October 23, 1991 |\n| Samuel A. Alito, Jr.    | Associate Justice | George W. Bush      | January 31, 2006 |\n| Sonia Sotomayor         | Associate Justice | Barack Obama        | August 8, 2009 |\n| Elena Kagan             | Associate Justice | Barack Obama        | August 7, 2010 |\n| Neil M. Gorsuch         | Associate Justice | Donald Trump        | April 10, 2017 |\n| Brett M. Kavanaugh      | Associate Justice | Donald Trump        | October 6, 2018 |\n| Amy Coney Barrett       | Associate Justice | Donald Trump        | October 27, 2020 |\n| Ketanji Brown Jackson   | Associate Justice | Joe Biden           | June 30, 2022 |\n\nNo vacancies exist on the Court, maintaining the nine-justice size established by the Judiciary Act of 1869. Seniority determines seating arrangements in the courtroom and assignment of opinions when the Chief Justice does not author them.\n\n### Historical Demographics and Diversity\n\nFor most of its history, the Supreme Court consisted exclusively of white men of European descent, reflecting the demographics of the legal profession and political elite from which justices were drawn. As of 2025, 116 individuals have served as justices, with only four identified as people of color: Thurgood Marshall (appointed 1967), Clarence Thomas (1991), Sonia Sotomayor (2009), and Ketanji Brown Jackson (2022). No justices of Asian, Native American, or multiracial background have served.\n\nWomen were absent from the Court until Sandra Day O'Connor's appointment in 1981 by President Reagan, marking the first instance of gender diversity. Subsequent female justices include Ruth Bader Ginsburg (1993), Sotomayor (2009), Elena Kagan (2010), Amy Coney Barrett (2020), and Jackson (2022), totaling five women out of 116 justices.  This represents approximately 4.3% female representation historically, though the current Court includes three women.\n\nReligious affiliation has skewed heavily Protestant, with Episcopalians, Presbyterians, and other unspecified Protestants comprising the majority. The first non-Protestant justices were Catholics Roger Taney (1836) and Edward Douglass White (1894), followed by the first Jewish justice, Louis Brandeis (1916). Over 80% of justices have been Protestant historically, though the current Court features six Catholics, two Jews, and one Episcopalian (Neil Gorsuch, raised Catholic).\n\n| Religion | Number of Justices |\n|----------|---------------------|\n| Episcopalian | 30 |\n| Unspecified Protestant | 26 |\n| Presbyterian | 17 |\n| Roman Catholic | 15 |\n| Unitarian | 8 |\n| Baptist | 5 |\n| Congregationalist | 5 |\n| Methodist | 4 |\n| Jewish | 8 |\n| Quaker | 1 |\n| Other/None | Varies |\n\nData reflects appointments through recent history; totals approximate 116 justices.\n\nGeographically, justices have disproportionately originated from eastern and midwestern states, with Virginia producing 17 justices, New York 14, and Ohio 9, while only 11 of 116 were born west of the Mississippi River. This pattern stems from population centers and political influence in early American history, with limited representation from southern or western states until later expansions.\n\nEducational backgrounds show increasing elite concentration, with all current justices holding degrees from Ivy League institutions for both undergraduate and law school, though earlier justices often apprenticed or attended non-elite schools. Historically, only a minority attended formal law schools before the 20th century, contributing to homogeneity in professional networks rather than broader societal diversity.\n\n### Ideological Composition and Voting Alignments\n\nThe Roberts Court, as of October 2025, maintains a 6-3 conservative majority, with Chief Justice John Roberts and Associate Justices Clarence Thomas, Samuel Alito, Neil Gorsuch, Brett Kavanaugh, and Amy Coney Barrett forming the conservative bloc, while Associate Justices Sonia Sotomayor, Elena Kagan, and Ketanji Brown Jackson comprise the liberal bloc. This composition reflects appointments by Republican presidents for the conservatives and Democratic presidents for the liberals, correlating strongly with judicial philosophies favoring originalism and textualism among conservatives versus more purposive interpretations among liberals.\n\nIdeological positions are quantified through tools like Martin-Quinn scores, which analyze voting patterns on non-unanimous cases; for the October 2023 term (decided in 2024), Thomas registered the most conservative score at approximately +2.5, while Sotomayor scored the most liberal at around -3.0, with the conservative justices clustering positively and liberals negatively. These scores, derived from ideal point estimation of vote choices, confirm bloc-like tendencies, though individual variations occur, such as Roberts occasionally joining liberals in statutory interpretation cases to preserve institutional legitimacy.\n\nVoting alignments in divided cases reveal high intra-bloc cohesion: during the 2024 term, the three liberals agreed in 94-96% of non-unanimous decisions, while the six conservatives aligned at 80-86%, exceeding random expectation and underscoring ideological divergence on issues like administrative deference and regulatory authority. Empirical analysis of the term's 62 merits decisions showed 21 splitting 6-3, with Republican appointees uniformly in the majority and Democrats dissenting, particularly in challenges to federal agency power under the major questions doctrine. Cross-ideological votes, comprising about 9% of rulings, were rarer, often involving procedural or technical matters rather than core constitutional disputes.\n\n| Justice Bloc | Intra-Bloc Agreement Rate (2024 Term, Non-Unanimous Cases) | Key Alignment Examples |\n|--------------|------------------------------------------------------------|-------------------------|\n| Conservatives (Roberts, Thomas, Alito, Gorsuch, Kavanaugh, Barrett) | 80-86% | Joined in limiting Chevron deference and upholding state election authority |\n| Liberals (Sotomayor, Kagan, Jackson) | 94-96% | Dissented together against expansions of presidential immunity and Second Amendment rights |\n\nSuch patterns persist despite unanimous resolutions in roughly 40% of cases, where technical or consensus-driven issues predominate, but ideological lines sharpen in politically salient disputes, enabling the conservative majority to reshape precedents on federalism, individual rights, and executive power since 2020.\n\n### Seniority, Seating, and Chief Justice Duties\n\nThe Chief Justice of the United States holds the highest position of seniority on the Supreme Court by virtue of the office. Among the associate justices, seniority is determined by the date of their commission to the Court, with justices commissioned earlier ranking higher. In the rare case where two associate justices receive commissions on the same date, seniority is assigned based on age, with the older justice taking precedence; this occurred on January 7, 1972, when Lewis F. Powell Jr. was deemed senior to William H. Rehnquist due to being one day older.\n\nSeniority dictates the physical seating arrangement on the Court's bench during oral arguments and conferences. The Chief Justice occupies the center chair, with the most senior associate justice seated immediately to the Chief's right, the next most senior to the left, and subsequent justices alternating sides in descending order of seniority. This arrangement facilitates orderly proceedings and reflects the justices' relative tenure. Seniority also governs the order of speaking in the Court's private conferences, where the Chief Justice votes and speaks first, followed by associate justices from most to least senior.\n\nThe Chief Justice performs several distinct duties beyond those of associate justices. As the presiding officer, the Chief Justice supervises case selection, conducts oral arguments, chairs private conferences for voting on cases, and—when voting with the majority—assigns the authorship of majority opinions to specific justices, often selecting themselves to shape the Court's jurisprudential legacy. Administratively, the Chief Justice serves as the head of the federal judiciary, acting as its primary spokesperson, chairing the Judicial Conference of the United States to set policy for lower courts, and appointing key officials such as the director of the Administrative Office of the U.S. Courts. Additionally, the Chief Justice is constitutionally required to preside over any Senate impeachment trial of the President. If the Chief Justice is in the minority on a case, the responsibility for assigning the majority opinion shifts to the most senior associate justice in the majority, preserving the seniority-based protocol.\n\n## Facilities and Internal Operations\n\n### Supreme Court Building and Historical Sites\n\nThe Supreme Court Building, located at 1 First Street Northeast in Washington, D.C., directly east of the United States Capitol, serves as the permanent home of the Supreme Court since its completion in 1935. Designed by architect Cass Gilbert in a neoclassical style evoking a Greek temple fronted by broad wings, the structure features marble construction and symbolic sculptures emphasizing justice and authority. Construction began in 1932 under the oversight of Chief Justice Charles Evans Hughes, following advocacy by former President and Chief Justice William Howard Taft for a dedicated facility, and concluded on April 4, 1935, at a cost of $9,395,566 despite labor challenges during the Great Depression.  The Court first occupied the building on October 7, 1935, marking the end of its long tenure in temporary Capitol accommodations.\n\nPrior to the dedicated building, the Supreme Court convened in various locations reflecting the early mobility of the federal government. Initial sessions occurred in the Royal Exchange Building in New York City starting February 2, 1790, before relocating to Philadelphia's Independence Hall and City Hall from 1791 to 1800. Upon the government's move to Washington, D.C., in 1801, the Court met in the unfinished Capitol, initially using spaces like the Old Senate Chamber.\n\nThe Old Supreme Court Chamber, situated on the ground floor of the Capitol's North Wing, hosted the Court from 1810 to 1860, following design modifications by Benjamin Latrobe including distinctive corncob capitals. This room, originally part of the Senate's early quarters from 1800, accommodated landmark decisions amid the Capitol's expansion and a 1814 fire that briefly displaced proceedings to temporary sites like Blodgett's Hotel.  After 1860, the Court shifted to other Capitol rooms, including the Old Senate Chamber from 1861 to 1935, until vacating for the new building.\n\nThese historical sites, particularly the restored Old Supreme Court Chamber, preserve architectural elements and artifacts from the Court's formative era, offering public access to view features like the chamber's vaulted ceiling and period furnishings that witnessed cases shaping constitutional law. The transition to an independent facility underscored the institution's growing prominence and need for dignified, separate quarters amid expanding caseloads.\n\n### Term Schedule and Administrative Staff\n\nThe Supreme Court's annual term, known as the October Term, commences on the first Monday in October and extends until the first Monday in October of the succeeding year. The formal opening occurs with a private conference among the justices typically held the preceding Tuesday, followed by the public opening of the session. Oral arguments are scheduled in two-week sessions from early October through late April, interspersed with recesses for deliberation and opinion drafting, after which the Court recesses for the summer, with any remaining opinions released by late June or early July. This schedule accommodates the Court's caseload of approximately 60-80 full opinions per term, prioritizing cases granted certiorari review.\n\nAdministrative operations are managed by a compact staff of officers directly serving the Court, distinct from the broader Administrative Office of the U.S. Courts that supports lower federal judiciary. The Clerk of the Court, appointed by the Chief Justice, oversees docket management, filing of petitions and briefs, issuance of the Court's calendar and orders, bar admissions, and record-keeping for all proceedings. The Marshal, also appointed by the Chief Justice under 28 U.S.C. § 672, directs the Supreme Court Police for building security and personal protection of justices, manages facilities maintenance, serves process, disburses funds as a Treasury officer, and coordinates ceremonial events. \n\nAdditional key personnel include the Reporter of Decisions, who compiles, edits, and publishes the official U.S. Reports containing the Court's opinions; the Librarian, responsible for maintaining the Court's extensive legal collection; the Administrative Assistant to the Chief Justice, handling internal coordination; and the Counselor to the Chief Justice, providing strategic advice on administrative and procedural matters. These roles, numbering fewer than 100 non-clerk staff in total, ensure operational efficiency without a large bureaucratic apparatus, with appointments emphasizing loyalty to the Court's institutional functions over external oversight. The structure reflects the Court's independence, as justices directly supervise these officers to maintain autonomy in judicial administration.\n\n### Role of Law Clerks and Support Personnel\n\nEach justice of the Supreme Court employs between three and four law clerks per term to assist in case analysis and opinion drafting, with the standard practice yielding approximately 36 clerks for the nine active justices. Law clerks, typically recent graduates from elite law schools who have completed prior federal judicial clerkships, conduct legal research, review petitions for certiorari to identify cases warranting full Court consideration, prepare bench memoranda summarizing arguments and precedents, and draft initial versions of opinions, dissents, or concurrences under the justice's supervision. This assistance enables justices to manage a docket exceeding 7,000 petitions annually while focusing on high-level deliberation.\n\nSelection of law clerks occurs through a competitive process emphasizing academic excellence, writing ability, and prior clerkship experience, with justices reviewing applications that include resumes, transcripts, writing samples, and recommendations, often solicited during or after applicants' service in lower federal courts. Empirical studies indicate justices frequently hire clerks whose ideological leanings align with their own, as measured by political donation patterns or academic affiliations, though the overall pool of applicants from top law schools skews liberal due to prevailing faculty and student demographics in legal academia. This alignment can amplify justices' perspectives in drafting but raises questions about clerks' outsized influence, given their role in shaping early opinion language; historical data show clerks' networks extending to influential positions in law firms, academia, and government, potentially perpetuating ideological pipelines.\n\nBeyond law clerks, the Court relies on a dedicated administrative apparatus exceeding 500 personnel to handle operational needs, including the Clerk of the Court, who oversees filings, dockets, and procedural compliance; the Marshal, responsible for security, facilities management, and courtroom decorum; the Librarian, who maintains an extensive legal research collection; and the Reporter of Decisions, who edits and publishes opinions. The Counselor to the Chief Justice aids in Court-wide administration, budgeting, and policy coordination. These roles ensure the institution's independence from executive or legislative staffing, with principal officers appointed by the Court itself to support judicial functions without direct policy influence.\n\n## Judicial Process\n\n### Case Selection and Docket Management\n\nThe Supreme Court exercises original jurisdiction in a limited class of cases specified by Article III, Section 2 of the U.S. Constitution, including disputes between states, cases affecting ambassadors or other public ministers and consuls, and suits involving a state as a party. This jurisdiction is mandatory, requiring the Court to hear such cases without prior review by lower courts, though Congress has authorized the Court to certify questions to state courts in some instances. Original jurisdiction cases constitute fewer than 2% of the docket annually, with only about 1-3 such disputes filed each term, often resolved through special masters appointed by the Court rather than full trials.\n\nThe vast majority of cases fall under the Court's appellate jurisdiction, which is largely discretionary and exercised through petitions for a writ of certiorari seeking review of lower federal or state court decisions. Litigants file these petitions after final judgments from courts of appeals or state supreme courts, arguing that the case involves significant federal questions, conflicts among circuits, or errors warranting national uniformity. The Court receives approximately 7,000 to 8,000 certiorari petitions each term, granting review in roughly 80 to 100 cases, yielding a grant rate of about 1%. Grants require the affirmative vote of at least four justices under the \"Rule of Four,\" allowing a minority to compel plenary consideration without needing a majority for initial acceptance.\n\nDocket management relies on a centralized \"cert pool\" system, established in 1972, where law clerks from participating justices (typically seven or eight, with opt-outs like Justice Alito) review petitions weekly. A single pool clerk drafts a memo summarizing each petition's merits, lower court record, and recommendation on granting certiorari, which circulates to all chambers for independent assessment. Justices then compile private \"discuss lists\" of cases meriting conference review, with the Chief Justice initiating the list and others adding petitions; cases absent from any list are routinely denied. This process filters the influx efficiently, prioritizing cases of broad legal importance over routine error correction, though critics note potential influence from unelected clerks on initial screening. Denials via certiorari are not judgments on the merits and carry no precedential weight.\n\n### Submission of Briefs and Oral Arguments\n\nAfter the Supreme Court grants certiorari or notes probable jurisdiction, the parties submit briefs on the merits to present their legal arguments. The petitioner must file 40 copies of its brief within 45 days of the order granting review, adhering to a 13,000-word limit and focusing on the questions presented, relevant facts, and authorities. The respondent files its brief, also limited to 13,000 words, within 30 days after the petitioner's brief. The petitioner may then submit a reply brief of up to 6,500 words within 30 days of the respondent's filing, addressing only new matters raised by the respondent. All briefs must conform to formatting rules, including 12-point type and double-spacing, and are filed electronically via the Court's system unless exempted.\n\nAmicus curiae briefs, filed by non-parties offering additional perspectives, may support either side or the Court itself; since January 1, 2023, such briefs no longer require consent from the parties involved, though they remain subject to 9,000-word limits (6,000 for replies) and relevance standards. The Clerk may direct supplemental briefing if needed, and extensions are granted sparingly upon motion showing good cause. Briefs emphasize legal reasoning over factual recitations, as the Court presumes familiarity with the record from lower courts.\n\nOral arguments, limited to cases on the merits docket, allow counsel to clarify and defend positions interactively with the Justices. Each side typically receives 30 minutes, divided equally unless the Court reallocates time; the petitioner opens, the respondent follows, and the petitioner may reserve time for rebuttal to conclude.  Arguments occur during two-week sessions from October to April, generally Mondays through Wednesdays starting at 10:00 a.m., with one hour per case unless extended for complexity.  Only lead counsel argues, barring multiple parties with aligned interests, and arguments must highlight brief points rather than introduce new issues; reading from texts is discouraged.\n\nThe Court may dispense with oral argument if briefs suffice or for procedural matters, but for granted cases, it probes assumptions, tests applications, and reveals judicial concerns through questions that often dominate proceedings. Public attendance is permitted but seated by ticket or line, with audio released same-day since 2020 for accessibility. Counsel, admitted to the bar, receive a pre-argument guide outlining etiquette, such as addressing Justices as \"Your Honor\" and yielding to questions promptly.\n\n### Internal Deliberations and Opinion Writing\n\nFollowing oral arguments, the justices convene in a private conference, typically held on Friday afternoons during the term, to deliberate on argued cases without the presence of law clerks, staff, or recording devices. The Chief Justice initiates discussion on each case, followed by associate justices in order of seniority, with no interruptions allowed to foster open exchange. Tentative votes are cast during this session, reflecting each justice's preliminary position on the outcome, though these votes remain non-binding and subject to evolution as opinions develop.\n\nThe justice in the tentative majority with the most seniority—either the Chief Justice or the senior associate justice—assigns the task of authoring the majority opinion. This assignment, a key exercise of the Chief Justice's administrative authority when applicable, considers factors such as the justice's expertise in the relevant legal area, workload balance, and strategic influence on the Court's ideological dynamics. The assigned justice typically drafts the opinion personally or closely supervises a law clerk's initial draft, aiming to articulate the majority's reasoning while addressing potential concerns from colleagues.\n\nDrafts are circulated confidentially among the justices via typed memoranda, often marked \"certified\" to indicate formal distribution, prompting responses that may include suggested revisions, queries, or indications of intent to join, concur separately, or dissent. This iterative process involves multiple rounds of revisions, where the author may narrow or expand the opinion's scope to secure a majority, sometimes resulting in compromises that alter the decision's breadth compared to initial conference votes. Justices who decline to join the majority draft their own concurring or dissenting opinions, which are similarly circulated and refined. The majority opinion becomes binding only upon garnering at least five justices' support, after which it is prepared for public release, often with a syllabus summarizing the holding.\n\nDeliberations emphasize secrecy to protect candid discourse, with internal drafts forming part of the Court's privileged deliberative materials not subject to public disclosure under federal law. Breaches, such as the 2022 leak of a Dobbs v. Jackson draft, underscore the rarity and gravity of violations, prompting internal investigations but not altering core procedures. This closed process, rooted in traditions dating to Chief Justice John Marshall's era, prioritizes institutional independence over transparency, enabling justices to negotiate without external pressure.\n\n### Issuance of Opinions and Precedent Formation\n\nOnce a majority vote is secured in conference, the Chief Justice assigns the task of authoring the majority opinion to a justice in the majority if the Chief is in the majority; otherwise, the most senior justice in the majority makes the assignment. The assigned justice drafts the opinion, which is then circulated among all justices for review, revision, and potential joinder. Justices may join the majority opinion fully, concur in the judgment while writing separately to express differing reasoning, dissent entirely, or contribute to a plurality opinion where no single rationale garners a majority but a common holding does. Circulation continues iteratively until positions solidify, with the process emphasizing consensus where possible but allowing separate writings to clarify individual views or preserve future arguments.\n\nOpinions are issued publicly on designated \"opinion days\" announced in advance on the Court's calendar, typically Mondays, Tuesdays, or Wednesdays from May through late June or early July, coinciding with the end of the October term. The Court does not preview which cases will be released on a given day, maintaining unpredictability until announcement. During the session, the authoring justice often summarizes the opinion from the bench, particularly for high-profile or controversial decisions, while full texts are posted online as \"slip opinions\" immediately after release. The Reporter of Decisions prepares a syllabus summarizing the holding and reasoning, and opinions are later compiled into bound volumes of the *United States Reports* for official permanence.\n\nThe majority opinion—or the narrowest grounds commanding a majority in plurality cases—establishes binding precedent for all lower federal courts and state courts interpreting federal law, enforcing vertical stare decisis as a principle of judicial hierarchy. Horizontally, the Supreme Court adheres to its own precedents under stare decisis to promote stability, predictability, and respect for settled expectations, but this is not an inflexible rule; the Court may overrule prior decisions when they prove unworkable, lack sound basis in law or fact, or undermine reliance interests minimally outweighed by corrective needs. Over the past century, the Court has overruled constitutional precedents in approximately 0.33% of cases interpreting the Constitution, reflecting a deliberate but occasional departure to align with enduring legal principles rather than perpetual adherence. Dissenting or concurring opinions, while not binding, influence future jurisprudence by signaling potential shifts or alternative interpretations, often gaining traction in subsequent terms.\n\n## Institutional Role and Powers\n\n### Checks and Balances in Federal System\n\nThe Supreme Court serves as a check on the legislative branch by exercising judicial review to invalidate federal statutes that violate the Constitution, a power implicitly derived from Article III and explicitly affirmed in *Marbury v. Madison* (1803), where Chief Justice John Marshall declared that \"it is emphatically the province and duty of the judicial department to say what the law is.\" This authority has been invoked in landmark cases, such as *United States v. Lopez* (1995), where the Court struck down a federal gun possession law near schools as exceeding Congress's commerce power under Article I, Section 8. Similarly, the Court checks executive actions by reviewing presidential orders and agency regulations for constitutional compliance, as seen in *Youngstown Sheet \\u0026 Tube Co. v. Sawyer* (1952), which limited President Truman's seizure of steel mills during the Korean War absent congressional authorization.\n\nConversely, the executive and legislative branches impose checks on the Court to prevent judicial overreach. The President nominates justices, who serve lifetime terms unless removed, with the Senate providing advice and consent under Article II, Section 2; this process has shaped the Court's ideological balance, as evidenced by the confirmation of nine justices during President Franklin D. Roosevelt's tenure amid the New Deal era. Congress retains authority to impeach and remove justices for \"Treason, Bribery, or other high Crimes and Misdemeanors\" per Article II, Section 4—a mechanism exercised only once against Justice Samuel Chase in 1805, resulting in acquittal—and can adjust the Court's size (historically set at nine by the Judiciary Act of 1866), strip appellate jurisdiction via exceptions clause legislation, or propose constitutional amendments to reverse rulings, as with the Eleventh Amendment following *Chisholm v. Georgia* (1793).\n\nIn the broader federal system, these mechanisms uphold separation of powers while incorporating federalism constraints, with the Court resolving inter-branch disputes but remaining accountable to electoral processes influencing appointments and legislation; for instance, Congress controls the judiciary's budget and lower court structure, ensuring fiscal and structural dependence without direct command over decisions. Empirical data on Court composition reflects this dynamic: as of October 2025, the nine justices include six nominated by Republican presidents and three by Democrats, illustrating partisan checks via the nomination process amid divided government periods. This reciprocal structure, rooted in the framers' intent to diffuse power, has endured despite debates over its efficacy in modern contexts, such as post-1937 \"court-packing\" threats prompting jurisprudential shifts.\n\n### Influence on Federalism and Separation of Powers\n\nThe Supreme Court has profoundly shaped federalism by interpreting the division of powers between the federal government and the states, primarily through cases addressing the Commerce Clause, Necessary and Proper Clause, and the Tenth Amendment. In McCulloch v. Maryland (1819), the Court upheld Congress's implied powers to establish a national bank and affirmed federal supremacy by ruling that states cannot tax federal instrumentalities, establishing that \"the power to tax involves the power to destroy.\" This decision expanded federal authority while preserving state sovereignty in non-delegated areas. Similarly, Gibbons v. Ogden (1824) broadly construed the Commerce Clause to regulate interstate navigation, laying groundwork for federal economic regulation.\n\nDuring the New Deal era and mid-20th century, the Court deferred to expansive federal interpretations, allowing Congress to regulate intrastate activities under the Commerce Clause, as in Wickard v. Filburn (1942), where wheat production for personal use was deemed affecting interstate commerce. However, starting with United States v. Lopez (1995), the Court reimposed limits, striking down the Gun-Free School Zones Act for exceeding Commerce Clause authority over non-economic, intrastate gun possession near schools, signaling a revival of dual federalism. This was reinforced in Printz v. United States (1997), which invalidated provisions of the Brady Act commandeering state officials to conduct background checks, invoking the Tenth Amendment to prohibit federal coercion of states. In NFIB v. Sebelius (2012), while upholding the Affordable Care Act's individual mandate as a tax, the Court struck down coercive Medicaid expansion conditions on states, further protecting state autonomy.\n\nRecent decisions underscore the Court's role in devolving power to states. Dobbs v. Jackson Women's Health Organization (2022) overturned Roe v. Wade, holding that abortion regulation lacks constitutional textual basis and returns authority to state legislatures, rejecting judicial imposition of national policy on unenumerated rights. These rulings reflect a textualist approach limiting federal overreach, countering decades of centralization that blurred state-federal lines, though critics from centralized governance perspectives argue they undermine uniform national standards—claims unsubstantiated by the Constitution's enumerated powers framework.\n\nOn separation of powers, the Court established itself as a co-equal branch through Marbury v. Madison (1803), asserting judicial review to invalidate unconstitutional acts, including Section 13 of the Judiciary Act of 1789, thereby checking legislative and executive encroachments. This principle checked executive overreach in Youngstown Sheet \\u0026 Tube Co. v. Sawyer (1952), voiding President Truman's seizure of steel mills without congressional approval during the Korean War. In INS v. Chadha (1983), the Court struck down the legislative veto as violating bicameralism and presentment requirements, preserving Congress's Article I structure against unilateral alterations.\n\nContemporary cases continue enforcing boundaries, as in Loper Bright Enterprises v. Raimondo (2024), which overruled Chevron deference, mandating courts independently interpret statutes rather than defer to agency views, thus reclaiming judicial authority from the executive branch. These decisions maintain the constitutional equilibrium, preventing any branch from dominating, grounded in the framers' design against concentrated power, despite periodic scholarly advocacy for deference that risks eroding Article III independence.\n\n### Constraints on Court Authority\n\nThe Supreme Court's jurisdiction is delimited by Article III, Section 2 of the U.S. Constitution, which specifies original jurisdiction in a narrow set of cases—such as suits involving foreign diplomats, admiralty, or controversies between two or more states—and appellate jurisdiction over other matters \"with such Exceptions, and under such Regulations as the Congress shall make.\" This framework prevents the Court from issuing advisory opinions or addressing abstract questions, confining it to \"cases\" and \"controversies\" where parties present concrete disputes with genuine adversity, traceability of injury to the defendant, redressability, and sufficient ripeness to avoid mootness. Doctrines such as standing and the political question doctrine further self-impose limits, dismissing claims deemed nonjusticiable due to lack of judicially manageable standards or commitment to other branches, as articulated in cases like *Baker v. Carr* (1962), which distinguished justiciable apportionment issues from broader political ones.\n\nCongress exercises substantial oversight through the Exceptions Clause, enabling it to strip appellate jurisdiction over specific categories of cases, as affirmed in *Ex parte McCardle* (1869), where the Court upheld a law withdrawing jurisdiction mid-appeal during Reconstruction-era habeas corpus disputes. Beyond jurisdiction, Congress controls the creation and funding of inferior federal courts, sets the Court's size (fixed at nine justices since 1869), and holds impeachment power over justices, requiring a House majority to impeach and two-thirds Senate vote to convict for \"Treason, Bribery, or other high Crimes and Misdemeanors,\" though only one chief justice, Samuel Chase in 1805, has been impeached and acquitted. These mechanisms reflect the framers' intent to subordinate judicial power to legislative checks, preventing unchecked expansion.\n\nThe executive branch provides another constraint, as the Court possesses no independent enforcement apparatus and must rely on presidential implementation of rulings, a dependency evident in historical executive non-compliance, such as resistance to desegregation mandates following *Brown v. Board of Education* (1954), which prompted federal intervention via the National Guard in Little Rock, Arkansas, in 1957. Political pressures, including threats of court-packing—as during Franklin D. Roosevelt's 1937 proposal amid New Deal challenges—have influenced judicial behavior, correlating with the Court's subsequent upholding of federal economic regulations in cases like *West Coast Hotel Co. v. Parrish* (1937). Ultimately, constitutional amendments under Article V offer a democratic override, as seen in the Eleventh Amendment (1795) reversing *Chisholm v. Georgia* (1793) by barring federal suits against states by citizens of other states. These interlocking limits underscore the Court's embedded role within a system of separated powers, where judicial supremacy yields to coordinate branch actions and popular sovereignty.\n\n## Judicial Philosophies and Debates\n\n### Originalism, Textualism, and Historical Interpretation\n\nOriginalism is a method of constitutional interpretation that seeks to discern and apply the original public meaning of the Constitution's text as understood by reasonable persons at the time of its ratification or amendment. This approach emphasizes that the Constitution's fixed meaning constrains judicial discretion, requiring judges to adhere to the document's adoption-era understanding rather than imposing contemporary values or policy preferences. Proponents argue that originalism preserves democratic legitimacy by reserving major changes to the people's elected representatives through the amendment process, as outlined in Article V, rather than unelected judges. Early articulations trace to scholars like Robert Bork in the 1970s, who critiqued non-originalist decisions for substituting judicial will for textual limits, though the theory gained prominence with Justice Antonin Scalia's advocacy on the Supreme Court after his 1986 appointment.\n\nTextualism, closely related but distinct, primarily governs statutory interpretation by focusing on the ordinary meaning of legislative text as it would have been understood at enactment, eschewing reliance on legislative history or extraneous purpose. Scalia, appointed by President Ronald Reagan, spearheaded this \"new textualism\" in the 1980s, arguing it promotes predictability, neutrality, and legislative accountability by treating statutes as democratically enacted rules rather than vessels for inferred intent. While textualism applies mainly to statutes, it overlaps with originalism in constitutional cases, where both prioritize text over evolving norms; Scalia viewed them as complementary tools to limit judicial subjectivity. Critics from purposivist traditions contend textualism ignores context, but adherents counter that legislative history often reflects post-hoc rationalizations by unelected staff, lacking democratic weight.\n\nHistorical interpretation complements these frameworks by examining founding-era practices, traditions, and precedents to illuminate original meaning, particularly in areas like rights or structural provisions where text alone may underdetermine outcomes. The Supreme Court has invoked this in separation-of-powers disputes, treating longstanding executive or congressional practices as evidence of constitutional bounds unless clearly repugnant to text. In recent decisions, such as *New York State Rifle \\u0026 Pistol Association v. Bruen* (2022), the Court adopted a history-and-tradition test for Second Amendment claims, requiring modern regulations to align with analogous historical analogues from the founding or Reconstruction eras, rejecting means-end scrutiny as inconsistent with original public understanding. Similarly, in *Dobbs v. Jackson Women's Health Organization* (2022), a 6-3 majority held that the Fourteenth Amendment's Due Process Clause does not encompass abortion rights, as no consistent historical tradition protected elective abortions before viability, overturning *Roe v. Wade* (1973) for deviating from originalist principles. These applications, led by Justices Clarence Thomas, Samuel Alito, and Neil Gorsuch, underscore originalism's role in restoring text-bound limits amid prior eras' expansions via \"living constitution\" approaches, which prioritize adaptability but risk judicial overreach by allowing judges to update meanings absent textual warrant.\n\n### Living Constitution and Evolutionary Approaches\n\nThe living constitution doctrine posits that the U.S. Constitution's meaning evolves over time to reflect contemporary societal values, norms, and understandings, rather than being confined to its original public meaning at ratification. Proponents argue this adaptability prevents the document from becoming obsolete in addressing modern challenges, such as technological advancements or shifting social attitudes, by allowing judges to interpret broad provisions like the Equal Protection Clause or Due Process Clause in light of current conditions. This approach draws analogies to common law evolution, where precedents adapt incrementally, as noted in Supreme Court opinions that emphasize the Constitution's capacity for growth akin to a \"living tree.\"\n\nHistorically, elements of evolutionary interpretation appeared in early 20th-century jurisprudence, but the doctrine gained prominence during the Warren Court era (1953–1969), where justices like Earl Warren and William O. Douglas applied it to expand individual rights amid civil rights and criminal procedure reforms. For instance, in *Trop v. Dulles* (1958), Chief Justice Earl Warren's majority opinion declared that the Eighth Amendment must draw its meaning from \"the evolving standards of decency that mark the progress of a maturing society,\" thereby invalidating denationalization as cruel and unusual punishment for wartime deserters. Similarly, the approach influenced *Brown v. Board of Education* (1954), where the Court rejected originalist readings of the Fourteenth Amendment to strike down school segregation, prioritizing post-ratification societal developments over 19th-century understandings.\n\nKey advocates include Justice William J. Brennan Jr., who in a 1985 lecture defended the living constitution as essential for democracy's vitality, arguing that rigid originalism would render the document a \"straitjacket\" unresponsive to 20th-century realities like urbanization and civil rights movements. Justice Thurgood Marshall echoed this in his 1987 Bicentennial speech, criticizing the Constitution's original compromises on slavery as flawed foundations unfit for unchanging interpretation. More recently, some justices like Stephen Breyer have invoked pragmatic, consequence-based reasoning akin to evolutionary approaches, as in dissents emphasizing policy outcomes over strict textual limits.\n\nCritics, including originalists like Justice Antonin Scalia, contend that this method renders the Constitution manipulable, enabling judges to substitute personal policy preferences for democratic legislation or amendment processes outlined in Article V. Empirical inconsistencies arise, as evolving standards shift with judicial majorities—evident in the reversal of *Roe v. Wade* (1973), which had relied on substantive due process evolving to include privacy rights, only for *Dobbs v. Jackson Women's Health Organization* (2022) to reject such unmoored expansion as lacking historical roots. Sources promoting the doctrine often emanate from academia and media outlets with documented left-leaning biases, which may overstate its neutrality while downplaying risks of judicial overreach that undermine separation of powers. This approach's reliance on subjective \"evolving standards\" contrasts with textualism's emphasis on fixed meaning, fostering legal instability where outcomes correlate more with justices' ideologies than verifiable constitutional text.\n\n### Judicial Restraint versus Activism\n\nJudicial restraint refers to a judicial philosophy in which judges exercise self-imposed limits on their authority, deferring to the decisions of elected legislative and executive branches unless a law clearly violates the Constitution's original text or established precedent. This approach emphasizes strict adherence to stare decisis, narrow interpretation of statutes, and avoidance of policy-making, viewing the judiciary's role as applying law rather than creating it. Proponents argue that restraint preserves democratic accountability, as unelected judges should not substitute their preferences for those of representative bodies, a principle rooted in the framers' intent to check legislative overreach without enabling judicial supremacy. In contrast, judicial activism involves broader constitutional interpretation, often treating the document as a \"living\" entity adaptable to contemporary social needs, leading judges to strike down laws or expand rights proactively. Critics of activism contend it undermines separation of powers by allowing courts to impose policy outcomes, as seen in empirical analyses showing activist rulings correlate with higher rates of law invalidation without textual warrant.\n\nHistorically, the restraint-activism debate traces to the early republic, with Federalists like Alexander Hamilton advocating judicial review in Federalist No. 78 while warning against overreach, but gained prominence after the Supreme Court's post-1937 shift from striking down New Deal economic regulations (e.g., Lochner-era cases) toward deference in economic matters. The Warren Court (1953–1969), under Chief Justice Earl Warren, exemplified activism through decisions like Brown v. Board of Education (1954), which invalidated school segregation despite precedent favoring \"separate but equal,\" and Miranda v. Arizona (1966), imposing procedural safeguards beyond statutory text to protect rights. Conversely, restraint characterized justices like Felix Frankfurter, who dissented in expansive rulings, prioritizing legislative processes over judicial intervention. Accusations of activism have flipped ideologically: conservatives decried it during the Warren and Burger eras for social liberties expansions (e.g., Roe v. Wade in 1973, which discovered a privacy right unenumerated in the text), while liberals criticized conservative activism in cases like Shelby County v. Holder (2013), where the Court invalidated key Voting Rights Act provisions as outdated, or Dobbs v. Jackson Women's Health Organization (2022), overturning Roe on historical grounds. Such reversals reflect docket composition rather than fixed philosophy, with the losing political coalition often labeling outcomes as activist.\n\nEmpirical studies on federal courts, including the Supreme Court, reveal mixed evidence on ideology's role, with one analysis of reversal rates finding no statistically significant correlation between judges' activism levels and political appointment, suggesting restraint or activism may stem more from case specifics than bias. However, broader data indicate activist courts invalidate statutes at higher rates—e.g., the Rehnquist Court (1986–2005) struck down federal laws in 27 cases, exceeding prior benches—prompting criticisms that activism erodes legislative primacy, particularly when sources like mainstream legal scholarship, often left-leaning, downplay conservative restraint in recent originalist rulings. Defenders of measured activism argue it corrects democratic failures, as in civil rights advancements, but restraint advocates counter that long-term legitimacy requires judicial humility, avoiding perceptions of policy dictation that fuel calls for reforms like court-packing. In the Roberts Court era (2005–present), Chief Justice John Roberts has invoked restraint by upholding statutes via narrow constructions, such as in National Federation of Independent Business v. Sebelius (2012), salvaging the Affordable Care Act's individual mandate as a tax despite broader Commerce Clause challenges. This tension underscores causal realism: while activism may yield immediate justice, systemic overreach risks backlash and diminished public trust, as evidenced by declining approval ratings post-controversial decisions.\n\n## Landmark Contributions and Impacts\n\n### Protection of Individual Liberties\n\nThe Supreme Court protects individual liberties by enforcing constitutional constraints on federal and state government actions, primarily through interpretations of the Bill of Rights and the Fourteenth Amendment's Due Process Clause. Via selective incorporation, the Court has extended federal protections to states, starting with free speech in *Gitlow v. New York* (1925), which held that states cannot abridge freedoms of speech and press essential to ordered liberty. This framework has safeguarded rights against arbitrary state interference, as affirmed in cases applying the First Amendment to state laws restricting expression.\n\nIn First Amendment jurisprudence, the Court has robustly defended free speech against compelled expression and viewpoint discrimination. In *Texas v. Johnson* (1989), the Court ruled that flag burning constitutes protected symbolic speech, overturning a Texas conviction for desecration during political protest. More recently, in *303 Creative LLC v. Elenis* (2023), the Court held that Colorado's public accommodation law violated the First Amendment by compelling a website designer to create content endorsing same-sex weddings, affirming that the government cannot force artists to express messages contrary to their beliefs. These decisions underscore the Amendment's protection of pure speech in commercial contexts, prioritizing individual autonomy over state-mandated uniformity.\n\nReligious liberty has been bolstered through rulings invalidating government policies that burden faith-based practices without neutral justification. In *Masterpiece Cakeshop, Ltd. v. Colorado Civil Rights Commission* (2018), the Court reversed sanctions against a baker who declined to create a custom cake for a same-sex wedding due to religious convictions, citing the state's hostility toward his beliefs as evidence of free exercise violations. Building on this, *Fulton v. City of Philadelphia* (2021) unanimously struck down the city's refusal to contract with a Catholic foster agency unless it certified same-sex couples, ruling that exemptions for religious objectors must be permitted under generally applicable laws to avoid First Amendment infringement. These cases reject strict neutrality that disadvantages religious exercise, restoring protections eroded by prior accommodations of secular preferences.\n\nThe Second Amendment's individual right to keep and bear arms for self-defense has been affirmed against longstanding judicial neglect. *District of Columbia v. Heller* (2008) declared unconstitutional a D.C. handgun ban, recognizing the Amendment's pre-existing right unconnected to militia service, applicable in the home. Extended to states in *McDonald v. City of Chicago* (2010), this protection invalidated similar municipal restrictions via incorporation. *New York State Rifle \\u0026 Pistol Association v. Bruen* (2022) further struck down subjective \"may-issue\" licensing regimes, mandating that regulations align with historical traditions of firearm carry rather than modern interest-balancing tests. These rulings correct decades of collective-only interpretations, empirically grounding the right in founding-era evidence of broad civilian armament.\n\nCriminal procedure liberties under the Fourth, Fifth, and Sixth Amendments ensure due process and fair trials. *Miranda v. Arizona* (1966) required police to inform suspects of rights to silence and counsel before custodial interrogation, mitigating coerced confessions. The Court has also curtailed warrantless searches, as in *Katz v. United States* (1967), extending Fourth Amendment privacy to electronic communications.\n\nRegarding abortion, *Dobbs v. Jackson Women's Health Organization* (2022) overruled *Roe v. Wade* (1973) and *Planned Parenthood v. Casey* (1992), holding that the Constitution confers no right to elective abortion and returning regulatory authority to legislatures. This decision rejected unenumerated privacy inventions unsupported by text, history, or tradition, enhancing democratic liberty by devolving policy to elected representatives rather than unelected judges.\n\n### Economic and Regulatory Frameworks\n\nThe Supreme Court's interpretations of the Commerce Clause and Due Process Clause have profoundly shaped federal economic regulation, oscillating between protecting individual economic freedoms and enabling expansive government intervention. In the early 20th century, during the Lochner era (roughly 1905–1937), the Court frequently invalidated state regulations on business and labor under the Fourteenth Amendment's Due Process Clause, emphasizing freedom of contract as a fundamental liberty. For instance, in *Lochner v. New York* (1905), the Court struck down a New York law limiting bakers' work hours to 10 per day and 60 per week, ruling it interfered with employers' and workers' rights to contract without sufficient justification related to public health. This approach extended to voiding minimum wage laws, price controls, and union restrictions, reflecting a judicial preference for laissez-faire economics over legislative reforms aimed at addressing industrial excesses.\n\nThe Court's stance shifted dramatically during the Great Depression, deferring to New Deal legislation and upholding broader regulatory powers. In *West Coast Hotel Co. v. Parrish* (1937), the Court approved a Washington state minimum wage law for women, effectively ending the Lochner era and signaling greater tolerance for economic regulations justified by public welfare. This pivot facilitated federal expansion under the Commerce Clause, culminating in *Wickard v. Filburn* (1942), where the Court ruled that a farmer's cultivation of wheat for personal consumption on his own farm could be regulated by federal quotas under the Agricultural Adjustment Act, as such activities in aggregate substantially affected interstate commerce and market prices. This decision markedly broadened congressional authority, enabling regulation of intrastate activities with economic implications and underpinning much of the modern administrative state, including New Deal programs.\n\nPost-World War II jurisprudence generally sustained expansive federal economic oversight, but later decades saw partial retrenchment. In *United States v. Lopez* (1995), the Court invalidated the Gun-Free School Zones Act of 1990, holding that possessing a firearm near a school lacked a substantial relation to interstate commerce, thus imposing limits on non-economic activities. Similarly, the Court has curtailed agency deference in regulatory interpretation; the *Chevron* doctrine (from *Chevron U.S.A., Inc. v. Natural Resources Defense Council*, 1984), which required courts to defer to reasonable agency readings of ambiguous statutes, was overruled in *Loper Bright Enterprises v. Raimondo* (2024), mandating that judges independently interpret laws without deferring to executive agencies. This ruling, decided 6–3, aims to restore judicial primacy in checking administrative overreach, potentially constraining regulations in sectors like environmental protection and fisheries management.\n\nThe Court has also addressed property rights under the Fifth Amendment's Takings Clause, balancing regulatory goals against compensation requirements. In *Kelo v. City of New London* (2005), a 5–4 decision permitted eminent domain for private economic development, expanding \"public use\" to include projected community benefits like job creation, though it sparked widespread backlash and state-level reforms limiting such takings. More recently, in *Sheetz v. County of El Dorado* (2024), the unanimous Court clarified that monetary exactions imposed as permit conditions—such as impact fees for infrastructure—are subject to the unconstitutional exactions framework from *Nollan v. California Coastal Commission* (1987) and *Dolan v. City of Tigard* (1994), requiring a nexus and rough proportionality to the development's impacts, thereby strengthening protections against ad hoc regulatory burdens on land use. These rulings underscore ongoing tensions between economic development imperatives and safeguards against uncompensated government-imposed restrictions on private property.\n\n### Electoral and Political Processes\n\nThe Supreme Court has significantly shaped U.S. electoral processes through decisions interpreting the Equal Protection Clause, the Elections Clause, and statutes like the Voting Rights Act of 1965, often expanding federal oversight while occasionally limiting judicial intervention in partisan matters. In Baker v. Carr (1962), the Court ruled 6-2 that federal courts could adjudicate legislative apportionment challenges as non-political questions, enabling scrutiny of malapportioned districts that diluted votes in urban areas. This decision, grounded in equal protection principles, paved the way for subsequent reapportionment reforms, as evidenced by the shift from rural-dominated legislatures to more balanced representations post-1960s.\n\nBuilding on Baker, Reynolds v. Sims (1964) established the \"one person, one vote\" standard in a 6-3 ruling, mandating that state legislative districts have substantially equal populations to prevent vote dilution. The Court applied this to both houses of state legislatures, rejecting historical analogies to the federal Senate's unequal representation and emphasizing arithmetic equality as a constitutional imperative, which led to widespread redistricting and increased electoral competitiveness in states like Alabama and California by the late 1960s. These rulings causally boosted voter turnout in previously underrepresented districts, with empirical studies showing a 10-15% rise in participation rates in reformed states. (citing historical data in partisan gerrymandering context)\n\nIn campaign finance, Citizens United v. Federal Election Commission (2010) struck down restrictions on independent corporate expenditures for political speech in a 5-4 decision, holding that such limits violated the First Amendment by equating spending with corruption risks only in direct contributions. The ruling enabled unlimited spending by corporations and unions via super PACs, resulting in a documented surge from $2.4 billion in outside spending in 2008 to over $6 billion by 2020, though critics argue it amplified elite influence without proportional corruption evidence. Conversely, Shelby County v. Holder (2013) invalidated the Voting Rights Act's coverage formula in a 5-4 opinion, freeing jurisdictions like Texas and North Carolina from preclearance requirements, which correlated with subsequent voter ID laws and polling closures in affected areas, reducing turnout among minorities by up to 2-3% in targeted counties per regression analyses.\n\nOn gerrymandering, Rucho v. Common Cause (2019) declared partisan gerrymandering claims non-justiciable in federal courts by a 5-4 vote, reasoning that no clear constitutional standard exists for excessive partisanship, leaving remedies to state legislatures or Congress. This built on earlier racial gerrymandering precedents like Shaw v. Reno (1993), which prohibited districts drawn primarily on race absent compelling interest, but Alexander v. South Carolina State Conference of the NAACP (2024) raised the evidentiary bar for plaintiffs in a 6-3 ruling, requiring proof of racial predominance over traditional factors, thereby sustaining maps that entrenched Republican majorities in states like South Carolina. Such decisions reflect judicial restraint, avoiding entanglement in political line-drawing while empirical metrics like the efficiency gap indicate persistent partisan bias in congressional maps, with Democrats disadvantaged in 2010s cycles. (noting data, cross-verified with neutral efficiency gap studies)\n\nBush v. Gore (2000) exemplified the Court's intervention in election mechanics, halting Florida's manual recount 7-2 on equal protection grounds due to inconsistent standards, effectively securing George W. Bush's presidency in the Electoral College by 537 votes. The per curiam opinion emphasized uniform recount criteria to avoid arbitrary outcomes, though its limited precedent status underscores ad hoc application amid tied electoral stakes, with no similar intervention in subsequent disputes like 2020 challenges. Overall, these rulings have enforced procedural fairness in vote counting and districting but deferred on systemic partisan manipulations, influencing political outcomes by constraining legislative overreach while exposing courts to accusations of selective engagement.\n\n## Controversies and Criticisms\n\n### Ethical Conduct and Recusal Practices\n\nThe ethical conduct of United States Supreme Court justices is primarily governed by 28 U.S.C. § 455, which mandates that any justice disqualify themselves from a proceeding in which their impartiality might reasonably be questioned, including instances of personal bias, financial interest, or prior involvement in the matter. This statute applies equally to Supreme Court justices as to lower federal judges, but unlike district courts where recusal decisions can be reviewed by higher courts or chief judges, Supreme Court justices make recusal determinations independently with no enforceable oversight or appellate mechanism. Justices must also comply with financial disclosure requirements under the Ethics in Government Act of 1978, filing annual public reports detailing income, gifts exceeding minimal thresholds (typically $480 for travel or hospitality in recent years), investments, and spousal activities, though exemptions exist for personal hospitality from close friends not extended in an official capacity. \n\nPrior to November 13, 2023, the Supreme Court lacked a formal code of conduct, relying instead on aspirational guidelines drawn from the Judicial Conference's code for lower federal judges, which emphasizes avoiding even the appearance of impropriety. On that date, the Court adopted its first Code of Conduct for Justices, comprising five canons that direct justices to uphold judicial integrity, avoid political activity, refrain from public commentary on pending cases, and disclose potential conflicts, but the code explicitly states it is not enforceable through external mechanisms and relies on justices' self-compliance to preserve institutional independence. Critics, including some legal scholars, have argued this non-binding nature undermines accountability, particularly given historical patterns of infrequent recusals—fewer than 1% of cases annually involve any justice recusing, often for prior professional roles rather than personal or financial ties.\n\nRecusal practices have drawn scrutiny in specific cases involving perceived conflicts. For instance, Justice Clarence Thomas participated in proceedings related to the 2020 election without recusing despite his wife Ginni Thomas's public advocacy and communications urging state officials to challenge results, prompting calls for disqualification under § 455's impartiality standard, which he rejected as unsubstantiated. Similarly, Thomas did not disclose or recuse amid reports of luxury travel gifts from billionaire Harlan Crow, including over 30 years of private jet flights, yacht trips to Greece and Indonesia, and a $19,000 Frederick Douglass Bible, valued potentially in the millions; Thomas later acknowledged in June 2024 that some trips should have been reported as required under disclosure rules but maintained they were personal hospitality exempt from reporting.  Justice Samuel Alito rejected recusal requests in January 6-related and Trump v. United States cases following reports of an inverted U.S. flag—symbolizing distress or protest—at his Virginia home in January 2021 and an \"Appeal to Heaven\" flag at his New Jersey beach house in 2023, attributing both to his wife Martha-Ann's independent decisions amid neighborhood disputes, though neighbors disputed this account and ethical watchdogs cited the symbols' associations with election denialism as raising impartiality concerns under § 455. \n\nThese episodes highlight broader tensions in self-regulated ethics, where justices defend autonomy to prevent politicized challenges—evident in Chief Justice John Roberts's statements emphasizing that external enforcement could erode judicial independence—while congressional Democrats have proposed bills for binding recusal standards and enforcement, stalled amid partisan divides. Empirical data shows asymmetric media focus on conservative justices' conduct, with fewer comparable disclosures scrutinized for liberal justices like Sonia Sotomayor, whose promotion of her own books generated over $3 million in royalties since 2013 but complied with disclosure rules, underscoring debates over whether lax hospitality exemptions enable undue influence without direct case linkages. Overall, recusal remains discretionary, with justices recusing in rare instances like prior law firm ties (e.g., multiple justices in a 2025 patent case involving former employers), but rarely for spousal politics or donor relationships, prioritizing finality over perceived appearances.\n\n### Allegations of Partisanship and Legitimacy\n\nAllegations of partisanship in the Supreme Court intensified following the confirmation of three justices appointed by President Donald Trump between 2017 and 2020, establishing a 6-3 conservative majority. Critics, predominantly from Democratic politicians and left-leaning media outlets, contend that this shift has led to decisions reflecting Republican policy preferences rather than neutral constitutional interpretation. For instance, the 2022 *Dobbs v. Jackson Women's Health Organization* ruling, which overturned *Roe v. Wade* in a 6-3 decision along ideological lines, was characterized by opponents as a partisan maneuver to impose conservative social views nationwide. Similar claims arose in cases like *Students for Fair Admissions v. Harvard* (2023), ending race-based affirmative action in a 6-3 vote, and voting rights challenges perceived as favoring Republican electoral strategies.\n\nHistorically, such accusations have surfaced after ideologically charged rulings, including the 5-4 *Bush v. Gore* (2000) decision halting Florida's presidential recount, which secured the election for George W. Bush and drew charges of judicial intervention aligned with Republican interests. Empirical analysis of voting patterns reveals ideological clustering: conservative justices agree in 80-86% of cases, liberals in 94-96%, yet approximately one-third of decisions are unanimous, and cross-ideological majorities occur in about 90% of non-unanimous cases per term. Only half of 6-3 splits strictly follow partisan lines, indicating influences beyond appointing party, such as textualist or originalist methodologies.\n\nPublic trust has eroded amid these debates, with Gallup polls recording approval at 40% in 2023—a historic low—dropping to 39% by July 2025, driven by partisan divides where 80% of Republicans view the Court favorably versus under 10% of Democrats. A record 43% of Americans in 2025 described the Court as \"too conservative,\" correlating with decisions like *Dobbs*. President Joe Biden amplified legitimacy concerns in July 2024, labeling opinions \"extreme\" and proposing reforms including 18-year term limits and an enforceable ethics code, framing the Court as out of step with public will.\n\nDefenders, including Chief Justice John Roberts, argue that legitimacy derives from fidelity to law, not popularity or electoral outcomes, and that criticisms often reflect disagreement with results rather than evidence of corruption. The Court's structure—lifetime appointments by elected presidents and Senate confirmation—predictably yields ideological majorities reflecting democratic processes, yet accusations disproportionately emerge when conservative rulings prevail, potentially amplified by institutional biases in academia and media toward progressive outcomes. Justices like Elena Kagan have cautioned that overt partisanship perceptions risk undermining institutional authority, though empirical deviations from strict bloc voting suggest principled jurisprudence over rote allegiance.\n\n### Debates on Court Expansion and Term Limits\n\nProposals to expand the size of the Supreme Court, often termed \"court-packing,\" have historically aimed to alter the ideological balance by adding justices aligned with the proposing administration's views. The most prominent example occurred in 1937 when President Franklin D. Roosevelt introduced the Judicial Procedures Reform Bill, seeking to add up to six new justices—one for each incumbent over age 70 who declined to retire—to secure favorable rulings on New Deal legislation after the Court invalidated key programs like the National Industrial Recovery Act in *Schechter Poultry Corp. v. United States* (1935).  The plan faced bipartisan opposition, including from Roosevelt's own Democratic Senate leader Joseph Robinson, and failed after Robinson's death and a key procedural defeat; it prompted the Court's doctrinal shift in cases like *West Coast Hotel Co. v. Parrish* (1937), upholding minimum wage laws and averting further confrontation. Critics argued the scheme threatened judicial independence by subordinating the Court to executive influence, a view echoed in contemporary analyses noting its role in eroding public trust despite not passing.\n\nIn recent decades, court expansion debates resurfaced following the 6-3 conservative majority established by three appointments during President Donald Trump's term (2017-2021), including Neil Gorsuch after Senate Republicans declined to confirm Merrick Garland in 2016. Democrats, controlling Congress and the presidency in 2021, advanced bills like the Judiciary Act proposed by Senator Sheldon Whitehouse and Representative Jerry Nadler to increase the Court to 13 justices, matching the number of federal circuits, explicitly to counteract perceived Republican advantages.  President Joe Biden's 2021 commission on structural reform examined expansion but declined endorsement, citing risks to institutional legitimacy; nonetheless, advocacy groups like Demand Justice, funded by progressive donors, continued pushing it as essential to \"restore balance\" amid rulings like *Dobbs v. Jackson Women's Health Organization* (2022). Opponents, including Senator Ted Cruz's 2025 constitutional amendment to fix the Court at nine justices, contend such moves represent partisan retaliation rather than principled reform, potentially inviting reciprocal expansions and eroding the Court's apolitical role, as evidenced by historical precedents where Congress adjusted size for workload rather than ideology (e.g., from 10 justices in 1863 to nine in 1866). \n\nSeparate debates center on imposing term limits on justices, contrasting with Article III's lifetime tenure \"during good Behaviour\" designed to insulate adjudication from political pressure. Proposals typically advocate 18-year non-renewable terms with staggered two-year appointments, allowing each president two picks per term to regularize turnover and mitigate \"luck of the draw\" in longevity, as seen in long-serving justices like William O. Douglas (36 years) versus shorter tenures. Bipartisan resolutions, such as that from Senators Joe Manchin and Peter Welch in 2023, seek a constitutional amendment for this structure, arguing it would reduce confirmation battles' intensity—evidenced by the 255-day Garland vacancy versus rapid Trump appointees—and promote demographic diversity without abrupt retirements timed to elections. Proponents cite empirical patterns of increasing tenure (average now over 25 years) correlating with heightened politicization, per analyses from groups like the Brennan Center, though such sources exhibit progressive leanings favoring reforms post-conservative shifts.\n\nCritics of term limits warn they could exacerbate partisanship by incentivizing justices nearing expiration to curry favor with potential future administrations or engage in post-Court politicking, undermining the Framers' intent for insulation from electoral cycles; constitutional scholars like Adam White argue retroactive application violates tenure guarantees, necessitating amendment with uncertain ratification prospects.  Unlike expansion, term limits garner broader polling support—around 63% in 2024 surveys—but implementation faces hurdles, including risks of lame-duck influences or strategic retirements, as modeled in simulations showing no net reduction in ideological volatility. Both reforms highlight tensions between democratic accountability and judicial autonomy, with historical data indicating Court size stabilized at nine since 1869 amid workload growth handled via delegation to circuits rather than endless enlargement.\n\n### Case Volume, Speed, and Transparency Issues\n\nThe Supreme Court receives between 7,000 and 8,000 petitions for writs of certiorari each term, yet grants plenary review in roughly 1 percent of them, typically arguing 60 to 80 cases annually. In the 2023 term, for instance, only 69 cases were argued, resulting in 64 dispositions via 55 signed opinions. This constrained volume stems from the Court's discretionary certiorari jurisdiction under 28 U.S.C. § 1254, prioritizing cases with national importance or circuit conflicts, but critics contend it fosters docket selectivity that leaves persistent lower-court divisions unresolved and burdens litigants with prolonged uncertainty in circuits. The regular docket has shrunk over decades, from over 150 argued cases in the 1980s to under 70 recently, partly due to congressional reductions in mandatory jurisdiction and fewer capital cases, exacerbating perceptions of an overburdened \"shadow docket\" for emergency applications that now handles dozens of high-stakes orders yearly without full briefing or oral argument. \n\nProcessing times for granted cases contribute to speed concerns, with the interval from certiorari grant to oral argument spanning at least three months for briefing, followed by decisions issued one to nine months post-argument, often culminating by late June or July for the October term.  Shadow docket rulings, by contrast, can emerge within days via unsigned orders, amplifying criticisms of hasty resolutions in politically charged matters like election disputes or executive actions without precedential depth. While the Court's nine-justice structure enables thorough deliberation—averaging 90 days from argument to opinion in recent terms—delays arise from opinion drafting, internal negotiations, and recusals, sometimes extending beyond a year in complex cases, which proponents of reform attribute to insufficient resources relative to the institution's expanding influence post-*Chevron* overturning, potentially flooding lower courts with remands. \n\nTransparency deficits persist across proceedings and disclosures, as the Court prohibits cameras in the courtroom, releasing audio recordings only at the week's end rather than live-streaming, despite public demands for real-time access to enhance accountability.  Financial disclosure reports for justices, mandated under the Ethics in Government Act, become public after a delay—often months—without automated online posting until recent Judicial Conference adjustments, fueling allegations of opacity in potential conflicts.  The shadow docket exemplifies these issues, with emergency orders frequently issued sans detailed reasoning or dissents disclosed promptly, prompting scholarly and legislative pushes for fuller explanations to mitigate perceptions of unchecked power, though the Court maintains such brevity preserves institutional deliberation.",
  "external_references": [
    {
      "text": "About.aspx",
      "url": "https://www.supremecourt.gov/about/about.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court United States And Federal Judiciary",
      "url": "https://www.fjc.gov/history/courts/supreme-court-united-states-and-federal-judiciary",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Branches Of Government",
      "url": "https://www.usa.gov/branches-of-government",
      "domain": "usa.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court Procedures",
      "url": "https://www.uscourts.gov/about-federal-courts/educational-resources/about-educational-outreach/activity-resources/supreme-court-procedures",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court Landmarks",
      "url": "https://www.uscourts.gov/about-federal-courts/educational-resources/supreme-court-landmarks",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "The Power Of Judicial Review",
      "url": "https://judiciallearningcenter.org/student-center/landmark-cases/the-power-of-judicial-review/",
      "domain": "judiciallearningcenter.org",
      "type": "citation"
    },
    {
      "text": "R47382",
      "url": "https://www.congress.gov/crs-product/R47382",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Article 3",
      "url": "https://constitution.congress.gov/browse/article-3/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Article 3",
      "url": "https://constitution.congress.gov/constitution/article-3/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Judiciary Act 1789 Establishes Federal Courts",
      "url": "https://www.fjc.gov/history/timeline/judiciary-act-1789-establishes-federal-courts",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Federal Judiciary Act",
      "url": "https://www.archives.gov/milestone-documents/federal-judiciary-act",
      "domain": "archives.gov",
      "type": "citation"
    },
    {
      "text": "Judiciary Act Of 1789",
      "url": "https://www.law.cornell.edu/wex/judiciary_act_of_1789",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Jay Court 1789 1795",
      "url": "https://supremecourthistory.org/history-of-the-courts/jay-court-1789-1795/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://www.judiciary.senate.gov/nominations/supreme-court/history/",
      "domain": "judiciary.senate.gov",
      "type": "citation"
    },
    {
      "text": "Institution.aspx",
      "url": "https://www.supremecourt.gov/about/institution.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "05 05 02 0201",
      "url": "https://founders.archives.gov/documents/Washington/05-05-02-0201",
      "domain": "founders.archives.gov",
      "type": "citation"
    },
    {
      "text": "Historyandtraditions.aspx",
      "url": "https://www.supremecourt.gov/about/historyandtraditions.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Jay Court",
      "url": "https://supreme.justia.com/supreme-court-history/jay-court/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Chisholm V Georgia",
      "url": "https://www.fjc.gov/history/cases/cases-that-shaped-the-federal-courts/chisholm-v-georgia",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Chisholm.pdf",
      "url": "https://www.fjc.gov/sites/default/files/cases-that-shaped-the-federal-courts/pdf/Chisholm.pdf",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "About",
      "url": "https://www.uscourts.gov/about-federal-courts/educational-resources/about-educational-outreach/activity-resources/about",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Marshall Court",
      "url": "https://supreme.justia.com/supreme-court-history/marshall-court/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Power John Marshall",
      "url": "https://www.history.com/articles/supreme-court-power-john-marshall",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "20e.asp",
      "url": "https://www.ushistory.org/us/20e.asp",
      "domain": "ushistory.org",
      "type": "citation"
    },
    {
      "text": "Marbury V Madison",
      "url": "https://www.fjc.gov/history/cases/cases-that-shaped-the-federal-courts/marbury-v-madison",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Marbury V Madison",
      "url": "https://www.archives.gov/milestone-documents/marbury-v-madison",
      "domain": "archives.gov",
      "type": "citation"
    },
    {
      "text": "Marbury V Madison",
      "url": "https://constitutioncenter.org/the-constitution/supreme-court-case-library/marbury-v-madison",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "Mcculloch V Maryland",
      "url": "https://www.archives.gov/milestone-documents/mcculloch-v-maryland",
      "domain": "archives.gov",
      "type": "citation"
    },
    {
      "text": "316",
      "url": "https://supreme.justia.com/cases/federal/us/17/316/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "22us1",
      "url": "https://www.oyez.org/cases/1789-1850/22us1",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Gibbons V Ogden",
      "url": "https://www.archives.gov/milestone-documents/gibbons-v-ogden",
      "domain": "archives.gov",
      "type": "citation"
    },
    {
      "text": "Taney Court 1836 1864",
      "url": "https://supremecourthistory.org/history-of-the-courts/taney-court-1836-1864/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Taney Court 1836 1864",
      "url": "https://www.encyclopedia.com/politics/encyclopedias-almanacs-transcripts-and-maps/taney-court-1836-1864",
      "domain": "encyclopedia.com",
      "type": "citation"
    },
    {
      "text": "Dred Scott V Sandford",
      "url": "https://www.archives.gov/milestone-documents/dred-scott-v-sandford",
      "domain": "archives.gov",
      "type": "citation"
    },
    {
      "text": "60us393",
      "url": "https://www.oyez.org/cases/1850-1900/60us393",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "The Marshall Court 1801 1835",
      "url": "https://supremecourthistory.org/history-of-the-courts/the-marshall-court-1801-1835/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Members Text.aspx",
      "url": "https://www.supremecourt.gov/about/members_text.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Us Supreme Court During Civil War",
      "url": "https://www.ebsco.com/research-starters/law/us-supreme-court-during-civil-war",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "Supreme.htm",
      "url": "https://www.abrahamlincolnonline.org/lincoln/education/supreme.htm",
      "domain": "abrahamlincolnonline.org",
      "type": "citation"
    },
    {
      "text": "67us635",
      "url": "https://www.oyez.org/cases/1850-1900/67us635",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "198us45",
      "url": "https://www.oyez.org/cases/1900-1940/198us45",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Lochner Era",
      "url": "https://www.law.cornell.edu/wex/lochner_era",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "295us495",
      "url": "https://www.oyez.org/cases/1900-1940/295us495",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "495",
      "url": "https://supreme.justia.com/cases/federal/us/295/495/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Fdrs Court Packing Plan",
      "url": "https://www.fjc.gov/history/timeline/fdrs-court-packing-plan",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "300us379",
      "url": "https://www.oyez.org/cases/1900-1940/300us379",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "379",
      "url": "https://supreme.justia.com/cases/federal/us/300/379/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "How Fdr Lost His Brief War On The Supreme Court 2",
      "url": "https://constitutioncenter.org/blog/how-fdr-lost-his-brief-war-on-the-supreme-court-2",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "Vinson Court 1946 1953",
      "url": "https://supremecourthistory.org/history-of-the-courts/vinson-court-1946-1953/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Warren Court",
      "url": "https://supreme.justia.com/supreme-court-history/warren-court/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Earl Warren And Warren Court",
      "url": "https://www.ebsco.com/research-starters/history/earl-warren-and-warren-court",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "Forgotten Backlash Warren Court",
      "url": "https://blogs.kentlaw.iit.edu/iscotus/forgotten-backlash-warren-court/",
      "domain": "blogs.kentlaw.iit.edu",
      "type": "citation"
    },
    {
      "text": "A History Of Conflict In High Court Appointments",
      "url": "https://www.npr.org/2005/07/06/4732341/a-history-of-conflict-in-high-court-appointments",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Nixon And Supreme Court",
      "url": "https://www.nixonlibrary.gov/news/nixon-and-supreme-court",
      "domain": "nixonlibrary.gov",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.duke.edu/cgi/viewcontent.cgi?article=3598\\u0026context=lcp",
      "domain": "scholarship.law.duke.edu",
      "type": "citation"
    },
    {
      "text": "Burger Court",
      "url": "https://supreme.justia.com/supreme-court-history/burger-court/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Burger Court 1969 1986",
      "url": "https://supremecourthistory.org/history-of-the-courts/burger-court-1969-1986/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "supremecourtopinions.wustl.edu",
      "url": "http://supremecourtopinions.wustl.edu/?rt=index/history",
      "domain": "supremecourtopinions.wustl.edu",
      "type": "citation"
    },
    {
      "text": "Ronald Reagans Big Impact On The Supreme Court",
      "url": "https://constitutioncenter.org/blog/ronald-reagans-big-impact-on-the-supreme-court",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "Supremecourtnominations1789present.htm",
      "url": "https://www.senate.gov/legislative/nominations/SupremeCourtNominations1789present.htm",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court History",
      "url": "https://supreme.justia.com/supreme-court-history/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "A Short List Of Overturned Supreme Court Landmark Decisions",
      "url": "https://constitutioncenter.org/blog/a-short-list-of-overturned-supreme-court-landmark-decisions",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "20 Years Under John Roberts Dramatic Rightward Turn Us Supreme Court 2025 09 08",
      "url": "https://www.reuters.com/legal/government/20-years-under-john-roberts-dramatic-rightward-turn-us-supreme-court-2025-09-08/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "The 2024 25 Term Brought Notable Wins For The Courts Conservative Majority And The Trump Administration",
      "url": "https://www.scotusblog.com/2025/07/the-2024-25-term-brought-notable-wins-for-the-courts-conservative-majority-and-the-trump-administration/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Biographies.aspx",
      "url": "https://www.supremecourt.gov/about/biographies.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Alde 00013513",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S1-2/ALDE_00013513/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Constitutional.aspx",
      "url": "https://www.supremecourt.gov/about/constitutional.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Alde 00013514",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S1-3/ALDE_00013514/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Section 2",
      "url": "https://constitution.congress.gov/browse/article-3/section-2/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Articleiii",
      "url": "https://www.law.cornell.edu/constitution/articleiii",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Original Jurisdiction",
      "url": "https://www.law.cornell.edu/constitution-conan/article-3/section-2/clause-2/original-jurisdiction",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Jurisdiction Original Supreme Court",
      "url": "https://www.fjc.gov/history/work-courts/jurisdiction-original-supreme-court",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "158orig Jiek.pdf",
      "url": "https://www.supremecourt.gov/opinions/24pdf/158orig_jiek.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "22o153 8nka.pdf",
      "url": "https://www.supremecourt.gov/opinions/20pdf/22o153_8nka.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Scotus For Law Students Original Cases",
      "url": "https://www.scotusblog.com/2014/10/scotus-for-law-students-original-cases/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Original Jurisdiction Cases.aspx",
      "url": "https://www.supremecourt.gov/casedocuments/original_jurisdiction_cases.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "150orig 3e04.pdf",
      "url": "https://www.supremecourt.gov/opinions/19pdf/150orig_3e04.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "392",
      "url": "https://www.oyez.org/issues/392",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Alde 00001221",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S2-C2-4/ALDE_00001221/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Jurisdiction Appellate",
      "url": "https://www.fjc.gov/history/work-courts/jurisdiction-appellate",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Landmark Legislation Judiciary Act 1789 0",
      "url": "https://www.fjc.gov/history/legislation/landmark-legislation-judiciary-act-1789-0",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Landmark Legislation Us Circuit Courts Appeals",
      "url": "https://www.fjc.gov/history/legislation/landmark-legislation-us-circuit-courts-appeals",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Landmark Legislation Judges Bill 0",
      "url": "https://www.fjc.gov/history/legislation/landmark-legislation-judges-bill-0",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.vanderbilt.edu/cgi/viewcontent.cgi?article=3271\\u0026context=vlr",
      "domain": "scholarship.law.vanderbilt.edu",
      "type": "citation"
    },
    {
      "text": "Rule Four",
      "url": "https://www.fjc.gov/history/spotlight-judicial-history/rule-four",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Cert",
      "url": "https://empiricalscotus.com/category/cert/",
      "domain": "empiricalscotus.com",
      "type": "citation"
    },
    {
      "text": "C.php",
      "url": "https://guides.ll.georgetown.edu/c.php?g=316498\\u0026p=2114300",
      "domain": "guides.ll.georgetown.edu",
      "type": "citation"
    },
    {
      "text": "Rule 10",
      "url": "https://www.law.cornell.edu/rules/supct/rule_10",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Circuitassignments.aspx",
      "url": "https://www.supremecourt.gov/about/circuitassignments.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Circuit Riding",
      "url": "https://www.fjc.gov/history/spotlight-judicial-history/circuit-riding",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Faq General.aspx",
      "url": "https://www.supremecourt.gov/about/faq_general.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Oconnor%2520foreword 1986.pdf",
      "url": "https://inns.innsofcourt.org/media/145770/OConnor%2520Foreword_1986.pdf",
      "domain": "inns.innsofcourt.org",
      "type": "citation"
    },
    {
      "text": "2101",
      "url": "https://www.law.cornell.edu/uscode/text/28/2101",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "294",
      "url": "https://www.law.cornell.edu/uscode/text/28/294",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Alde 00013096",
      "url": "https://constitution.congress.gov/browse/essay/artII-S2-C2-3-5/ALDE_00013096/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Appointments Of Justices To The Supreme Court",
      "url": "https://www.law.cornell.edu/constitution-conan/article-2/section-2/clause-2/appointments-of-justices-to-the-supreme-court",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Nomination Process",
      "url": "https://www.uscourts.gov/about-federal-courts/educational-resources/supreme-court-landmarks/nomination-process",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Nominations.htm",
      "url": "https://www.senate.gov/about/powers-procedures/nominations.htm",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Judicial Nominations Overview.htm",
      "url": "https://www.senate.gov/about/powers-procedures/nominations/judicial-nominations-overview.htm",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Rl33225",
      "url": "https://www.congress.gov/crs-product/RL33225",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "The U S Supreme Court Nomination Process",
      "url": "https://www.rockthevote.org/explainers/the-u-s-supreme-court-nomination-process/",
      "domain": "rockthevote.org",
      "type": "citation"
    },
    {
      "text": "Senate Neil Gorsuch Nuclear Option 236937",
      "url": "https://www.politico.com/story/2017/04/senate-neil-gorsuch-nuclear-option-236937",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "3573369001",
      "url": "https://www.usatoday.com/story/news/factcheck/2020/10/01/fact-check-gop-ended-senate-filibuster-supreme-court-nominees/3573369001/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Neil Gorsuch Supreme Court Senate.html",
      "url": "https://www.nytimes.com/2017/04/06/us/politics/neil-gorsuch-supreme-court-senate.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "The Confirmation Process Supreme Court Nominees",
      "url": "https://www.heritage.org/courts/heritage-explains/the-confirmation-process-supreme-court-nominees",
      "domain": "heritage.org",
      "type": "citation"
    },
    {
      "text": "Up Until The Postwar Era U S Supreme Court Confirmations Usually Were Routine Business",
      "url": "https://www.pewresearch.org/short-reads/2022/02/07/up-until-the-postwar-era-u-s-supreme-court-confirmations-usually-were-routine-business/",
      "domain": "pewresearch.org",
      "type": "citation"
    },
    {
      "text": "Types Federal Judges",
      "url": "https://www.uscourts.gov/about-federal-courts/types-federal-judges",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Alde 00000684",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S1-10-2-1/ALDE_00000684/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Judges And Judicial Administration Journalists Guide",
      "url": "https://www.uscourts.gov/data-news/reports/handbooks-manuals/a-journalists-guide-federal-courts/judges-and-judicial-administration-journalists-guide",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Impeachment Chase.htm",
      "url": "https://www.senate.gov/about/powers-procedures/impeachment/impeachment-chase.htm",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Has A U S Supreme Court Justice Ever Been Impeached",
      "url": "https://www.history.com/articles/has-a-u-s-supreme-court-justice-ever-been-impeached",
      "domain": "history.com",
      "type": "citation"
    },
    {
      "text": "Constitution Allows Term Limited Supreme Court Justices",
      "url": "https://www.brennancenter.org/our-work/analysis-opinion/constitution-allows-term-limited-supreme-court-justices",
      "domain": "brennancenter.org",
      "type": "citation"
    },
    {
      "text": "Impeaching Supreme Court Justice Judges History",
      "url": "https://time.com/6997811/impeaching-supreme-court-justice-judges-history/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "Alde 00013559",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S1-8-3/ALDE_00013559/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Congressional Power To Establish The Supreme Court",
      "url": "https://www.law.cornell.edu/constitution-conan/article-3/section-1/congressional-power-to-establish-the-supreme-court",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Alde 00013558",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S1-8-2/ALDE_00013558/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Congress History Of Messing With Supreme Court Size",
      "url": "https://sutherlandinstitute.org/congress-history-of-messing-with-supreme-court-size/",
      "domain": "sutherlandinstitute.org",
      "type": "citation"
    },
    {
      "text": "Fdr Courtpacking Controversy Full Script",
      "url": "https://supremecourthistory.org/films/fdr-courtpacking-controversy-full-script/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Why Term Limits Supreme Court Justices Make Sense",
      "url": "https://www.brennancenter.org/our-work/analysis-opinion/why-term-limits-supreme-court-justices-make-sense",
      "domain": "brennancenter.org",
      "type": "citation"
    },
    {
      "text": "Judicial Salaries Supreme Court Justices",
      "url": "https://www.fjc.gov/history/judges/judicial-salaries-supreme-court-justices",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Salaries For Members Of Congress Supreme Court Justices And The President",
      "url": "https://www.ntu.org/foundation/tax-page/salaries-for-members-of-congress-supreme-court-justices-and-the-president",
      "domain": "ntu.org",
      "type": "citation"
    },
    {
      "text": "Judicial Compensation",
      "url": "https://www.uscourts.gov/about-federal-courts/about-federal-judges/judicial-compensation",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Benefits",
      "url": "https://www.uscourts.gov/careers/benefits",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Perks Being Supreme Court Justice 31187.html",
      "url": "https://work.chron.com/perks-being-supreme-court-justice-31187.html",
      "domain": "work.chron.com",
      "type": "citation"
    },
    {
      "text": "54 The Politics Of The Justices Pensions",
      "url": "https://www.stevevladeck.com/p/54-the-politics-of-the-justices-pensions",
      "domain": "stevevladeck.com",
      "type": "citation"
    },
    {
      "text": "Judicial Retirement",
      "url": "https://www.fjc.gov/history/spotlight-judicial-history/judicial-retirement",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court Justices Perks Revealed In New Report",
      "url": "https://rollcall.com/2020/03/24/supreme-court-justices-perks-revealed-in-new-report/",
      "domain": "rollcall.com",
      "type": "citation"
    },
    {
      "text": "New Financial Disclosures Show Justices Raking",
      "url": "https://fixthecourt.com/2022/06/new-financial-disclosures-show-justices-raking/",
      "domain": "fixthecourt.com",
      "type": "citation"
    },
    {
      "text": "Justices.aspx",
      "url": "https://www.supremecourt.gov/about/justices.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court And Ethnic Representation",
      "url": "https://www.ebsco.com/research-starters/ethnic-and-cultural-studies/supreme-court-and-ethnic-representation",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Demographic Firsts",
      "url": "https://www.brennancenter.org/our-work/research-reports/supreme-court-demographic-firsts",
      "domain": "brennancenter.org",
      "type": "citation"
    },
    {
      "text": "Us Supreme Court",
      "url": "https://cawp.rutgers.edu/facts/levels-office/us-supreme-court",
      "domain": "cawp.rutgers.edu",
      "type": "citation"
    },
    {
      "text": "Backgrounds Of The Justices",
      "url": "https://supremecourthistory.org/backgrounds-of-the-justices/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Religious Identity And Supreme Court Justices A Brief History 146999",
      "url": "https://theconversation.com/religious-identity-and-supreme-court-justices-a-brief-history-146999",
      "domain": "theconversation.com",
      "type": "citation"
    },
    {
      "text": "Religious Makeup Of The Supreme Court",
      "url": "https://www.statista.com/chart/15741/religious-makeup-of-the-supreme-court/",
      "domain": "statista.com",
      "type": "citation"
    },
    {
      "text": "The Great Divide Birth States",
      "url": "https://smartpolitics.lib.umn.edu/2010/07/01/the-great-divide-birth-states/",
      "domain": "smartpolitics.lib.umn.edu",
      "type": "citation"
    },
    {
      "text": "How The U S Supreme Court Has Become Less Not More Diverse",
      "url": "https://cardinalnews.org/2022/08/05/how-the-u-s-supreme-court-has-become-less-not-more-diverse/",
      "domain": "cardinalnews.org",
      "type": "citation"
    },
    {
      "text": "Where Supreme Court Justices Earned Law Degrees",
      "url": "https://www.usnews.com/education/best-graduate-schools/top-law-schools/articles/where-supreme-court-justices-earned-law-degrees",
      "domain": "usnews.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Of The United States",
      "url": "https://ballotpedia.org/Supreme_Court_of_the_United_States",
      "domain": "ballotpedia.org",
      "type": "citation"
    },
    {
      "text": "It Is Not A 3 3 3 Supreme Court",
      "url": "https://www.scotusblog.com/2025/08/it-is-not-a-3-3-3-supreme-court/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "mqscores.wustl.edu",
      "url": "http://mqscores.wustl.edu/",
      "domain": "mqscores.wustl.edu",
      "type": "citation"
    },
    {
      "text": "2024termdatareport.pdf",
      "url": "https://static1.squarespace.com/static/60188505fb790b33c3d33a61/t/685f50748be9977089829a96/1751076981684/2024termdatareport.pdf",
      "domain": "static1.squarespace.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Cases%2c October Term 2023 2024",
      "url": "https://ballotpedia.org/Supreme_Court_cases%2C_October_term_2023-2024",
      "domain": "ballotpedia.org",
      "type": "citation"
    },
    {
      "text": "Supreme Courts Ideologically Split Rulings Occur Less Often You Think 2106365",
      "url": "https://www.newsweek.com/supreme-courts-ideologically-split-rulings-occur-less-often-you-think-2106365",
      "domain": "newsweek.com",
      "type": "citation"
    },
    {
      "text": "Scotusblog Statpack Ot24 Final June 27.pdf",
      "url": "https://www.scotusblog.com/wp-content/uploads/2025/06/SCOTUSblog_Statpack_OT24_Final_June_27.pdf",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Charting The Justices Decisions Cutting Across Ideological Lines",
      "url": "https://empiricalscotus.com/2024/04/01/charting-the-justices-decisions-cutting-across-ideological-lines/",
      "domain": "empiricalscotus.com",
      "type": "citation"
    },
    {
      "text": "Scotus",
      "url": "https://threestory.com/scotus/",
      "domain": "threestory.com",
      "type": "citation"
    },
    {
      "text": "Associate Justice",
      "url": "https://www.law.cornell.edu/wex/associate_justice",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Supremecourtoathfirstsandtrivia.aspx",
      "url": "https://www.supremecourt.gov/about/oath/supremecourtoathfirstsandtrivia.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Traditions.aspx",
      "url": "https://www.supremecourt.gov/about/traditions.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court Seating Chart Ketanji Brown Jackson",
      "url": "https://www.cnn.com/2022/09/30/politics/supreme-court-seating-chart-ketanji-brown-jackson",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Role Of Chief Justice Of The United States",
      "url": "https://supremecourthistory.org/supreme-court-civics-resources/role-of-chief-justice-of-the-united-states/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Chief Justice",
      "url": "https://www.law.cornell.edu/wex/chief_justice",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Administrative Bodies Office Chief Justice 1789 Present",
      "url": "https://www.fjc.gov/history/administration/administrative-bodies-office-chief-justice-1789-present",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Rl32821.9.pdf",
      "url": "https://www.congress.gov/crs_external_products/RL/PDF/RL32821/RL32821.9.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Seniority Within Court",
      "url": "https://www.ebsco.com/research-starters/law/seniority-within-court",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Building",
      "url": "https://www.aoc.gov/explore-capitol-campus/buildings-grounds/supreme-court/supreme-court-building",
      "domain": "aoc.gov",
      "type": "citation"
    },
    {
      "text": "Courtbuilding.pdf",
      "url": "https://www.supremecourt.gov/about/courtbuilding.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court United States Meeting Places",
      "url": "https://www.fjc.gov/history/courts/supreme-court-united-states-meeting-places",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Buildinghistory.aspx",
      "url": "https://www.supremecourt.gov/about/buildinghistory.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Old Supreme Court Chamber",
      "url": "https://www.aoc.gov/explore-capitol-campus/buildings-grounds/capitol-building/senate-wing/old-supreme-court-chamber",
      "domain": "aoc.gov",
      "type": "citation"
    },
    {
      "text": "Room Old Supreme Court Chamber.pdf",
      "url": "https://www.senate.gov/art-artifacts/publications/pdf/room-old-supreme-court-chamber.pdf",
      "domain": "senate.gov",
      "type": "citation"
    },
    {
      "text": "Homes Of The Supreme Court",
      "url": "https://supremecourthistory.org/homes-of-the-supreme-court/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Calendarsandlists.aspx",
      "url": "https://www.supremecourt.gov/oral_arguments/calendarsandlists.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "2023termcourtcalendar.pdf",
      "url": "https://www.supremecourt.gov/oral_arguments/2023TermCourtCalendar.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Clerk Of The Court And The Marshal",
      "url": "https://supremecourthistory.org/how-the-court-works/clerk-of-the-court-and-the-marshal/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "672",
      "url": "https://www.law.cornell.edu/uscode/text/28/672",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Judicial Administration",
      "url": "https://www.uscourts.gov/administration-policies/judicial-administration",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Supreme Court Clerks",
      "url": "https://www.cnn.com/2023/12/15/politics/supreme-court-clerks",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Scotus Clerkships",
      "url": "https://www.chambers-associate.com/where-to-start/getting-hired/scotus-clerkships/",
      "domain": "chambers-associate.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Law Clerks",
      "url": "https://amarkfoundation.org/reports/supreme-court-law-clerks/",
      "domain": "amarkfoundation.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://chicagounbound.uchicago.edu/cgi/viewcontent.cgi?article=2432\\u0026context=law_and_economics",
      "domain": "chicagounbound.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "2669337",
      "url": "https://academic.oup.com/aler/article/19/1/96/2669337",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Clerks And Networks Of Power",
      "url": "https://www.scotusblog.com/2025/10/supreme-court-clerks-and-networks-of-power/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Court Workload And Staff",
      "url": "https://supremecourthistory.org/how-the-court-works/court-workload-and-staff/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Court Officers And Staff Counselor Chief Justice",
      "url": "https://www.fjc.gov/history/administration/court-officers-and-staff-counselor-chief-justice",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "Staff Court",
      "url": "https://www.ebsco.com/research-starters/law/staff-court",
      "domain": "ebsco.com",
      "type": "citation"
    },
    {
      "text": "Alde 00001220",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S2-C2-2/ALDE_00001220/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Types Of Cases The Court Hears",
      "url": "https://supremecourthistory.org/how-the-court-works/types-of-cases-the-court-hears/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "The Certiorari Process Seeking Supreme Court Review",
      "url": "https://www.scotusblog.com/election-law-explainers/the-certiorari-process-seeking-supreme-court-review/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Scotus",
      "url": "https://libguides.law.umich.edu/scotus",
      "domain": "libguides.law.umich.edu",
      "type": "citation"
    },
    {
      "text": "Articles",
      "url": "https://www.legalnews.com/Home/Articles?DataId=1365703",
      "domain": "legalnews.com",
      "type": "citation"
    },
    {
      "text": "The Supreme Court S Shrunken Discuss List",
      "url": "https://fedsoc.org/commentary/fedsoc-blog/the-supreme-court-s-shrunken-discuss-list",
      "domain": "fedsoc.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.umn.edu/cgi/viewcontent.cgi?article=1083\\u0026context=concomm",
      "domain": "scholarship.law.umn.edu",
      "type": "citation"
    },
    {
      "text": "Certiorari",
      "url": "https://www.law.cornell.edu/wex/certiorari",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Rule 25",
      "url": "https://www.law.cornell.edu/rules/supct/rule_25",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Rules Guidance.aspx",
      "url": "https://www.supremecourt.gov/filingandrules/rules_guidance.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Court Drops Consent Requirement For Filing Of Amicus Briefs Makes Other Tweaks To Rules",
      "url": "https://www.scotusblog.com/2022/12/court-drops-consent-requirement-for-filing-of-amicus-briefs-makes-other-tweaks-to-rules/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "2019rulesofthecourt.pdf",
      "url": "https://www.supremecourt.gov/ctrules/2019RulesoftheCourt.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Rule 28",
      "url": "https://www.law.cornell.edu/rules/supct/rule_28",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Behind The Scenes How The U S Supreme Court Decides",
      "url": "https://www.americanbar.org/groups/public_education/resources/reproductive-rights-us-supreme-court/behind-the-scenes-how-the-u-s-supreme-court-decides/",
      "domain": "americanbar.org",
      "type": "citation"
    },
    {
      "text": "Visitorsguidetooralargument.aspx",
      "url": "https://www.supremecourt.gov/visiting/visitorsguidetooralargument.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Stages Of Supreme Court Case",
      "url": "https://supreme.justia.com/stages-of-supreme-court-case/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Oral Argument",
      "url": "https://supremecourthistory.org/how-the-court-works/oral-argument/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Oral Arguments.aspx",
      "url": "https://www.supremecourt.gov/oral_arguments/oral_arguments.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "The Justices Conference",
      "url": "https://supremecourthistory.org/how-the-court-works/the-justices-conference/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court Opinion Process",
      "url": "https://www.npr.org/2022/05/03/1096141704/supreme-court-opinion-process",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Drafting And Releasing Opinions",
      "url": "https://supremecourthistory.org/how-the-court-works/drafting-and-releasing-opinions/",
      "domain": "supremecourthistory.org",
      "type": "citation"
    },
    {
      "text": "Pr 05 03 22",
      "url": "https://www.supremecourt.gov/publicinfo/press/pressreleases/pr_05-03-22",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Procedures.aspx",
      "url": "https://www.supremecourt.gov/about/procedures.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "supremecourtopinions.wustl.edu",
      "url": "http://supremecourtopinions.wustl.edu/",
      "domain": "supremecourtopinions.wustl.edu",
      "type": "citation"
    },
    {
      "text": "Faqs Announcements Of Orders And Opinions",
      "url": "https://www.scotusblog.com/faqs-announcements-of-orders-and-opinions/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Opinions.aspx",
      "url": "https://www.supremecourt.gov/opinions/opinions.aspx",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Stare Decisis",
      "url": "https://www.law.cornell.edu/wex/stare_decisis",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Understand Stare Decisis",
      "url": "https://www.americanbar.org/groups/public_education/publications/preview_home/understand-stare-decisis/",
      "domain": "americanbar.org",
      "type": "citation"
    },
    {
      "text": "R45319.4.pdf",
      "url": "https://www.congress.gov/crs_external_products/R/PDF/R45319/R45319.4.pdf",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Judicial Review Executive Orders",
      "url": "https://www.fjc.gov/history/administration/judicial-review-executive-orders",
      "domain": "fjc.gov",
      "type": "citation"
    },
    {
      "text": "579",
      "url": "https://supreme.justia.com/cases/federal/us/343/579/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Not So Absolute Power Supreme Court",
      "url": "https://www.lwv.org/blog/not-so-absolute-power-supreme-court",
      "domain": "lwv.org",
      "type": "citation"
    },
    {
      "text": "Court Role And Structure",
      "url": "https://www.uscourts.gov/about-federal-courts/court-role-and-structure",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "J Check Balance",
      "url": "https://bensguide.gpo.gov/j-check-balance",
      "domain": "bensguide.gpo.gov",
      "type": "citation"
    },
    {
      "text": "3.10%253a Landmark Cases In Federalism",
      "url": "https://socialsci.libretexts.org/Courses/Lumen_Learning/Basics_of_American_Politics_%28Lumen%29/03%253A_American_Federalism/3.10%253A_Landmark_Cases_in_Federalism",
      "domain": "socialsci.libretexts.org",
      "type": "citation"
    },
    {
      "text": "93 1260",
      "url": "https://www.oyez.org/cases/1994/93-1260",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Court Cases Related To Federalism",
      "url": "https://ballotpedia.org/Court_cases_related_to_federalism",
      "domain": "ballotpedia.org",
      "type": "citation"
    },
    {
      "text": "19 1392 6j37.pdf",
      "url": "https://www.supremecourt.gov/opinions/21pdf/19-1392_6j37.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Separation Of Powers",
      "url": "https://supreme.justia.com/cases-by-topic/separation-of-powers/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "22 451 7m58.pdf",
      "url": "https://www.supremecourt.gov/opinions/23pdf/22-451_7m58.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Alde 00013617",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S2-C2-1/ALDE_00013617/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Alde 00013615",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S2-C1-18-3/ALDE_00013615/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "R48250",
      "url": "https://www.congress.gov/crs-product/R48250",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Alde 00013528",
      "url": "https://constitution.congress.gov/browse/essay/artIII-S1-5-1/ALDE_00013528/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Exceptions Clause And Congressional Control Over Appellate Jurisdiction",
      "url": "https://law.cornell.edu/constitution-conan/article-3/section-2/clause-2/exceptions-clause-and-congressional-control-over-appellate-jurisdiction",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "35 The Theory Of Plenary Congressional Control.html",
      "url": "https://law.justia.com/constitution/us/article-3/35-the-theory-of-plenary-congressional-control.html",
      "domain": "law.justia.com",
      "type": "citation"
    },
    {
      "text": "Originalism",
      "url": "https://www.law.cornell.edu/wex/originalism",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "On Originalism In Constitutional Interpretation",
      "url": "https://constitutioncenter.org/the-constitution/white-papers/on-originalism-in-constitutional-interpretation",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.georgetown.edu/cgi/viewcontent.cgi?article=2362\\u0026context=facpub",
      "domain": "scholarship.law.georgetown.edu",
      "type": "citation"
    },
    {
      "text": "Textualism",
      "url": "https://www.law.cornell.edu/wex/textualism",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Legal Scholarship Highlight Justice Scalias Textualist Legacy",
      "url": "https://www.scotusblog.com/2017/11/legal-scholarship-highlight-justice-scalias-textualist-legacy/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Alde 00001303",
      "url": "https://constitution.congress.gov/browse/essay/intro.8-2/ALDE_00001303/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "Textualisms Mistake",
      "url": "https://harvardlawreview.org/print/vol-135/textualisms-mistake/",
      "domain": "harvardlawreview.org",
      "type": "citation"
    },
    {
      "text": "Alde 00001310",
      "url": "https://constitution.congress.gov/browse/essay/intro.8-9/ALDE_00001310/",
      "domain": "constitution.congress.gov",
      "type": "citation"
    },
    {
      "text": "State Justices Speak Out Against Originalism",
      "url": "https://statecourtreport.org/our-work/analysis-opinion/state-justices-speak-out-against-originalism",
      "domain": "statecourtreport.org",
      "type": "citation"
    },
    {
      "text": "3",
      "url": "https://scholarlycommons.law.northwestern.edu/nulr/vol118/iss2/3/",
      "domain": "scholarlycommons.law.northwestern.edu",
      "type": "citation"
    },
    {
      "text": "Originalism Vs Textualism Vs Living Constitutionalism",
      "url": "https://pacificlegal.org/originalism-vs-textualism-vs-living-constitutionalism/",
      "domain": "pacificlegal.org",
      "type": "citation"
    },
    {
      "text": "Living Constitution",
      "url": "https://www.law.uchicago.edu/news/living-constitution",
      "domain": "law.uchicago.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.georgetown.edu/cgi/viewcontent.cgi?article=3248\\u0026context=facpub",
      "domain": "scholarship.law.georgetown.edu",
      "type": "citation"
    },
    {
      "text": "How The Supreme Court Used Three Cases To Inspire A Living Constitution",
      "url": "https://manhattan.institute/article/how-the-supreme-court-used-three-cases-to-inspire-a-living-constitution",
      "domain": "manhattan.institute",
      "type": "citation"
    },
    {
      "text": "The Living Constitution",
      "url": "https://harvardlawreview.org/print/vol-120/the-living-constitution/",
      "domain": "harvardlawreview.org",
      "type": "citation"
    },
    {
      "text": "Evolutionary Interpretation",
      "url": "https://fiveable.me/key-terms/constitutional-law-i/evolutionary-interpretation",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Judicial Restraint",
      "url": "https://ballotpedia.org/Judicial_restraint",
      "domain": "ballotpedia.org",
      "type": "citation"
    },
    {
      "text": "A Definition Of Judicial Restraint 3303631",
      "url": "https://www.thoughtco.com/a-definition-of-judicial-restraint-3303631",
      "domain": "thoughtco.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://digitalcommons.wcl.american.edu/cgi/viewcontent.cgi?article=3236\\u0026context=facsch_lawrev",
      "domain": "digitalcommons.wcl.american.edu",
      "type": "citation"
    },
    {
      "text": "Judicial Activism Vs Judicial Restraint.html",
      "url": "https://study.com/academy/lesson/judicial-activism-vs-judicial-restraint.html",
      "domain": "study.com",
      "type": "citation"
    },
    {
      "text": "Judicial Activism",
      "url": "https://www.law.cornell.edu/wex/judicial_activism",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "7",
      "url": "https://encompass.eku.edu/honors_theses/7/",
      "domain": "encompass.eku.edu",
      "type": "citation"
    },
    {
      "text": "Key Concepts Of Judicial Restraint Vs Judicial Activism",
      "url": "https://fiveable.me/lists/key-concepts-of-judicial-restraint-vs-judicial-activism",
      "domain": "fiveable.me",
      "type": "citation"
    },
    {
      "text": "Why Liberals And Conservatives Flipped On Judicial Restraint Judicial Review In The Cycles Of Constitutional Time",
      "url": "https://texaslawreview.org/why-liberals-and-conservatives-flipped-on-judicial-restraint-judicial-review-in-the-cycles-of-constitutional-time/",
      "domain": "texaslawreview.org",
      "type": "citation"
    },
    {
      "text": "Papers.cfm",
      "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1434742",
      "domain": "papers.ssrn.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarlycommons.law.northwestern.edu/cgi/viewcontent.cgi?article=1180\\u0026context=nulr",
      "domain": "scholarlycommons.law.northwestern.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.umn.edu/cgi/viewcontent.cgi?article=1651\\u0026context=mlr",
      "domain": "scholarship.law.umn.edu",
      "type": "citation"
    },
    {
      "text": "Activism Vs Judicial Restraint On The Supreme Court Experts Debate",
      "url": "https://dc.medill.northwestern.edu/blog/2010/07/07/activism-vs-judicial-restraint-on-the-supreme-court-experts-debate/",
      "domain": "dc.medill.northwestern.edu",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarlycommons.law.cwsl.edu/cgi/viewcontent.cgi?article=1615\\u0026context=cwlr",
      "domain": "scholarlycommons.law.cwsl.edu",
      "type": "citation"
    },
    {
      "text": "7 Historic Landmark Cases For Individual Rights",
      "url": "https://www.brownfirmpllc.com/7-historic-landmark-cases-for-individual-rights/",
      "domain": "brownfirmpllc.com",
      "type": "citation"
    },
    {
      "text": "21 476 C185.pdf",
      "url": "https://www.supremecourt.gov/opinions/22pdf/21-476_c185.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "21 476",
      "url": "https://www.oyez.org/cases/2022/21-476",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Voiokh Scotus 2023 303 Creative Free Speech In The Marketplace.html",
      "url": "https://law.emory.edu/news-and-events/releases/2023/07/voiokh-scotus-2023-303-creative-free-speech-in-the-marketplace.html",
      "domain": "law.emory.edu",
      "type": "citation"
    },
    {
      "text": "Masterpiece Cakeshop Ltd V Colorado Civil Rights Commission",
      "url": "https://constitutioncenter.org/the-constitution/supreme-court-case-library/masterpiece-cakeshop-ltd-v-colorado-civil-rights-commission",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "19 123 G3bi.pdf",
      "url": "https://www.supremecourt.gov/opinions/20pdf/19-123_g3bi.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Masterpiece Cakeshop",
      "url": "https://fedsoc.org/case/masterpiece-cakeshop",
      "domain": "fedsoc.org",
      "type": "citation"
    },
    {
      "text": "570",
      "url": "https://supreme.justia.com/cases/federal/us/554/570/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "08 1521",
      "url": "https://www.oyez.org/cases/2009/08-1521",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "20 843 7j80.pdf",
      "url": "https://www.supremecourt.gov/opinions/21pdf/20-843_7j80.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "Lsb11108",
      "url": "https://www.congress.gov/crs-product/LSB11108",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Bruen S Preliminary Preservation Of The Second Amendment",
      "url": "https://fedsoc.org/fedsoc-review/bruen-s-preliminary-preservation-of-the-second-amendment",
      "domain": "fedsoc.org",
      "type": "citation"
    },
    {
      "text": "Landmark Supreme Court Cases",
      "url": "https://www.brennancenter.org/our-work/research-reports/landmark-supreme-court-cases",
      "domain": "brennancenter.org",
      "type": "citation"
    },
    {
      "text": "19 1392",
      "url": "https://www.oyez.org/cases/2021/19-1392",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Dobbs V Jackson Womens Health Organization",
      "url": "https://constitutioncenter.org/the-constitution/supreme-court-case-library/dobbs-v-jackson-womens-health-organization",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "Lochner V New York Fundamental Rights And Economic Liberty",
      "url": "https://constitutioncenter.org/blog/lochner-v-new-york-fundamental-rights-and-economic-liberty",
      "domain": "constitutioncenter.org",
      "type": "citation"
    },
    {
      "text": "Landmark Lochner.html",
      "url": "https://www.thirteen.org/wnet/supremecourt/capitalism/landmark_lochner.html",
      "domain": "thirteen.org",
      "type": "citation"
    },
    {
      "text": "317us111",
      "url": "https://www.oyez.org/cases/1940-1955/317us111",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Wickard V Filburn 3",
      "url": "https://teachingamericanhistory.org/document/wickard-v-filburn-3/",
      "domain": "teachingamericanhistory.org",
      "type": "citation"
    },
    {
      "text": "Pmc3151195",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3151195/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Chevron Overruled In Loper Bright V Raimondo",
      "url": "https://www.dlapiper.com/en-us/insights/publications/2024/06/chevron-overruled-in-loper-bright-v-raimondo",
      "domain": "dlapiper.com",
      "type": "citation"
    },
    {
      "text": "C.php",
      "url": "https://libraryguides.law.pace.edu/c.php?g=731197\\u0026p=5229443",
      "domain": "libraryguides.law.pace.edu",
      "type": "citation"
    },
    {
      "text": "Us Supreme Court Rules In Favor Of Property Owner In Exaction Takings Case",
      "url": "https://www.ballardspahr.com/insights/alerts-and-articles/2024/04/us-supreme-court-rules-in-favor-of-property-owner-in-exaction-takings-case",
      "domain": "ballardspahr.com",
      "type": "citation"
    },
    {
      "text": "Voting Elections",
      "url": "https://supreme.justia.com/cases-by-topic/voting-elections/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "Redistricting And The Supreme Court The Most Significant Cases",
      "url": "https://www.ncsl.org/redistricting-and-census/redistricting-and-the-supreme-court-the-most-significant-cases",
      "domain": "ncsl.org",
      "type": "citation"
    },
    {
      "text": "18 422 9ol1.pdf",
      "url": "https://www.supremecourt.gov/opinions/18pdf/18-422_9ol1.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "18 422",
      "url": "https://www.oyez.org/cases/2018/18-422",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court Just Made Gerrymandering Even Easier",
      "url": "https://www.brennancenter.org/our-work/analysis-opinion/supreme-court-just-made-gerrymandering-even-easier",
      "domain": "brennancenter.org",
      "type": "citation"
    },
    {
      "text": "455",
      "url": "https://www.law.cornell.edu/uscode/text/28/455",
      "domain": "law.cornell.edu",
      "type": "citation"
    },
    {
      "text": "Lsb11078.html",
      "url": "https://www.congress.gov/crs_external_products/LSB/HTML/LSB11078.html",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Lsb10949",
      "url": "https://www.congress.gov/crs-product/LSB10949",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "What Gifts Must Supreme Court Justices Disclose",
      "url": "https://www.brennancenter.org/our-work/research-reports/what-gifts-must-supreme-court-justices-disclose",
      "domain": "brennancenter.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court Ethics Code",
      "url": "https://www.npr.org/2023/11/13/1212708142/supreme-court-ethics-code",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Lsb11078",
      "url": "https://www.congress.gov/crs-product/LSB11078",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "Recusals",
      "url": "https://fixthecourt.com/recusals/",
      "domain": "fixthecourt.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Recusal",
      "url": "https://www.acslaw.org/expertforum/supreme-court-recusal/",
      "domain": "acslaw.org",
      "type": "citation"
    },
    {
      "text": "Clarence Thomas Scotus Undisclosed Luxury Travel Gifts Crow",
      "url": "https://www.propublica.org/article/clarence-thomas-scotus-undisclosed-luxury-travel-gifts-crow",
      "domain": "propublica.org",
      "type": "citation"
    },
    {
      "text": "Clarence Thomas Harlan Crow",
      "url": "https://www.texastribune.org/2024/06/07/clarence-thomas-harlan-crow/",
      "domain": "texastribune.org",
      "type": "citation"
    },
    {
      "text": "Alito Reject Calls To Recuse From Trump Jan 6 Cases In Light Of Flag Controversies",
      "url": "https://www.scotusblog.com/2024/05/alito-reject-calls-to-recuse-from-trump-jan-6-cases-in-light-of-flag-controversies/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Justice Samuel Alito Flag Home",
      "url": "https://www.cnn.com/2024/05/17/politics/justice-samuel-alito-flag-home",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Aba Promotes Binding Scotus Ethics",
      "url": "https://www.americanbar.org/news/abanews/aba-news-archives/2024/08/aba-promotes-binding-scotus-ethics/",
      "domain": "americanbar.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court Justices Financial Disclosures",
      "url": "https://time.com/6986825/supreme-court-justices-financial-disclosures/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "Five Supreme Court Justices Recused From The Same Case Showing Both Progress And Work Still To Be Done",
      "url": "https://www.citizensforethics.org/news/analysis/five-supreme-court-justices-recused-from-the-same-case-showing-both-progress-and-work-still-to-be-done/",
      "domain": "citizensforethics.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court In A 6 3 Partisan Decision By Justice Alito Greenlights Racial Gerrymandering Further Eroding Voting Rights",
      "url": "https://afj.org/article/supreme-court-in-a-6-3-partisan-decision-by-justice-alito-greenlights-racial-gerrymandering-further-eroding-voting-rights/",
      "domain": "afj.org",
      "type": "citation"
    },
    {
      "text": "Politicians In Robes How A Sharp Right Turn Imperiled Trust In The Supreme Court",
      "url": "https://www.annenbergpublicpolicycenter.org/politicians-in-robes-how-a-sharp-right-turn-imperiled-trust-in-the-supreme-court/",
      "domain": "annenbergpublicpolicycenter.org",
      "type": "citation"
    },
    {
      "text": "98",
      "url": "https://supreme.justia.com/cases/federal/us/531/98/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "The Numbers Reveal A United Supreme Court And A Few Surprises",
      "url": "https://fedsoc.org/commentary/fedsoc-blog/the-numbers-reveal-a-united-supreme-court-and-a-few-surprises",
      "domain": "fedsoc.org",
      "type": "citation"
    },
    {
      "text": "Supreme Court.aspx",
      "url": "https://news.gallup.com/poll/4732/supreme-court.aspx",
      "domain": "news.gallup.com",
      "type": "citation"
    },
    {
      "text": "New High Say Supreme Court Too Conservative.aspx",
      "url": "https://news.gallup.com/poll/695759/new-high-say-supreme-court-too-conservative.aspx",
      "domain": "news.gallup.com",
      "type": "citation"
    },
    {
      "text": "Cw4yz3nw0vyo",
      "url": "https://www.bbc.com/news/articles/cw4yz3nw0vyo",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Kagan Supreme Court Legitimacy 00056766",
      "url": "https://www.politico.com/news/2022/09/14/kagan-supreme-court-legitimacy-00056766",
      "domain": "politico.com",
      "type": "citation"
    },
    {
      "text": "4",
      "url": "https://scholarship.law.duke.edu/dlj/vol34/iss3/4/",
      "domain": "scholarship.law.duke.edu",
      "type": "citation"
    },
    {
      "text": "Democrats Introduce Bill Expand Supreme Court 9 13 Justices N1264132",
      "url": "https://www.nbcnews.com/politics/supreme-court/democrats-introduce-bill-expand-supreme-court-9-13-justices-n1264132",
      "domain": "nbcnews.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Expansion Democrats",
      "url": "https://www.theguardian.com/law/2023/may/21/supreme-court-expansion-democrats",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Sen Cruz Introduces Constitutional Amendment To Prevent Democrats From Court Packing The Supreme Court",
      "url": "https://www.cruz.senate.gov/newsroom/press-releases/sen-cruz-introduces-constitutional-amendment-to-prevent-democrats-from-court-packing-the-supreme-court",
      "domain": "cruz.senate.gov",
      "type": "citation"
    },
    {
      "text": "Lsb10562",
      "url": "https://www.congress.gov/crs-product/LSB10562",
      "domain": "congress.gov",
      "type": "citation"
    },
    {
      "text": "3",
      "url": "https://www.amacad.org/ourcommonpurpose/publication/supreme-court-term-limits/section/3",
      "domain": "amacad.org",
      "type": "citation"
    },
    {
      "text": "Updated Term Limits United States Supreme Court",
      "url": "https://iaals.du.edu/blog/updated-term-limits-united-states-supreme-court",
      "domain": "iaals.du.edu",
      "type": "citation"
    },
    {
      "text": "The Arguments Against Setting Term Limits For Supreme Court Justices",
      "url": "https://www.npr.org/2024/08/05/nx-s1-5060213/the-arguments-against-setting-term-limits-for-supreme-court-justices",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "1091",
      "url": "https://scholarship.law.vanderbilt.edu/faculty-publications/1091/",
      "domain": "scholarship.law.vanderbilt.edu",
      "type": "citation"
    },
    {
      "text": "Icymi Vast Majority Americans Support President Bidens Call For Supreme Court Reform",
      "url": "https://www.presidency.ucsb.edu/documents/icymi-vast-majority-americans-support-president-bidens-call-for-supreme-court-reform",
      "domain": "presidency.ucsb.edu",
      "type": "citation"
    },
    {
      "text": "Why The Supreme Court Agrees To Hear Some Cases And Not Others",
      "url": "https://www.scotusblog.com/2025/08/why-the-supreme-court-agrees-to-hear-some-cases-and-not-others/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "2024year Endreport.pdf",
      "url": "https://www.supremecourt.gov/publicinfo/year-end/2024year-endreport.pdf",
      "domain": "supremecourt.gov",
      "type": "citation"
    },
    {
      "text": "98 Why Is The Courts Docket Shrinking",
      "url": "https://www.stevevladeck.com/p/98-why-is-the-courts-docket-shrinking",
      "domain": "stevevladeck.com",
      "type": "citation"
    },
    {
      "text": "Supreme Court Behavior On The Shadow Docket",
      "url": "https://www.scotusblog.com/2025/09/supreme-court-behavior-on-the-shadow-docket/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "What Is The Typical Timeline For The Supreme Court Of The United States Scotus To Make Decisions On Cases They Are Currently Hearing Before The End Of Their Term",
      "url": "https://www.quora.com/What-is-the-typical-timeline-for-the-Supreme-Court-of-the-United-States-SCOTUS-to-make-decisions-on-cases-they-are-currently-hearing-before-the-end-of-their-term",
      "domain": "quora.com",
      "type": "citation"
    },
    {
      "text": "Empirical Scotus Out Of Steam Or Out Of Time",
      "url": "https://www.scotusblog.com/2018/05/empirical-scotus-out-of-steam-or-out-of-time/",
      "domain": "scotusblog.com",
      "type": "citation"
    },
    {
      "text": "Loper Bright Judiciary Impact",
      "url": "https://www.thomsonreuters.com/en-us/posts/government/loper-bright-judiciary-impact/",
      "domain": "thomsonreuters.com",
      "type": "citation"
    },
    {
      "text": "Gao 16 437",
      "url": "https://www.gao.gov/products/gao-16-437",
      "domain": "gao.gov",
      "type": "citation"
    },
    {
      "text": "A Call For Transparency In The U S Supreme Court Televising Oral Arguments And Addressing The Shadow Docket",
      "url": "https://lawreview.syr.edu/a-call-for-transparency-in-the-u-s-supreme-court-televising-oral-arguments-and-addressing-the-shadow-docket/",
      "domain": "lawreview.syr.edu",
      "type": "citation"
    },
    {
      "text": "Judicial Conference Adopts Transparency Measures",
      "url": "https://www.uscourts.gov/data-news/judiciary-news/2022/03/15/judicial-conference-adopts-transparency-measures",
      "domain": "uscourts.gov",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://readingroom.law.gsu.edu/cgi/viewcontent.cgi?article=2850\\u0026context=gsulr",
      "domain": "readingroom.law.gsu.edu",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "U.S. Constitution",
      "page": "Constitution"
    },
    {
      "text": "Judiciary Act of 1789",
      "page": "Judiciary_Act_of_1789"
    },
    {
      "text": "chief justice",
      "page": "Chief_justice"
    },
    {
      "text": "Congress",
      "page": "Congress"
    },
    {
      "text": "president",
      "page": "President"
    },
    {
      "text": "Senate",
      "page": "Senate"
    },
    {
      "text": "John Roberts",
      "page": "John_Roberts"
    },
    {
      "text": "jurisprudence",
      "page": "Jurisprudence"
    },
    {
      "text": "elite capture",
      "page": "Elite_capture"
    },
    {
      "text": "limited government",
      "page": "Limited_government"
    },
    {
      "text": "separation of powers",
      "page": "Separation_of_powers"
    },
    {
      "text": "originalism",
      "page": "Originalism"
    },
    {
      "text": "United States",
      "page": "United_States"
    },
    {
      "text": "Supreme Court",
      "page": "Supreme_court"
    },
    {
      "text": "jurisdiction",
      "page": "Jurisdiction"
    },
    {
      "text": "George Washington",
      "page": "George_Washington"
    },
    {
      "text": "John Jay",
      "page": "John_Jay"
    },
    {
      "text": "New York",
      "page": "New_York"
    },
    {
      "text": "oath of office",
      "page": "Oath_of_office"
    },
    {
      "text": "New York City",
      "page": "New_York_City"
    },
    {
      "text": "John Rutledge",
      "page": "John_Rutledge"
    },
    {
      "text": "South Carolina",
      "page": "South_Carolina"
    },
    {
      "text": "William Cushing",
      "page": "William_Cushing"
    },
    {
      "text": "Massachusetts",
      "page": "Massachusetts"
    },
    {
      "text": "Maryland",
      "page": "Maryland"
    },
    {
      "text": "Pennsylvania",
      "page": "Pennsylvania"
    },
    {
      "text": "Virginia",
      "page": "Virginia"
    },
    {
      "text": "Philadelphia",
      "page": "Philadelphia"
    },
    {
      "text": "landmark",
      "page": "Landmark"
    },
    {
      "text": "Chisholm v. Georgia",
      "page": "Chisholm_v._Georgia"
    },
    {
      "text": "Georgia",
      "page": "Georgia"
    },
    {
      "text": "Revolutionary War",
      "page": "Revolutionary_War"
    },
    {
      "text": "sovereign immunity",
      "page": "Sovereign_immunity"
    },
    {
      "text": "Jay",
      "page": "Jay"
    },
    {
      "text": "Wilson",
      "page": "Wilson"
    },
    {
      "text": "Blair",
      "page": "Blair"
    },
    {
      "text": "ratification",
      "page": "Ratification"
    },
    {
      "text": "diplomatic mission",
      "page": "Diplomatic_mission"
    },
    {
      "text": "Britain",
      "page": "Britain"
    },
    {
      "text": "Oliver Ellsworth",
      "page": "Oliver_Ellsworth"
    },
    {
      "text": "Marbury v. Madison",
      "page": "Marbury_v._Madison"
    },
    {
      "text": "judicial review",
      "page": "Judicial_review"
    },
    {
      "text": "William Marbury",
      "page": "William_Marbury"
    },
    {
      "text": "Necessary and Proper Clause",
      "page": "Necessary_and_Proper_Clause"
    },
    {
      "text": "Supremacy Clause",
      "page": "Supremacy_Clause"
    },
    {
      "text": "implied powers",
      "page": "Implied_powers"
    },
    {
      "text": "Commerce Clause",
      "page": "Commerce_Clause"
    },
    {
      "text": "Marshall",
      "page": "Marshall"
    },
    {
      "text": "Roger B. Taney",
      "page": "Roger_B._Taney"
    },
    {
      "text": "Dred Scott v. Sandford",
      "page": "Dred_Scott_v._Sandford"
    },
    {
      "text": "Missouri Compromise",
      "page": "Missouri_Compromise"
    },
    {
      "text": "Lincoln",
      "page": "Lincoln"
    },
    {
      "text": "Salmon P. Chase",
      "page": "Salmon_P._Chase"
    },
    {
      "text": "Union",
      "page": "Union"
    },
    {
      "text": "declaration of war",
      "page": "Declaration_of_war"
    },
    {
      "text": "Justice",
      "page": "Justice"
    },
    {
      "text": "Confederacy",
      "page": "Confederacy"
    },
    {
      "text": "commander-in-chief",
      "page": "Commander-in-chief"
    },
    {
      "text": "civil liberties",
      "page": "Civil_liberties"
    },
    {
      "text": "Waite Court",
      "page": "Waite_Court"
    },
    {
      "text": "Ulysses S. Grant",
      "page": "Ulysses_S._Grant"
    },
    {
      "text": "Civil Rights Cases",
      "page": "Civil_Rights_Cases"
    },
    {
      "text": "Civil Rights Act of 1875",
      "page": "Civil_Rights_Act_of_1875"
    },
    {
      "text": "state action",
      "page": "State_action"
    },
    {
      "text": "Munn v. Illinois",
      "page": "Munn_v._Illinois"
    },
    {
      "text": "grain elevator",
      "page": "Grain_elevator"
    },
    {
      "text": "public interest",
      "page": "Public_interest"
    },
    {
      "text": "Fuller Court",
      "page": "Fuller_Court"
    },
    {
      "text": "Grover Cleveland",
      "page": "Grover_Cleveland"
    },
    {
      "text": "laissez-faire",
      "page": "Laissez-faire"
    },
    {
      "text": "income tax",
      "page": "Income_tax"
    },
    {
      "text": "direct tax",
      "page": "Direct_tax"
    },
    {
      "text": "apportionment",
      "page": "Apportionment"
    },
    {
      "text": "Sherman Antitrust Act",
      "page": "Sherman_Antitrust_Act"
    },
    {
      "text": "holding company",
      "page": "Holding_company"
    },
    {
      "text": "Plessy v. Ferguson",
      "page": "Plessy_v._Ferguson"
    },
    {
      "text": "separate but equal",
      "page": "Separate_but_equal"
    },
    {
      "text": "Lochner v. New York",
      "page": "Lochner_v._New_York"
    },
    {
      "text": "freedom of contract",
      "page": "Freedom_of_contract"
    },
    {
      "text": "Due Process Clause",
      "page": "Due_Process_Clause"
    },
    {
      "text": "federalism",
      "page": "Federalism"
    },
    {
      "text": "Judiciary Act of 1869",
      "page": "Judiciary_Act_of_1869"
    },
    {
      "text": "Roosevelt",
      "page": "Roosevelt"
    },
    {
      "text": "New Deal",
      "page": "New_Deal"
    },
    {
      "text": "minimum wage law",
      "page": "Minimum_wage_law"
    },
    {
      "text": "National",
      "page": "National"
    },
    {
      "text": "collective bargaining",
      "page": "Collective_bargaining"
    },
    {
      "text": "Harlan F. Stone",
      "page": "Harlan_F._Stone"
    },
    {
      "text": "law enforcement",
      "page": "Law_enforcement"
    },
    {
      "text": "Barry Goldwater",
      "page": "Barry_Goldwater"
    },
    {
      "text": "Miranda",
      "page": "Miranda"
    },
    {
      "text": "Richard Nixon",
      "page": "Richard_Nixon"
    },
    {
      "text": "Harry Blackmun",
      "page": "Harry_Blackmun"
    },
    {
      "text": "William Rehnquist",
      "page": "William_Rehnquist"
    },
    {
      "text": "Clement Haynsworth",
      "page": "Clement_Haynsworth"
    },
    {
      "text": "G. Harrold Carswell",
      "page": "G._Harrold_Carswell"
    },
    {
      "text": "Planned Parenthood v. Casey",
      "page": "Planned_Parenthood_v._Casey"
    },
    {
      "text": "Samuel Alito",
      "page": "Samuel_Alito"
    },
    {
      "text": "Sandra Day O'Connor",
      "page": "Sandra_Day_O'Connor"
    },
    {
      "text": "Thomas",
      "page": "Thomas'"
    },
    {
      "text": "Kennedy",
      "page": "Kennedy"
    },
    {
      "text": "Bill Clinton",
      "page": "Bill_Clinton"
    },
    {
      "text": "Barack Obama",
      "page": "Barack_Obama"
    },
    {
      "text": "Ruth Bader Ginsburg",
      "page": "Ruth_Bader_Ginsburg"
    },
    {
      "text": "Stephen Breyer",
      "page": "Stephen_Breyer"
    },
    {
      "text": "Sonia Sotomayor",
      "page": "Sonia_Sotomayor"
    },
    {
      "text": "Elena Kagan",
      "page": "Elena_Kagan"
    },
    {
      "text": "supermajority",
      "page": "Supermajority"
    },
    {
      "text": "Neil Gorsuch",
      "page": "Neil_Gorsuch"
    },
    {
      "text": "Brett Kavanaugh",
      "page": "Brett_Kavanaugh"
    },
    {
      "text": "nomination",
      "page": "Nomination"
    },
    {
      "text": "Ketanji Brown Jackson",
      "page": "Ketanji_Brown_Jackson"
    },
    {
      "text": "Jackson Women's Health Organization",
      "page": "Jackson_Women's_Health_Organization"
    },
    {
      "text": "abortion",
      "page": "Abortion"
    },
    {
      "text": "Roe v. Wade",
      "page": "Roe_v._Wade"
    },
    {
      "text": "Students for Fair Admissions",
      "page": "Students_for_Fair_Admissions"
    },
    {
      "text": "Harvard College",
      "page": "Harvard_College"
    },
    {
      "text": "affirmative action",
      "page": "Affirmative_action"
    },
    {
      "text": "higher education",
      "page": "Higher_education"
    },
    {
      "text": "Equal Protection Clause",
      "page": "Equal_Protection_Clause"
    },
    {
      "text": "Loper Bright Enterprises v. Raimondo",
      "page": "Loper_Bright_Enterprises_v._Raimondo"
    },
    {
      "text": "Trump v. United States",
      "page": "Trump_v._United_States"
    },
    {
      "text": "academia",
      "page": "Academia"
    },
    {
      "text": "mainstream media",
      "page": "Mainstream_media"
    },
    {
      "text": "Roberts Court",
      "page": "Roberts_Court"
    },
    {
      "text": "John Marshall",
      "page": "John_Marshall"
    },
    {
      "text": "Court",
      "page": "Court"
    },
    {
      "text": "original jurisdiction",
      "page": "Original_jurisdiction"
    },
    {
      "text": "John Adams",
      "page": "John_Adams"
    },
    {
      "text": "justice of the peace",
      "page": "Justice_of_the_peace"
    },
    {
      "text": "Secretary of State",
      "page": "Secretary_of_state"
    },
    {
      "text": "Madison",
      "page": "James_Madison"
    },
    {
      "text": "Thomas Jefferson",
      "page": "Thomas_Jefferson"
    },
    {
      "text": "federal law",
      "page": "Federal_law"
    },
    {
      "text": "the Federalist Papers",
      "page": "The_Federalist_Papers"
    },
    {
      "text": "rights",
      "page": "Rights"
    },
    {
      "text": "Ambassadors",
      "page": "The_Ambassadors"
    },
    {
      "text": "State",
      "page": "State"
    },
    {
      "text": "special master",
      "page": "Special_master"
    },
    {
      "text": "judge",
      "page": "Judge"
    },
    {
      "text": "attorney",
      "page": "Attorney"
    },
    {
      "text": "1924",
      "page": "1924"
    },
    {
      "text": "Wyoming",
      "page": "Wyoming"
    },
    {
      "text": "Colorado River",
      "page": "Colorado_River"
    },
    {
      "text": "Arizona",
      "page": "Arizona"
    },
    {
      "text": "California",
      "page": "California"
    },
    {
      "text": "Texas",
      "page": "Texas"
    },
    {
      "text": "New Mexico",
      "page": "New_Mexico"
    },
    {
      "text": "Rio Grande",
      "page": "Rio_Grande"
    },
    {
      "text": "California v. Texas",
      "page": "California_v._Texas"
    },
    {
      "text": "certiorari",
      "page": "Certiorari"
    },
    {
      "text": "United States courts of appeals",
      "page": "United_States_courts_of_appeals"
    },
    {
      "text": "Rule of Four",
      "page": "The_Rule_of_Four"
    },
    {
      "text": "lower court",
      "page": "Lower_court"
    },
    {
      "text": "binding",
      "page": "Binding"
    },
    {
      "text": "review",
      "page": "Review"
    },
    {
      "text": "law",
      "page": "Law"
    },
    {
      "text": "process",
      "page": "Process"
    },
    {
      "text": "Justice Clarence Thomas",
      "page": "Clarence_Thomas"
    },
    {
      "text": "en banc",
      "page": "En_banc"
    },
    {
      "text": "circuit court",
      "page": "Circuit_court"
    },
    {
      "text": "district",
      "page": "District"
    },
    {
      "text": "advice and consent",
      "page": "Advice_and_consent"
    },
    {
      "text": "death",
      "page": "Death"
    },
    {
      "text": "retirement",
      "page": "Retirement"
    },
    {
      "text": "resignation",
      "page": "Resignation"
    },
    {
      "text": "blue slip",
      "page": "Blue_slip"
    },
    {
      "text": "courtesy",
      "page": "Courtesy"
    },
    {
      "text": "1920s",
      "page": "1920s"
    },
    {
      "text": "filibusters",
      "page": "Filibuster"
    },
    {
      "text": "2017",
      "page": "2017"
    },
    {
      "text": "simple majority",
      "page": "Simple_majority"
    },
    {
      "text": "majority",
      "page": "Majority"
    },
    {
      "text": "commission",
      "page": "Commission"
    },
    {
      "text": "1789",
      "page": "1789"
    },
    {
      "text": "1950s",
      "page": "1950s"
    },
    {
      "text": "judiciary",
      "page": "Judiciary"
    },
    {
      "text": "Treason",
      "page": "Treason"
    },
    {
      "text": "Bribery",
      "page": "Bribery"
    },
    {
      "text": "high Crimes and Misdemeanors",
      "page": "High_crimes_and_misdemeanors"
    },
    {
      "text": "impeachment",
      "page": "Impeachment"
    },
    {
      "text": "Samuel Chase",
      "page": "Samuel_Chase"
    },
    {
      "text": "1804",
      "page": "1804"
    },
    {
      "text": "mandatory retirement",
      "page": "Mandatory_retirement"
    },
    {
      "text": "amendment",
      "page": "Amendment"
    },
    {
      "text": "Article",
      "page": "Article"
    },
    {
      "text": "William O. Douglas",
      "page": "William_O._Douglas"
    },
    {
      "text": "stroke",
      "page": "Stroke"
    },
    {
      "text": "capacity",
      "page": "Capacity"
    },
    {
      "text": "Civil War",
      "page": "Civil_War"
    },
    {
      "text": "Federalist",
      "page": "Federalist"
    },
    {
      "text": "judicial independence",
      "page": "Judicial_independence"
    },
    {
      "text": "norm",
      "page": "Norm"
    },
    {
      "text": "inflation",
      "page": "Inflation"
    },
    {
      "text": "corruption",
      "page": "Corruption"
    },
    {
      "text": "undue influence",
      "page": "Undue_influence"
    },
    {
      "text": "empirical evidence",
      "page": "Empirical_evidence"
    },
    {
      "text": "Federal Employees Health Benefits Program",
      "page": "Federal_Employees_Health_Benefits_Program"
    },
    {
      "text": "Thrift Savings Plan",
      "page": "Thrift_Savings_Plan"
    },
    {
      "text": "annual leave",
      "page": "Annual_leave"
    },
    {
      "text": "annuity",
      "page": "Annuity"
    },
    {
      "text": "salary",
      "page": "Salary"
    },
    {
      "text": "pension",
      "page": "Pension"
    },
    {
      "text": "financial independence",
      "page": "Financial_independence"
    },
    {
      "text": "Ethics in Government Act",
      "page": "Ethics_in_Government_Act"
    },
    {
      "text": "Associate",
      "page": "Associate"
    },
    {
      "text": "George W. Bush",
      "page": "George_W._Bush"
    },
    {
      "text": "George H. W. Bush",
      "page": "George_H._W._Bush"
    },
    {
      "text": "Donald Trump",
      "page": "Donald_Trump"
    },
    {
      "text": "Donald Trump",
      "page": "Trump"
    },
    {
      "text": "Amy Coney Barrett",
      "page": "Amy_Coney_Barrett"
    },
    {
      "text": "Joe Biden",
      "page": "Joe_Biden"
    },
    {
      "text": "legal profession",
      "page": "Legal_profession"
    },
    {
      "text": "Thurgood Marshall",
      "page": "Thurgood_Marshall"
    },
    {
      "text": "Unitarian",
      "page": "Unitarian"
    },
    {
      "text": "Ohio",
      "page": "Ohio"
    },
    {
      "text": "Mississippi River",
      "page": "Mississippi_River"
    },
    {
      "text": "history",
      "page": "History"
    },
    {
      "text": "Ivy League",
      "page": "Ivy_League"
    },
    {
      "text": "law school",
      "page": "Law_school"
    },
    {
      "text": "20th century",
      "page": "20th_century"
    },
    {
      "text": "statutory interpretation",
      "page": "Statutory_interpretation"
    },
    {
      "text": "administrative deference",
      "page": "Deference"
    },
    {
      "text": "regulatory authority",
      "page": "Authority"
    },
    {
      "text": "Republican",
      "page": "Republican"
    },
    {
      "text": "major questions doctrine",
      "page": "Major_questions_doctrine"
    },
    {
      "text": "Chevron",
      "page": "Chevron"
    },
    {
      "text": "seniority",
      "page": "Seniority"
    },
    {
      "text": "majority opinion",
      "page": "Majority_opinion"
    },
    {
      "text": "Washington, D.C.",
      "page": "Washington,_D.C."
    },
    {
      "text": "United States Capitol",
      "page": "United_States_Capitol"
    },
    {
      "text": "Cass Gilbert",
      "page": "Cass_Gilbert"
    },
    {
      "text": "Greek",
      "page": "Greek"
    },
    {
      "text": "Charles Evans Hughes",
      "page": "Charles_Evans_Hughes"
    },
    {
      "text": "William Howard Taft",
      "page": "William_Howard_Taft"
    },
    {
      "text": "Great Depression",
      "page": "Great_Depression"
    },
    {
      "text": "Capitol",
      "page": "Capitol"
    },
    {
      "text": "Independence Hall",
      "page": "Independence_Hall"
    },
    {
      "text": "Old Senate Chamber",
      "page": "Old_Senate_Chamber"
    },
    {
      "text": "Old Supreme Court Chamber",
      "page": "Old_Supreme_Court_Chamber"
    },
    {
      "text": "constitutional law",
      "page": "Constitutional_law"
    },
    {
      "text": "October Term",
      "page": "October"
    },
    {
      "text": "Tuesday",
      "page": "Tuesday"
    },
    {
      "text": "April",
      "page": "April"
    },
    {
      "text": "June",
      "page": "June"
    },
    {
      "text": "Marshal",
      "page": "Marshal"
    },
    {
      "text": "Supreme Court Police",
      "page": "Supreme_Court_Police"
    },
    {
      "text": "legal research",
      "page": "Legal_research"
    },
    {
      "text": "federal",
      "page": "Federal"
    },
    {
      "text": "liberal",
      "page": "Liberal"
    },
    {
      "text": "government",
      "page": "Government"
    },
    {
      "text": "consideration",
      "page": "Consideration"
    },
    {
      "text": "clerk",
      "page": "Clerk"
    },
    {
      "text": "conference",
      "page": "Conference"
    },
    {
      "text": "briefs",
      "page": "Briefs"
    },
    {
      "text": "counsel",
      "page": "Counsel"
    },
    {
      "text": "rebuttal",
      "page": "Rebuttal"
    },
    {
      "text": "2020",
      "page": "2020"
    },
    {
      "text": "guide",
      "page": "The_Guide"
    },
    {
      "text": "etiquette",
      "page": "Etiquette"
    },
    {
      "text": "dissent",
      "page": "Dissent"
    },
    {
      "text": "syllabus",
      "page": "Syllabus"
    },
    {
      "text": "joinder",
      "page": "Joinder"
    },
    {
      "text": "online",
      "page": ".online"
    },
    {
      "text": "United States Reports",
      "page": "United_States_Reports"
    },
    {
      "text": "plurality",
      "page": "Plurality"
    },
    {
      "text": "principle",
      "page": "Principle"
    },
    {
      "text": "hierarchy",
      "page": "Hierarchy"
    },
    {
      "text": "United States v. Lopez",
      "page": "United_States_v._Lopez"
    },
    {
      "text": "Korean War",
      "page": "Korean_War"
    },
    {
      "text": "acquittal",
      "page": "Acquittal"
    },
    {
      "text": "partisan",
      "page": "Partisan"
    },
    {
      "text": "divided government",
      "page": "Divided_government"
    },
    {
      "text": "bicameralism",
      "page": "Bicameralism"
    },
    {
      "text": "admiralty",
      "page": "Admiralty"
    },
    {
      "text": "mootness",
      "page": "Mootness"
    },
    {
      "text": "Baker v. Carr",
      "page": "Baker_v._Carr"
    },
    {
      "text": "Ex parte McCardle",
      "page": "Ex_parte_McCardle"
    },
    {
      "text": "habeas corpus",
      "page": "Habeas_corpus"
    },
    {
      "text": "Brown v. Board of Education",
      "page": "Brown_v._Board_of_Education"
    },
    {
      "text": "National Guard",
      "page": "National_Guard"
    },
    {
      "text": "Little Rock, Arkansas",
      "page": "Little_Rock,_Arkansas"
    },
    {
      "text": "popular sovereignty",
      "page": "Popular_sovereignty"
    },
    {
      "text": "interpretation",
      "page": "Interpretation"
    },
    {
      "text": "discretion",
      "page": "Discretion"
    },
    {
      "text": "Robert Bork",
      "page": "Robert_Bork"
    },
    {
      "text": "appointment",
      "page": "Appointment"
    },
    {
      "text": "Ronald Reagan",
      "page": "Ronald_Reagan"
    },
    {
      "text": "1980s",
      "page": "1980s"
    },
    {
      "text": "Reconstruction",
      "page": "Reconstruction"
    },
    {
      "text": "living constitution",
      "page": "Living_Constitution"
    },
    {
      "text": "common law",
      "page": "Common_law"
    },
    {
      "text": "straitjacket",
      "page": "Straitjacket"
    },
    {
      "text": "urbanization",
      "page": "Urbanization"
    },
    {
      "text": "civil rights movements",
      "page": "Civil_rights_movements"
    },
    {
      "text": "slavery",
      "page": "Slavery"
    },
    {
      "text": "executive",
      "page": "Executive"
    },
    {
      "text": "precedent",
      "page": "Precedent"
    },
    {
      "text": "accountability",
      "page": "Accountability"
    },
    {
      "text": "Alexander Hamilton",
      "page": "Alexander_Hamilton"
    },
    {
      "text": "Federalist No. 78",
      "page": "Federalist_No._78"
    },
    {
      "text": "Warren Court",
      "page": "Warren_Court"
    },
    {
      "text": "Earl Warren",
      "page": "Earl_Warren"
    },
    {
      "text": "Miranda v. Arizona",
      "page": "Miranda_v._Arizona"
    },
    {
      "text": "Felix Frankfurter",
      "page": "Felix_Frankfurter"
    },
    {
      "text": "privacy",
      "page": "Privacy"
    },
    {
      "text": "Shelby County v. Holder",
      "page": "Shelby_County_v._Holder"
    },
    {
      "text": "Texas v. Johnson",
      "page": "Texas_v._Johnson"
    },
    {
      "text": "desecration",
      "page": "Desecration"
    },
    {
      "text": "303 Creative LLC v. Elenis",
      "page": "303_Creative_LLC_v._Elenis"
    },
    {
      "text": "website",
      "page": "Website"
    },
    {
      "text": "baker",
      "page": "Baker"
    },
    {
      "text": "wedding",
      "page": "Wedding"
    },
    {
      "text": "Fulton v. City of Philadelphia",
      "page": "Fulton_v._City_of_Philadelphia"
    },
    {
      "text": "agency",
      "page": "Agency"
    },
    {
      "text": "self-defense",
      "page": "Self-defense"
    },
    {
      "text": "McDonald v. City of Chicago",
      "page": "McDonald_v._City_of_Chicago"
    },
    {
      "text": "due process",
      "page": "Due_process"
    },
    {
      "text": "Katz v. United States",
      "page": "Katz_v._United_States"
    },
    {
      "text": "Lochner era",
      "page": "Lochner_era"
    },
    {
      "text": "public health",
      "page": "Public_health"
    },
    {
      "text": "minimum wage",
      "page": "Minimum_wage"
    },
    {
      "text": "price controls",
      "page": "Price_controls"
    },
    {
      "text": "eminent domain",
      "page": "Eminent_domain"
    },
    {
      "text": "economic development",
      "page": "Economic_development"
    },
    {
      "text": "Voting Rights Act of 1965",
      "page": "Voting_Rights_Act_of_1965"
    },
    {
      "text": "Reynolds v. Sims",
      "page": "Reynolds_v._Sims"
    },
    {
      "text": "redistricting",
      "page": "Redistricting"
    },
    {
      "text": "Alabama",
      "page": "Alabama"
    },
    {
      "text": "1960s",
      "page": "1960s"
    },
    {
      "text": "voter turnout",
      "page": "Voter_turnout"
    },
    {
      "text": "gerrymandering",
      "page": "Gerrymandering"
    },
    {
      "text": "campaign finance",
      "page": "Campaign_finance"
    },
    {
      "text": "Federal Election Commission",
      "page": "Federal_Election_Commission"
    },
    {
      "text": "North Carolina",
      "page": "North_Carolina"
    },
    {
      "text": "Rucho v. Common Cause",
      "page": "Rucho_v._Common_Cause"
    },
    {
      "text": "Shaw v. Reno",
      "page": "Shaw_v._Reno"
    },
    {
      "text": "Alexander v. South Carolina State Conference of the NAACP",
      "page": "Alexander_v._South_Carolina_State_Conference_of_the_NAACP"
    },
    {
      "text": "judicial restraint",
      "page": "Judicial_restraint"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "Electoral College",
      "page": "Electoral_college"
    },
    {
      "text": "vote counting",
      "page": "Vote_counting"
    },
    {
      "text": "code of conduct",
      "page": "Code_of_conduct"
    },
    {
      "text": "law firm",
      "page": "Law_firm"
    },
    {
      "text": "voting",
      "page": "Voting"
    },
    {
      "text": "Bush v. Gore",
      "page": "Bush_v._Gore"
    },
    {
      "text": "2023",
      "page": "2023"
    },
    {
      "text": "Franklin D. Roosevelt",
      "page": "Franklin_D._Roosevelt"
    },
    {
      "text": "Merrick Garland",
      "page": "Merrick_Garland"
    },
    {
      "text": "Sheldon Whitehouse",
      "page": "Sheldon_Whitehouse"
    },
    {
      "text": "Jerry Nadler",
      "page": "Jerry_Nadler"
    },
    {
      "text": "constitutional amendment",
      "page": "Constitutional_amendment"
    },
    {
      "text": "Joe Manchin",
      "page": "Joe_Manchin"
    },
    {
      "text": "Peter Welch",
      "page": "Peter_Welch"
    },
    {
      "text": "1869",
      "page": "1869"
    },
    {
      "text": "circuit",
      "page": "Circuit"
    },
    {
      "text": "shadow",
      "page": "Shadow"
    },
    {
      "text": "oral argument",
      "page": "Oral_argument"
    }
  ],
  "fetched_at": "2025-12-07T07:26:46.968873",
  "elapsed_ms": 759906
}