{
  "topic": "Usain Bolt",
  "title": "Usain Bolt",
  "slug": "usain-bolt",
  "grokipedia_slug": "Usain_Bolt",
  "grokipedia_url": "https://grokipedia.com/page/Usain_Bolt",
  "source": "grokipedia",
  "content": "# Usain Bolt\n\nUsain St. Leo Bolt is a retired Jamaican sprinter widely regarded as the greatest sprinter of all time, renowned for holding the world records in the **100 metres** (9.58 seconds, set on 16 August 2009 in Berlin), the **200 metres** (19.19 seconds, set on 20 August 2009 in Berlin), and the **4 × 100 metres relay** (36.84 seconds, set on 11 August 2012 in London), as well as securing eight Olympic gold medals across three consecutive Games.\n\nBorn on 21 August 1986 in Sherwood Content, Trelawny parish, Jamaica, Bolt grew up in a rural area and showed early promise in sports like cricket and football before focusing on track and field during his high school years at William Knibb Memorial High School. At age 15, he won a bronze medal in the 400 metres at the 2001 CARIFTA Games, marking the start of his competitive career, and by 16, he claimed gold in the 200 metres at the 2002 World Junior Championships in Kingston, Jamaica, becoming the youngest global sprint champion.\n\nBolt's international breakthrough came at the 2008 Beijing Olympics, where he dominated the sprints by winning gold in the 100 metres (9.69 seconds, a world record at the time) and 200 metres (19.30 seconds, another world record), later adding a 4 × 100 metres relay gold that was stripped in 2017 due to a teammate's doping violation. He repeated gold medals in the 100 metres, 200 metres, and 4 × 100 metres relay at the 2012 London Olympics and the 2016 Rio Olympics, achieving a triple in the individual sprints across three consecutive Games. In total, his Olympic successes include golds in the 100 metres (2008, 2012, 2016), 200 metres (2008, 2012, 2016), and 4 × 100 metres relay (2012, 2016).\n\nBeyond the Olympics, Bolt amassed 11 gold medals at the IAAF World Championships in Athletics from 2009 to 2015, including multiple wins in the 100 metres, 200 metres, and relays, solidifying his dominance in the sport. Standing at 1.95 metres (6 feet 5 inches) tall and weighing around 94 kilograms (207 pounds), his exceptional stride length and speed propelled him to celebrity status, earning him endorsements, the nickname \"Lightning Bolt,\" and a lasting impact on track and field as a charismatic ambassador for athletics.\n\nBolt announced his retirement in 2015, intending to conclude his career after the 2017 World Championships in London, where he earned a bronze in the 100 metres—his final individual race—before withdrawing from the 200 metres and suffering a hamstring injury in the relay final. Since retiring, he has pursued music production, philanthropy through his foundation, and occasional media appearances, while maintaining his records and legacy as the fastest man in history.\n\n## Early life\n\n### Childhood and family background\n\nUsain St. Leo Bolt was born on 21 August 1986 in Sherwood Content, a small rural town in Jamaica's Trelawny parish. He is the son of Wellesley Bolt (1957–2025), who ran a local grocery store selling everyday items like sweets and basic provisions, and Jennifer Bolt, a homemaker who helped manage the family business. The couple, both devout Seventh-day Adventists, raised their children in a faith-centered household, emphasizing Christian principles and community involvement in their modest rural home. Bolt arrived 10 days late, and his mother later recalled noticing his unusual strength as a newborn, when at just three weeks old he nearly rolled off the bed but pulled himself back up.\n\nBolt grew up alongside his older brother Sadiki and younger sister Sherine, forming a close-knit family in the simple village environment without streetlights or reliable running water. The siblings spent much of their time playing cricket and football in the dusty roads, where Bolt's natural speed first became apparent during informal games. By age five, his mother observed him consistently winning races against classmates at school, marking the early signs of his exceptional talent. His father described him as jovial yet fiercely competitive, unwilling to lose even in childhood play.\n\nThe family's humble circumstances shaped Bolt's grounded upbringing, with his parents prioritizing discipline and education amid their grocery store duties. Diagnosed as hyperactive as a child, Bolt was known for his boundless energy, often channeling it into outdoor activities rather than structured routines. Despite these challenges, the supportive home environment, influenced by their Adventist faith, fostered resilience and a strong sense of family unity that Bolt has credited for his later success. Wellesley Bolt died on March 31, 2025, after a lengthy illness.\n\n### Education and discovery of athletic talent\n\nBolt attended Waldensia Primary and All-Age School in his early years, where he demonstrated early signs of speed by becoming the fastest 100-meter runner among his peers at age 12, once clocking 52 seconds for a 400-meter race on a grass track. He also represented his parish in the National Primary and All-Age Schools Athletic Championships, showing interest in both cricket and football alongside track events.\n\nIn secondary school, Bolt enrolled at William Knibb Memorial High School in Falmouth, Trelawny (also known as Martha Brae), a institution renowned for producing Olympic sprinters such as Michael Green. There, his athletic talent was more formally recognized; initially excelling as a fast bowler in cricket and in high jump, he was redirected toward track and field by coaches who noticed his natural sprinting ability during school activities. At age 14, Bolt earned his first medal—a bronze in the 80-meter hurdles—at the Western Championships held on his school campus, and he followed with a silver in the 200-meter dash (22.04 seconds) at the 2001 Jamaican High School Championships (Champs).\n\nUnder the guidance of high school coaches Pablo McNeil, a former Jamaican Olympic sprinter, and Dwayne Barrett, Bolt's potential was nurtured, with McNeil predicting he could break world records within five to six years. By age 15 in 2002, he achieved a hand-timed 20.3 seconds in the 200-meter final at the Western Championships and swept the 200-meter and 400-meter events at the CARIFTA Trials, going on to win four golds at the CARIFTA Games in Nassau, Bahamas, setting under-17 records of 21.12 seconds in the 200 meters and 47.33 seconds in the 400 meters. That same year, at the IAAF World Junior Championships in Kingston, Jamaica, Bolt secured gold in the 200 meters with a world junior record of 20.61 seconds, becoming the youngest ever world junior gold medalist in the event and marking his emergence on the international stage. His family, including his father Wellesley and mother Jennifer Bolt, provided crucial support during these formative years, amid Jamaica's strong tradition of school-based athletics competitions like Champs.\n\n## Athletic career\n\n### Junior and early senior achievements (2002-2007)\n\nBolt emerged as a prodigy in Jamaican athletics during his junior years, capturing international attention at the age of 15. In 2002, he won gold in the 200 meters at the World Junior Championships in Kingston, Jamaica, clocking 20.61 seconds and becoming the youngest male gold medalist in the event's history. That same year, at the CARIFTA Games in Nassau, Bahamas, Bolt secured four gold medals in the under-20 category: the 200 meters (20.40 seconds), 400 meters (47.33 seconds), 4×100 meters relay, and 4×400 meters relay, showcasing his versatility in sprints. These victories marked his transition from local high school competitions to the global stage, under the guidance of coach Pablo McNeill.\n\nIn 2003, Bolt continued his dominance at the CARIFTA Games in Port of Spain, Trinidad and Tobago, earning three gold medals in the 200 meters (20.40 seconds), 400 meters (46.48 seconds), and 4×400 meters relay. By 2004, at 17 years old, he shattered the world junior record in the 200 meters with a time of 19.93 seconds at the CARIFTA Games in Hamilton, Bermuda, becoming the first junior to break the 20-second barrier. Selected for the Athens Olympics that summer, Bolt made his senior international debut but struggled with a leg injury, finishing fifth in his 200 meters heat with 21.05 seconds and failing to advance. This early setback highlighted the physical challenges of his rapid growth and transition to senior competition.\n\nInjuries continued to hinder Bolt's progress in 2005 and 2006. At the World Championships in Helsinki, he reached the 200 meters final but pulled up mid-race due to a hamstring strain, finishing last in 26.27 seconds. Despite this, he won the Jamaican national 200 meters title in 2006 with a personal best of 19.88 seconds. By 2007, Bolt focused more on the 100 meters, achieving a personal best of 10.03 seconds at the Vardinoyannia meet in Rethymno, Greece. He also set a Jamaican senior record in the 200 meters with 19.75 seconds at the Grand Prix in Athens. At the World Championships in Osaka, Japan, Bolt earned silver medals in the 200 meters (19.91 seconds, behind Tyson Gay) and the 4×100 meters relay (37.89 seconds). These results solidified his potential as a senior sprinter, though persistent injuries had limited his consistency during this period.\n\n### World records and 2008 Beijing Olympics\n\nIn the lead-up to the 2008 Beijing Olympics, Usain Bolt established himself as a dominant force in sprinting by shattering the men's 100 meters world record. On May 31, 2008, at the Reebok Grand Prix in New York City's Icahn Stadium, Bolt clocked 9.72 seconds, surpassing Asafa Powell's previous mark of 9.74 seconds set in 2007. This performance, aided by a +2.0 m/s tailwind, marked Bolt's emergence as the fastest man in history and built immense anticipation for his Olympic debut.\n\nAt the 2008 Summer Olympics in Beijing, Bolt not only defended his world record status but elevated it further across multiple events, securing two gold medals and rewriting sprinting history. In the men's 100 meters final on August 16, Bolt exploded from the blocks and powered through the line in 9.69 seconds, breaking his own world record by 0.03 seconds under still conditions (0.0 m/s wind). This victory, by a margin of 0.20 seconds over silver medalist Richard Thompson, showcased Bolt's unparalleled acceleration and top-end speed, drawing widespread acclaim for its apparent ease.\n\nFour days later, on August 20, Bolt turned his attention to the 200 meters, where he again redefined limits. In the final at the Beijing National Stadium, he ran 19.30 seconds with a -0.9 m/s headwind, eclipsing Michael Johnson's longstanding world record of 19.32 seconds from 1996 by 0.02 seconds. Bolt's performance, which included a commanding curve and straightaway surge, resulted in a 0.66-second winning margin over Shawn Crawford, highlighting his versatility in the longer sprint. This achievement made Bolt the first sprinter since Carl Lewis in 1984 to win both the 100m and 200m Olympic golds.\n\nBolt capped his Beijing campaign on August 22 in the men's 4x100 meters relay, anchoring Jamaica's team to a time of 37.10 seconds. Teaming with Nesta Carter, Michael Frater, and Asafa Powell, Bolt received a flawless baton exchange and powered home 0.30 seconds ahead of Trinidad and Tobago, surpassing the previous world record of 37.40 seconds set by the United States in 1992. However, in 2017, the relay gold and performance were annulled following a positive doping test for Carter from re-analysis of 2008 samples, leaving Bolt with two Olympic golds and two world records from the Beijing Games. These feats—across the individual events under 29 seconds total—cemented Bolt's status as a once-in-a-generation talent and propelled track and field into global headlines.\n\n### Dominant years (2009-2012)\n\nFollowing his triumphs at the 2008 Beijing Olympics, Usain Bolt entered a period of unparalleled dominance in sprinting from 2009 to 2012, marked by multiple world records and gold medals at major international championships. At the 2009 IAAF World Championships in Berlin, Bolt secured gold in the 100 meters with a world record time of 9.58 seconds, shattering his previous mark by 0.11 seconds and winning by a margin of 0.13 seconds over silver medalist Tyson Gay. He followed this with victory in the 200 meters, clocking another world record of 19.19 seconds, which remains the fastest legally recorded time in history and highlighted his exceptional curve-running ability. Anchoring Jamaica's 4x100-meter relay team, Bolt contributed to a championship record of 37.31 seconds, securing a third gold and completing a historic triple at the event.\n\nIn 2010 and early 2011, Bolt maintained his supremacy through the IAAF Diamond League circuit, winning key races such as the 100 meters in Oslo (9.79 seconds) and Lausanne (9.82 seconds), though he focused on refining his start to address occasional vulnerabilities. At the 2011 World Championships in Daegu, Bolt's campaign faced a setback in the 100 meters final when he was disqualified for a false start under the IAAF's zero-tolerance rule, allowing teammate Yohan Blake to claim gold in 9.92 seconds. Undeterred, Bolt rebounded to win the 200 meters gold in 19.40 seconds, the fastest time of the season, demonstrating his resilience and superiority in the longer sprint. He then anchored Jamaica to a world record in the 4x100-meter relay at 37.04 seconds, surpassing the previous mark set at the 2008 Olympics and underscoring the team's seamless baton exchanges.\n\nBolt's dominance peaked at the 2012 London Olympics, where he defended his titles and achieved the unprecedented feat of becoming the first athlete to win consecutive Olympic golds in both the 100 meters and 200 meters. In the 100 meters final, he set an Olympic record of 9.63 seconds, edging out Blake by 0.12 seconds amid strong headwinds. He followed with a 200 meters victory in an Olympic record 19.32 seconds, completing the sprint double for the second time and solidifying his status as the fastest man alive. Anchoring Jamaica's relay team, Bolt helped establish a new world record of 36.84 seconds in the 4x100 meters, the first sub-37-second performance in history, with flawless handoffs from Nesta Carter, Michael Frater, and Blake. These achievements across the 2009-2012 span cemented Bolt's era of sprinting supremacy, with eight Olympic and World Championship golds in individual and relay events.\n\n### Continued success and 2016 Rio Olympics (2013-2016)\n\nFollowing his dominant performances at the 2012 London Olympics, Usain Bolt continued his reign in sprinting with a treble at the 2013 IAAF World Championships in Moscow. He won the men's 100m final in 9.77 seconds, edging out Justin Gatlin by 0.01 seconds despite challenging wet conditions at Luzhniki Stadium. Bolt then secured the 200m title in 19.66 seconds, becoming the first athlete to achieve the 100m-200m double at three consecutive World Championships. Anchoring Jamaica's 4x100m relay team, he helped them claim gold in a world-leading 37.36 seconds, marking his ninth world championship gold overall.\n\nIn 2014, Bolt faced setbacks due to a foot injury that limited his competitive schedule, but he made a notable return at the Commonwealth Games in Glasgow. Competing for the first time at the event, he anchored Jamaica to victory in the men's 4x100m relay, setting a Commonwealth record of 37.58 seconds and earning his first Games medal. Throughout the year, Bolt also won key Diamond League meetings, including the 200m in Oslo (20.67 seconds) and the 100m in Lausanne (9.93 seconds), reinforcing his status despite reduced appearances.\n\nBolt's form peaked again at the 2015 IAAF World Championships in Beijing, where he defended his sprint titles amid a high-stakes rivalry with Gatlin. In the 100m final, he clocked 9.79 seconds for gold, overcoming a hamstring concern to finish 0.01 seconds ahead of Gatlin. He followed with a commanding 200m win in 19.55 seconds, his third consecutive title in the event and a championship record. Closing the championships, Bolt anchored Jamaica to 4x100m gold in another world-leading 37.36 seconds, extending his unbeaten streak in major championship relays.\n\nThe pinnacle of this period came at the 2016 Rio Olympics, where Bolt aimed for gold in the 100m, 200m, and 4x100m relay across three consecutive Games. In the 100m final, he triumphed in 9.81 seconds, holding off Gatlin and Andre De Grasse to secure his third straight Olympic title in the event. Bolt then won the 200m in 19.78 seconds, becoming the first athlete to win the 100m and 200m at three consecutive Olympics. Finally, anchoring Jamaica's 4x100m relay, he led them to gold in 37.27 seconds, adding a second relay gold (following 2012) for a total of eight Olympic golds. For these accomplishments, Bolt was named IAAF World Athlete of the Year for the sixth time.\n\n### 2017 retirement season\n\nIn early 2017, Usain Bolt confirmed that the year would mark his final competitive season, with the World Athletics Championships in London serving as his planned farewell to track and field. He shifted focus primarily to the 100 meters, opting out of the 200 meters due to a history of false starts and a desire to conserve energy for the shorter sprint and relay events. Bolt's preparation included a non-standard exhibition race on February 9 in Melbourne, Australia, where he won the 150 meters in 15.28 seconds as part of the inaugural Nitro Athletics series, marking his first competitive outing of the year.\n\nBolt's return to the 100 meters came on June 27 at the Ostrava Golden Spike in the Czech Republic, where he secured victory in 10.06 seconds despite appearing rusty and facing criticism for a sluggish start. He improved significantly on July 21 at the Monaco Diamond League, clocking a season-best 9.95 seconds to win ahead of a strong field including Christian Coleman and Yohan Blake. A minor hamstring issue forced him to withdraw from the Rabat Diamond League meet on July 16, but Bolt recovered in time for the championships.\n\nAt the London World Championships, Bolt advanced through the 100 meters heats on August 4 with a 10.07-second performance, expressing frustration over his slow reaction time of 0.166 seconds. In the semifinals the following day, he ran 9.98 seconds to qualify for the final. The final on August 5 delivered Bolt's last individual race, where he earned bronze with another 9.95 seconds, finishing behind gold medalist Justin Gatlin (9.92 seconds) and silver medalist Christian Coleman (9.94 seconds). This podium finish extended Bolt's unbeaten streak in major championship 100 meters finals to 11 but ended without a victory for the first time.\n\nBolt's career concluded in the men's 4x100 meters relay final on August 12, where he anchored Jamaica's team. After a strong handover from Yohan Blake, Bolt surged into the lead but pulled up approximately 70 meters into his leg with a torn left hamstring, collapsing in pain and failing to finish. Jamaica recorded a did-not-finish, allowing Great Britain to claim gold in 37.47 seconds ahead of the United States (37.52 seconds) and Japan (38.04 seconds). The injury sidelined Bolt for the remainder of the championships and confirmed his immediate retirement at age 30, closing a career that included eight Olympic golds and 11 World Championship titles.\n\n## Post-retirement activities\n\n### Football aspirations\n\nFollowing his retirement from track and field after the 2017 World Athletics Championships, Usain Bolt pursued a professional career in football, a sport he had long admired as a lifelong fan of Manchester United. He expressed confidence in his abilities, stating in interviews that he believed he could outperform some professional players due to his speed and athletic background. Bolt began training with various clubs to transition into the sport, aiming to secure a contract as a winger where his sprinting prowess could be an asset.\n\nIn early 2018, Bolt trained with Borussia Dortmund in Germany, participating in sessions at their facility and impressing observers with his enthusiasm despite his lack of formal football experience. He then moved to South Africa for a trial with Mamelodi Sundowns, followed by a stint with Strømsgodset in Norway, where he honed basic skills like ball control and tactical awareness. These experiences built his fitness for football, though no contracts were offered. In August 2018, Bolt joined the Central Coast Mariners in Australia's A-League on an indefinite training basis, debuting in a friendly match that month and scoring two goals in his second appearance in October. His trial there lasted until November 2018, but the club could not offer a deal due to financial constraints.\n\nDuring this period, Bolt received a professional offer from Valletta FC in Malta, which he declined over disagreements on salary terms. Despite the progress, he faced challenges adapting to the demands of team play and positioning, leading to frustration. In January 2019, Bolt announced the end of his football pursuit, declaring, \"The sports life is over,\" and shifting focus to business ventures, though he reflected positively on the team experience: \"It was fun while it lasted.\"\n\nIn a 2021 interview, Bolt expressed regrets about his approach, particularly calling his move to Australia a \"mistake\" because he sought to avoid European media scrutiny, missing out on superior coaching and opportunities there. He stated, \"If I knew I would have stayed in Europe,\" highlighting how the location impacted his development. Ultimately, Bolt's football endeavor remained a brief, unfulfilled chapter, underscoring the difficulties of switching sports at age 31.\n\n### Business ventures and entrepreneurship\n\nFollowing his retirement from athletics in 2017, Usain Bolt has diversified into entrepreneurship, leveraging his global brand to launch and invest in various ventures across hospitality, music, technology, and entertainment. His activities emphasize sustainable innovation and cultural expression, though some initiatives have faced challenges. Bolt's net worth, estimated at $90 million in 2025, stems partly from these pursuits alongside endorsements.\n\nOne of Bolt's flagship ventures is Tracks \\u0026 Records, a restaurant chain he co-founded in 2015, blending Jamaican cuisine with international flavors to celebrate his sprinting legacy. The brand operates locations in Kingston (with a vegetarian emphasis), Montego Bay, and London, focusing on casual dining experiences that attract tourists and locals alike. It has expanded steadily, positioning Bolt as an active restaurateur in the hospitality sector.\n\nIn music production, Bolt established A-Team Lifestyle, a company that prioritizes dancehall and reggae genres to promote Jamaican artists. Through its imprint 9.58 Records—named after his 100m world record time—the label released the compilation album *Country Yutes* in 2021 and the riddim album *Usain Bolt Presents: 9.58 Riddim* in 2022, featuring collaborations with artists like Vybz Kartel. Bolt has described the venture as a way to give back to his cultural roots, producing tracks such as \"Touch The Sky\" and \"Money Fast.\"\n\nBolt has also ventured into technology and gaming. In 2019, he co-founded Bolt Mobility, an electric scooter startup aimed at eco-friendly urban transport, serving as its global ambassador. The company raised $30 million in a Series A round in 2020, achieving a $100 million valuation, but faced financial difficulties and ceased operations in several markets by 2022. More successfully, in 2022, Bolt became co-owner of WYLDE, an Irish esports organization focused on games like Rainbow Six Siege and FIFA. WYLDE, which he joined to disrupt competitive gaming, secured a multi-year partnership with Puma in 2023 and opened an esports academy in Cork, Ireland.\n\nEarlier entrepreneurial efforts include Champion Shave, a razor company launched in 2016 with Bolt as co-owner and ambassador, offering six-blade products marketed for affordability and quality. Despite an investment exceeding $10 million, the venture struggled and appears defunct, with its online presence discontinued. Additionally, Bolt filed for a U.S. trademark in 2022 for his iconic \"To Di World\" victory pose, intended for licensing across sunglasses, jewelry, bags, sporting goods, and even restaurant services, signaling plans to expand his personal brand into consumer products.\n\nThese initiatives reflect Bolt's shift from athletic dominance to building a multifaceted business portfolio, though setbacks like the $12.7 million loss in a 2023 Jamaican investment scam with Stocks and Securities Ltd. have tested his resilience, with partial compensation beginning in August 2025 via the SSL Victims' Compensation Fund.\n\n## Personal life\n\n### Relationships and family\n\nUsain Bolt has described his upbringing as modest, with his parents instilling values of hard work and discipline that influenced his athletic career. His father, Wellesley, a former policeman and cricketer, passed away on March 31, 2025, at the age of 68 following a lengthy illness, prompting tributes from Jamaican officials and the global athletics community for his supportive role in Bolt's success.\n\nBolt has three siblings: his younger full sister, Sherine Bolt; his younger half-brother, Sadiki Bolt (sharing the same father but different mothers); and his older half-sister, Christine Bolt-Hylton. Sherine and Sadiki have maintained low public profiles while residing in Jamaica, though Sadiki has occasionally appeared in family photos shared by Bolt on social media. Christine has also kept a low profile but has spoken publicly on family matters, including defending Bolt during controversies.\n\nIn his personal relationships, Bolt has been in a long-term partnership with Kasi Bennett, a Jamaican businesswoman, since 2013, though they kept their relationship private until 2016. The couple, who are not married but have expressed aspirations for a family life modeled after Bolt's parents' decade-long courtship before their marriage, welcomed their first child, daughter Olympia Lightning Bolt, on May 17, 2020. They expanded their family with twin sons, Thunder Bolt and Saint Leo Bolt, born on June 4, 2021. Bolt has publicly shared that fatherhood, particularly raising three young children, presents greater challenges than his Olympic achievements, emphasizing his commitment to family amid his post-retirement life.\n\n### Financial issues and recovery\n\nIn January 2023, Usain Bolt's investment company, Welljen Limited, discovered that approximately US$6.2 million had been fraudulently withdrawn from its account at Stocks and Securities Limited (SSL), a Jamaican brokerage firm, leaving a balance of just US$12,000. The funds, intended as a retirement pension for Bolt and his parents, were siphoned off through unauthorized transfers by former SSL employee Jean-Ann Panton, who was later charged in connection with the scheme. This incident formed part of a larger fraud at SSL affecting over 200 clients, with total losses surpassing US$30 million over more than a decade.\n\nBolt's legal team, led by attorney Linton Gordon, immediately pursued recovery through Jamaican authorities, who launched a joint investigation with the FBI into the alleged theft. A forensic audit by KROLL Associates, completed in November 2023, validated Welljen's claim and identified irregularities, but full restitution required a criminal conviction under Jamaica's Proceeds of Crime Act to seize assets. Bolt publicly described the ordeal as a \"stressful situation,\" expressing shock and disappointment at the betrayal by trusted financial advisors. By February 2025, with no funds returned after two years, Bolt voiced frustration over the Jamaican government's perceived inaction, noting he had personally appealed to officials without progress and felt let down despite his contributions to national pride.\n\nRecovery efforts advanced in 2025 with the establishment of an SSL Victims’ Compensation Fund, funded by liquidated firm assets totaling J$79 million against approved claims of J$1.7 billion. In August 2025, Welljen Limited was among roughly 40 approved claimants to receive an initial partial distribution starting August 25, categorized in Tiers 1 and 2, though the payout represented only a small fraction of the original loss and no specific amount for Bolt was disclosed. Panton's trial, scheduled for May 2026, could enable further asset seizures to aid ongoing restitution. Despite the setback, Bolt has continued diversifying his portfolio through endorsements and ventures, maintaining an estimated net worth exceeding US$90 million as of late 2025.\n\n### Philanthropy and personal interests\n\nBolt established the Usain Bolt Foundation in 2016, dedicated to enhancing the character of children through educational and cultural development, with a vision to create a legacy of happy children by providing opportunities for positive change. The foundation focuses on building healthy environments, recreational facilities, and programs like \"Dare to Dream\" to support youth in realizing their potential, guided by values of safety, stewardship, and knowledge. It emphasizes fiscal responsibility, high-quality services, and partnerships to deliver impactful initiatives for vulnerable children in Jamaica and beyond.\n\nKey philanthropic efforts include donations to educational and athletic programs; in March 2025, the foundation contributed J$6.1 million in cash and supplies to six rural Jamaican high schools to aid preparation for the Inter-Secondary Schools Sports Association Championships, covering expenses such as athlete spikes, food, and accommodation. Bolt has personally supported relief efforts for vulnerable youth, aligning the foundation's work with his post-retirement goals of youth empowerment through education and sports. In 2025, he headlined the inaugural Pho3nix Charity Gala in Zurich, raising funds for child welfare initiatives that complement the foundation's mission.\n\nBeyond philanthropy, Bolt's personal interests reflect his energetic personality and Jamaican roots. A lifelong Manchester United supporter, he has expressed a dream to play professionally for the club, training with them in 2018 and, in January 2025, praising their early 2024-2025 Premier League form as capable of securing the title due to their commitment. His passion for football extends to casual play and commentary, often sharing insights on matches via social media and interviews.\n\nBolt is an avid enthusiast of dancehall music, a genre central to Jamaican culture, and has pursued it post-retirement by producing tracks and collaborating with artists, viewing it as a creative outlet akin to his sprinting career. He credits video games, particularly Mario Kart, with sharpening his focus and reflexes during his athletic prime, incorporating gaming into his relaxation routine. Additionally, Bolt maintains a notable collection of luxury cars, including a gold-painted Nissan GT-R gifted by the manufacturer in 2013 to celebrate his Olympic achievements, alongside vehicles like a Mini Cooper and Jeep Wrangler that suit his love for speed off the track.\n\n## Public image and media\n\n### Sponsorships and endorsements\n\nUsain Bolt's sponsorships and endorsements have formed a cornerstone of his commercial success, generating an estimated $20 million annually from brand partnerships as of 2025. His marketability, driven by his record-breaking achievements and charismatic persona, positioned him as one of the most valuable athletes in track and field, earning him approximately 20 times more than the average sprinter at his peak.\n\nBolt's longest and most lucrative deal is with Puma, which signed him in 2003 at age 16 for an initial contract that evolved into a lifetime ambassadorship worth about $10 million per year. This partnership included signature products like the PUMA x Bolt collection of training gear and sprint spikes, contributing to a 200% sales surge for Puma during the 2012 Olympics and tripling the brand's track and field division growth. Puma's investment extended post-retirement, with the deal running through at least 2025 and featuring co-branded fashion lines that leveraged Bolt's global icon status.\n\nOther major endorsements include Gatorade, for which Bolt appeared in Super Bowl commercials promoting hydration and performance; Hublot, featuring him in playful watch campaigns; and Nissan, with airport-based ads for the GT-R model. Visa and Virgin Media also partnered with him for promotional efforts tied to major events like the Olympics, while early deals with Digicel provided foundational support before his international breakthrough. These agreements, often valued between $1 million and $4 million each, amplified Bolt's visibility and helped diversify Puma's portfolio across sports and lifestyle sectors.\n\nPost-retirement in 2017, Bolt's endorsement portfolio remained robust, with continued roles as a brand ambassador for Puma, Gatorade, and Hublot, sustaining his high earnings without the demands of competition. His involvement in these deals extended to creative input on campaigns, such as Puma's \"Stick Stick Stick\" initiative from 2004, underscoring his transition from athlete to enduring commercial figure.\n\n### Entertainment pursuits and music\n\nUsain Bolt has pursued entertainment through DJing and music production, blending his athletic fame with Jamaican musical traditions like reggae and dancehall. His interest in music dates back to at least 2010, when he performed a reggae-focused DJ set at a Puma event in Paris City Hall, playing tracks such as Bob Marley's \"Iron Lion Zion\" and Beres Hammond's \"Putting Up Resistance.\" This marked the start of informal DJ appearances, including an impromptu set in Rome's Piazza di Spagna in 2012 featuring electronic dance music like Tommy Trash's \"Cascade,\" and a post-race afterparty in Oslo following his win at the Bislett Games that same year. Bolt has described these performances as a fun outlet tied to his love for Jamaican sounds, often incorporating live MCing and scratching on equipment like Serato turntables, as seen in a 2013 guest set at Club Privilege in Kingston.\n\nTransitioning from performer to producer, Bolt executive-produced the Olympe Rosé riddim in 2019, a trap-influenced dancehall beat launched at his Tracks and Records gym in Kingston. Collaborating with his cousin Rajah \"Plugs\" Nelson, the project featured artists including Dexta Daps on \"Big Moves,\" Munga Honorable on \"Weekend,\" and Christopher Martin on \"Dweet,\" and was distributed worldwide via 21st Hapilos to over 600 digital platforms. This effort promoted his role as chief entertainment officer for G.H. Mumm's Olympe Rosé champagne, highlighting Bolt's aim to fuse music with branding. In 2021, he released the single \"Living the Dream\" and prepared a Dancehall EP to establish himself internationally, emphasizing a deliberate build-up akin to his sprinting career.\n\nBolt's debut album, *Country Yutes*, arrived on September 3, 2021, via A-Team Lifestyle and United Masters, with him serving as executive producer and vibes curator alongside childhood friend Nugent \"NJ\" Walker. Recorded at Kingston's Big Yard studio, the project mixes reggae, Afrobeats, and dancehall to reflect Bolt's rural Jamaican roots in Sherwood Content, including tracks like \"LIVING THE DREAM\" and \"RIP MY G,\" a tribute to late high jumper Germaine Mason. He has collaborated with artists such as Migos' Quavo, Jamaican singer Koffee, and dancehall veterans Dexta Daps and Baby Cham, drawing from influences like Drake while prioritizing positive messaging for youth. By 2022, Bolt launched an NFT collection titled \"Tracks and Records,\" pairing five of his world records with beats from the album.\n\nIn entertainment beyond music, Bolt made cameo appearances in high-profile videos, including Stormzy's 2022 track \"Mel Made Me Do It,\" an 11-minute clip directed by KLVDR that also featured José Mourinho and Louis Theroux. He has expressed ambitions to emulate producer DJ Khaled by securing Grammy wins and platinum albums, viewing music as a platform for global impact. By September 2025, Bolt committed to music full-time, citing the need to promote positivity amid global challenges, with *Country Yutes* as a vehicle for uplifting youth through energetic Jamaican genres.\n\n### Documentaries, publications, and awards\n\nSeveral documentaries have chronicled Usain Bolt's life, career, and impact on athletics. The 2016 film *I Am Bolt*, directed by Benjamin Turner and Gabe Turner, provides an intimate look at Bolt's journey from his Jamaican roots to Olympic stardom, featuring interviews with Bolt, his family, and peers like Serena Williams and Pelé. It explores his motivations, training regimen, and the pressures of fame, culminating in his final races at the 2016 Rio Olympics. The documentary received positive reviews for its engaging portrayal of Bolt's charisma and legacy, earning an 86% approval rating on Rotten Tomatoes. Another notable production is the 2012 BBC documentary *Usain Bolt: The Fastest Man Alive*, directed by Gaël Leiblang, which follows Bolt's preparation for the London Olympics, highlighting his world records and personal challenges through archival footage and on-the-ground reporting. This film emphasizes his quest to defend his titles and captures the global excitement surrounding his performances.\n\nBolt has also contributed to publications that detail his experiences and worldview. His primary work is the 2012 autobiography *Faster than Lightning: My Autobiography*, co-written with Chris Brighty, where he recounts his upbringing in Trelawny, Jamaica, early struggles with scoliosis, breakthrough at the 2008 Beijing Olympics, and the highs of fame alongside temptations like partying. The book offers insights into his mindset, including his laid-back personality and drive to inspire youth, and became a bestseller, praised for its honest and humorous tone.\n\nBeyond his sporting accolades, Bolt has received numerous honors recognizing his broader cultural and inspirational influence. In 2022, he was awarded the BBC Sports Personality of the Year Lifetime Achievement Award, joining luminaries like Pelé and Serena Williams for his transformative impact on track and field and global sports entertainment. This prestigious recognition highlighted his eight Olympic golds and role as a positive ambassador for Jamaica. In 2009, Bolt was bestowed the Order of Jamaica, one of his nation's highest civilian honors, for elevating Jamaica's profile on the world stage through his achievements. Additionally, in 2011, the University of the West Indies conferred upon him an honorary Doctor of Laws degree, acknowledging his contributions to sports, education, and youth development in the Caribbean. These awards underscore Bolt's enduring legacy as a cultural icon beyond the track.\n\n## Legacy and statistics\n\n### Impact on athletics and records\n\nUsain Bolt's dominance in sprinting profoundly elevated the standards of track and field athletics, particularly through his establishment of seemingly unattainable world records that reshaped expectations for human performance. In 2009 at the World Championships in Berlin, Bolt set the men's 100m world record at 9.58 seconds and the 200m record at 19.19 seconds, marks that remain unbroken as of 2025 and represent improvements of 0.11 seconds and 0.11 seconds, respectively, over previous benchmarks. These achievements, combined with his 4x100m relay world record of 37.10 seconds set in Beijing 2008, not only highlighted his exceptional biomechanics—such as an average step length of 2.449 meters and a maximum velocity of 12.32 m/s in the 100m—but also prompted scientific analyses that advanced understanding of sprint optimization, including the balance of acceleration, top speed maintenance, and minimal deceleration.\n\nBeyond the numerical feats, Bolt's records catalyzed a surge in global interest and participation in athletics, transforming sprinting from a niche discipline into a spectacle of mass appeal. His performances, characterized by dramatic comebacks and charismatic celebrations, drew unprecedented viewership, underscoring his role in revitalizing the sport's visibility. This phenomenon extended to sponsorships, with Bolt securing the largest-ever deal for a track athlete—a $10 million annual Puma contract starting in 2013—demonstrating how his records translated into economic growth for athletics. Jamaica's rise to 13th in the 2008 Olympic medal table, fueled by six golds largely from sprint events, further exemplified his influence on national programs and talent development.\n\nBolt's legacy in records also inspired innovations in training methodologies and athlete preparation, emphasizing genetic advantages like his 1.95-meter height and stride efficiency while encouraging a focus on joy and mental resilience over rote technical drills. Post-retirement analyses credit him with \"almost single-handedly bringing the sport to a new generation\" by infusing it with showmanship, leading to increased youth engagement and the emergence of talents like Noah Lyles and Erriyon Knighton who reference Bolt as a benchmark. His eight Olympic golds and 11 World Championship titles across three events solidified sprinting's Olympic prestige, ensuring that future records will be measured against his era of unparalleled dominance.\n\n### Major achievements and honors\n\nUsain Bolt is renowned for his unprecedented dominance in sprinting, securing eight Olympic gold medals across three consecutive Games. He won the men's 100 meters and 200 meters events at the 2008 Beijing Olympics, setting world records in both with times of 9.69 seconds and 19.30 seconds, respectively, and contributed to Jamaica's 4x100 meters relay victory in 37.10 seconds, also a world record. At the 2012 London Olympics, Bolt defended his titles in the 100 meters (9.63 seconds, Olympic record) and 200 meters (19.32 seconds), while anchoring the relay team to gold in 36.84 seconds, another world record. In 2016 at Rio de Janeiro, he completed the \"triple-triple\" by claiming gold in the 100 meters (9.81 seconds) and 200 meters (19.78 seconds), becoming the first athlete to win these events at three straight Olympics, though Jamaica's 2016 relay gold was later stripped due to a teammate's doping violation, leaving Bolt with eight total Olympic golds.\n\nAt the World Athletics Championships, Bolt amassed 11 gold medals, establishing him as one of the most successful sprinters in the event's history. His triumphs include three 100 meters titles (2009, 2013, 2015), four 200 meters titles (2009, 2011, 2013, 2015), and four 4x100 meters relay golds (2009, 2011, 2013, 2015), with multiple world records set during these competitions, such as his 9.58-second 100 meters in Berlin 2009 and 19.19-second 200 meters in the same championships. These performances not only broke barriers in speed but also popularized sprinting globally, with Bolt's records remaining unbroken as of 2025.\n\nBolt's world records stand as cornerstones of his legacy: 9.58 seconds in the 100 meters (Berlin, 2009), 19.19 seconds in the 200 meters (Berlin, 2009), and 36.84 seconds in the 4x100 meters relay (London, 2012), all ratified by World Athletics. He also holds national records for Jamaica in these events. Early in his career, Bolt earned junior accolades, including the 200 meters gold at the 2002 World Junior Championships and the IAAF Rising Star Award in 2002 and 2003.\n\nAmong his honors, Bolt received the IAAF World Athlete of the Year award a record six times (2008, 2009, 2011, 2012, 2013, 2016), recognizing his exceptional contributions to athletics. He was named Laureus World Sportsman of the Year four times (2009, 2010, 2013, 2017), the most for any male athlete in that award's history. In Jamaica, he was conferred the Order of the Nation in 2009, the country's highest civilian honor, for his sporting excellence. Additional recognitions include BBC Overseas Sports Personality of the Year (2008, 2012) and designation as a Guinness World Records Icon in 2025 for his multiple record-breaking feats.\n\n### Performance records and rankings\n\nUsain Bolt holds the men's world record in the 100 metres with a time of 9.58 seconds, set on 16 August 2009 at the World Championships in Berlin, Germany. This performance, aided by a +0.9 m/s tailwind, remains unbroken as of 2025 and also serves as the Olympic and World Championships record. In the 200 metres, Bolt's world record stands at 19.19 seconds, achieved two days later on 20 August 2009 in Berlin under a -0.3 m/s headwind, marking it as one of the most dominant sprint achievements. Additionally, he anchored Jamaica to the men's 4 × 100 metres relay world record of 36.84 seconds at the 2012 London Olympics, a mark that also holds as the Olympic record and has not been surpassed in subsequent years, including the 2025 World Championships where the leading time was 37.29 seconds.\n\nBolt's dominance is evident in all-time performance lists maintained by World Athletics. In the 100 metres, he occupies the top three positions with times of 9.58 seconds (Berlin, 2009), 9.63 seconds (London Olympics, 2012), and 9.69 seconds (Beijing Olympics, 2008), accounting for a significant portion of the fastest legal performances in history. For the 200 metres, Bolt holds the first and third spots with 19.19 seconds (Berlin, 2009) and 19.30 seconds (Beijing Olympics, 2008), underscoring his versatility across distances. In the 4 × 100 metres relay, the Jamaican team featuring Bolt in 2012 ranks first on the all-time list, with his contributions also placing other Jamaican relays he anchored in the top 25.\n\n| Event | Rank | Time | Date | Venue | Notes |\n|-------|------|------|------|-------|-------|\n| 100 m | 1 | 9.58 s | 16 Aug 2009 | Berlin, Germany | World Record |\n| 100 m | 2 | 9.63 s | 5 Aug 2012 | London, United Kingdom | Olympic Record |\n| 100 m | 3 | 9.69 s | 16 Aug 2008 | Beijing, China | - |\n| 200 m | 1 | 19.19 s | 20 Aug 2009 | Berlin, Germany | World Record |\n| 200 m | 3 | 19.30 s | 20 Aug 2008 | Beijing, China | Olympic Record |\n| 4 × 100 m | 1 | 36.84 s | 11 Aug 2012 | London, United Kingdom | World and Olympic Record |\n\nWorld Athletics rankings further highlight Bolt's supremacy, as he was named the top-ranked athlete in the 100 metres for eight consecutive years from 2008 to 2015 and in the 200 metres for seven years from 2008 to 2014. These rankings, based on seasonal performances and major competition results, reflect his unparalleled consistency, with no other sprinter matching his combination of world records and sustained top positioning across events.",
  "external_references": [
    {
      "text": "Usain Bolt 14201847",
      "url": "https://worldathletics.org/athletes/jamaica/usain-bolt-14201847",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Athlete",
      "url": "https://usainbolt.com/athlete/",
      "domain": "usainbolt.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt",
      "url": "https://www.olympics.com/en/athletes/usain-bolt",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt",
      "url": "https://olympics.com/en/athletes/usain-bolt",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Jamaica Athletics",
      "url": "https://www.theguardian.com/sport/2009/aug/09/usain-bolt-jamaica-athletics",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Olympic Champion Usain Bolt Was Raised In Adventist Home",
      "url": "https://adventistreview.org/news/olympic-champion-usain-bolt-was-raised-in-adventist-home/",
      "domain": "adventistreview.org",
      "type": "citation"
    },
    {
      "text": "37078358",
      "url": "https://www.bbc.com/sport/olympics/37078358",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Father Wellesley Bolt Dead Illness Legacy 11706681",
      "url": "https://people.com/usain-bolt-father-wellesley-bolt-dead-illness-legacy-11706681",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "Downloadnsa",
      "url": "https://worldathletics.org/download/downloadnsa?filename=bf3e56c5-67aa-4287-9a65-b5824ba69e77.pdf\\u0026urlslug=the-bolt-phenomenon",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Acref 9780195301731 E 50903",
      "url": "https://oxfordaasc.com/display/10.1093/acref/9780195301731.001.0001/acref-9780195301731-e-50903",
      "domain": "oxfordaasc.com",
      "type": "citation"
    },
    {
      "text": "Two Years Ago In Kingstonusain Bolt",
      "url": "https://worldathletics.org/news/news/two-years-ago-in-kingstonusain-bolt",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Read Article.php",
      "url": "http://www.sportsjamaica.com/read_article.php?id=13632",
      "domain": "sportsjamaica.com",
      "type": "citation"
    },
    {
      "text": "Bolt Dashes To 1993 World Junior 200m Recor",
      "url": "https://worldathletics.org/news/news/bolt-dashes-to-1993-world-junior-200m-recor",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "D3ab2253010416b503996d8a9af932f7",
      "url": "https://www.foxsports.com.au/olympics/usain-bolt-doesnt-have-a-perfect-olympics-record-after-having-lost-in-200m-heats-at-2004-athens-games/news-story/d3ab2253010416b503996d8a9af932f7",
      "domain": "foxsports.com.au",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/results/world-athletics-championships/2005/10th-iaaf-world-championships-in-athletics-6937596/men/200-metres/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Sports2.html",
      "url": "http://old.jamaica-gleaner.com/gleaner/20070720/sports/sports2.html",
      "domain": "old.jamaica-gleaner.com",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/competitions/world-athletics-championships/11th-iaaf-world-championships-in-athletics-6903480/results/men/4x100-metres-relay/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Bolt 972 In New York World 100m Record Ia",
      "url": "https://worldathletics.org/news/news/bolt-972-in-new-york-world-100m-record-ia",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/results/olympic-games/2008/the-xxix-olympic-games-6977748/men/100-metres/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Bolt Again 1930sec World 200m Record In Beiji",
      "url": "https://worldathletics.org/news/news/bolt-again-1930sec-world-200m-record-in-beiji",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "News Flash World 4x100m Record 3710 Sec B",
      "url": "https://worldathletics.org/news/news/news-flash-world-4x100m-record-3710-sec-b",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Ioc Sanctions Two Athletes For Failing Anti Doping Test At Beijing 2008",
      "url": "https://www.olympics.com/ioc/news/ioc-sanctions-two-athletes-for-failing-anti-doping-test-at-beijing-2008",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/competitions/world-athletics-championships/12th-iaaf-world-championships-in-athletics-6998524/results/men/100-metres/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/results/world-athletics-championships/2009/12th-iaaf-world-championships-in-athletics-6998524/men/4x100-metres-relay/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "14698558",
      "url": "https://www.bbc.co.uk/sport/0/athletics/14698558",
      "domain": "bbc.co.uk",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/competitions/world-athletics-championships/world-athletics-championships-daegu-2011-7003367/results/men/200-metres/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/competitions/world-athletics-championships/world-athletics-championships-daegu-2011-7003367/results/men/4x100-metres-relay/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/competitions/olympic-games/thexxx-olympic-games-6999193/results/men/100-metres/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "London 2012 Event Report Mens 200m Final",
      "url": "https://worldathletics.org/news/report/london-2012-event-report-mens-200m-final",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Jamaica Crush 4x100m Relay World Record 368",
      "url": "https://worldathletics.org/news/news/jamaica-crush-4x100m-relay-world-record-368",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "40790508",
      "url": "https://www.bbc.com/sport/athletics/40790508",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Bolt Confirms Wont Run 200m London",
      "url": "https://www.channelstv.com/2017/07/19/bolt-confirms-wont-run-200m-london/",
      "domain": "channelstv.com",
      "type": "citation"
    },
    {
      "text": "Nitro Melbourne Bolt 150m",
      "url": "https://worldathletics.org/news/report/nitro-melbourne-bolt-150m",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Monaco Diamond League 2017 Bolt 995",
      "url": "https://worldathletics.org/news/report/monaco-diamond-league-2017-bolt-995",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/results/world-athletics-championships/2017/iaaf-world-championships-london-2017-7093740/men/100-metres/heats/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Summary",
      "url": "https://worldathletics.org/competitions/world-athletics-championships/iaaf-world-championships-london-2017-5151/results/men/100-metres/semi-final/summary",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/results/world-athletics-championships/2017/iaaf-world-championships-london-2017-7093740/men/100-metres/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "40839202",
      "url": "https://www.bbc.com/sport/athletics/40839202",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Relay World Championships.html",
      "url": "https://www.nytimes.com/2017/08/12/sports/usain-bolt-relay-world-championships.html",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Result",
      "url": "https://worldathletics.org/competitions/world-athletics-championships/iaaf-worldchampionships-london-2017-7093740/results/men/4x100-metres-relay/final/result",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Iaaf World Athletics Championships 2017 Usain Bolt Finishes Career Unlikely Fall",
      "url": "https://www.espn.com/athletics/story/_/id/20326247/iaaf-world-athletics-championships-2017-usain-bolt-finishes-career-unlikely-fall",
      "domain": "espn.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Reveals Regrets About Football Career",
      "url": "https://www.olympics.com/en/news/usain-bolt-reveals-regrets-about-football-career",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "46966279",
      "url": "https://www.bbc.com/sport/athletics/46966279",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "World Australia 46068150",
      "url": "https://www.bbc.com/news/world-australia-46068150",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Earns Tryout With Australias Central Coast Mariners",
      "url": "https://www.cnn.com/2018/08/07/football/usain-bolt-earns-tryout-with-australias-central-coast-mariners",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Gives Up On Football Dream Saying His Sports Life Is Over",
      "url": "https://www.theguardian.com/sport/2019/jan/23/usain-bolt-gives-up-on-football-dream-saying-his-sports-life-is-over",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt How The Worlds Fastest Man Built A Business Empire",
      "url": "https://www.theceomagazine.com/business/coverstory/usain-bolt-how-the-worlds-fastest-man-built-a-business-empire/",
      "domain": "theceomagazine.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Net Worth 2025 Endorsements Business Ventures Legacy Explained",
      "url": "https://tradebrains.in/usain-bolt-net-worth-2025-endorsements-business-ventures-legacy-explained/",
      "domain": "tradebrains.in",
      "type": "citation"
    },
    {
      "text": "Usain Bolt 3 Thriving Multi Million Ventures Owned By Jamaican Sprint Legend 2025030610573777175",
      "url": "https://www.pulsesports.co.ke/lifestyle/story/usain-bolt-3-thriving-multi-million-ventures-owned-by-jamaican-sprint-legend-2025030610573777175",
      "domain": "pulsesports.co.ke",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Debut Album Dancehall Country Yutes News",
      "url": "https://mixmag.net/read/usain-bolt-debut-album-dancehall-country-yutes-news",
      "domain": "mixmag.net",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Is Sprinting Toward His Next Venture 133719845.html",
      "url": "https://finance.yahoo.com/news/usain-bolt-is-sprinting-toward-his-next-venture-133719845.html",
      "domain": "finance.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolts Scooter Company Closes 30m Series",
      "url": "https://www.morningbrew.com/stories/2020/03/03/usain-bolts-scooter-company-closes-30m-series",
      "domain": "morningbrew.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Backed Startup Has Disappeared From Many Markets After Raising 40 2 Million",
      "url": "https://dazeinfo.com/2022/08/02/usain-bolt-backed-startup-has-disappeared-from-many-markets-after-raising-40-2-million/",
      "domain": "dazeinfo.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Enters Esports With Surprising Team Ownership Deal",
      "url": "https://www.forbes.com/sites/mattgardner1/2022/03/30/usain-bolt-enters-esports-with-surprising-team-ownership-deal/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "Wylde Esports Puma Usain Bolt",
      "url": "https://esportsinsider.com/2023/03/wylde-esports-puma-usain-bolt",
      "domain": "esportsinsider.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Retired Athletics Failed Business 651467 20241126",
      "url": "https://www.sportbible.com/nba/usain-bolt-retired-athletics-failed-business-651467-20241126",
      "domain": "sportbible.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Brand Business Model 35m Annual Income Increase Worlds Greatest Athlete Stops Sprinting",
      "url": "https://www.peterfisk.com/2017/08/usain-bolt-brand-business-model-35m-annual-income-increase-worlds-greatest-athlete-stops-sprinting/",
      "domain": "peterfisk.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Ready To Take His Business To The World",
      "url": "https://our.today/usain-bolt-ready-to-take-his-business-to-the-world/",
      "domain": "our.today",
      "type": "citation"
    },
    {
      "text": "Jamaicas Usain Bolt Missing 12 7 Million In Possible Fraud",
      "url": "https://www.aljazeera.com/news/2023/1/20/jamaicas-usain-bolt-missing-12-7-million-in-possible-fraud",
      "domain": "aljazeera.com",
      "type": "citation"
    },
    {
      "text": "Ssl Payout Starts",
      "url": "https://jamaica-gleaner.com/article/lead-stories/20250824/ssl-payout-starts",
      "domain": "jamaica-gleaner.com",
      "type": "citation"
    },
    {
      "text": "Who Is Kasi Bennett Usain Bolt 8385871",
      "url": "https://people.com/who-is-kasi-bennett-usain-bolt-8385871",
      "domain": "people.com",
      "type": "citation"
    },
    {
      "text": "Wellesley Bolt Father Usain Bolt Died",
      "url": "https://www.jamaicaobserver.com/2025/03/31/wellesley-bolt-father-usain-bolt-died/",
      "domain": "jamaicaobserver.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Dad Wellesley Death Illness",
      "url": "https://www.the-sun.com/sport/13912646/usain-bolt-dad-wellesley-death-illness/",
      "domain": "the-sun.com",
      "type": "citation"
    },
    {
      "text": "5 Things You Did Not Know About Usain Bolts Family 2025051511294635641",
      "url": "https://www.pulsesports.co.ke/athletics/story/5-things-you-did-not-know-about-usain-bolts-family-2025051511294635641",
      "domain": "pulsesports.co.ke",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Family Parents Girlfriend Marriage Jennifer Wellesley Siblings Hometown Trelawny",
      "url": "https://heavy.com/sports/2016/08/usain-bolt-family-parents-girlfriend-marriage-jennifer-wellesley-siblings-hometown-trelawny/",
      "domain": "heavy.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Who Are The Siblings Of The Greatest Sprinter Of All Time 2025021919035787402",
      "url": "https://www.pulsesports.co.ke/athletics/story/usain-bolt-who-are-the-siblings-of-the-greatest-sprinter-of-all-time-2025021919035787402",
      "domain": "pulsesports.co.ke",
      "type": "citation"
    },
    {
      "text": "124365761.cms",
      "url": "https://timesofindia.indiatimes.com/sports/international-sports/who-is-usain-bolts-partner-inside-kasi-bennetts-life-and-their-family-journey/articleshow/124365761.cms",
      "domain": "timesofindia.indiatimes.com",
      "type": "citation"
    },
    {
      "text": "7860321002",
      "url": "https://www.usatoday.com/story/sports/olympics/2021/07/06/usain-bolt-discusses-fatherhood-and-newborn-twins-saint-leo-thunder/7860321002/",
      "domain": "usatoday.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt And Partner Welcome Newborn Twins Thunder And Saint Leo",
      "url": "https://www.theguardian.com/sport/2021/jun/21/usain-bolt-and-partner-welcome-newborn-twins-thunder-and-saint-leo",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Baby Twins Born Intl Hnk",
      "url": "https://www.cnn.com/2021/06/21/sport/usain-bolt-baby-twins-born-intl-hnk",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Talks New Baby Boy Twins Lack Of Sleep What He S Afraid Of And Why Tr",
      "url": "https://www.olympics.com/en/news/usain-bolt-talks-new-baby-boy-twins-lack-of-sleep-what-he-s-afraid-of-and-why-tr",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Bolts Ssl Funds Validated",
      "url": "https://jamaica-gleaner.com/article/lead-stories/20240303/bolts-ssl-funds-validated",
      "domain": "jamaica-gleaner.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Seeks Missing 127 Mln Jamaica Investment Firm 2023 01 18",
      "url": "https://www.reuters.com/business/finance/usain-bolt-seeks-missing-127-mln-jamaica-investment-firm-2023-01-18/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Bolt Frustrated Over Governments Inaction Missing Millions",
      "url": "https://jamaica-gleaner.com/article/esponsored/20250218/bolt-frustrated-over-governments-inaction-missing-millions",
      "domain": "jamaica-gleaner.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Fraud Allegations Reaction Spt Intl",
      "url": "https://www.cnn.com/2023/01/28/sport/usain-bolt-fraud-allegations-reaction-spt-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Among Ssl Fraud Victims To Receive Partial Payout",
      "url": "https://www.caribbeannationalweekly.com/news/caribbean-news/usain-bolt-among-ssl-fraud-victims-to-receive-partial-payout/",
      "domain": "caribbeannationalweekly.com",
      "type": "citation"
    },
    {
      "text": "Foundation",
      "url": "https://usainbolt.com/foundation/",
      "domain": "usainbolt.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Foundation Gives Back Millions To Rural Schools To Prepare For Issa Champs 2025",
      "url": "https://usainbolt.com/foundations/usain-bolt-foundation-gives-back-millions-to-rural-schools-to-prepare-for-issa-champs-2025/",
      "domain": "usainbolt.com",
      "type": "citation"
    },
    {
      "text": "The Usain Bolt Foundation Daring Youth To Sprint To Big Dreams",
      "url": "https://cvssja.org/the-usain-bolt-foundation-daring-youth-to-sprint-to-big-dreams/",
      "domain": "cvssja.org",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Headlines Pho3nix Charity Gala Inaugural",
      "url": "https://pho3nixfoundation.com/news/usain-bolt-headlines-pho3nix-charity-gala-inaugural/",
      "domain": "pho3nixfoundation.com",
      "type": "citation"
    },
    {
      "text": "Five Things To Know About Usain Bolt Playing Football",
      "url": "https://www.manutd.com/en/news/detail/five-things-to-know-about-usain-bolt-playing-football",
      "domain": "manutd.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Believes Manchester United Can Win The Premier League If They Play Like This 2025 01 06",
      "url": "https://www.beinsports.com/en-us/soccer/premier-league/articles-video/usain-bolt-believes-manchester-united-can-win-the-premier-league-if-they-play-like-this-2025-01-06",
      "domain": "beinsports.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Manchester United Ac Milan Europa League Spt Intl",
      "url": "https://www.cnn.com/2021/03/18/football/usain-bolt-manchester-united-ac-milan-europa-league-spt-intl",
      "domain": "cnn.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Olympics Dancehall Music",
      "url": "https://www.nytimes.com/athletic/2660640/2021/06/22/usain-bolt-olympics-dancehall-music/",
      "domain": "nytimes.com",
      "type": "citation"
    },
    {
      "text": "Entertainment Arts 59669585",
      "url": "https://www.bbc.com/news/av/entertainment-arts-59669585",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Release 00fb3f22783e40f1b4bf9071e2eae59e",
      "url": "https://usa.nissannews.com/en-US/releases/release-00fb3f22783e40f1b4bf9071e2eae59e?gallery=release-00fb3f22783e40f1b4bf9071e2eae59e\\u0026viewallTab=photos\\u0026origin=channel-246",
      "domain": "usa.nissannews.com",
      "type": "citation"
    },
    {
      "text": "Check Out Usain Bolts Incredible 1 Million Car Collection With Photos",
      "url": "https://clutchpoints.com/olympics/check-out-usain-bolts-incredible-1-million-car-collection-with-photos",
      "domain": "clutchpoints.com",
      "type": "citation"
    },
    {
      "text": "123938233.cms",
      "url": "https://timesofindia.indiatimes.com/sports/international-sports/usain-bolts-net-worth-in-2025-how-the-greatest-sprinter-of-all-time-turned-olympic-glory-into-a-thriving-business-empire/articleshow/123938233.cms",
      "domain": "timesofindia.indiatimes.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt",
      "url": "https://www.forbes.com/profile/usain-bolt/",
      "domain": "forbes.com",
      "type": "citation"
    },
    {
      "text": "How Usain Bolt Built Legacy Marketing Sponsorship",
      "url": "https://www.sportspro.com/insights/features/from-the-magazine/how-usain-bolt-built-legacy-marketing-sponsorship/",
      "domain": "sportspro.com",
      "type": "citation"
    },
    {
      "text": "Case Study How Puma Built A Brand Around Usain Bolt",
      "url": "https://www.unpauzed.com/post/case-study-how-puma-built-a-brand-around-usain-bolt",
      "domain": "unpauzed.com",
      "type": "citation"
    },
    {
      "text": "How Usain Bolt Spends His Millions 2016 8",
      "url": "https://www.businessinsider.com/how-usain-bolt-spends-his-millions-2016-8",
      "domain": "businessinsider.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Dj Set Youtube Retrospective Olympics Rio",
      "url": "https://www.vice.com/en/article/usain-bolt-dj-set-youtube-retrospective-olympics-rio/",
      "domain": "vice.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Riddim Track Video",
      "url": "https://www.billboard.com/pro/usain-bolt-riddim-track-video/",
      "domain": "billboard.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Prepares Dancehall Ep Says Music Career Is No Joke.html",
      "url": "https://www.dancehallmag.com/2021/02/15/news/usain-bolt-prepares-dancehall-ep-says-music-career-is-no-joke.html",
      "domain": "dancehallmag.com",
      "type": "citation"
    },
    {
      "text": "Olympic Runner Usain Bolt Grammy Interview Gives Track New Meaning Debut Reggae Album Country Yutes",
      "url": "https://www.grammy.com/news/olympic-runner-usain-bolt-grammy-interview-gives-track-new-meaning-debut-reggae-album-country-yutes",
      "domain": "grammy.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Talks Quavo Koffee Drake Sheds Light Music Career 2020 2",
      "url": "https://www.businessinsider.com/usain-bolt-talks-quavo-koffee-drake-sheds-light-music-career-2020-2",
      "domain": "businessinsider.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Conquer Music World",
      "url": "https://www.olympics.com/en/news/usain-bolt-conquer-music-world",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Dina Asher Smith Stormzy Video",
      "url": "https://www.olympics.com/en/news/usain-bolt-dina-asher-smith-stormzy-video",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "There Is A Lot Going On Usain Bolt Explains Why Music Is Now His Full Time Focus 2025093010221720859",
      "url": "https://www.pulsesports.co.ke/athletics/story/there-is-a-lot-going-on-usain-bolt-explains-why-music-is-now-his-full-time-focus-2025093010221720859",
      "domain": "pulsesports.co.ke",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Record World Champion Athlete Fastest Man Olympics Sprinter 100m 200m",
      "url": "https://www.olympics.com/en/news/usain-bolt-record-world-champion-athlete-fastest-man-olympics-sprinter-100m-200m",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Pmc10669785",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10669785/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Bolt Signs 10 Million Deal To Stay With Puma Idusbre98n0am",
      "url": "https://www.reuters.com/article/sports/bolt-signs-10-million-deal-to-stay-with-puma-idUSBRE98N0AM/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Bolts Time Runs Out Greatest Athletics Champion Of Them All",
      "url": "https://www.theguardian.com/sport/2017/aug/05/bolts-time-runs-out-greatest-athletics-champion-of-them-all",
      "domain": "theguardian.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Impact Track And Field Athletics Shelly Ann Fraser Pryce",
      "url": "https://www.olympics.com/en/news/usain-bolt-impact-track-and-field-athletics-shelly-ann-fraser-pryce",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Usain Bolt Values His Eight Olympic Gold Medals Over His World Records",
      "url": "https://www.olympics.com/en/news/usain-bolt-values-his-eight-olympic-gold-medals-over-his-world-records",
      "domain": "olympics.com",
      "type": "citation"
    },
    {
      "text": "Five World Championships Multiple Medallists",
      "url": "https://worldathletics.org/news/series/five-world-championships-multiple-medallists",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Senior",
      "url": "https://worldathletics.org/records/all-time-toplists/sprints/100-metres/outdoor/men/senior",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Usain St Leo Bolt",
      "url": "https://jis.gov.jm/information/famous-jamaicans/usain-st-leo-bolt/",
      "domain": "jis.gov.jm",
      "type": "citation"
    },
    {
      "text": "Go Head To Head With Worlds Fastest Man Usain Bolt In Our Ultimate 100 M Quiz",
      "url": "https://www.guinnessworldrecords.com/news/2025/6/go-head-to-head-with-worlds-fastest-man-usain-bolt-in-our-ultimate-100-m-quiz",
      "domain": "guinnessworldrecords.com",
      "type": "citation"
    },
    {
      "text": "Men",
      "url": "https://worldathletics.org/records/by-discipline/sprints/200-metres/outdoor/men",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Men",
      "url": "https://worldathletics.org/records/by-discipline/relays/4x100-metres-relay/outdoor/men",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Senior",
      "url": "https://worldathletics.org/records/all-time-toplists/sprints/200-metres/outdoor/men/senior",
      "domain": "worldathletics.org",
      "type": "citation"
    },
    {
      "text": "Senior",
      "url": "https://worldathletics.org/records/all-time-toplists/relays/4x100-metres-relay/outdoor/men/senior",
      "domain": "worldathletics.org",
      "type": "citation"
    }
  ],
  "internal_links": [],
  "fetched_at": "2025-12-07T07:14:31.181513",
  "elapsed_ms": 24120
}