{
  "topic": "Vaccine",
  "title": "Vaccine",
  "slug": "vaccine",
  "grokipedia_slug": "Vaccine",
  "grokipedia_url": "https://grokipedia.com/page/Vaccine",
  "source": "grokipedia",
  "content": "# Vaccine\n\nA vaccine is a biological preparation consisting of attenuated or inactivated microorganisms, or fractions thereof such as proteins or genetic material, designed to stimulate the body's immune system to develop immunity against a specific infectious disease without causing the illness itself. This process mimics natural infection by presenting antigens that trigger the production of antibodies and memory cells, enabling a rapid and effective response upon subsequent exposure to the pathogen.\n\nThe development of vaccines traces back to 1796, when English physician Edward Jenner demonstrated that exposure to cowpox—a milder related virus—could confer protection against the deadly smallpox virus through a process he termed \"vaccination,\" derived from the Latin *vacca* for cow. Jenner's empirical observations and controlled experiments, including inoculating an 8-year-old boy with cowpox pus followed by a challenge with smallpox variolation, established the foundational principle of using a harmless agent to induce protective immunity. This breakthrough laid the groundwork for modern vaccinology, leading to widespread adoption and, ultimately, the global eradication of smallpox in 1980 via coordinated vaccination and surveillance efforts that eliminated the variola virus from human populations.\n\nSubsequent vaccines have achieved profound reductions in morbidity and mortality from diseases such as polio, measles, diphtheria, and tetanus, with routine childhood immunizations credited for preventing an estimated 154 million deaths worldwide since 1974, predominantly among children under five. These successes stem from causal mechanisms including direct protection of individuals and herd immunity, where high vaccination coverage interrupts transmission chains, as evidenced by sharp declines in incidence following introduction— for instance, measles cases dropped over 99% in regions with sustained programs.\n\nHowever, vaccines carry risks of adverse events, ranging from common mild reactions like injection-site pain and fever to rare serious outcomes such as anaphylaxis, febrile seizures (causally linked to MMR vaccine), or Guillain-Barré syndrome, with overall rates indicating that while benefits typically outweigh harms for targeted diseases, individual risk-benefit assessments vary. Ongoing controversies include debates over long-term safety, the influence of adjuvants and preservatives, and policy mandates, contributing to vaccine hesitancy despite empirical evidence of net public health gains, with some skepticism rooted in historical incidents like contaminated polio vaccines or perceived underreporting in surveillance systems.\n\n## Definition and Principles\n\n### Core Concept and Historical Origin\n\nA vaccine is a biological preparation designed to stimulate the adaptive immune system to provide active acquired immunity against a specific infectious disease. It typically incorporates an antigen derived from a pathogen—such as a weakened, inactivated, or partial form of a virus, bacterium, toxin, or surface protein—that mimics the disease-causing agent without inducing illness, thereby training immune cells to recognize and neutralize the pathogen upon subsequent exposure. This process elicits the production of antibodies and memory lymphocytes, enabling a rapid, targeted response to future infections.\n\nThe conceptual foundation of vaccination draws from observations of naturally occurring cross-immunity, where exposure to a milder related pathogen confers protection against a more virulent one. Unlike passive immunization, which transfers pre-formed antibodies (e.g., via maternal milk or serum therapy), vaccines induce endogenous, long-lasting immunity through the recipient's own immune machinery.\n\nPreceding formal vaccination, variolation—an antecedent practice—involved deliberately exposing individuals to dried smallpox scabs or pus to induce a controlled infection, originating in China by the 10th century and documented in texts from 1549, with similar methods in India and Africa. This carried inherent risks, including a 1-2% mortality rate from induced smallpox and potential disease transmission, though it reduced overall susceptibility compared to natural infection. Variolation reached Europe in the early 18th century, popularized by Lady Mary Wortley Montagu after observing Ottoman practices in 1717.\n\nThe modern era of vaccination commenced in 1796 with Edward Jenner's empirical experiments against smallpox. Noting that milkmaids infected with cowpox—a bovine orthopoxvirus—rarely contracted the human variola virus, Jenner hypothesized cross-protective immunity. On May 14, 1796, he inoculated 8-year-old James Phipps with fluid from cowpox pustules on dairymaid Sarah Nelmes' hand, sourced from a cow named Blossom. After recovery, Jenner variolated Phipps with smallpox material on July 1, 1796; the boy exhibited no disease symptoms, confirming immunity. Jenner termed the procedure \"vaccination\" from *vacca* (Latin for cow) and detailed it in his 1798 publication *An Inquiry into the Causes and Effects of the Variolae Vaccinae*, establishing the paradigm of using attenuated or heterologous agents for safer immunization. This innovation supplanted variolation's dangers, enabling widespread smallpox control and eradication efforts culminating in 1980.\n\n### Mechanism of Action\n\nVaccines function by delivering antigens—molecules derived from pathogens such as viruses or bacteria—that mimic an infection to stimulate the adaptive immune system without causing disease. These antigens are recognized by the innate immune system through pattern-recognition receptors (PRRs), including Toll-like receptors (TLRs) on antigen-presenting cells (APCs) like dendritic cells and macrophages, initiating phagocytosis and antigen processing. The processed antigens are then presented on major histocompatibility complex (MHC) class I or II molecules: MHC I to CD8+ cytotoxic T cells for intracellular pathogen recognition, and MHC II to CD4+ helper T cells, which coordinate broader responses including cytokine release to amplify immunity.\n\nCD4+ T helper cells differentiate into subsets such as Th1 (promoting cellular immunity via interferon-gamma) or Th2 (favoring humoral immunity through interleukin-4), directing B cells to undergo proliferation, somatic hypermutation, and class-switch recombination for high-affinity antibodies like IgG and IgA. Antibodies neutralize pathogens by binding epitopes, preventing cell entry or marking targets for complement activation and phagocytosis (opsonization), while CD8+ T cells directly lyse infected cells via perforin and granzymes. This dual humoral and cellular response establishes immunological memory through long-lived plasma cells and central memory T cells, enabling faster secondary responses with higher antibody titers and effector cell expansion upon re-exposure.\n\nAdjuvants, often incorporated in subunit or inactivated vaccines, enhance this mechanism by prolonging antigen presentation, recruiting APCs via inflammasome activation, or inducing local inflammation to boost innate signals like NF-κB pathway activation, thereby improving adaptive priming without relying solely on pathogen replication. However, the quality and durability of vaccine-induced immunity vary by antigen type, dose, and host factors; for instance, live vaccines more effectively mimic natural infection to elicit balanced Th1/Th2 responses and mucosal IgA, whereas non-replicating ones may predominantly drive humoral immunity requiring boosters for sustained protection. Empirical data from immunological studies confirm that correlates of protection, such as neutralizing antibody thresholds (e.g., \\u003e1:40 for influenza hemagglutination inhibition), often predict efficacy, though cellular metrics like T-cell interferon-gamma production provide orthogonal evidence against variants.\n\n## Types of Vaccines\n\n### Live Attenuated Vaccines\n\nLive attenuated vaccines utilize a viable but weakened version of the pathogen, engineered to replicate at low levels sufficient to elicit a robust immune response while minimizing the risk of disease in immunocompetent hosts. This attenuation preserves key antigenic properties, allowing the vaccine strain to mimic aspects of natural infection, including induction of both cellular (T-cell mediated) and humoral (antibody-based) immunity. Unlike inactivated vaccines, these stimulate mucosal immunity when administered via relevant routes, such as oral polio vaccine (OPV), potentially conferring herd protection through limited transmission.\n\nAttenuation is typically achieved through empirical methods like serial passage of the pathogen in non-native host cells, embryonated eggs, or animal models, which select for mutations reducing virulence while maintaining immunogenicity; modern approaches incorporate rational genetic engineering to target specific virulence factors. For bacterial vaccines, similar passaging or deletion of essential genes occurs, though viral examples predominate in routine use. Historical precedents include the smallpox vaccine, derived from cowpox, and the Sabin OPV, attenuated via monkey kidney cell passage in the 1950s.\n\nProminent examples encompass the measles-mumps-rubella (MMR) vaccine, varicella (chickenpox) vaccine, rotavirus vaccine, yellow fever vaccine, and LAIV for influenza. Efficacy data demonstrate high protectiveness: two doses of MMR yield 97% effectiveness against measles, 88% against mumps, and near-complete prevention of rubella congenital syndrome; varicella vaccine provides over 90% protection against moderate to severe disease post-two doses. These vaccines often require fewer doses than non-live alternatives due to sustained replication and memory cell induction.\n\nSafety profiles are favorable in healthy populations but necessitate precautions: contraindicated in immunocompromised individuals, pregnant persons, or those with severe allergies to components, as replication may lead to disseminated infection. Rare adverse events include vaccine-strain shedding and reversion to virulence, exemplified by OPV-associated paralytic poliomyelitis (VAPP), which occurs in roughly 2-4 cases per million doses, prompting its phase-out in high-income countries favoring inactivated alternatives. Institutional sources like CDC and WHO emphasize benefits outweighing risks in endemic settings, though empirical data underscore the need for vigilant post-licensure surveillance given potential for outbreak reversion in under-vaccinated areas.\n\n### Inactivated Vaccines\n\nInactivated vaccines contain pathogens that have been killed or inactivated, typically through chemical treatment (such as formaldehyde), heat, or radiation, rendering them unable to replicate while preserving key antigens to stimulate an immune response. This approach contrasts with live attenuated vaccines by eliminating the risk of reversion to virulence, making inactivated vaccines suitable for individuals with compromised immune systems.\n\nProduction involves cultivating the target pathogen in cell cultures or other media, followed by inactivation to ensure complete neutralization without destroying immunogenicity. Formaldehyde is commonly used for viruses like poliovirus and hepatitis A virus, allowing scalable manufacturing that is relatively cost-effective and thermostable compared to live vaccines.\n\nProminent examples include the inactivated poliovirus vaccine (IPV), introduced by Jonas Salk in 1955, which has contributed to near-eradication of wild poliovirus in many regions; the rabies vaccine for post-exposure prophylaxis; hepatitis A vaccine; and inactivated influenza vaccines administered annually. Other instances encompass whole-virus inactivated formulations for Japanese encephalitis and tick-borne encephalitis.\n\nThese vaccines induce humoral immunity primarily through antibody production against surface antigens, but the lack of replication limits cellular immunity and duration of protection, often necessitating adjuvants, multiple priming doses, and boosters for sustained efficacy. For instance, IPV requires a primary series of four doses in infancy, with boosters in adolescence. Real-world effectiveness varies by pathogen; IPV achieves over 99% protection against paralytic polio after full vaccination, while inactivated influenza vaccines demonstrate 40-60% efficacy against influenza-like illness in seasons with good strain matching.\n\nAdvantages include enhanced safety profiles due to non-replicative nature, enabling use in pregnant individuals and immunocompromised patients without disease causation risk, alongside simpler logistics from thermostability. Disadvantages encompass potentially inferior immunogenicity requiring higher antigen doses or adjuvants, shorter-lived immunity prompting frequent revaccination, and challenges in eliciting broad T-cell responses compared to live vaccines. Safety data from clinical trials indicate mild reactogenicity, such as local soreness or fever, with rare severe events attributable to manufacturing residuals rather than the inactivated pathogen itself.\n\n### Subunit, Toxoid, and Conjugate Vaccines\n\nSubunit vaccines consist of purified antigenic fragments of a pathogen, such as viral proteins or polysaccharides, designed to elicit an immune response without introducing the entire organism. These antigens are often produced using recombinant DNA technology in host cells like yeast or insect cells, ensuring no risk of replication or infection. The mechanism involves antigen-presenting cells processing the subunit to activate B cells for antibody production and T cells for cellular immunity, though responses may be primarily humoral and require adjuvants like aluminum salts to enhance immunogenicity.\n\nExamples include the recombinant hepatitis B vaccine, which uses the surface antigen (HBsAg) produced in yeast and was first licensed in 1986, and the human papillomavirus (HPV) vaccine targeting L1 capsid proteins. Acellular pertussis vaccines, introduced in the 1990s to replace whole-cell versions, incorporate purified pertussis toxin and other proteins. Advantages encompass high safety profiles suitable for immunocompromised individuals and thermostability, but disadvantages include potentially weaker and shorter-lived immunity necessitating boosters and adjuvants.\n\nToxoid vaccines employ chemically inactivated bacterial toxins (toxoids) to stimulate neutralizing antibodies against the toxin's harmful effects, rather than the bacterium itself. Formaldehyde treatment detoxifies the toxin while preserving its antigenic structure, leading to T-dependent B-cell activation and memory formation. Classic examples are diphtheria toxoid, developed in 1923 and licensed in the mid-1920s, and tetanus toxoid, introduced in 1924 for military use and widely available by 1938. These are often combined in DTaP vaccines with acellular pertussis components. They offer robust protection against toxin-mediated diseases but do not prevent bacterial colonization or infection, requiring tetanus boosters every 10 years.\n\nConjugate vaccines link bacterial capsular polysaccharides—poorly immunogenic alone, especially in infants—to carrier proteins like diphtheria or tetanus toxoid, converting a T-independent response into a T-dependent one that promotes class switching to IgG, affinity maturation, and immunological memory. This conjugation enhances opsonophagocytosis and herd immunity in young children. The Haemophilus influenzae type b (Hib) conjugate vaccine, first licensed in 1987, dramatically reduced invasive Hib disease; pneumococcal conjugate vaccines (PCV7 in 2000, PCV13 in 2010) and meningococcal conjugates followed. Limitations include carrier-induced epitopic suppression if multiple conjugates share carriers and the need for multiple doses, though they excel in preventing encapsulated bacterial diseases over plain polysaccharide vaccines.\n\n| Vaccine Type | Key Mechanism | Primary Examples | First Licensing (Approximate) |\n|--------------|---------------|------------------|-------------------------------|\n| Subunit    | Purified antigens trigger targeted humoral/cellular response | Hepatitis B (recombinant), HPV, acellular pertussis | 1986 (Hep B recombinant) |\n| Toxoid     | Inactivated toxin induces anti-toxin antibodies | Diphtheria, tetanus | 1920s (diphtheria/tetanus toxoids) |\n| Conjugate  | Polysaccharide-protein link enables T-cell help for memory | Hib, PCV13, meningococcal | 1987 (Hib) |\n\nThese vaccine classes prioritize safety by avoiding viable pathogens, making them preferable for vulnerable populations, though their immunogenicity often demands formulation refinements like novel adjuvants.\n\n### Nucleic Acid and Viral Vector Vaccines\n\nNucleic acid vaccines deliver synthetic genetic material—either DNA or messenger RNA (mRNA)—encoding a pathogen's antigen directly into host cells, prompting endogenous production of the antigen to elicit both humoral and cellular immune responses. In mRNA vaccines, the RNA is translated into protein in the cytoplasm without entering the nucleus, offering transient expression and avoiding risks of genomic integration. DNA vaccines, by contrast, require nuclear entry for transcription into mRNA before translation, providing longer-lasting antigen expression but posing greater delivery challenges due to cellular barriers. The first mRNA vaccines, developed by Pfizer-BioNTech (BNT162b2) and Moderna (mRNA-1273), received emergency use authorization on December 11, 2020, and December 18, 2020, respectively, by the U.S. FDA for SARS-CoV-2 prevention, marking the platform's debut in widespread human use after decades of preclinical research. DNA vaccines, such as India's ZyCoV-D (approved August 2021), have seen limited approvals, primarily due to lower immunogenicity in humans compared to mRNA formats, though they enable stable storage without cold chains.\n\nViral vector vaccines employ a replication-incompetent virus, often an adenovirus, as a carrier to transduce host cells with DNA encoding the target antigen, leveraging the vector's natural infection machinery for efficient gene delivery and antigen presentation. Examples include the AstraZeneca-Oxford vaccine (AZD1222, using chimpanzee adenovirus ChAdOx1, authorized December 30, 2020, in the UK) and Johnson \\u0026 Johnson (Ad26.COV2.S, using human adenovirus 26, authorized February 27, 2021, by the FDA), both targeting SARS-CoV-2 spike protein expression to induce T-cell and antibody responses. Unlike nucleic acid vaccines, viral vectors mimic viral entry but cannot replicate or cause disease in the vector itself, though pre-existing immunity to common adenoviruses (affecting up to 90% of adults) can reduce efficacy in heterologous prime-boost regimens. These platforms demonstrated initial clinical efficacy rates of 60-90% against symptomatic COVID-19 in phase 3 trials conducted in 2020-2021, with advantages in single-dose options (e.g., J\\u0026J) but challenges from rare vector-related reactogenicity.\n\nBoth categories enable rapid platform adaptation to new pathogens by swapping antigen genes, bypassing traditional cell-culture propagation, though mRNA vaccines generally outperform DNA in potency due to direct translation and innate immune stimulation via pattern recognition receptors. Viral vectors may confer broader T-cell immunity via MHC class I presentation but face antivector immunity hurdles absent in nucleic acid approaches. Empirical data from COVID-19 deployments highlight causal efficacy in reducing severe outcomes, yet real-world waning of antibody responses underscores the need for boosters, with no evidence of altering host DNA in either type. Peer-reviewed analyses emphasize their safety profiles, with adverse events primarily limited to injection-site reactions and transient systemic symptoms, though monitoring continues for rare events like myocarditis in mRNA formulations.\n\n### Emerging and Experimental Types\n\nSelf-amplifying RNA (saRNA) vaccines represent an advancement over conventional mRNA platforms by incorporating replicase genes that enable intracellular RNA amplification, potentially requiring lower doses for equivalent immunogenicity. Clinical trials have demonstrated saRNA candidates eliciting robust humoral and cellular responses; for instance, the ARCT-154 saRNA COVID-19 vaccine, approved in Japan in 2024, showed comparable safety and efficacy to mRNA vaccines at one-fifth the dose, with phase 3 data confirming protection against severe disease.  Similar saRNA formulations for respiratory syncytial virus (RSV) have induced strong prefusion-F protein-specific antibodies in preclinical models, though human trials as of 2025 remain in early phases. Challenges include potential prolonged antigen expression raising theoretical integration risks, unproven in large-scale data, but empirical evidence from trials indicates tolerability without increased adverse events.\n\nNanoparticle-based vaccines utilize nanoscale carriers, such as lipid or protein nanoparticles, to enhance antigen presentation, stability, and targeted delivery, often mimicking viral structures for superior immune activation. Over 26 nanoparticle candidates entered clinical testing by 2021, with ongoing developments including metal-organic framework nanoparticles that act as adjuvants to amplify T-cell responses in preclinical vaccine models.  Computationally designed mRNA-launched receptor-binding domain nanoparticles for SARS-CoV-2 have shown superior neutralizing antibody titers compared to approved vaccines in 2025 preclinical comparisons. Non-covalent multiepitope nanoparticles enable assembly of antigens from diverse pathogens on a single particle, promising broader protection, though clinical translation requires addressing manufacturing scalability and biodistribution variability.\n\nUniversal vaccines aim to confer cross-protective immunity against viral families or variants by targeting conserved epitopes, reducing the need for annual reformulations. U.S. Department of Health and Human Services initiatives in 2025 allocated funding for platforms against pandemic-prone viruses, including sarbecovirus vaccines projected to halve deaths in modeled outbreaks via broad neutralization.  For influenza, nucleic acid-based universal candidates number 16 in preclinical and 15 in clinical stages as of 2025, focusing on hemagglutinin stalk domains for durable T-cell mediated responses enduring multiple seasons. Experimental universal cancer vaccines, such as mRNA-encoded neoantigen nanoparticles, have enhanced immunotherapy in mouse models by boosting tumor-specific T-cells, with human trials exploring personalized formulations. Efficacy hinges on epitope conservation, with real-world validation pending large trials amid variability in human immune responses.\n\nDNA vaccines, delivered via electroporation or needle-free devices, encode antigens for endogenous expression but have lagged behind RNA platforms due to lower immunogenicity in humans. As of 2025, they remain experimental, with phase 1 trials for cancers like triple-negative breast and pancreatic showing epitope-specific T-cell induction without severe toxicity.  Candidates for HIV and Zika viruses have demonstrated safety and modest antibody responses in early human studies, often combined with adjuvants to overcome plasmid stability issues.  First commercial approvals for DNA cancer vaccines are anticipated post-2030, contingent on phase 2/3 data confirming durable protection beyond transient expression. These platforms' causal mechanism—direct cellular transfection—offers thermostability advantages, yet empirical superiority over mRNA requires head-to-head trials accounting for delivery efficiency.\n\n## Effectiveness\n\n### Metrics and Measurement\n\nVaccine efficacy is typically assessed in randomized controlled trials (RCTs) as the relative reduction in disease incidence among vaccinated individuals compared to unvaccinated controls, calculated using the formula \\( VE = (1 - \\frac{I_v}{I_u}) \\\times 100\\% \\), where \\( I_v \\) is the incidence rate in the vaccinated group and \\( I_u \\) in the unvaccinated group. This metric focuses on endpoints such as symptomatic infection, hospitalization, or death, with efficacy often reported as relative risk reduction (RRR), which divides the risk difference by the unvaccinated baseline risk. For example, in phase 3 trials of mRNA COVID-19 vaccines conducted in 2020, RRR values exceeded 90% against symptomatic disease under low baseline infection risks of approximately 1-2%.\n\nIn contrast, absolute risk reduction (ARR) measures the arithmetic difference in event rates between groups, providing a direct estimate of individual-level benefit and yielding the number needed to vaccinate (NNV = 1/ARR) to prevent one case. ARR is generally lower than RRR when baseline risks are small, as seen in the same COVID-19 trials where ARR ranged from 0.7% to 1.2%, corresponding to NNV values of 83 to 143, highlighting how RRR can inflate perceived impact without context on population risk.  Critics argue that exclusive reliance on RRR in trial reporting, without ARR, may mislead public understanding, particularly for low-prevalence diseases, though RRR facilitates comparisons across studies with varying baselines.\n\nVaccine effectiveness extends efficacy evaluation to real-world observational data, accounting for factors like adherence, comorbidities, and circulating variants, often using cohort, case-control, or screening designs. In cohort studies, effectiveness mirrors efficacy calculations but adjusts for confounders via methods like inverse probability weighting; case-control approaches estimate odds ratios as proxies for relative risk. The screening method, suitable for diseases without universal testing, derives effectiveness as \\( VE = 1 - \\frac{PCV / (1 - PCV)}{PPV / (1 - PPV)} \\), where PCV is the vaccination proportion among cases and PPV among the population, assuming random vaccination. Real-world studies of COVID-19 vaccines from 2021-2023 showed initial effectiveness against infection waning to below 50% after six months, while protection against hospitalization remained higher at 70-90%, influenced by immune evasion from variants like Omicron.\n\nAdditional metrics include duration of protection, assessed via Kaplan-Meier survival curves or hazard ratios over time, revealing waning immunity that necessitates boosters. Correlates of protection, such as neutralizing antibody titers, serve as surrogates for efficacy but require validation against clinical outcomes, as higher titers do not always predict population-level effectiveness due to non-humoral immunity factors. Challenges in measurement include selection bias in observational data—e.g., healthier individuals more likely to vaccinate—and underreporting of mild cases, which can overestimate effectiveness against severe disease while underestimating transmission impacts. Population-level metrics, like reductions in reproduction number (R) or herd immunity thresholds, integrate effectiveness with coverage but depend on accurate transmission modeling.\n\n### Evidence from Clinical Trials and Real-World Data\n\nClinical trials have established high efficacy for major vaccines against severe disease outcomes. The 1954 Salk inactivated polio vaccine field trial, the largest of its kind involving approximately 1.8 million children, demonstrated 80-90% effectiveness in preventing paralytic poliomyelitis. Early cooperative field trials of live attenuated measles vaccines reported clinical efficacy of about 95% or better at one year post-vaccination with combined schedules including immune globulin. For the MMR vaccine, trials showed 95-100% protection against measles in vaccinated individuals.\n\nReal-world data following vaccine rollout confirm these trial results through substantial reductions in disease burden. In the United States, for eight diseases with vaccines licensed before 1980—including diphtheria, measles, mumps, pertussis, polio, rubella, tetanus, and smallpox—morbidity declined by more than 92% and mortality by 99% or greater compared to pre-vaccine eras. Globally, immunization programs averted an estimated 154 million deaths over 50 years ending in 2024, with measles vaccines preventing nearly 94 million, primarily infants. Smallpox vaccination campaigns achieved worldwide eradication by 1980, with no cases reported since, as verified by intensified surveillance.\n\n| Vaccine-Preventable Disease | Pre-Vaccine Annual US Cases (20th Century Average) | Recent Annual US Cases (Post-Vaccine) | Reduction in Cases |\n|-----------------------------|----------------------------------------------------|---------------------------------------|---------------------|\n| Measles                    | 530,217                                           | \\u003c100                                 | \\u003e99%               |\n| Polio (Paralytic)          | ~21,000                                           | 0 (since 1979)                       | 100%               |\n| Diphtheria                 | 175,885                                           | 0                                    | 100%               |\n\nReal-world effectiveness often aligns with trial efficacy for core protection against severe outcomes but can differ due to uncontrolled variables like varying exposure levels, population immunity gaps, and pathogen antigenic drift, as observed in annual influenza vaccines where real-world estimates adjust for match quality. For durable vaccines like those for polio and measles, sustained high coverage has maintained low incidence, supporting herd immunity thresholds and preventing resurgence in vaccinated populations.\n\n### Comparison with Natural Immunity\n\nNatural immunity, acquired through recovery from infection with a pathogen, typically elicits a multifaceted immune response involving antibodies, T-cell memory, and mucosal immunity, often providing robust and long-lasting protection against reinfection and severe disease. In contrast, vaccine-induced immunity stimulates targeted responses to specific antigens without the risks of active disease, though it may wane more rapidly and exhibit narrower breadth against variants. \n\nFor SARS-CoV-2, multiple observational studies indicate that natural immunity confers stronger and more durable protection against reinfection, symptomatic illness, and hospitalization compared to two doses of mRNA vaccines, with hazard ratios for breakthrough infection as low as 0.14 for previously infected individuals versus 2.34 for vaccinated without prior infection over six months.  A 2023 analysis of randomized controlled trials and cohort data found no significant superiority of vaccination over natural immunity alone, while hybrid immunity (prior infection plus vaccination) yielded the highest effectiveness, persisting beyond 12 months with neutralizing antibody titers 2-3 times higher than vaccine-only responses. Vaccine effectiveness against Omicron variants declined to under 20% at six months post-booster, whereas natural immunity showed slower waning and better cross-protection due to exposure to diverse epitopes during infection. \n\nIn measles, natural infection induces lifelong sterilizing immunity in nearly all cases, with reinfection rates below 0.1% even decades later, supported by sustained high-avidity IgG and cellular responses. Two doses of live attenuated measles vaccine achieve 97% effectiveness against infection, but antibody levels decline faster than post-natural infection, particularly if the first dose is administered before 8.5 months of age, leading to loss of protective titers within 6 years in some cohorts.   Natural immunity demonstrates greater breadth against circulating strains due to the full viral proteome encounter, whereas vaccine responses, while effective, correlate with higher breakthrough risks in waning scenarios.\n\n| Disease | Natural Immunity Duration | Vaccine Immunity Duration | Key Comparative Notes |\n|---------|----------------------------|---------------------------|-----------------------|\n| SARS-CoV-2 | 12+ months, slower waning; strong T-cell component | 6-12 months post-primary series; faster decline against variants | Natural/hybrid superior for severe outcomes; broader epitope recognition in natural.  |\n| Measles | Lifelong in \\u003e99% of cases | Lifelong in 97% with two doses, but potential waning | Natural antibodies decay slower; vaccines safer but narrower initial response.  |\n\nOverall, while natural immunity often exceeds vaccine-induced in duration and variant resilience due to comprehensive pathogen exposure, vaccines offer consistent protection without morbidity risks, and hybrid strategies maximize outcomes across pathogens.  Empirical data from large cohorts underscore natural immunity's potency, though variability in infection severity influences its reliability compared to standardized vaccination.\n\n### Factors Influencing Efficacy and Breakthrough Infections\n\nVaccine efficacy, defined as the reduction in disease incidence among vaccinated versus unvaccinated individuals under controlled conditions, varies based on multiple interacting factors including host characteristics, vaccine properties, pathogen evolution, and temporal dynamics. Host factors such as age profoundly influence immune responses; for instance, older adults exhibit diminished antibody production and T-cell activation following influenza vaccination due to immunosenescence, resulting in lower efficacy rates compared to younger cohorts. Genetic polymorphisms in immune-related genes, like those encoding HLA molecules or cytokine receptors, can alter vaccine-induced immunogenicity, with certain alleles associated with reduced responses to hepatitis B or measles vaccines. Comorbidities, including obesity, diabetes, and immunosuppression, further impair vaccine effectiveness by disrupting innate and adaptive immunity, as evidenced by lower seroconversion rates in immunocompromised patients receiving pneumococcal vaccines.\n\nPathogen-related elements, particularly antigenic drift and shift, erode efficacy when vaccines target strains mismatched to circulating variants; for example, seasonal influenza vaccines show reduced protection against drifted subtypes, with efficacy dropping from 60% against matched strains to below 20% against mismatched ones in some seasons. Viral mutations in key epitopes, as seen with SARS-CoV-2 variants like Omicron, diminish neutralizing antibody binding, leading to breakthrough infections despite prior vaccination. Environmental and behavioral factors, such as high exposure doses or waning population immunity, exacerbate this by increasing infection probability in vaccinated individuals, particularly in high-density settings.\n\nVaccine-specific attributes, including formulation, dosing intervals, and adjuvants, modulate immune priming; live attenuated vaccines like measles often achieve \\u003e95% efficacy with robust mucosal immunity, whereas inactivated or subunit types may require boosters to sustain protection. Efficacy frequently wanes over time due to declining antibody titers and memory cell exhaustion; studies on mRNA COVID-19 vaccines report initial effectiveness of 90% against infection falling to 30-50% after six months, correlating with reduced neutralizing antibodies. Similar patterns occur with pertussis vaccines, where acellular formulations lose 70-90% efficacy within 4-12 years post-vaccination.\n\nBreakthrough infections, occurring when vaccinated individuals contract the targeted pathogen, arise from incomplete sterilizing immunity, variant escape, or insufficient antibody levels at exposure. In highly vaccinated populations, such events predominate numerically due to sheer vaccinated numbers, but typically manifest as milder disease owing to preserved T-cell responses that limit severity. Factors like low neutralizing titers post-waning or high viral inoculum contribute, as demonstrated in healthcare worker cohorts where breakthrough SARS-CoV-2 rates correlated inversely with peak antibody levels. Boosters can restore efficacy temporarily, yet repeated dosing risks original antigenic sin, potentially biasing responses toward initial strains and impairing adaptation to variants.\n\n## Safety Profile\n\n### Common and Mild Adverse Reactions\n\nLocal reactions at the injection site, such as pain, erythema, and swelling, represent the most prevalent mild adverse events following vaccination, occurring in 10% to 80% of recipients across various vaccine types, with frequencies varying by formulation, dose, and individual factors like age.  These manifestations arise from the innate immune response to vaccine antigens and adjuvants, typically peaking within 24-48 hours post-administration and resolving spontaneously within 1-3 days without intervention. For instance, in diphtheria-tetanus-acellular pertussis (DTaP) vaccines, injection-site pain or tenderness affects approximately 35% of children, erythema 36%, and swelling 26%, based on clinical trial data.\n\nSystemic mild reactions, including low-grade fever (usually \\u003c39°C), fatigue, headache, myalgia, and chills, occur less frequently, generally in 1% to 25% of cases, and are more common after live attenuated vaccines or booster doses due to enhanced adaptive immune activation.  In inactivated influenza vaccines, systemic symptoms like fever or muscle aches are reported in up to 10% of adults, while local soreness affects 10-64%. These events are self-limiting, with median duration of 1-2 days, and do not correlate strongly with long-term immunogenicity or efficacy. Reactogenicity tends to be higher in younger individuals and after primary series doses compared to boosters, reflecting differences in prior immune exposure.\n\nMild reactions are actively solicited in clinical trials and post-licensure studies to assess reactogenicity profiles, distinguishing them from coincidental events reported passively via systems like VAERS, which capture a broader but unverified range of post-vaccination occurrences without establishing causality. Overall, such events underscore the vaccine-induced inflammatory cascade essential for protection, outweighing their transient discomfort in risk-benefit evaluations for preventable diseases.\n\n### Serious and Rare Adverse Events\n\nSerious adverse events following vaccination, defined by regulatory bodies such as the U.S. Food and Drug Administration (FDA) as those resulting in death, life-threatening illness, hospitalization, or permanent disability, occur at rates far below one percent of doses administered across most vaccines. These events are identified through pharmacovigilance systems like the Vaccine Adverse Event Reporting System (VAERS) in the U.S., the Yellow Card scheme in the UK, and global databases maintained by the World Health Organization (WHO), though raw reports require epidemiological confirmation for causality.  Incidence varies by vaccine type, population, and dose; for instance, inactivated and live-attenuated vaccines generally exhibit lower rates than certain viral vector platforms.\n\nAnaphylaxis, a severe allergic reaction, represents one of the most immediate serious risks, occurring at approximately 1.3 cases per million doses for most routine childhood vaccines and up to 5 per million for mRNA COVID-19 vaccines like Pfizer-BioNTech and Moderna. Symptoms typically manifest within 15-30 minutes post-injection, treatable with epinephrine, and are linked to components such as polyethylene glycol (PEG) in lipid nanoparticles or gelatin stabilizers. Historical data from the 1976 swine flu vaccination campaign showed elevated Guillain-Barré syndrome (GBS) risk, with an excess of about 1 case per 100,000 recipients, a pattern sporadically observed with influenza vaccines (1-2 excess cases per million doses annually). 30821-3/fulltext) GBS involves autoimmune nerve demyelination, confirmed via temporal clustering and epidemiological studies rather than coincidence alone.\n\nFor COVID-19 vaccines, mRNA formulations have been associated with myocarditis and pericarditis, particularly in adolescent and young adult males after the second dose, with rates of 40-60 cases per million in males aged 12-17 per CDC surveillance data through 2022, declining with boosters.  Adenoviral vector vaccines like AstraZeneca and Janssen exhibited rare thrombosis with thrombocytopenia syndrome (TTS), at 2-3 cases per million doses in younger adults, attributed to antibody-mediated platelet activation via vector spike protein interactions. 00862-0/fulltext) Live vaccines, such as oral polio (OPV), carry risks of vaccine-derived poliovirus (VDPV) in under-immunized settings, causing 1 in 2.4 million doses to result in paralysis, prompting shifts to inactivated polio vaccine (IPV) in many countries. These events underscore the need for rapid case adjudication; for example, VAERS signals prompted pauses in Janssen rollout in 2021, later resolved with risk stratification.\n\nLonger-term rare events, including autoimmune disorders or neurological sequelae, lack robust causal links beyond specific instances like progressive multifocal leukoencephalopathy (PML) in immunosuppressed JC virus carriers post-polio vaccination, though population studies show no overall excess incidence. Post-marketing analyses, such as those from the European Medicines Agency (EMA), confirm that serious event rates for established vaccines like measles-mumps-rubella (MMR) remain below 1 per 100,000 doses, with no verified autism association despite early retracted claims. 11096-0/fulltext) Benefit-risk assessments, weighing these rarities against disease burdens, justify continued use, but underreporting in passive systems may underestimate true incidence by factors of 10-100 for non-fatal events, per capture-recapture studies. Academic and regulatory sources, while rigorous, exhibit institutional incentives toward favorable interpretations, necessitating independent verification through meta-analyses of randomized trial data.\n\n### Long-Term Risks and Monitoring\n\nMonitoring of vaccine safety extends beyond clinical trials to post-licensure surveillance systems designed to detect rare or delayed adverse events that may manifest months or years after administration. In the United States, the Vaccine Adverse Event Reporting System (VAERS), co-managed by the CDC and FDA, facilitates passive reporting of potential adverse events by healthcare providers, vaccine manufacturers, and the public, serving as an early warning mechanism for signals requiring further investigation. Complementary active surveillance platforms, such as the Vaccine Safety Datalink (VSD) and the FDA's Post-licensure Rapid Immunization Safety Monitoring (PRISM), leverage electronic health records from large populations to quantify incidence rates and assess causality through controlled analyses. These systems have enabled the identification and mitigation of specific risks, such as the association between certain influenza vaccines and Guillain-Barré syndrome, though overall long-term population-level harms remain exceedingly rare relative to disease prevention benefits.\n\nHistorical precedents underscore the value of vigilant monitoring for long-term effects. The oral polio vaccine (OPV), used widely from the 1960s, carries a risk of vaccine-associated paralytic poliomyelitis (VAPP) at rates of approximately 1 in 2.4 million doses and can lead to circulating vaccine-derived poliovirus outbreaks in under-immunized areas, prompting shifts to inactivated polio vaccine (IPV) in high-income countries. Similarly, early rotavirus vaccines like Rotashield, withdrawn in 1999, were linked to intussusception—a bowel obstruction—emerging in post-marketing data, with risks estimated at 1 in 10,000 to 1 in 20,000 doses during the first week post-vaccination. Population-based analyses of vaccine-preventable diseases demonstrate declines exceeding 92% in cases and 99% in deaths for pre-1980 vaccines, without corresponding surges in chronic conditions attributable to vaccination.\n\nFor newer vaccine platforms, such as mRNA-based formulations deployed during the COVID-19 pandemic, long-term data as of 2025 from over 13 billion doses administered globally show no widespread evidence of delayed serious adverse effects. Follow-up studies, including systematic reviews of pregnant populations and cancer patients, affirm safety profiles with rare events like myocarditis predominantly acute and resolving, though theoretical concerns about autoimmunity or genomic integration persist without empirical confirmation. Multiple vaccination schedules have prompted scrutiny for potential cumulative effects, with some analyses suggesting associations with multisystem inflammatory conditions, but these require replication in larger cohorts to establish causality amid confounding factors like underlying health status.\n\nOngoing international efforts, including WHO-coordinated pharmacovigilance and national registries, emphasize real-time data integration and signal validation to address biases in reporting, such as under-detection of mild events or over-attribution in media-driven narratives. Despite institutional tendencies toward reassurance, independent peer-reviewed evaluations highlight the need for transparent, hypothesis-driven longitudinal studies to monitor emerging signals, particularly in vulnerable subgroups like the elderly or immunocompromised. This framework ensures that benefits, evidenced by averted morbidity in billions, are weighed against verifiable risks, with adjustments like formulation changes implemented as data evolve.\n\n### Risk-Benefit Analysis\n\nThe risk-benefit analysis of vaccination weighs the probability and severity of adverse events against the reduction in disease incidence, morbidity, and mortality attributable to the vaccine. This evaluation incorporates epidemiological data on pathogen transmission, vaccine efficacy from randomized trials and observational studies, incidence rates of serious side effects from pharmacovigilance systems, and population-specific factors such as age, comorbidities, and baseline disease risk. Quantitative frameworks, such as those outlined in benefit-risk assessment tools, facilitate structured comparisons, often expressing outcomes in terms of lives saved, quality-adjusted life years gained, or numbers needed to vaccinate to avert one adverse disease outcome.\n\nFor established vaccines targeting high-burden childhood diseases, empirical evidence consistently demonstrates favorable risk-benefit ratios. The measles-mumps-rubella (MMR) vaccine, for instance, confers approximately 95% protection against measles infection after two doses, averting complications like pneumonia (up to 1 in 20 cases), encephalitis (1 in 1,000), and death (1-2 per 1,000 in high-income settings, higher in low-resource areas). Global vaccination efforts prevented an estimated 57 million measles deaths from 2000 to 2022, with routine immunization yielding societal benefit-cost ratios exceeding 10:1 through reduced healthcare expenditures and productivity losses. Serious vaccine risks remain low: anaphylaxis occurs in about 1 per million doses, and large cohort studies find no increased incidence of autism, seizures, or other hypothesized long-term effects beyond transient mild reactions like fever in 5-15% of recipients.\n\nIn contexts of lower disease threat, such as COVID-19 vaccination among healthy young populations, the analysis reveals narrower margins or potential reversals. For mRNA boosters in adults aged 18-29, modeling estimates indicate 31,207-42,836 doses required to prevent one hospitalization over six months during Omicron predominance, juxtaposed against myocarditis risks of 1-10 per 100,000 doses in young males, with higher rates post-second dose and potential for persistent cardiac sequelae. Some observational data report no all-cause mortality benefit—or even transient increases—in low-prevalence periods for younger strata, prompting ethical scrutiny of mandates where individual harms may exceed population-level gains. Independent assessments emphasize re-evaluating boosters amid evolving variants and immunity landscapes, contrasting with regulatory claims of net positivity that may underweight rare but severe events due to reliance on short-term trial data.\n\nAcross vaccine types, risk-benefit profiles are dynamic, influenced by herd immunity thresholds (e.g., \\u003e95% coverage for measles) and waning efficacy against transmission. Prelicensure trials prioritize efficacy endpoints, but post-marketing surveillance via systems like VAERS or VSD reveals underreported signals, necessitating causal inference methods to distinguish correlation from vaccine-attributable harm. For novel platforms like mRNA, long-term data gaps persist, underscoring the imperative of stratified recommendations: unequivocal benefits in high-risk groups versus cautious application in low-risk ones to optimize public health outcomes.\n\n## Development Process\n\n### Preclinical and Clinical Phases\n\nThe preclinical phase of vaccine development encompasses exploratory research and laboratory-based testing to identify and refine potential candidates before human trials. Scientists first conduct discovery work to select antigens, weakened pathogens, or genetic constructs capable of eliciting an immune response, drawing on understanding of the target pathogen's mechanisms of disease. This is followed by in vitro studies using cell cultures to evaluate initial immune activation and toxicity, aiming to establish proof-of-concept for immunogenicity without adverse effects. Animal models, such as mice, ferrets, or non-human primates depending on the pathogen, then test safety, dosage ranges, and protective efficacy through challenge studies where feasible, assessing antibody production, T-cell responses, and reduction in disease severity. These studies help identify candidates unlikely to cause harm or fail to induce relevant immunity, though animal data may not fully predict human outcomes due to physiological differences. Successful preclinical evaluation culminates in submission of an Investigational New Drug (IND) application to regulators like the U.S. Food and Drug Administration (FDA), including data on manufacturing processes and proposed clinical protocols, to permit progression to human testing.\n\nClinical development proceeds in phased trials to rigorously assess safety, immunogenicity, and efficacy in humans, typically spanning several years and involving escalating participant numbers under regulatory oversight. Phase I trials enroll 20 to 100 healthy volunteers to evaluate initial safety, determine tolerable dosage schedules, and measure early immune responses such as antibody titers, with close monitoring for adverse reactions. These studies, often single- or double-blind and randomized against placebo where ethical, prioritize pharmacokinetics and potential short-term toxicities over efficacy endpoints. Phase II expands to 100 to 300 participants resembling the target population (e.g., by age or health status), refining optimal dosing, assessing immunogenicity correlates of protection—like neutralizing antibodies—and identifying common side effects through controlled comparisons. This phase may include exploratory efficacy signals in challenge models for pathogens like influenza, but generally relies on surrogate markers due to ethical constraints against deliberate infection.\n\nPhase III trials involve thousands of participants (often 10,000 or more) in large-scale, randomized, double-blind, placebo- or active-controlled studies to confirm protective efficacy against natural infection, monitor rare adverse events, and gather data on duration of immunity. Efficacy is measured by reductions in disease incidence, hospitalization, or transmission in field settings, with statistical powering to detect differences (e.g., 50-90% efficacy thresholds depending on public health needs), while safety surveillance captures events at rates as low as 1 in 10,000. Interim analyses may allow early efficacy readouts, but full data submission supports Biologics License Application (BLA) review by agencies like the FDA or European Medicines Agency (EMA). Post-approval Phase IV surveillance continues monitoring in broader populations, though it falls outside core clinical phases. The entire preclinical-to-Phase III process conventionally requires 10-15 years, with success rates historically below 10% from candidate to licensure, reflecting high attrition due to insufficient immunogenicity or unforeseen reactogenicity.\n\n### Manufacturing and Scale-Up\n\nVaccine manufacturing encompasses antigen production, purification, formulation, and packaging, with methods varying by vaccine type to ensure potency and safety. Traditional inactivated or live-attenuated vaccines often rely on egg-based or cell culture systems; for instance, influenza vaccines are propagated in embryonated chicken eggs or Madin-Darby canine kidney cells, yielding up to 1.53 billion doses annually as of 2025. Recombinant protein vaccines, such as those for hepatitis B, use yeast or bacterial expression systems to produce specific antigens, while viral vector vaccines employ host cells transfected with genetic material encoding the target protein. mRNA vaccines bypass cellular propagation through cell-free in vitro transcription from plasmid DNA templates, followed by purification and lipid nanoparticle encapsulation, facilitating faster iteration but requiring precise control over capping, polyadenylation, and sequence integrity.\n\nScale-up transitions laboratory processes to commercial bioreactors, expanding volumes from milliliters to thousands of liters while validating consistency via comparability protocols that assess yield, purity, and immunogenicity. This phase demands investment in facilities, supply chains for reagents like lipids or plasmids, and process optimization to minimize batch failures; empirical assessments indicate recombinant DNA technologies offer advantages in capital efficiency and material needs over egg-based methods. During the COVID-19 response, mRNA production scaled dramatically, with Pfizer-BioNTech increasing plasmid, mRNA drug substance, and drug product output by factors up to 1,000-fold to deliver over 3 billion doses in 2021 alone, supported by parallel manufacturing lines initiated pre-approval. Challenges included raw material shortages, such as lipids, and ensuring sterility at high throughput, often addressed through modular, automated systems rather than traditional volume expansion. \n\nRegulatory oversight mandates process validation at each scale, including stress testing for deviations and post-change assessments to confirm no impact on product quality. Global capacity constraints persist, with pre-pandemic vaccine production at approximately 3.5 billion doses yearly, underscoring bottlenecks in technology transfer to low-resource settings and the need for diversified platforms to mitigate risks like avian influenza disrupting egg supplies. Advances in continuous manufacturing and model-based simulations have accelerated development, reducing timelines from years to months for adaptable platforms like mRNA, though empirical data from COVID-19 highlights that rapid scaling can strain quality controls without prior platform validation.\n\n### Quality Assurance and Ethical Considerations\n\nVaccine quality assurance encompasses rigorous standards to ensure product safety, efficacy, and consistency throughout manufacturing and release. Manufacturers adhere to Good Manufacturing Practices (GMP), enforced by regulatory bodies such as the U.S. Food and Drug Administration (FDA) and the European Medicines Agency (EMA), which mandate controls over facilities, equipment, personnel, and processes to minimize contamination risks and variability.  These include validation of production methods, environmental monitoring, and documentation to trace any deviations, with vaccine-specific requirements addressing biological complexities like antigen stability.\n\nBatch release testing forms a critical checkpoint, evaluating purity (absence of impurities or contaminants), potency (immunogenic strength via assays like ELISA or animal models), sterility (culture-based or rapid methods to confirm no microbial growth), and identity (confirming the correct antigen).  The FDA, for instance, reviews manufacturer-submitted data on these parameters before approving lots for distribution, often supplemented by independent laboratory verification; failures in potency or sterility can lead to recalls, as seen in isolated cases of contaminated batches prompting enhanced testing protocols. Post-approval, ongoing stability studies and adverse event reporting feed into process improvements, though critics note that rapid scale-up during emergencies, such as the COVID-19 response, has occasionally strained these assurances despite regulatory adaptations.\n\nEthical considerations in vaccine development prioritize participant welfare and scientific integrity, guided by principles like those in the Declaration of Helsinki, which emphasize informed consent, equitable selection, and favorable risk-benefit ratios. Institutional Review Boards (IRBs) oversee trials to mitigate coercion, particularly in vulnerable populations such as children or low-income groups, where placebo use must justify non-inferiority to standard care without undue harm. Historical lapses, including 20th-century trials involving institutionalized children without full consent or adequate follow-up—as documented in Henry Beecher's 1966 analysis of unethical U.S. medical research—have prompted stricter oversight, though such practices were not vaccine-exclusive and led to reforms like federal regulations under 21 CFR 50.\n\nDebates persist over intellectual property and access, where patents incentivize innovation but can delay equitable distribution in global health crises, raising justice concerns under frameworks like the Nuremberg Code's prohibition on exploitative experimentation. In epidemic contexts, ethical equipoise challenges arise when testing new candidates against proven vaccines, requiring justification for withholding effective interventions; regulators like the FDA demand evidence of societal value without compromising individual rights. Animal testing, integral to preclinical phases, invokes welfare standards under laws like the U.S. Animal Welfare Act, balancing necessity against alternatives like in silico modeling, with empirical data showing reduced human risks through phased escalation. These tenets aim to align development with causal evidence of benefit over harm, acknowledging institutional biases in trial reporting that may underemphasize long-term uncertainties.\n\n## Regulatory and Policy Framework\n\n### Approval Processes by Major Jurisdictions\n\nIn the United States, the Food and Drug Administration (FDA), through its Center for Biologics Evaluation and Research (CBER), oversees vaccine approval via a multi-phase process beginning with preclinical laboratory and animal studies to assess safety and immunogenicity. Developers then submit an Investigational New Drug (IND) application to initiate human clinical trials, divided into Phase 1 (small-scale safety in healthy volunteers), Phase 2 (efficacy and dosing in hundreds of participants), and Phase 3 (large-scale efficacy, safety, and rare adverse events in thousands). Upon successful completion, a Biologics License Application (BLA) is filed, including all data on manufacturing, quality control, and clinical outcomes; FDA reviews this within 10 months for standard approvals or 6 months under priority review, verifying safety, efficacy, purity, and potency before licensure. For emergencies, Emergency Use Authorization (EUA) allows interim approval based on interim Phase 3 data if benefits outweigh risks, as seen with COVID-19 vaccines in December 2020, but requires full BLA for ongoing use and post-marketing surveillance.\n\nIn the European Union, the European Medicines Agency (EMA) coordinates centralized marketing authorisation for vaccines via the Committee for Medicinal Products for Human Use (CHMP), requiring submission of data from non-clinical studies, pharmaceutical quality assessments, and clinical trials demonstrating safety, efficacy, and quality. The standard process involves a 210-day evaluation period, potentially accelerated through rolling reviews where data is assessed in real-time as generated, or conditional marketing authorisation for unmet needs with robust post-authorisation commitments, as applied to COVID-19 vaccines from late 2020 onward with approvals in 17-36 days during emergencies. Between 2012 and 2022, 33 vaccines received central approval based on a median of two pivotal and five supportive studies, emphasising risk management plans and population-specific data.\n\nPost-Brexit, the United Kingdom's Medicines and Healthcare products Regulatory Agency (MHRA) employs a national assessment procedure for vaccine marketing authorisations, involving rolling reviews of submitted clinical, non-clinical, and manufacturing data to expedite decisions while upholding standards of safety and efficacy. For COVID-19 vaccines, temporary authorisations under Regulation 174 of the Human Medicines Regulations enabled supply based on interim data, with full approvals following comprehensive evaluation; the Pfizer-BioNTech vaccine, for instance, received authorisation on December 2, 2020, after a review starting October 1. MHRA assessments prioritise independent verification, distinct from EMA processes, and integrate advice from bodies like the Joint Committee on Vaccination and Immunisation (JCVI) for rollout recommendations.\n\nHealth Canada regulates vaccines through a rigorous review of quality, safety, and efficacy data from preclinical and clinical phases, typically spanning 10 years from development to approval, with multidisciplinary expert panels assessing applications for full notice of compliance or, during emergencies like COVID-19, interim orders allowing authorised release based on preliminary evidence while mandating ongoing studies. Submissions include pharmaceutical, non-clinical, and clinical trial results, evaluated for benefit-risk balance, with COVID-19 vaccines approved via expedited yet standards-maintained processes involving international data alignment.\n\nAustralia's Therapeutic Goods Administration (TGA) follows a structured six-stage process for vaccine registration: pre-application consultation, formal application with quality/safety/efficacy dossiers, expert evaluation (including clinical trial data from Phases 1-3), decision-making by the delegate, entry into the Australian Register of Therapeutic Goods (ARTG), and post-registration monitoring. For urgent needs, provisional registration permits market entry on interim Phase 3 data with manufacturing consistency, as with COVID-19 vaccines from early 2021, requiring full data within specified timelines; all approvals demand benefits substantially exceeding risks, assessed via independent advisory committees.\n\nThe World Health Organization (WHO) conducts vaccine prequalification, a voluntary programme assessing products for UN procurement and global immunisation, verifying compliance with quality, safety, and efficacy norms through dossier reviews, site inspections, and consistency audits, often building on national approvals like those from stringent regulatory authorities (e.g., FDA, EMA). Established to support low-resource settings, it has prequalified vaccines since the 1980s, with processes evolving to include real-time data for emergencies, ensuring interchangeability and stability without granting marketing authorisation.\n\n### Post-Marketing Surveillance\n\nPost-marketing surveillance encompasses the ongoing monitoring of vaccine safety and effectiveness after regulatory approval and widespread use, aiming to identify rare adverse events, assess real-world performance, and evaluate long-term outcomes not detectable in pre-licensure trials due to limited sample sizes. This phase relies on both passive and active systems: passive surveillance, such as the U.S. Vaccine Adverse Event Reporting System (VAERS) co-managed by the FDA and CDC, collects voluntary reports of potential adverse events following immunization from healthcare providers, vaccine manufacturers, and the public, serving as an early warning for safety signals. Active surveillance, including the CDC's Vaccine Safety Datalink (VSD) which analyzes electronic health records from integrated healthcare organizations covering millions of individuals, provides more robust data for confirming signals through controlled comparisons. Globally, systems like the WHO's VigiBase aggregate reports from national pharmacovigilance programs to facilitate international signal detection.\n\nNotable examples illustrate PMS's role in identifying risks: the 1999 withdrawal of the RotaShield rotavirus vaccine followed VAERS signals and subsequent studies confirming an elevated risk of intussusception, a bowel obstruction, at a rate of about 1 per 10,000-20,000 doses in U.S. infants. Similarly, post-approval monitoring of the 1976 swine flu vaccine detected an increased incidence of Guillain-Barré syndrome (GBS), approximately 1 excess case per 100,000 doses, prompting revised recommendations. For COVID-19 vaccines, mRNA products showed myocarditis signals in VAERS data within weeks of rollout in December 2020, with confirmed rates of 12.6 cases per million second doses in males aged 12-29 via VSD analysis by mid-2021, leading to updated labeling and guidance. These detections underscore PMS's capacity to inform risk mitigation, though actions depend on epidemiological confirmation beyond initial reports.\n\nDespite strengths, PMS systems face inherent limitations that can hinder timely and accurate assessment. Passive reporting like VAERS suffers from underreporting—estimated at 1-10% of actual events—due to reliance on voluntary submissions, lack of follow-up, and incomplete or unverified data, precluding direct causality inference without supplementary investigation. Biases, including stimulated reporting during high-profile campaigns or media attention, can inflate signals for specific events, while confounding factors like background rates of conditions (e.g., GBS occurs at 1-2 per 100,000 annually unrelated to vaccination) complicate attribution. Active systems mitigate some issues through population-based controls but are limited to participating networks, potentially missing underrepresented groups, and require substantial resources for signal validation. Peer-reviewed analyses emphasize that while PMS has averted harms, delays in signal recognition—sometimes months to years—and challenges in distinguishing correlation from causation necessitate complementary methods like self-controlled case series for robust post-approval evaluation.\n\n### Vaccination Scheduling and Recommendations\n\nVaccination schedules outline the timing and dosing of vaccines to optimize protection against targeted diseases, balancing factors such as waning immunity, disease incidence peaks in early life, and minimal interference between antigens. These schedules are formulated by expert committees, including the U.S. Centers for Disease Control and Prevention's Advisory Committee on Immunization Practices (ACIP) and the World Health Organization's Strategic Advisory Group of Experts on Immunization (SAGE), drawing on immunogenicity studies, epidemiological data, and post-licensure surveillance rather than randomized controlled trials directly comparing full combination schedules against alternatives. Intervals between doses are set to achieve seroprotection thresholds, with minimum spacing (typically 4 weeks for inactivated vaccines and 28 days for live vaccines) ensuring immune memory without unnecessary delays that could leave individuals vulnerable. While peer-reviewed studies affirm that simultaneous administration does not overwhelm the immune system—given daily antigen exposure from natural sources—evidence on long-term outcomes of compressed versus extended spacing remains observational, with some analyses suggesting modest benefits to slightly longer intervals for certain vaccines like mRNA platforms in boosting durability.\n\nIn the United States, the 2025 CDC child and adolescent schedule recommends initiating hepatitis B vaccination at birth, followed by doses at 1-2 months and 6-18 months to prevent perinatal transmission and early childhood infection. Rotavirus, DTaP, Hib, pneumococcal, IPV, and influenza vaccines are administered in multiple doses during infancy (e.g., at 2, 4, and 6 months), with MMR and varicella at 12-15 months and boosters at 4-6 years to align with school entry and peak disease susceptibility. HPV vaccination begins at ages 11-12 (2 doses if initiated before 15), and meningococcal at 11-12 with a booster at 16, reflecting adolescent social mixing risks. Catch-up guidance prioritizes minimum intervals for delayed vaccination, emphasizing undelayed protection amid declining coverage rates that have contributed to measles outbreaks.\n\n| Age Group | Key Vaccines and Dosing (U.S. CDC 2025) |\n|-----------|-----------------------------------------|\n| Birth     | Hepatitis B (dose 1)                   |\n| 1-2 months | Hepatitis B (2), DTaP (1), Hib (1), IPV (1), PCV (1), Rotavirus (1) |\n| 4 months  | DTaP (2), Hib (2), IPV (2), PCV (2), Rotavirus (2) |\n| 6 months  | DTaP (3), Hib (3 if needed), IPV (3 if needed), PCV (3), Influenza (annual), COVID-19 (per individual assessment) |\n| 12-15 months | Hib (4 if needed), PCV (4), MMR (1), Varicella (1), Hepatitis A (1) |\n| 4-6 years | DTaP (5), IPV (4), MMR (2), Varicella (2) |\n| 11-12 years | Tdap (1), HPV (series), Meningococcal (1) |\n\nFor adults, CDC recommendations include annual influenza vaccination, Tdap booster every 10 years or during pregnancy, and shingles (2 doses) starting at age 50, with pneumococcal now advised from age 50 rather than 65 based on updated risk assessments for invasive disease. COVID-19 vaccination shifted in 2025 to shared clinical decision-making rather than universal routine dosing, reflecting variable efficacy data and natural immunity considerations. WHO's global framework endorses similar core vaccines (e.g., BCG at birth in high-TB areas, DTP-HepB-Hib at 6, 10, 14 weeks) but adapts for resource-limited settings, prioritizing measles-rubella at 9-12 months to curb mortality in under-vaccinated regions. Special populations, such as immunocompromised individuals, require tailored spacing to avoid live vaccines and ensure boosters, while pregnant persons receive Tdap between 27-36 weeks to confer passive immunity to newborns. Schedules evolve with surveillance; for instance, ACIP updates incorporate real-world effectiveness data, though institutional reliance on modeling over direct causation studies has drawn critique for underemphasizing individual variability in immune response.\n\n## Historical Context\n\n### Pre-Modern and Early Vaccine Development\n\nThe practice of variolation, a precursor to vaccination, emerged in Asia, with evidence suggesting its use in China by the 10th century or earlier, where dried smallpox crusts were insufflated into the nostrils or scratched into the skin to induce a mild infection and subsequent immunity. Similar techniques involving nasal insufflation or dermal scarification with smallpox material were documented in regions of India, the Middle East, and Africa, predating widespread European adoption. This method carried inherent risks, including a 1-2% mortality rate from induced smallpox—lower than the 30% fatality of natural infection but still hazardous—and potential transmission to contacts.\n\nVariolation reached Europe in the early 18th century through accounts from the Ottoman Empire, notably promoted by Lady Mary Wortley Montagu, who observed the procedure during her time in Constantinople and facilitated trials in England starting around 1721. In the American colonies, the practice was introduced via enslaved Africans, with Puritan minister Cotton Mather learning of it from his slave Onesimus and advocating its use during the 1721 Boston smallpox outbreak, where controlled inoculations reportedly reduced mortality among participants. Despite successes, variolation's dangers prompted searches for safer alternatives, as it occasionally sparked epidemics.\n\nIn 1796, English physician Edward Jenner developed the first true vaccine by exploiting cross-immunity between cowpox—a milder bovine poxvirus—and human smallpox, observing that dairy workers exposed to cowpox appeared resistant to variola. On May 14, Jenner inoculated eight-year-old James Phipps with pus from cowpox lesions on dairymaid Sarah Nelmes' hand, producing a local reaction but no systemic illness; six weeks later, Phipps was variolated with smallpox matter and showed immunity, remaining protected in subsequent challenges. Jenner termed the procedure \"vaccination,\" derived from the Latin *vacca* for cow, and detailed his findings in the 1798 publication *An Inquiry into the Causes and Effects of the Variolae Vaccinae*. This innovation eliminated variolation's risks by using a non-human pathogen incapable of causing smallpox, marking the transition to safer immunization.\n\nEarly dissemination of Jenner's vaccine involved arm-to-arm human passage of cowpox material, which spread rapidly across Britain and Europe after endorsements from the Royal Society and government support; by 1801, vaccination was compulsory in some Danish regions, and Jenner's work earned him parliamentary grants totaling £30,000. Challenges included viral attenuation over passages and contamination risks, yet it drastically curbed smallpox incidence where adopted, laying the empirical foundation for subsequent vaccine development.\n\n### Key 20th-Century Milestones\n\nIn the early 20th century, advances in bacteriology led to the development of vaccines against several bacterial diseases. The pertussis vaccine, an inactivated whole-cell preparation, was first introduced in 1914 by Danish physician Peter Löffler and further refined by Pearl Kendrick and Grace Eldering in the 1930s. Diphtheria toxoid, developed by Gaston Ramon in 1923, marked a key innovation in using inactivated toxins to induce immunity without causing disease. Tetanus toxoid followed in 1924, enabling safer immunization against these toxin-mediated illnesses. By 1948, these components were combined into the diphtheria-pertussis-tetanus (DPT) vaccine, facilitating routine childhood immunization programs.\n\nViral vaccines progressed significantly mid-century, building on tissue culture techniques. The yellow fever vaccine, an attenuated live virus strain (17D), was developed by Max Theiler in 1937 and proved effective in preventing outbreaks in endemic regions. Influenza vaccines emerged during World War II; the first inactivated influenza vaccine was licensed in the United States in 1945, initially for military use, with civilian approval following in 1946. The inactivated polio vaccine (IPV), pioneered by Jonas Salk, underwent successful field trials involving over 1.8 million children in 1954 and received licensure in 1955, dramatically reducing polio incidence. Albert Sabin's oral polio vaccine (OPV), licensed in 1961-1962, offered easier administration and contributed to global eradication efforts.\n\nThe 1960s saw rapid development of vaccines for childhood viral diseases using egg-based or cell-culture propagation. The measles vaccine, a live attenuated strain derived from the Edmonston-B strain by John Enders and colleagues, was licensed in 1963 after demonstrating 95-100% efficacy in trials. Maurice Hilleman's team introduced the mumps vaccine in 1967 and rubella vaccine in 1969, both live attenuated and highly effective against these contagious illnesses. These were combined into the MMR vaccine in 1971, streamlining protection against three major exanthems.\n\nLate-century milestones included intensified eradication campaigns and new technologies. The World Health Organization's intensified smallpox vaccination program, launched in 1967, culminated in the last natural case in 1977 and official eradication certification in 1980, eliminating a disease that had killed millions annually. The plasma-derived hepatitis B vaccine was approved in 1981, followed by recombinant versions in 1986, addressing a major cause of liver cancer and cirrhosis. These developments, supported by improved manufacturing and surveillance, reduced global vaccine-preventable disease mortality by an estimated 2-3 million annually by century's end.\n\n### Late 20th and 21st-Century Advances and Setbacks\n\nThe World Health Organization certified the global eradication of smallpox in 1980, marking the culmination of a vaccination campaign initiated in 1967 that eliminated the last naturally occurring case in 1977, thereby preventing an estimated 2-5 million deaths annually prior to eradication. In the 1980s, recombinant DNA technology enabled the first genetically engineered vaccine against hepatitis B, approved for use starting in 1986, which replaced earlier plasma-derived versions and facilitated broader immunization efforts against a virus responsible for chronic liver disease in millions worldwide. Conjugate vaccines emerged as a key advance, with the Haemophilus influenzae type b (Hib) vaccine licensed in 1985, dramatically reducing invasive Hib disease incidence by over 99% in vaccinated populations by the early 1990s through improved immunogenicity in infants.\n\nEntering the 21st century, pneumococcal conjugate vaccines like PCV7, approved in 2000, reduced invasive pneumococcal disease in children under 5 by 75-90% within years of introduction, while subsequent formulations expanded coverage against additional serotypes. The human papillomavirus (HPV) vaccine, first licensed in 2006, demonstrated over 95% efficacy against vaccine-targeted HPV types causing cervical precancers in clinical trials, leading to significant declines in HPV infections and related lesions in vaccinated cohorts by the 2010s. Rotavirus vaccines, reintroduced post-2006 after prior issues, averted hundreds of thousands of severe diarrhea cases annually in children globally.\n\nMessenger RNA (mRNA) platforms represented a technological leap, with COVID-19 vaccines like Pfizer-BioNTech and Moderna authorized in December 2020 after trials showing 95% efficacy against symptomatic infection from the original strain, enabling rapid deployment of over 13 billion doses worldwide by 2023 and averting an estimated 20 million deaths in the first year. However, mRNA vaccines required multiple boosters due to waning immunity and variant escape, with effectiveness against transmission dropping to below 50% within months against Omicron subvariants.\n\nSetbacks included the 1976 swine flu vaccination program, which immunized 45 million Americans but was linked to an excess risk of Guillain-Barré syndrome (GBS) at approximately 1 case per 100,000 doses, prompting program suspension and eroding public trust in mass campaigns. The rhesus rotavirus vaccine RotaShield, licensed in 1998, was withdrawn in 1999 after post-licensure surveillance detected a 1-2 per 10,000 increased risk of intussusception in infants, highlighting challenges in pre-licensure detection of rare adverse events.\n\nCOVID-19 vaccine rollout faced scrutiny over rare but confirmed risks, including myocarditis at rates of 1 in 5,000-10,000 among young males after mRNA doses, and thrombosis with thrombocytopenia syndrome at 3-15 per million after adenovirus-vector vaccines, contributing to vaccine hesitancy amid policy mandates that prioritized population-level benefits despite individual variability in risk. Failures in trial design, such as reliance on relative rather than absolute risk reduction and short-term endpoints, fueled debates on overreliance, with excess non-COVID mortality observed in some highly vaccinated countries post-2021. These incidents underscored systemic issues, including pharmaceutical incentives potentially influencing regulatory haste and underreporting in adverse event systems biased toward affirming safety narratives from industry-funded studies.\n\n## Controversies and Debates\n\n### Origins and Drivers of Vaccine Skepticism\n\nVaccine skepticism emerged shortly after Edward Jenner's development of the smallpox vaccine in 1796, with early critics raising concerns about the safety of introducing cowpox material into humans, potential for disease transmission, and violations of bodily autonomy. Religious objections cited biblical prohibitions against mixing species, while philosophical arguments emphasized individual liberty over state-imposed medical interventions. In Britain, the 1853 Vaccination Act, which mandated smallpox vaccination for infants, intensified resistance, leading to mass protests and the establishment of the Anti-Vaccination League in 1866; similar movements arose in the United States, where critics highlighted contaminated vaccines causing erysipelas and syphilis through arm-to-arm inoculation practices. By the 1880s, the Leicester anti-vaccination campaign achieved high noncompliance rates—over 90% in some areas—advocating sanitation and quarantine as alternatives, which skeptics claimed reduced mortality without vaccination.\n\nIn the 20th century, specific incidents amplified distrust, including the 1955 Cutter Incident, where inactivated polio vaccine from Cutter Laboratories contained live virus, infecting over 40,000 children, paralyzing 200, and causing five deaths, exposing manufacturing flaws and regulatory lapses. The 1976 swine flu vaccination program in the United States administered doses to 45 million people but was halted after 450 cases of Guillain-Barré syndrome emerged, at a rate of approximately 1 in 100,000, with 25 fatalities, eroding public confidence in rushed campaigns. Concerns over the diphtheria-pertussis-tetanus (DPT) vaccine in the 1980s, fueled by reports of encephalopathy and a 1982 documentary linking it to neurological damage, prompted lawsuits and reformulations, though subsequent studies found risks lower than portrayed.\n\nKey drivers of vaccine skepticism include empirical evidence of rare but severe adverse events, perceived underreporting in surveillance systems, and doubts about long-term efficacy when diseases are controlled by non-vaccination factors like improved hygiene. Institutional factors, such as pharmaceutical industry influence and government mandates overriding informed consent, foster perceptions of profit motives over public health, as seen in historical compulsory laws sparking civil liberties debates. Personal anecdotes and social networks amplify fears of side effects, often outweighing statistical benefits in low-incidence scenarios, while skepticism toward official narratives grows from past overpromises, like the 1998 retracted study associating MMR vaccine with autism, which persists despite refutations due to parental observations of regression.\n\n### Specific Historical and Recent Scandals\n\nIn 1955, the Cutter Incident involved batches of Jonas Salk's inactivated polio vaccine produced by Cutter Laboratories that failed to fully inactivate the poliovirus, resulting in live virus contamination. Approximately 220,000 individuals were exposed, leading to over 40,000 cases of polio, including 200 cases of paralysis and at least 10 deaths among vaccinated children. This manufacturing failure prompted a temporary halt to the U.S. polio vaccination program, stricter federal oversight of vaccine production, and lawsuits against Cutter, highlighting deficiencies in quality control during rapid scaling of vaccine deployment.\n\nBetween 1955 and 1963, an estimated 10-30% of polio vaccines administered in the United States were contaminated with simian virus 40 (SV40), a polyomavirus present in monkey kidney cells used for viral propagation. Up to 30 million Americans, including children born between 1946 and 1963, received SV40-contaminated doses before detection in 1960 and subsequent elimination from production. While SV40 can cause tumors in animal models, epidemiological studies have not consistently linked it to increased human cancer rates, though research continues on potential long-term oncogenic risks.\n\nThe 1976 U.S. National Influenza Immunization Program vaccinated about 45 million people against an anticipated swine flu pandemic strain but was associated with an elevated incidence of Guillain-Barré syndrome (GBS), a rare autoimmune neuropathy. Surveillance identified 1,098 GBS cases from October 1976 to January 1977, with an attributable risk of approximately 1 case per 100,000 vaccinations—roughly tenfold higher than baseline—and 58 fatalities. The program was suspended in December 1976 amid these reports, contributing to public distrust in expedited vaccine campaigns despite the flu outbreak proving milder than feared.\n\nIn 2016-2017, the Philippines' Department of Health administered Sanofi Pasteur's Dengvaxia vaccine to over 830,000 schoolchildren as part of a dengue prevention initiative targeting high-risk areas. Post-licensure data revealed that Dengvaxia, a chimeric yellow fever-dengue tetravalent vaccine, increased the risk of severe dengue and hospitalization in seronegative individuals (those without prior dengue exposure), due to antibody-dependent enhancement where initial vaccination primes inadequate immunity against subsequent natural infection. This led to the program's abrupt termination in December 2017, criminal investigations into procurement irregularities, congressional inquiries, and widespread vaccine hesitancy, with at least three child deaths attributed to vaccine-enhanced disease in seronegative recipients. Sanofi updated labeling to restrict use to previously exposed individuals, underscoring challenges in deploying live-attenuated vaccines against flaviviruses with complex immunology.\n\n### Mandates, Coercion, and Individual Rights\n\nIn 1905, the U.S. Supreme Court in *Jacobson v. Massachusetts* upheld a Cambridge, Massachusetts, ordinance requiring smallpox vaccination during an outbreak, affirming states' police power to impose fines for noncompliance as a reasonable exercise of authority to protect public health, provided the measures were not arbitrary or oppressive. The ruling emphasized that individual liberty yields to community welfare when vaccination demonstrably curbs contagious disease spread, but it did not endorse forced injection or imprisonment, limiting enforcement to a $5 fine (equivalent to about $170 today). This precedent established a framework for mandates, influencing subsequent school-entry requirements that, by 1980, existed in all U.S. states for diseases like measles and polio, often with exemptions for medical, religious, or philosophical reasons.\n\nVaccine mandates trace to the American Revolutionary War, when General George Washington ordered smallpox inoculation for Continental Army troops in 1777 to combat outbreaks, marking one of the earliest coercive public health measures in U.S. history. By the 19th century, states like Massachusetts enacted compulsory laws amid urban epidemics, though enforcement varied and faced resistance, including riots in some cities. Military mandates have persisted, with U.S. armed forces requiring vaccines since the Continental Army era, including a COVID-19 mandate in August 2021 that led to over 8,000 service member separations by 2023 due to refusals, prompting congressional repeal in December 2022 amid claims of inadequate data on long-term safety.\n\nDuring the COVID-19 pandemic, mandates expanded significantly, with President Biden's September 2021 executive actions imposing requirements on federal contractors, healthcare workers via the Centers for Medicare \\u0026 Medicaid Services (CMS), and employers with 100+ employees through the Occupational Safety and Health Administration (OSHA). The Supreme Court blocked the OSHA rule in January 2022 by a 6-3 vote, ruling it exceeded agency authority under the Occupational Safety and Health Act, as COVID-19 posed a broad occupational risk rather than a workplace-specific hazard, thus infringing on individual choice without sufficient justification. Conversely, the Court permitted the CMS mandate for Medicare/Medicaid facilities affecting 17 million workers, deeming it a targeted condition for federal funding tied to patient safety. State-level mandates for healthcare workers correlated with a 4-6 percentage point increase in uptake among that group, per a 2024 cross-sectional analysis of 50 states, though overall population effects were modest and confounded by voluntary incentives.\n\nCritics of mandates invoke bodily autonomy as a fundamental right, arguing that coerced vaccination—via job loss, travel restrictions, or fines—undermines informed consent, a principle codified in the 1947 Nuremberg Code prohibiting non-voluntary medical interventions in human experimentation. While the Code applies to trials rather than licensed vaccines, opponents extend it to emergency-use authorizations, citing rushed approvals and reported adverse events like myocarditis in young males (peaking at 105.9 cases per million second doses in males aged 16-17). Empirical reviews question mandates' net benefits, noting waning efficacy against Omicron transmission (dropping below 50% by 3-4 months post-dose) and potential societal harms like workforce shortages in healthcare (up to 1.6% employment drops in mandate states) and eroded trust, which a 2022 policy analysis deemed likely to outweigh gains in heterogeneous risk populations.  Proponents counter with utilitarian grounds, prioritizing herd immunity thresholds (e.g., 70-90% for measles) to avert outbreaks, though data from employer mandates show mixed health outcomes, with no clear reduction in hospitalizations beyond voluntary vaccination trends. \n\nLegal challenges post-*Jacobson* have evolved with substantive due process under the 14th Amendment, as seen in overturned mandates during less severe outbreaks, highlighting that coercion must be proportionate to evidence of necessity and efficacy. Philosophically, mandates pit individual rights—rooted in self-ownership and refusal of invasive procedures—against collective obligations, with causal analyses revealing that overreliance on coercion can foster resentment and lower future compliance, as observed in pre-COVID hesitancy spikes after scandals like the 1976 swine flu program, which vaccinated 45 million but yielded minimal cases while causing Guillain-Barré syndrome in 1 per 100,000. Mainstream sources often frame mandates as unassailably pro-public health, yet empirical scrutiny, including from peer-reviewed outlets, underscores risks of policy overreach when vaccines confer imperfect or transient protection, particularly absent natural immunity credits.\n\n### Empirical Critiques of Overreliance and Policy Failures\n\nEmpirical data indicate that policies emphasizing widespread vaccination have sometimes overlooked limitations in vaccine performance, such as waning protection or unintended viral evolution, resulting in persistent disease circulation and suboptimal public health outcomes. For instance, the reliance on live attenuated oral polio vaccine (OPV) to achieve eradication has led to the emergence of circulating vaccine-derived polioviruses (cVDPVs), which revert to neurovirulence and transmit in underimmunized populations. Between January 2023 and June 2024, 849 cVDPV cases were reported globally, with 70 distinct type 2 outbreaks spanning 38 countries, many persisting beyond one year despite supplementary immunization activities.  This phenomenon underscores a policy trade-off: OPV's superior induction of intestinal immunity facilitated initial gains against wild poliovirus, but delayed global transitions to inactivated polio vaccine (IPV), which lacks this risk, have prolonged outbreak risks in regions with immunity gaps. \n\nIn the context of SARS-CoV-2, vaccines were deployed with expectations of significantly curbing transmission to justify measures like mandates and lockdowns, yet real-world data revealed substantial breakthrough infections and reduced effectiveness against variants. A household transmission study in England and Scotland during 2021 showed that full vaccination reduced Delta variant transmission risk by 40-50% from infected index cases compared to unvaccinated, but this was markedly lower than the 65% reduction observed for the Alpha variant, with protection diminishing over months post-vaccination.  Against Omicron, population-level estimates indicated vaccine effectiveness against infection fell below 20% six months after dosing, necessitating repeated boosters and highlighting overreliance on initial trial data that underrepresented variant escape and immune evasion.  Critics argue that such waning—evident in mRNA vaccines' protection against hospitalization dropping from over 90% initially to around 50% after four to five months—undermined policies prioritizing vaccination over hybrid strategies incorporating natural immunity or targeted protections, as evidenced by higher transmission from vaccinated individuals in Omicron-dominant periods.  \n\nBroader critiques extend to routine immunization schedules where empirical evidence of waning or incomplete protection has not always prompted reevaluation. For pertussis, acellular vaccines provide durable infant protection but wane rapidly by adolescence, correlating with resurgent epidemics in highly vaccinated cohorts; U.S. incidence rose from 1.6 cases per 100,000 in 1980 to 10.5 per 100,000 by 2019, driven by this temporal decay rather than vaccine refusal alone.  Policy responses, such as adolescent boosters, have mitigated but not eliminated cycles, illustrating overreliance on vaccination without addressing pathogen evolution or complementary measures like maternal immunization. These cases collectively demonstrate that while vaccines reduce burden, uncritical expansion of mandates or eradication timelines without accounting for immunological realities can lead to resource misallocation and eroded trust when outcomes diverge from projections.\n\n## Economic and Societal Dimensions\n\n### Costs of Research, Production, and Distribution\n\nThe development of vaccines entails substantial upfront investments in research and development (R\\u0026D), with estimates for bringing a successful preventive vaccine to market ranging from $132.7 million to $886.8 million in capitalized costs, including failures across clinical phases and a typical timeline of 10-15 years. Lower-end figures, such as $200-500 million, often exclude post-approval surveillance (Phase 4) and account for higher success rates in vaccines compared to therapeutics, though attrition remains high with over 90% of candidates failing pre-licensure. These costs encompass preclinical testing, clinical trials involving thousands of participants, regulatory compliance, and manufacturing scale-up, frequently subsidized by public funds that mitigate private sector risk but influence pricing and access dynamics.\n\nProduction costs vary by vaccine platform and scale, with per-dose manufacturing expenses typically ranging from $0.98 to $4.85 in developing countries for traditional vaccines, driven by antigen production, formulation, fill-finish operations, and quality assurance. For mRNA vaccines like those for COVID-19, production costs per dose are estimated at $1.27-2.85, reflecting higher expenses for lipid nanoparticles, purification, and single-use consumables that can comprise 45-90% of variable costs, though economies of scale reduce marginal costs at volumes exceeding 100 million doses. Facility investments add $50-500 million per antigen line due to stringent biosafety, contamination controls, and automation needs, with innovative platforms like viral vectors incurring higher upfront capital than inactivated or subunit vaccines.\n\nDistribution and logistics impose additional per-dose costs of $0.32-3.53, encompassing cold-chain storage, transportation, personnel, and waste management, which escalate in low-resource settings due to infrastructure gaps and outreach requirements. For instance, COVID-19 vaccine delivery in African and Asian countries averaged $0.90-4.60 per dose during campaigns, with fixed-site strategies costing less than mobile outreach but vulnerable to supply disruptions. These expenses, often 10-20% of total program costs, highlight causal dependencies on geographic, climatic, and political factors, where failures in cold-chain integrity can render doses ineffective, amplifying effective costs beyond financial outlays.\n\n### Intellectual Property and Market Dynamics\n\nIntellectual property rights, primarily through patents, serve as a core mechanism to incentivize vaccine research and development by granting temporary market exclusivity, enabling firms to recover substantial upfront costs estimated at $1-2 billion per vaccine due to lengthy clinical trials and regulatory hurdles. Without such protections, developers face risks of imitation by competitors, potentially leading to underinvestment in low-margin preventive products where benefits accrue broadly via herd immunity rather than direct consumer payments. Patents typically last 20 years from filing, though extensions via regulatory exclusivity can add 5-7 years, balancing innovation incentives against eventual generic entry.\n\nThe vaccine market exhibits oligopolistic characteristics, with a small number of multinational corporations dominating production and supply; in 2021, nine manufacturers accounted for 64% of global vaccine volumes excluding COVID-19 products, fostering limited competition and pricing power. This concentration stems from high barriers to entry, including specialized manufacturing facilities, regulatory approvals, and economies of scale, resulting in duopolies or monopolies for specific vaccines like those for rotavirus or HPV. Such dynamics enable premium pricing—evident in influenza vaccines where oligopolistic suppliers have sustained markups despite commoditized production—but also expose vulnerabilities, as seen in supply shortages during demand surges.\n\nRecent COVID-19 vaccine development highlighted tensions in IP and market interplay: Moderna retained full patent rights despite receiving over $2.5 billion in U.S. government funding via Operation Warp Speed, rejecting voluntary waivers that could have accelerated global production. This exclusivity contributed to high profitability—Pfizer reported $37 billion in Comirnaty sales in 2021 alone—while spurring litigation, including Moderna's 2022 suits against Pfizer/BioNTech for infringing mRNA stabilization patents, with mixed outcomes such as U.S. Patent Trial and Appeal Board invalidations of key claims in March 2025 alongside UK Court of Appeal upholding of infringement in August 2025. Patent protections thus preserved incentives for rapid innovation under emergency conditions but amplified debates over access, as exclusivity delayed technology transfer to low-income manufacturers amid global shortages.\n\nGovernment interventions, such as advance purchase agreements and liability shields under the PREP Act, have supplemented IP by de-risking investments, yet market dynamics persist where public funding coexists with private IP retention, potentially distorting incentives toward profitable blockbuster vaccines over neglected diseases. Empirical analyses indicate that while patents drive R\\u0026D in viable markets, they exacerbate inequities in oligopolistic settings without complementary policies like compulsory licensing, which have been invoked sparingly for vaccines due to technology transfer complexities.\n\n### Global Access, Equity, and Incentives\n\nGlobal vaccine coverage remains uneven, with significant disparities between high-income and low-income countries. In 2024, approximately 85% of infants worldwide received three doses of the diphtheria-tetanus-pertussis (DTP3) vaccine, covering about 109 million children, yet 14.3 million children—predominantly in low-income regions—received no vaccines at all, classified as zero-dose children.  Coverage for the first measles-containing vaccine dose stood at 84%, but dropped to 76% for the second dose, leaving 30 million children under-protected and contributing to outbreaks in 60 countries. These gaps persist despite initiatives like the GAVI Alliance, which since 2000 has supported immunization for over 1.2 billion children through subsidized vaccine purchases and health system strengthening, averting an estimated 18 million future deaths. However, GAVI's impact has been critiqued for insufficient attention to long-term sustainability post-transition, with some countries experiencing coverage declines after aid ends due to funding shortfalls.\n\nEquity challenges in vaccine access stem from a combination of supply constraints, logistical barriers, and domestic factors in recipient countries. In low- and middle-income countries, inequalities in wealth, education, and geographic access exacerbate dropout rates and limit uptake, even when vaccines are available. The COVID-19 pandemic highlighted these issues acutely: high-income countries secured over 70% of early vaccine supplies despite comprising 16% of the global population, leading to \"vaccine nationalism\" where nations prioritized domestic stockpiles over global sharing. COVAX, the WHO-led facility aimed at equitable distribution, initially targeted 2 billion doses for low-income countries by the end of 2021 but delivered only 910 million, relying heavily on donations that were delayed or insufficient amid production bottlenecks and export restrictions.  By its closure in December 2023, COVAX had distributed nearly 2 billion doses to 146 economies, averting an estimated 2.7 million deaths in advance market commitment countries, yet persistent gaps in low-income regions were attributed not solely to supply but to weak cold-chain infrastructure, corruption, and low demand from hesitancy. \n\nProposals to address inequities, such as the 2022 WTO TRIPS intellectual property waiver for COVID-19 vaccines, had negligible effects on production scaling. No country invoked the waiver to manufacture vaccines by late 2022, as barriers lay in technology transfer, raw materials, and manufacturing expertise rather than patents alone, underscoring that IP waivers do not resolve capacity constraints in low-income settings.  Economic incentives for vaccine development primarily rely on patents and market exclusivity to recoup high R\\u0026D costs—often exceeding $1 billion per vaccine—and spur innovation, given historical market failures where low profitability deterred private investment.  Public-private partnerships, like those funding Operation Warp Speed, accelerated COVID-19 vaccines while preserving IP rights, enabling rapid scaling through licensed production; however, critics argue this structure incentivizes pricing premiums and hoarding, though empirical evidence shows patents facilitate technology licensing pools that enhance access over compulsory measures.  Balancing these incentives with subsidies and voluntary tech transfers, as in GAVI's model, remains essential, but overemphasis on equity mandates without addressing recipient-country governance risks inefficient aid allocation.\n\n## Applications Beyond Human Medicine\n\n### Veterinary Vaccines\n\nVeterinary vaccines prevent infectious diseases in animals, enhancing welfare, boosting livestock productivity, and mitigating zoonotic risks to humans. Developed since the late 19th century, the first such vaccine targeted chicken cholera in 1879 by Louis Pasteur, followed by anthrax vaccines for sheep and cattle in 1881.  Rabies vaccines emerged in the 1880s, initially adapted from street virus via serial passage in rabbits. These early innovations laid the foundation for modern applications across mammals, birds, and fish, with vaccines now available for over 400 diseases.\n\nIn livestock, vaccines address major economic threats like foot-and-mouth disease, bovine viral diarrhea, and infectious bovine rhinotracheitis (IBR), reducing morbidity and mortality while curbing transmission. For instance, strategic vaccination against porcine epidemic diarrhea virus yielded farm-level benefits of €147,525 to €269,759 when applied to sows. Companion animal vaccines target core pathogens such as canine distemper, parvovirus, adenovirus, and rabies, with optional coverage for Lyme disease in endemic areas.  Effectiveness hinges on factors including herd management, with no vaccine achieving 100% protection alone; integrated strategies amplify outcomes by decreasing disease incidence and antibiotic needs. \n\nEconomically, veterinary vaccines sustain agriculture by averting losses from outbreaks, as seen in efforts to control neglected zoonoses via broader adoption, which also bolsters food security and community income. They reduce zoonotic spillover, protecting public health alongside animal productivity. Challenges include variable duration of immunity, potential adverse reactions like allergic or autoimmune responses, and development hurdles such as ensuring thermostability for field use.  Vaccine hesitancy among pet owners, often tied to reported risks or over-vaccination concerns, underscores the need for tailored protocols based on empirical risk assessment rather than blanket annual dosing. Regulatory frameworks, like the U.S. Virus-Serum-Toxin Act of 1913, enforce safety and efficacy standards to address historical concerns over biologics.\n\n### Biotechnological Uses and Analogues\n\nVirus-like particles (VLPs), structural analogues to viral vaccines lacking infectious genetic material, self-assemble from one or more viral proteins to mimic native virus morphology and enable biotechnological applications such as nanoscale drug delivery and bio-inspired material synthesis. These particles, typically 20-200 nm in diameter, leverage the repetitive antigenic display and stability of vaccine-derived capsids for encapsulating therapeutic payloads, including small molecules, nucleic acids, or proteins, facilitating targeted cellular uptake without replication risks inherent to live vectors. In non-vaccine contexts, VLPs have been engineered for programmable transient gene delivery, where surface modifications allow precise control over cargo release in synthetic biology workflows, as demonstrated in streamlined production systems achieving high yields via bacterial or yeast expression hosts.\n\nViral vectors, derived from attenuated or replication-deficient viruses originally optimized for vaccine immunogenicity, serve as core tools in gene therapy and recombinant protein production within biotechnology. Adeno-associated virus (AAV) vectors, with packaging capacities up to 4.7 kb, transduce non-dividing cells for stable transgene expression, underpinning over 200 clinical trials by 2023 for applications like enzyme replacement in metabolic disorders, distinct from their prior use in eliciting immune responses. Adenoviral vectors, capable of larger payloads (up to 36 kb), enable high-titer transient expression in mammalian cell lines for biomanufacturing, such as producing monoclonal antibodies or viral glycoproteins at scales exceeding 10^12 particles per liter in bioreactor systems. These adaptations prioritize transduction efficiency over immunogenicity, with modifications like capsid engineering reducing off-target effects observed in vaccine formulations.\n\nMessenger RNA (mRNA) platforms, accelerated by vaccine development, extend to biotechnological therapeutics for in vivo protein synthesis, bypassing traditional recombinant expression limitations in prokaryotic systems. Nucleoside modifications and lipid nanoparticle encapsulation, refined for vaccine stability, enable delivery of up to 4 kb transcripts encoding functional proteins like cystic fibrosis transmembrane conductance regulator, with preclinical yields supporting personalized manufacturing cycles under 10 days. Beyond prophylactic uses, these analogues facilitate transient gene editing via mRNA-encoded CRISPR components, achieving editing efficiencies above 50% in primary cells without genomic integration risks, as validated in 2024 studies on immune-mediated diseases. Such applications underscore causal links between vaccine-derived lipid formulations and scalable biotech production, where half-life extensions via 5' cap analogues correlate directly with therapeutic dosing intervals.\n\n## Future Trends and Challenges\n\n### Innovations in Vaccine Technology\n\nRecent innovations in vaccine technology have shifted toward nucleic acid-based platforms, enabling faster development and adaptation compared to traditional methods like inactivated or live-attenuated viruses. These platforms, including mRNA and viral vectors, were pivotal in the rapid deployment of COVID-19 vaccines, with mRNA vaccines receiving emergency authorization in December 2020 after clinical trials demonstrating high efficacy against severe disease. Viral vector technologies, such as those using adenoviruses, similarly facilitated vaccines like the Oxford-AstraZeneca product, approved in early 2021, by delivering genetic instructions for antigen production without viral replication.\n\nMessenger RNA (mRNA) vaccines represent a breakthrough, utilizing synthetic mRNA encapsulated in lipid nanoparticles to instruct host cells to produce viral antigens, thereby eliciting immune responses without introducing pathogens. Development accelerated in the 2010s, building on foundational research from the 1960s, with modifications like nucleoside alterations reducing innate immune activation and improving stability. Beyond COVID-19, mRNA platforms are advancing for influenza, where they allow annual strain updates in weeks rather than months, and for cancer, with early-phase trials showing potential immunogenicity against tumor antigens as of 2025. However, long-term durability and broad applicability remain under evaluation in ongoing studies.\n\nViral vector vaccines employ modified non-replicating viruses, such as adenoviruses or poxviruses, to ferry antigen-encoding genes into cells, promoting both humoral and cellular immunity superior to some subunit vaccines. The Ebola vaccine Ervebo, approved by the FDA in December 2019, utilized a vesicular stomatitis virus vector, demonstrating 97.5% efficacy in ring vaccination trials. Innovations include prime-boost regimens combining vectors to circumvent pre-existing immunity, enhancing responses against pathogens like HIV and malaria in preclinical models.\n\nEmerging self-amplifying RNA (saRNA) vaccines incorporate replicase genes, allowing intracellular RNA amplification for prolonged antigen expression at lower doses—potentially 10-fold less than conventional mRNA—while maintaining safety profiles in phase 1 trials initiated around 2020.  Adjuvant innovations, such as saponin-based nanoparticles targeting Toll-like receptors, have boosted potency and breadth in COVID-19 and HIV vaccine candidates, with murine studies showing improved neutralization as of 2024. Nanoparticle delivery systems further enhance targeted immunity, with metal-organic frameworks enabling stronger responses at reduced antigen doses in preclinical vaccine formulations. These technologies prioritize empirical immune correlates over unverified assumptions, though clinical translation requires rigorous validation against real-world efficacy metrics.\n\n### Addressing Evolving Pathogens and Resistance\n\nInfluenza viruses evolve through antigenic drift, involving gradual mutations in hemagglutinin and neuraminidase surface proteins, and antigenic shift, a major reassortment of gene segments that can lead to pandemics. These changes necessitate annual vaccine reformulation to match circulating strains, with the World Health Organization's Global Influenza Surveillance and Response System selecting candidate viruses twice yearly based on global surveillance data since 1973. For the 2025-2026 Northern Hemisphere season, vaccines are trivalent, targeting two influenza A subtypes (H1N1 and H3N2) and one B/Victoria lineage strain, reflecting ongoing evolution.  \n\nBacterial pathogens also demonstrate evolutionary responses to vaccination, as seen in *Streptococcus pneumoniae*, where conjugate vaccines like PCV7 and PCV13 reduced targeted serotypes but prompted replacement by non-vaccine serotypes, increasing their prevalence in carriage and disease. This serotype replacement, observed rapidly post-vaccination introduction in 2000, complicates long-term efficacy, with studies showing incomplete replacement in invasive disease compared to asymptomatic carriage, yet necessitating higher-valency vaccines like PCV20. Such dynamics highlight how vaccine pressure selects for immune-escape variants, though overall pneumococcal disease burden declines.  \n\nStrategies to counter pathogen evolution include developing broadly protective vaccines targeting conserved epitopes, as pursued for influenza through rational antigen design aligning sequences across subtypes. mRNA platforms enable rapid updates, exemplified by COVID-19 boosters adapted for variants like Omicron, though mutable RNA viruses such as HIV and influenza pose persistent challenges due to immune evasion and waning efficacy against drifted strains. Complex vaccination models suggest multi-epitope targeting prevents escape better than single-antigen approaches.  \n\nVaccines also mitigate antimicrobial resistance (AMR) by averting infections that would otherwise require antibiotics, reducing selective pressure for resistant strains. A 2024 WHO report estimates that optimizing vaccines against 24 pathogens could avert 2.5 billion antibiotic doses annually, a 22% global reduction, with pneumococcal and typhoid vaccines exemplifying impacts on resistant *S. pneumoniae* and *Salmonella typhi*. By preventing both susceptible and resistant infections, vaccines lower transmission and usage, though evolving resistance underscores the need for integrated surveillance.\n\n### Policy and Public Trust Implications\n\nThe COVID-19 pandemic significantly eroded public trust in vaccine policies and institutions, with surveys indicating a decline in confidence linked to perceived inconsistencies in guidance and adverse event reporting. A KFF poll from January 2025 found that trust in public health agencies like the CDC fell to 52% among U.S. adults, down from pre-pandemic levels, particularly among Republicans who cited skepticism over efficacy claims and mandate enforcement. Cross-national data from 113 countries showed that lower trust in government correlated with higher vaccine hesitancy rates, exacerbating outbreaks of vaccine-preventable diseases like measles, which rose globally by 2023 due to coverage gaps. \n\nVaccine mandates implemented during the pandemic, such as those for employment or travel, have been empirically associated with diminished trust and increased polarization rather than sustained uptake. A 2022 analysis of U.S. policies concluded that mandates failed to broadly alter vaccination behavior and instead heightened opposition, with 20-30% of unvaccinated individuals reporting reinforced distrust in health authorities.  Peer-reviewed studies further indicate that coercive measures eroded confidence in future vaccines, as publics weighed rapid development timelines—e.g., Operation Warp Speed's compressed trials—against reported risks like myocarditis, which occurred at rates of 1-10 per 100,000 doses in young males per CDC data. This backlash contributed to a 2023-2025 uptick in non-medical exemptions for childhood vaccines, reaching 3-5% in states like California post-mandate.\n\nFuture policy challenges center on reconciling public health imperatives with rebuilding trust amid hesitancy driven by both misinformation and verifiable institutional lapses, such as delayed acknowledgments of rare side effects. Strategies proposed in recent reviews emphasize transparent pharmacovigilance and voluntary incentives over mandates, as higher institutional trust predicted 10-20% faster vaccination rollout in comparative global analyses.  The U.S. National Vaccine Plan (2021-2025) highlights addressing disparities and hesitancy through targeted education, but critics note that overlooking causal factors like regulatory shortcuts—e.g., emergency use authorizations bypassing long-term data—perpetuates skepticism, potentially hindering responses to novel pathogens.  Policymakers must prioritize empirical monitoring of adverse events via systems like VAERS, which captured over 1 million COVID-19 vaccine reports by 2023, to inform evidence-based reforms that restore credibility without eroding civil liberties.",
  "external_references": [
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/vaccines/glossary/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4257027",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4257027/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Explaining How Vaccines Work.html",
      "url": "https://www.cdc.gov/vaccines/basics/explaining-how-vaccines-work.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1200696",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1200696/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "History Of Smallpox Vaccination",
      "url": "https://www.who.int/news-room/spotlight/history-of-vaccination/history-of-smallpox-vaccination",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Cdcm Pha Stem Lesson Smallpox Eradication Lesson.pdf",
      "url": "https://www.cdc.gov/museum/pdf/cdcm-pha-stem-lesson-smallpox-eradication-lesson.pdf",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736%2824%2900850-X/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Mm7331a2.htm",
      "url": "https://www.cdc.gov/mmwr/volumes/73/wr/mm7331a2.htm",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1113535",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1113535/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk190009",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK190009/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/vaccine-safety/historical-concerns/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3906279",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3906279/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "62db1490 7152 4edc Bb0d C1c08e5fe66c En",
      "url": "https://health.ec.europa.eu/document/download/62db1490-7152-4edc-bb0d-c1c08e5fe66c_en?filename=glossary_en.pdf",
      "domain": "health.ec.europa.eu",
      "type": "citation"
    },
    {
      "text": "Vaccines",
      "url": "https://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/vaccines",
      "domain": "hopkinsmedicine.org",
      "type": "citation"
    },
    {
      "text": "History.html",
      "url": "https://www.cdc.gov/smallpox/about/history.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3407399",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3407399/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "The History Of Variolation",
      "url": "https://historyofvaccines.org/blog/the-history-of-variolation/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Overview",
      "url": "https://historyofvaccines.org/history/edward-jenner-frs-frcpe/overview/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Pmc11463195",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11463195/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3253344",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3253344/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nbk233000",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK233000/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3068582",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3068582/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc3760154",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3760154/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41392 023 01557 7",
      "url": "https://www.nature.com/articles/s41392-023-01557-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "39951545",
      "url": "https://pubmed.ncbi.nlm.nih.gov/39951545/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41577 020 00479 7",
      "url": "https://www.nature.com/articles/s41577-020-00479-7",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "315995",
      "url": "https://academic.oup.com/cid/article/47/3/401/315995",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "Immune Mechanism Induced By Live Attenuated Vaccine 117409.html",
      "url": "https://www.walshmedicalmedia.com/open-access/immune-mechanism-induced-by-live-attenuated-vaccine-117409.html",
      "domain": "walshmedicalmedia.com",
      "type": "citation"
    },
    {
      "text": "Pmc2883798",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2883798/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "32959252",
      "url": "https://pubmed.ncbi.nlm.nih.gov/32959252/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9149153",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9149153/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11744563",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11744563/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Chapter 1 Principles Of Vaccination.html",
      "url": "https://www.cdc.gov/pinkbook/hcp/table-of-contents/chapter-1-principles-of-vaccination.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/measles/vaccines/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9067519",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9067519/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Contraindications Precautions.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-best-practices/contraindications-precautions.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Polio Vaccine Rates Information Sheet.pdf",
      "url": "https://cdn.who.int/media/docs/default-source/pvg/global-vaccine-safety/polio-vaccine-rates-information-sheet.pdf?sfvrsn=79c1135a_4\\u0026download=true",
      "domain": "cdn.who.int",
      "type": "citation"
    },
    {
      "text": "Pmc7192346",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7192346/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.hhs.gov/immunization/basics/types/index.html",
      "domain": "hhs.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7189890",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7189890/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8708925",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8708925/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/vaccines/hcp/vaccines-us/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10199328",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10199328/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/article/S0140-6736%2821%2901429-X/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Pmc10465871",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10465871/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9329957",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9329957/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10055765",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10055765/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "What Is A Toxoid Vaccine.aspx",
      "url": "https://www.news-medical.net/health/What-is-a-Toxoid-Vaccine.aspx",
      "domain": "news-medical.net",
      "type": "citation"
    },
    {
      "text": "Understanding Six Types Of Vaccine Technologies",
      "url": "https://www.pfizer.com/news/articles/understanding_six_types_of_vaccine_technologies",
      "domain": "pfizer.com",
      "type": "citation"
    },
    {
      "text": "Pmc1905528",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1905528/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc1405863",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1405863/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8185206",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8185206/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "38810703",
      "url": "https://pubmed.ncbi.nlm.nih.gov/38810703/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10134841",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10134841/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0022283623004084",
      "url": "https://www.sciencedirect.com/science/article/pii/S0022283623004084",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc8805485",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8805485/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9317404",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9317404/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41541 021 00356 X",
      "url": "https://www.nature.com/articles/s41541-021-00356-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2025.1584876/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "S12985 025 02645 6",
      "url": "https://virologyj.biomedcentral.com/articles/10.1186/s12985-025-02645-6",
      "domain": "virologyj.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "2700",
      "url": "https://www.mdpi.com/1422-0067/24/3/2700",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "S0092 8674%2824%2900309 X",
      "url": "https://www.cell.com/cell/fulltext/S0092-8674%2824%2900309-X",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "S41467 024 47905 1",
      "url": "https://www.nature.com/articles/s41467-024-47905-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41467 024 54289 9",
      "url": "https://www.nature.com/articles/s41467-024-54289-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099%2824%2900593-0/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Pmc10304030",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10304030/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/ebiom/article/PIIS2352-3964%2821%2900493-X/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Mit Scientists Use New Nanoparticle More Powerful Vaccines 0306",
      "url": "https://news.mit.edu/2024/mit-scientists-use-new-nanoparticle-more-powerful-vaccines-0306",
      "domain": "news.mit.edu",
      "type": "citation"
    },
    {
      "text": "Scitranslmed.adu2085",
      "url": "https://www.science.org/doi/10.1126/scitranslmed.adu2085",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "S41551 025 01530 5",
      "url": "https://www.nature.com/articles/s41551-025-01530-5",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc2912660",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2912660/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Hhs Nih Launch Next Generation Universal Vaccine Platform Pandemic Prone Viruses",
      "url": "https://www.nih.gov/news-events/news-releases/hhs-nih-launch-next-generation-universal-vaccine-platform-pandemic-prone-viruses",
      "domain": "nih.gov",
      "type": "citation"
    },
    {
      "text": "New Study Shows All One Coronavirus Vaccines Could Save Millions Lives Future Pandemics",
      "url": "https://cepi.net/new-study-shows-all-one-coronavirus-vaccines-could-save-millions-lives-future-pandemics",
      "domain": "cepi.net",
      "type": "citation"
    },
    {
      "text": "863",
      "url": "https://www.mdpi.com/2076-393X/13/8/863",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Surprising Finding Could Pave Way For Universal Cancer Vaccine",
      "url": "https://ufhealth.org/news/2025/surprising-finding-could-pave-way-for-universal-cancer-vaccine",
      "domain": "ufhealth.org",
      "type": "citation"
    },
    {
      "text": "About Universal Influenza Vaccine Technology Landscape",
      "url": "https://ivr.cidrap.umn.edu/about-universal-influenza-vaccine-technology-landscape",
      "domain": "ivr.cidrap.umn.edu",
      "type": "citation"
    },
    {
      "text": "8716",
      "url": "https://www.mdpi.com/1422-0067/26/17/8716",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2024.1498431/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pmc10251337",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10251337/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Immuno Cure And Pharmajet Collaborate To Advance A Novel Hiv Therapeutic Dna Vaccine Using Needle Free Technology In Humans",
      "url": "https://www.eatg.org/hiv-news/immuno-cure-and-pharmajet-collaborate-to-advance-a-novel-hiv-therapeutic-dna-vaccine-using-needle-free-technology-in-humans/",
      "domain": "eatg.org",
      "type": "citation"
    },
    {
      "text": "Antizika",
      "url": "https://www.clinicalresearchforum.org/page/AntiZika",
      "domain": "clinicalresearchforum.org",
      "type": "citation"
    },
    {
      "text": "Dna Cancer Vaccine Clinical Trials 135400697.html",
      "url": "https://finance.yahoo.com/news/dna-cancer-vaccine-clinical-trials-135400697.html",
      "domain": "finance.yahoo.com",
      "type": "citation"
    },
    {
      "text": "Pmc8586723",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8586723/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/lanmic/article/PIIS2666-52472100069-0/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Pmc7996517",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7996517/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9115787",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9115787/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Why Relative Risk Reduction Not Absolute Risk Reduction Is Most Often Used In Idusl2n2nk1xa",
      "url": "https://www.reuters.com/article/fact-check/why-relative-risk-reduction-not-absolute-risk-reduction-is-most-often-used-in-idUSL2N2NK1XA/",
      "domain": "reuters.com",
      "type": "citation"
    },
    {
      "text": "Pmc9982864",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9982864/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "6525007",
      "url": "https://academic.oup.com/ije/article/52/1/19/6525007",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "7591274",
      "url": "https://academic.oup.com/ofid/article/11/3/ofae051/7591274",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "S0264410x24002470",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0264410X24002470",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "The Challenge Of Measuring Vaccine Effectiveness",
      "url": "https://www.rockefellerfoundation.org/grantee-impact-stories/the-challenge-of-measuring-vaccine-effectiveness/",
      "domain": "rockefellerfoundation.org",
      "type": "citation"
    },
    {
      "text": "7 6 Vaccine Effectiveness 32408146.html",
      "url": "https://medicalguidelines.msf.org/en/viewport/mme/english/7-6-vaccine-effectiveness-32408146.html",
      "domain": "medicalguidelines.msf.org",
      "type": "citation"
    },
    {
      "text": "Pmc1114166",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1114166/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Cooperative Measles Vaccine Field Trial I Clinical",
      "url": "https://publications.aap.org/pediatrics/article/37/4/649/74504/COOPERATIVE-MEASLES-VACCINE-FIELD-TRIAL-I-Clinical",
      "domain": "publications.aap.org",
      "type": "citation"
    },
    {
      "text": "Efficacy",
      "url": "https://www.merckvaccines.com/mmr/efficacy/",
      "domain": "merckvaccines.com",
      "type": "citation"
    },
    {
      "text": "209448",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/209448",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "24 04 2024 Global Immunization Efforts Have Saved At Least 154 Million Lives Over The Past 50 Years",
      "url": "https://www.who.int/news/item/24-04-2024-global-immunization-efforts-have-saved-at-least-154-million-lives-over-the-past-50-years",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Vaccination",
      "url": "https://ourworldindata.org/vaccination",
      "domain": "ourworldindata.org",
      "type": "citation"
    },
    {
      "text": "P4037.pdf",
      "url": "https://www.immunize.org/wp-content/uploads/catg.d/p4037.pdf",
      "domain": "immunize.org",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/flu-vaccines-work/php/effectivenessqa/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc5557224",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5557224/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8627252",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8627252/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/lanam/article/PIIS2667-193X%2822%2900059-X/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Pmc9828372",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9828372/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2021.08.24.21262415v1",
      "url": "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1",
      "domain": "medrxiv.org",
      "type": "citation"
    },
    {
      "text": "S0013935122002389",
      "url": "https://www.sciencedirect.com/science/article/pii/S0013935122002389",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "2804451",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2804451",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "14760584.2025.2485252",
      "url": "https://www.tandfonline.com/doi/full/10.1080/14760584.2025.2485252",
      "domain": "tandfonline.com",
      "type": "citation"
    },
    {
      "text": "Do Adults Need A Measles Booster An Epidemiologist Explains Who Is Immune",
      "url": "https://www.pbs.org/newshour/health/do-adults-need-a-measles-booster-an-epidemiologist-explains-who-is-immune",
      "domain": "pbs.org",
      "type": "citation"
    },
    {
      "text": "S0264410x23009507",
      "url": "https://www.sciencedirect.com/science/article/pii/S0264410X23009507",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "7874423",
      "url": "https://academic.oup.com/cid/article/80/4/904/7874423",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "555",
      "url": "https://www.mdpi.com/2076-393X/13/6/555",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "S41467 023 37407 X",
      "url": "https://www.nature.com/articles/s41467-023-37407-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S13643 024 02597 Y",
      "url": "https://systematicreviewsjournal.biomedcentral.com/articles/10.1186/s13643-024-02597-y",
      "domain": "systematicreviewsjournal.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc9015327",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9015327/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Cmr.00084 18",
      "url": "https://journals.asm.org/doi/10.1128/cmr.00084-18",
      "domain": "journals.asm.org",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099%2819%2930121-5/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Jvi.00797 19",
      "url": "https://journals.asm.org/doi/10.1128/jvi.00797-19",
      "domain": "journals.asm.org",
      "type": "citation"
    },
    {
      "text": "S41591 022 01877 1",
      "url": "https://www.nature.com/articles/s41591-022-01877-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "324",
      "url": "https://ebm.bmj.com/content/27/6/324",
      "domain": "ebm.bmj.com",
      "type": "citation"
    },
    {
      "text": "2835590",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2835590",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Pmc6495011",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6495011/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41577 021 00662 4",
      "url": "https://www.nature.com/articles/s41577-021-00662-4",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Nejmoa2109072",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2109072",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "Pmc9553060",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9553060/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Possible Side Effects.html",
      "url": "https://www.cdc.gov/vaccines/basics/possible-side-effects.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "S41541 019 0132 6",
      "url": "https://www.nature.com/articles/s41541-019-0132-6",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc6760227",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6760227/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "P786.html",
      "url": "https://www.aafp.org/pubs/afp/issues/2017/0615/p786.html",
      "domain": "aafp.org",
      "type": "citation"
    },
    {
      "text": "Safety.htm",
      "url": "https://www.cdc.gov/flu/professionals/acip/app/safety.htm",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Chapter 4 Vaccine Safety.html",
      "url": "https://www.cdc.gov/pinkbook/hcp/table-of-contents/chapter-4-vaccine-safety.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Vaccine Adverse Event Reporting System Vaers Questions And Answers",
      "url": "https://www.fda.gov/vaccines-blood-biologics/vaccine-adverse-events/vaccine-adverse-event-reporting-system-vaers-questions-and-answers",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "vaers.hhs.gov",
      "url": "https://vaers.hhs.gov/",
      "domain": "vaers.hhs.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4504357",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4504357/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12179814",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12179814/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "37951411",
      "url": "https://pubmed.ncbi.nlm.nih.gov/37951411/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7712358",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7712358/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11669561",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11669561/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "37563049",
      "url": "https://pubmed.ncbi.nlm.nih.gov/37563049/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7575467",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7575467/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Measles Vaccine Effectiveness Safety",
      "url": "https://ourworldindata.org/measles-vaccine-effectiveness-safety",
      "domain": "ourworldindata.org",
      "type": "citation"
    },
    {
      "text": "Pmc10946219",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10946219/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10850707",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10850707/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S2666606523001153",
      "url": "https://www.sciencedirect.com/science/article/pii/S2666606523001153",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "126",
      "url": "https://jme.bmj.com/content/50/2/126",
      "domain": "jme.bmj.com",
      "type": "citation"
    },
    {
      "text": "Pmc10234830",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10234830/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/landig/article/PIIS2589-7500%2825%2900025-1/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "Vaccine Development 101",
      "url": "https://www.fda.gov/vaccines-blood-biologics/development-approval-process-cber/vaccine-development-101",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Vaccine Development Testing And Regulation",
      "url": "https://historyofvaccines.org/vaccines-101/how-are-vaccines-made/vaccine-development-testing-and-regulation/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Nbk236428",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK236428/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "How Developed Approved.html",
      "url": "https://www.cdc.gov/vaccines/basics/how-developed-approved.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Phases Clinical Trials",
      "url": "https://ncirs.org.au/phases-clinical-trials",
      "domain": "ncirs.org.au",
      "type": "citation"
    },
    {
      "text": "Pmc4944327",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4944327/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Clinical Trials",
      "url": "https://www.who.int/health-topics/clinical-trials",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "25 03 2025 Despite Global Influenza Vaccine Production Remaining Steady Production And Distribution Challenges Remain",
      "url": "https://www.who.int/news/item/25-03-2025-despite-global-influenza-vaccine-production-remaining-steady--production-and-distribution-challenges-remain",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Pmc8641981",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8641981/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://www.fda.gov/media/170198/download",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "S41598 024 67797 X",
      "url": "https://www.nature.com/articles/s41598-024-67797-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S41587 022 01643 1",
      "url": "https://www.nature.com/articles/s41587-022-01643-1",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0264410x23014779",
      "url": "https://www.sciencedirect.com/science/article/pii/S0264410X23014779",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Gao 21 319",
      "url": "https://www.gao.gov/products/gao-21-319",
      "domain": "gao.gov",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://www.fda.gov/media/183533/download",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Background Paper 6 Scaling Up Vaccinationlegal Aspects.pdf",
      "url": "https://theindependentpanel.org/wp-content/uploads/2021/05/Background-paper-6-Scaling-up-vaccinationlegal-aspects.pdf",
      "domain": "theindependentpanel.org",
      "type": "citation"
    },
    {
      "text": "S2211339823001028",
      "url": "https://www.sciencedirect.com/science/article/pii/S2211339823001028",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Current Good Manufacturing Practice Cgmp Regulations",
      "url": "https://www.fda.gov/drugs/pharmaceutical-quality-resources/current-good-manufacturing-practice-cgmp-regulations",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Good Manufacturing Practice",
      "url": "https://www.ema.europa.eu/en/human-regulatory-overview/research-development/compliance-research-development/good-manufacturing-practice",
      "domain": "ema.europa.eu",
      "type": "citation"
    },
    {
      "text": "Pmc9891391",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9891391/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7152481",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7152481/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://www.fda.gov/media/151716/download",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Vaccine Clinical Studies Safeguards",
      "url": "https://www.niaid.nih.gov/clinical-trials/vaccine-clinical-studies-safeguards",
      "domain": "niaid.nih.gov",
      "type": "citation"
    },
    {
      "text": "S12913 023 09237 6",
      "url": "https://bmchealthservres.biomedcentral.com/articles/10.1186/s12913-023-09237-6",
      "domain": "bmchealthservres.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Vaccine Testing And Vulnerable Human Subjects",
      "url": "https://historyofvaccines.org/vaccines-101/ethical-issues-and-vaccines/vaccine-testing-and-vulnerable-human-subjects/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Ethical Issues And Vaccines",
      "url": "https://historyofvaccines.org/vaccines-101/ethical-issues-and-vaccines/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "S13063 021 05597 8",
      "url": "https://trialsjournal.biomedcentral.com/articles/10.1186/s13063-021-05597-8",
      "domain": "trialsjournal.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Vaccines",
      "url": "https://www.fda.gov/vaccines-blood-biologics/vaccines",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "What Does Eua Mean",
      "url": "https://www.yalemedicine.org/news/what-does-eua-mean",
      "domain": "yalemedicine.org",
      "type": "citation"
    },
    {
      "text": "Covid 19 Medicines",
      "url": "https://www.ema.europa.eu/en/human-regulatory-overview/public-health-threats/coronavirus-disease-covid-19/covid-19-medicines",
      "domain": "ema.europa.eu",
      "type": "citation"
    },
    {
      "text": "Pmc8743449",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8743449/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S0264410x24008491",
      "url": "https://www.sciencedirect.com/science/article/pii/S0264410X24008491",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "National Assessment Procedure For Medicines",
      "url": "https://www.gov.uk/guidance/national-assessment-procedure-for-medicines",
      "domain": "gov.uk",
      "type": "citation"
    },
    {
      "text": "Regulatory Approval Of Covid 19 Vaccine Astrazeneca",
      "url": "https://www.gov.uk/government/publications/regulatory-approval-of-covid-19-vaccine-astrazeneca",
      "domain": "gov.uk",
      "type": "citation"
    },
    {
      "text": "The Roles Of The Mhra And Jcvi In Covid 19 Vaccines",
      "url": "https://ukhsa.blog.gov.uk/2020/12/02/the-roles-of-the-mhra-and-jcvi-in-covid-19-vaccines/",
      "domain": "ukhsa.blog.gov.uk",
      "type": "citation"
    },
    {
      "text": "Vaccine Safety",
      "url": "https://www.immunize.ca/vaccine-safety",
      "domain": "immunize.ca",
      "type": "citation"
    },
    {
      "text": "Foundations2 Vaccine Regulation .pdf",
      "url": "https://nccid.ca/wp-content/uploads/sites/2/2021/02/Foundations2_-Vaccine-Regulation_.pdf",
      "domain": "nccid.ca",
      "type": "citation"
    },
    {
      "text": "Covid 19 Vaccine Approval Process",
      "url": "https://www.tga.gov.au/products/covid-19/covid-19-vaccines/covid-19-vaccine-approval-process",
      "domain": "tga.gov.au",
      "type": "citation"
    },
    {
      "text": "Covid 19 Vaccination Simple Information On The 6 Steps To Approve A Vaccine.pdf",
      "url": "https://www.health.gov.au/sites/default/files/documents/2022/06/covid-19-vaccination-simple-information-on-the-6-steps-to-approve-a-vaccine.pdf",
      "domain": "health.gov.au",
      "type": "citation"
    },
    {
      "text": "Vaccines",
      "url": "https://extranet.who.int/prequal/vaccines",
      "domain": "extranet.who.int",
      "type": "citation"
    },
    {
      "text": "Pmc5355375",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5355375/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9401377",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9401377/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Chapter 21 Vaers.html",
      "url": "https://www.cdc.gov/surv-manual/php/table-of-contents/chapter-21-vaers.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6500454",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6500454/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Postmarketing Surveillance",
      "url": "https://www.sciencedirect.com/topics/pharmacology-toxicology-and-pharmaceutical-science/postmarketing-surveillance",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "00000473.htm",
      "url": "https://www.cdc.gov/Mmwr/preview/mmwrhtml/00000473.htm",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "12825543",
      "url": "https://pubmed.ncbi.nlm.nih.gov/12825543/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "2784015",
      "url": "https://jamanetwork.com/journals/jama/fullarticle/2784015",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Dataguide.html",
      "url": "https://vaers.hhs.gov/data/dataguide.html",
      "domain": "vaers.hhs.gov",
      "type": "citation"
    },
    {
      "text": "Vaers.html",
      "url": "https://wonder.cdc.gov/vaers.html",
      "domain": "wonder.cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc11252891",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11252891/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "39142925",
      "url": "https://pubmed.ncbi.nlm.nih.gov/39142925/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Index.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/index.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Who Recommendations For Routine Immunization Summary Tables",
      "url": "https://www.who.int/teams/immunization-vaccines-and-biologicals/policies/who-recommendations-for-routine-immunization---summary-tables",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Timing Spacing Immunobiologics.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-best-practices/timing-spacing-immunobiologics.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Rationale For The Immunization Schedule Why Is It",
      "url": "https://publications.aap.org/pediatricsinreview/article/40/1/26/35216/Rationale-for-the-Immunization-Schedule-Why-Is-It",
      "domain": "publications.aap.org",
      "type": "citation"
    },
    {
      "text": "S41467 024 45334 8",
      "url": "https://www.nature.com/articles/s41467-024-45334-8",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Child Adolescent Age.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/child-adolescent-age.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "0 18yrs Child Combined Schedule.pdf",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/downloads/child/0-18yrs-child-combined-schedule.pdf",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Child Adolescent Catch Up.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/child-adolescent-catch-up.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Adult Age.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/adult-age.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Cdc Updates 2025 Immunization Schedule With New Recommendations For Older Adults.aspx",
      "url": "https://www.ahcancal.org/News-and-Communications/Blog/Pages/CDC-Updates-2025-Immunization-Schedule-With-New-Recommendations-for-Older-Adults.aspx",
      "domain": "ahcancal.org",
      "type": "citation"
    },
    {
      "text": "Cdc Immunization Schedule Individual Decision Covid19 Standalone Chickenpox Toddlers.html",
      "url": "https://www.hhs.gov/press-room/cdc-immunization-schedule-individual-decision-covid19-standalone-chickenpox-toddlers.html",
      "domain": "hhs.gov",
      "type": "citation"
    },
    {
      "text": "Child Adolescent Medical Indication.html",
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/child-adolescent-medical-indication.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "2025 Immunization Schedules",
      "url": "https://phf.org/tools-resources/2025-immunization-schedules/",
      "domain": "phf.org",
      "type": "citation"
    },
    {
      "text": "Sp Variolation.html",
      "url": "https://www.nlm.nih.gov/exhibition/smallpox/sp_variolation.html",
      "domain": "nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Developments By Year",
      "url": "https://www.chop.edu/vaccine-education-center/science-history/vaccine-history/developments-by-year",
      "domain": "chop.edu",
      "type": "citation"
    },
    {
      "text": "00056803.htm",
      "url": "https://www.cdc.gov/mmwr/preview/mmwrhtml/00056803.htm",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4659912",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4659912/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "A Brief History Of Vaccination",
      "url": "https://www.who.int/news-room/spotlight/history-of-vaccination/a-brief-history-of-vaccination",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Overview",
      "url": "https://historyofvaccines.org/history/vaccine-timeline/overview/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Safety And Effectiveness Data.html",
      "url": "https://www.cdc.gov/hpv/hcp/vaccination-considerations/safety-and-effectiveness-data.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "2839024",
      "url": "https://jamanetwork.com/journals/jamapediatrics/fullarticle/2839024",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Nejme058285",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMe058285",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "Pmc8856755",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8856755/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nejmoa2510226",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2510226",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "463869",
      "url": "https://pubmed.ncbi.nlm.nih.gov/463869/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "584721",
      "url": "https://jamanetwork.com/journals/jamaneurology/fullarticle/584721",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Pmc2094741",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2094741/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Mm4843a5.htm",
      "url": "https://www.cdc.gov/mmwr/preview/mmwrhtml/mm4843a5.htm",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "How They Work.html",
      "url": "https://www.cdc.gov/covid/vaccines/how-they-work.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "The Power Of A Single Dose Evidence For A Single Dose Hpv Vaccine Schedule",
      "url": "https://publichealth.jhu.edu/ivac/the-power-of-a-single-dose-evidence-for-a-single-dose-hpv-vaccine-schedule",
      "domain": "publichealth.jhu.edu",
      "type": "citation"
    },
    {
      "text": "The Covid Vaccine Trials Failures In Design And Interpretation",
      "url": "https://publichealth.realclearjournals.org/history-of-public-health/2025/01/the-covid-vaccine-trials-failures-in-design-and-interpretation/",
      "domain": "publichealth.realclearjournals.org",
      "type": "citation"
    },
    {
      "text": "Pmc2595572",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC2595572/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9383768",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9383768/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "History Anti Vaccination Movements",
      "url": "https://historyofvaccines.org/vaccines-101/misconceptions-about-vaccines/history-anti-vaccination-movements/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Pmc1123944",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1123944/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "20250905 The Strange History Of The Anti Vaccine Movement",
      "url": "https://www.bbc.com/future/article/20250905-the-strange-history-of-the-anti-vaccine-movement",
      "domain": "bbc.com",
      "type": "citation"
    },
    {
      "text": "Vaccination Resistance",
      "url": "https://www.oah.org/tah/august-2/vaccination-resistance/",
      "domain": "oah.org",
      "type": "citation"
    },
    {
      "text": "Anti Vaccination Movement History",
      "url": "https://time.com/7205900/anti-vaccination-movement-history/",
      "domain": "time.com",
      "type": "citation"
    },
    {
      "text": "The Anti Vaccine Movement",
      "url": "https://www.npr.org/2025/02/13/1231104444/the-anti-vaccine-movement",
      "domain": "npr.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/public-health/articles/10.3389/fpubh.2023.1177634/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Pmc1410842",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1410842/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Nejmp048180",
      "url": "https://www.nejm.org/doi/abs/10.1056/NEJMp048180",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "Nbk221112",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK221112/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6605722",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6605722/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Dengue Vaccine Fiasco Leads Criminal Charges Researcher Philippines",
      "url": "https://www.science.org/content/article/dengue-vaccine-fiasco-leads-criminal-charges-researcher-philippines",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "How The Worlds First Dengue Vaccination Drive Ended In Disaster",
      "url": "https://www.scientificamerican.com/article/how-the-worlds-first-dengue-vaccination-drive-ended-in-disaster/",
      "domain": "scientificamerican.com",
      "type": "citation"
    },
    {
      "text": "11",
      "url": "https://supreme.justia.com/cases/federal/us/197/11/",
      "domain": "supreme.justia.com",
      "type": "citation"
    },
    {
      "text": "197us11",
      "url": "https://www.oyez.org/cases/1900-1940/197us11",
      "domain": "oyez.org",
      "type": "citation"
    },
    {
      "text": "The History Of Vaccine Hesitancy From Smallpox To Covid 19",
      "url": "https://news.berkeley.edu/2025/09/26/the-history-of-vaccine-hesitancy-from-smallpox-to-covid-19/",
      "domain": "news.berkeley.edu",
      "type": "citation"
    },
    {
      "text": "Timeline Of Vaccination Mandates",
      "url": "https://historyofvaccines.org/blog/timeline-of-vaccination-mandates/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Protecting The Populace The History Of Vaccination Regulation In The United States",
      "url": "https://nealmuseum.wvu.edu/learn/2025/05/16/protecting-the-populace-the-history-of-vaccination-regulation-in-the-united-states",
      "domain": "nealmuseum.wvu.edu",
      "type": "citation"
    },
    {
      "text": "Pmc9376337",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9376337/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Legal Challenges Complicate Vaccine Mandate.aspx",
      "url": "https://www.acenet.edu/News-Room/Pages/Legal-Challenges-Complicate-Vaccine-Mandate.aspx",
      "domain": "acenet.edu",
      "type": "citation"
    },
    {
      "text": "2021 12 01 Blog Updates Legal Challenges Cms Vaccine Mandate Rule",
      "url": "https://www.aha.org/news/blog/2021-12-01-blog-updates-legal-challenges-cms-vaccine-mandate-rule",
      "domain": "aha.org",
      "type": "citation"
    },
    {
      "text": "2822221",
      "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2822221",
      "domain": "jamanetwork.com",
      "type": "citation"
    },
    {
      "text": "Jme 2024 110236",
      "url": "https://jme.bmj.com/content/early/2024/10/28/jme-2024-110236",
      "domain": "jme.bmj.com",
      "type": "citation"
    },
    {
      "text": "The Nuremberg Code Does Not Apply To Licensed Approved And Authorized Vaccinations Only To The Research That Led To That Licensure Approval And Authorization",
      "url": "https://historyofvaccines.org/blog/the-nuremberg-code-does-not-apply-to-licensed-approved-and-authorized-vaccinations-only-to-the-research-that-led-to-that-licensure-approval-and-authorization/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Pmc9136690",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9136690/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8633920",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8633920/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "W33072.pdf",
      "url": "https://www.nber.org/system/files/working_papers/w33072/w33072.pdf",
      "domain": "nber.org",
      "type": "citation"
    },
    {
      "text": "9",
      "url": "https://scholarship.law.slu.edu/jhlp/vol17/iss1/9/",
      "domain": "scholarship.law.slu.edu",
      "type": "citation"
    },
    {
      "text": "2020 01",
      "url": "https://journalofethics.ama-assn.org/article/when-are-vaccine-mandates-appropriate/2020-01",
      "domain": "journalofethics.ama-assn.org",
      "type": "citation"
    },
    {
      "text": "Circulating Vaccine Derived Poliovirus Count",
      "url": "https://polioeradication.org/circulating-vaccine-derived-poliovirus-count/",
      "domain": "polioeradication.org",
      "type": "citation"
    },
    {
      "text": "Nejmoa2116597",
      "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2116597",
      "domain": "nejm.org",
      "type": "citation"
    },
    {
      "text": "Article",
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300198",
      "domain": "journals.plos.org",
      "type": "citation"
    },
    {
      "text": "Bmj 2022 072141",
      "url": "https://www.bmj.com/content/379/bmj-2022-072141",
      "domain": "bmj.com",
      "type": "citation"
    },
    {
      "text": "Aspe Vaccine Costs Brief.pdf",
      "url": "https://aspe.hhs.gov/sites/default/files/documents/dddeb3748f486324a493a8a6d27f4338/aspe-vaccine-costs-brief.pdf",
      "domain": "aspe.hhs.gov",
      "type": "citation"
    },
    {
      "text": "Nbk611605",
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK611605/",
      "domain": "ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Vaccine Finance Epidemics And Prevention Bloom",
      "url": "https://www.imf.org/en/Publications/fandd/issues/2020/09/vaccine-finance-epidemics-and-prevention-bloom",
      "domain": "imf.org",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X%2818%2930346-2/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "S0264410x18315755",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0264410X18315755",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Moderna Vaccine Price Hike Would Be 4000 Mark Up Above Cost",
      "url": "https://peoplesmedicines.org/resources/media-releases/moderna-vaccine-price-hike-would-be-4000-mark-up-above-cost/",
      "domain": "peoplesmedicines.org",
      "type": "citation"
    },
    {
      "text": "Covid19 Techbrief Process Cost Modelling Eng.pdf",
      "url": "https://msfaccess.org/sites/default/files/2021-09/COVID19_TechBrief_Process_cost_modelling_ENG.pdf",
      "domain": "msfaccess.org",
      "type": "citation"
    },
    {
      "text": "Pmc5518734",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC5518734/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc8238647",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8238647/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S12916 023 02944 1",
      "url": "https://bmcmedicine.biomedcentral.com/articles/10.1186/s12916-023-02944-1",
      "domain": "bmcmedicine.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "C19 Vaccine Delivery Costing",
      "url": "https://immunizationeconomics.org/c19-vaccine-delivery-costing/",
      "domain": "immunizationeconomics.org",
      "type": "citation"
    },
    {
      "text": "Costs Of Covid 19 Vaccine Delivery In 92amc 08.02.21.pdf",
      "url": "https://www.who.int/docs/default-source/coronaviruse/act-accelerator/covax/costs-of-covid-19-vaccine-delivery-in-92amc_08.02.21.pdf",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "5838028",
      "url": "https://academic.oup.com/jlb/article/7/1/lsaa026/5838028",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "When Markets Fail Patents And Infectious Disease Products",
      "url": "https://www.fdli.org/2018/09/when-markets-fail-patents-and-infectious-disease-products/",
      "domain": "fdli.org",
      "type": "citation"
    },
    {
      "text": "Jwip.12258",
      "url": "https://onlinelibrary.wiley.com/doi/10.1111/jwip.12258",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "Global Vaccine Market Dealing With Oligopolies Who Says 104397",
      "url": "https://www.devex.com/news/global-vaccine-market-dealing-with-oligopolies-who-says-104397",
      "domain": "devex.com",
      "type": "citation"
    },
    {
      "text": "Lilinda Dje.pdf",
      "url": "https://sites.duke.edu/djepapers/files/2016/10/lilinda-dje.pdf",
      "domain": "sites.duke.edu",
      "type": "citation"
    },
    {
      "text": "Msom.1080.0242",
      "url": "https://pubsonline.informs.org/doi/10.1287/msom.1080.0242",
      "domain": "pubsonline.informs.org",
      "type": "citation"
    },
    {
      "text": "Pmc9115153",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9115153/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Moderna Covid Vaccine Technology Struck Ptab",
      "url": "https://ipwatchdog.com/2025/03/06/moderna-covid-vaccine-technology-struck-ptab/",
      "domain": "ipwatchdog.com",
      "type": "citation"
    },
    {
      "text": "Uk Court Of Appeal Upholds Moderna Mrna Patent Against Pfizer Biontech",
      "url": "https://www.bigmoleculewatch.com/2025/08/14/uk-court-of-appeal-upholds-moderna-mrna-patent-against-pfizer-biontech/",
      "domain": "bigmoleculewatch.com",
      "type": "citation"
    },
    {
      "text": "S41587 022 01485 X",
      "url": "https://www.nature.com/articles/s41587-022-01485-x",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Viewcontent.cgi",
      "url": "https://scholarship.law.slu.edu/cgi/viewcontent.cgi?article=1645\\u0026context=faculty",
      "domain": "scholarship.law.slu.edu",
      "type": "citation"
    },
    {
      "text": "Impacts Vaccine Intellectual Property Rights Waiver Global Supply",
      "url": "https://cepr.org/voxeu/columns/impacts-vaccine-intellectual-property-rights-waiver-global-supply",
      "domain": "cepr.org",
      "type": "citation"
    },
    {
      "text": "Immunization Coverage",
      "url": "https://www.who.int/news-room/fact-sheets/detail/immunization-coverage",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Global Vaccination Rate Holds Steady At 85 But Still Off Course From Sdg Target",
      "url": "https://healthpolicy-watch.news/global-vaccination-rate-holds-steady-at-85-but-still-off-course-from-sdg-target/",
      "domain": "healthpolicy-watch.news",
      "type": "citation"
    },
    {
      "text": "Wuenic 2024",
      "url": "https://measlesrubellapartnership.org/wuenic-2024/",
      "domain": "measlesrubellapartnership.org",
      "type": "citation"
    },
    {
      "text": "Progress Report",
      "url": "https://www.gavi.org/progress-report",
      "domain": "gavi.org",
      "type": "citation"
    },
    {
      "text": "E2200536",
      "url": "https://www.ghspjournal.org/content/11/4/e2200536",
      "domain": "ghspjournal.org",
      "type": "citation"
    },
    {
      "text": "S12939 022 01678 5",
      "url": "https://equityhealthj.biomedcentral.com/articles/10.1186/s12939-022-01678-5",
      "domain": "equityhealthj.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc10551961",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10551961/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S12992 022 00801 Z",
      "url": "https://globalizationandhealth.biomedcentral.com/articles/10.1186/s12992-022-00801-z",
      "domain": "globalizationandhealth.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Pmc9862832",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9862832/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Covax Ensuring Global Equitable Access Covid 19 Vaccines",
      "url": "https://www.unicef.org/supply/covax-ensuring-global-equitable-access-covid-19-vaccines",
      "domain": "unicef.org",
      "type": "citation"
    },
    {
      "text": "Full",
      "url": "https://www.frontiersin.org/journals/public-health/articles/10.3389/fpubh.2023.1087662/full",
      "domain": "frontiersin.org",
      "type": "citation"
    },
    {
      "text": "Trips Waivers And Pharmaceutical Innovation",
      "url": "https://www.csis.org/blogs/perspectives-innovation/trips-waivers-and-pharmaceutical-innovation",
      "domain": "csis.org",
      "type": "citation"
    },
    {
      "text": "Pmc9790937",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9790937/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Strengthening Incentives Vaccine Development",
      "url": "https://www.nber.org/reporter/2020number4/strengthening-incentives-vaccine-development",
      "domain": "nber.org",
      "type": "citation"
    },
    {
      "text": "How Patents Can Improve Access To Vaccines",
      "url": "https://www.weforum.org/stories/2022/04/how-patents-can-improve-access-to-vaccines/",
      "domain": "weforum.org",
      "type": "citation"
    },
    {
      "text": "Pmc1448560",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC1448560/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7124274",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7124274/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Veterinary",
      "url": "https://americanhistory.si.edu/collections/object-groups/antibody-initiative/veterinary",
      "domain": "americanhistory.si.edu",
      "type": "citation"
    },
    {
      "text": "Pmc7149312",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7149312/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc4043076",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC4043076/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Vaccination For Animal Health",
      "url": "https://www.noah.co.uk/topics/farm-animals/vaccination-for-animal-health/",
      "domain": "noah.co.uk",
      "type": "citation"
    },
    {
      "text": "Pmc7431490",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7431490/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Administration Of Vaccines In Animals",
      "url": "https://www.merckvetmanual.com/pharmacology/vaccines-and-immunotherapy/administration-of-vaccines-in-animals",
      "domain": "merckvetmanual.com",
      "type": "citation"
    },
    {
      "text": "Vaccinations",
      "url": "https://www.avma.org/resources-tools/pet-owners/petcare/vaccinations",
      "domain": "avma.org",
      "type": "citation"
    },
    {
      "text": "Vaccination Strategies Maximize Preventive Health And Minimize Adverse Effects Market Quality",
      "url": "https://www.vet.cornell.edu/animal-health-diagnostic-center/programs/nyschap/modules-documents/vaccination-strategies-maximize-preventive-health-and-minimize-adverse-effects-market-quality",
      "domain": "vet.cornell.edu",
      "type": "citation"
    },
    {
      "text": "S13567 018 0560 8",
      "url": "https://veterinaryresearch.biomedcentral.com/articles/10.1186/s13567-018-0560-8",
      "domain": "veterinaryresearch.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "23 04 2019 Increasing The Adoption Of Animal Vaccines To Address Livestock Losses And Boost Control Of Neglected Zoonotic Diseases",
      "url": "https://www.who.int/news/item/23-04-2019-increasing-the-adoption-of-animal-vaccines-to-address-livestock-losses-and-boost-control-of-neglected-zoonotic-diseases",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "9781119506287.ch1",
      "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/9781119506287.ch1",
      "domain": "onlinelibrary.wiley.com",
      "type": "citation"
    },
    {
      "text": "S0378113506001441",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0378113506001441",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Pmc7123657",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7123657/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Vaccine Hesitancy Gives Some Us Dog Cat Owners Cold Feet",
      "url": "https://www.avma.org/news/vaccine-hesitancy-gives-some-us-dog-cat-owners-cold-feet",
      "domain": "avma.org",
      "type": "citation"
    },
    {
      "text": "History",
      "url": "https://www.aphis.usda.gov/veterinary-biologics/about-cvb/history",
      "domain": "aphis.usda.gov",
      "type": "citation"
    },
    {
      "text": "S12951 021 00806 7",
      "url": "https://jnanobiotechnology.biomedcentral.com/articles/10.1186/s12951-021-00806-7",
      "domain": "jnanobiotechnology.biomedcentral.com",
      "type": "citation"
    },
    {
      "text": "Acs.molpharmaceut.0c00828",
      "url": "https://pubs.acs.org/doi/abs/10.1021/acs.molpharmaceut.0c00828",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "S41467 025 64181 9",
      "url": "https://www.nature.com/articles/s41467-025-64181-9",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc10177981",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10177981/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "36992407",
      "url": "https://pubmed.ncbi.nlm.nih.gov/36992407/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41541 022 00503 Y",
      "url": "https://www.nature.com/articles/s41541-022-00503-y",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Gene Therapy Innovation Unlocking The Promise Of Viral Vectors",
      "url": "https://www.mckinsey.com/industries/life-sciences/our-insights/gene-therapy-innovation-unlocking-the-promise-of-viral-vectors",
      "domain": "mckinsey.com",
      "type": "citation"
    },
    {
      "text": "S41392 024 02002 Z",
      "url": "https://www.nature.com/articles/s41392-024-02002-z",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "S0140673623024443",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0140673623024443",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "Acsptsci.3c00047",
      "url": "https://pubs.acs.org/doi/10.1021/acsptsci.3c00047",
      "domain": "pubs.acs.org",
      "type": "citation"
    },
    {
      "text": "Pmc10054865",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10054865/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc10384963",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC10384963/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "368476 The Future Of Mrna Vaccines Potential Beyond Covid 19",
      "url": "https://www.cureus.com/articles/368476-the-future-of-mrna-vaccines-potential-beyond-covid-19",
      "domain": "cureus.com",
      "type": "citation"
    },
    {
      "text": "S41392 023 01408 5",
      "url": "https://www.nature.com/articles/s41392-023-01408-5",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Pmc12115715",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12115715/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S1525 0016%2825%2900269 2",
      "url": "https://www.cell.com/molecular-therapy-family/molecular-therapy/fulltext/S1525-0016%2825%2900269-2",
      "domain": "cell.com",
      "type": "citation"
    },
    {
      "text": "Sciadv.adn7187",
      "url": "https://www.science.org/doi/10.1126/sciadv.adn7187",
      "domain": "science.org",
      "type": "citation"
    },
    {
      "text": "Change.html",
      "url": "https://www.cdc.gov/flu/php/viruses/change.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Viruses And Evolution",
      "url": "https://historyofvaccines.org/vaccines-101/what-do-vaccines-do/viruses-and-evolution/",
      "domain": "historyofvaccines.org",
      "type": "citation"
    },
    {
      "text": "Vaccines",
      "url": "https://www.who.int/teams/global-influenza-programme/vaccines",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Influenza Vaccine Composition 2025 2026 Us Influenza Season",
      "url": "https://www.fda.gov/vaccines-blood-biologics/influenza-vaccine-composition-2025-2026-us-influenza-season",
      "domain": "fda.gov",
      "type": "citation"
    },
    {
      "text": "Keyfacts.html",
      "url": "https://www.cdc.gov/flu/vaccines/keyfacts.html",
      "domain": "cdc.gov",
      "type": "citation"
    },
    {
      "text": "Pmc6930049",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC6930049/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "S41598 020 75691 5",
      "url": "https://www.nature.com/articles/s41598-020-75691-5",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Download",
      "url": "https://dash.harvard.edu/bitstreams/7312037d-b6ed-6bd4-e053-0100007fdf3b/download",
      "domain": "dash.harvard.edu",
      "type": "citation"
    },
    {
      "text": "Pcv13 Vaccination Highly Effective But Complicated By Serotype Replacement",
      "url": "https://www.healio.com/news/infectious-disease/20190307/pcv13-vaccination-highly-effective-but-complicated-by-serotype-replacement",
      "domain": "healio.com",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/lanwpc/article/PIIS2666-6065%2824%2900076-2/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "S0264410x2500578x",
      "url": "https://www.sciencedirect.com/science/article/pii/S0264410X2500578X",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "1345",
      "url": "https://www.mdpi.com/2076-393X/12/12/1345",
      "domain": "mdpi.com",
      "type": "citation"
    },
    {
      "text": "37196356",
      "url": "https://pubmed.ncbi.nlm.nih.gov/37196356/",
      "domain": "pubmed.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "7712376",
      "url": "https://academic.oup.com/evolut/article/78/10/1722/7712376",
      "domain": "academic.oup.com",
      "type": "citation"
    },
    {
      "text": "10 10 2024 Better Use Of Vaccines Could Reduce Antibiotic Use By 2.5 Billion Doses Annually Says Who",
      "url": "https://www.who.int/news/item/10-10-2024-better-use-of-vaccines-could-reduce-antibiotic-use-by-2.5-billion-doses-annually--says-who",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Fulltext",
      "url": "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247%2824%2900308-2/fulltext",
      "domain": "thelancet.com",
      "type": "citation"
    },
    {
      "text": "S41579 020 00506 3",
      "url": "https://www.nature.com/articles/s41579-020-00506-3",
      "domain": "nature.com",
      "type": "citation"
    },
    {
      "text": "Anti Microbial Resistance",
      "url": "https://www.who.int/teams/immunization-vaccines-and-biologicals/product-and-delivery-research/anti-microbial-resistance",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Poll Trust In Public Health Agencies And Vaccines Falls Amid Republican Skepticism",
      "url": "https://www.kff.org/health-information-trust/poll-trust-in-public-health-agencies-and-vaccines-falls-amid-republican-skepticism/",
      "domain": "kff.org",
      "type": "citation"
    },
    {
      "text": "S2590136223000402",
      "url": "https://www.sciencedirect.com/science/article/pii/S2590136223000402",
      "domain": "sciencedirect.com",
      "type": "citation"
    },
    {
      "text": "24 04 2025 Increases In Vaccine Preventable Disease Outbreaks Threaten Years Of Progress Warn Who Unicef Gavi",
      "url": "https://www.who.int/news/item/24-04-2025-increases-in-vaccine-preventable-disease-outbreaks-threaten-years-of-progress--warn-who--unicef--gavi",
      "domain": "who.int",
      "type": "citation"
    },
    {
      "text": "Pmc8888038",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC8888038/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc7798520",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7798520/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Trends In Vaccination Law And Judicial Challenges",
      "url": "https://www.networkforphl.org/resources/trends-in-vaccination-law-and-judicial-challenges/",
      "domain": "networkforphl.org",
      "type": "citation"
    },
    {
      "text": "Pmc11532736",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC11532736/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Pmc12344792",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12344792/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    },
    {
      "text": "Hhs Vaccines Report.pdf",
      "url": "https://www.hhs.gov/sites/default/files/HHS-Vaccines-Report.pdf",
      "domain": "hhs.gov",
      "type": "citation"
    },
    {
      "text": "Pmc9557136",
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9557136/",
      "domain": "pmc.ncbi.nlm.nih.gov",
      "type": "citation"
    }
  ],
  "internal_links": [
    {
      "text": "immune system",
      "page": "Immune_system"
    },
    {
      "text": "disease",
      "page": "Disease"
    },
    {
      "text": "pathogen",
      "page": "Pathogen"
    },
    {
      "text": "Edward Jenner",
      "page": "Edward_Jenner"
    },
    {
      "text": "cowpox",
      "page": "Cowpox"
    },
    {
      "text": "smallpox",
      "page": "Smallpox"
    },
    {
      "text": "vaccination",
      "page": "Vaccination"
    },
    {
      "text": "polio",
      "page": "Polio"
    },
    {
      "text": "measles",
      "page": "Measles"
    },
    {
      "text": "diphtheria",
      "page": "Diphtheria"
    },
    {
      "text": "tetanus",
      "page": "Tetanus"
    },
    {
      "text": "herd immunity",
      "page": "Herd_immunity"
    },
    {
      "text": "anaphylaxis",
      "page": "Anaphylaxis"
    },
    {
      "text": "MMR vaccine",
      "page": "MMR_vaccine"
    },
    {
      "text": "vaccine hesitancy",
      "page": "Vaccine_hesitancy"
    },
    {
      "text": "empirical evidence",
      "page": "Empirical_evidence"
    },
    {
      "text": "public health",
      "page": "Public_health"
    },
    {
      "text": "adaptive immune system",
      "page": "Adaptive_immune_system"
    },
    {
      "text": "antigen",
      "page": "Antigen"
    },
    {
      "text": "virus",
      "page": "Virus"
    },
    {
      "text": "toxin",
      "page": "Toxin"
    },
    {
      "text": "immunization",
      "page": "Immunization"
    },
    {
      "text": "variolation",
      "page": "Variolation"
    },
    {
      "text": "infection",
      "page": "Infection"
    },
    {
      "text": "China",
      "page": "China"
    },
    {
      "text": "10th century",
      "page": "10th_century"
    },
    {
      "text": "India",
      "page": "India"
    },
    {
      "text": "Africa",
      "page": "Africa"
    },
    {
      "text": "mortality rate",
      "page": "Mortality_rate"
    },
    {
      "text": "Europe",
      "page": "Europe"
    },
    {
      "text": "18th century",
      "page": "18th_century"
    },
    {
      "text": "Lady Mary Wortley Montagu",
      "page": "Lady_Mary_Wortley_Montagu"
    },
    {
      "text": "bacteria",
      "page": "Bacteria"
    },
    {
      "text": "innate immune system",
      "page": "Innate_immune_system"
    },
    {
      "text": "phagocytosis",
      "page": "Phagocytosis"
    },
    {
      "text": "antigen processing",
      "page": "Antigen_processing"
    },
    {
      "text": "major histocompatibility complex",
      "page": "Major_histocompatibility_complex"
    },
    {
      "text": "CD8",
      "page": "CD8"
    },
    {
      "text": "CD4",
      "page": "CD4"
    },
    {
      "text": "cytokine",
      "page": "Cytokine"
    },
    {
      "text": "humoral immunity",
      "page": "Humoral_immunity"
    },
    {
      "text": "somatic hypermutation",
      "page": "Somatic_hypermutation"
    },
    {
      "text": "effector cell",
      "page": "Effector_cell"
    },
    {
      "text": "antigen presentation",
      "page": "Antigen_presentation"
    },
    {
      "text": "inflammasome",
      "page": "Inflammasome"
    },
    {
      "text": "NF-κB",
      "page": "NF-κB"
    },
    {
      "text": "protection",
      "page": "Protection"
    },
    {
      "text": "antibody",
      "page": "Antibody"
    },
    {
      "text": "influenza",
      "page": "Influenza"
    },
    {
      "text": "efficacy",
      "page": "Efficacy"
    },
    {
      "text": "production",
      "page": "Production"
    },
    {
      "text": "evidence",
      "page": "Evidence"
    },
    {
      "text": "immune response",
      "page": "Immune_response"
    },
    {
      "text": "attenuation",
      "page": "Attenuation"
    },
    {
      "text": "serial passage",
      "page": "Serial_passage"
    },
    {
      "text": "host",
      "page": "Host"
    },
    {
      "text": "virulence",
      "page": "Virulence"
    },
    {
      "text": "immunogenicity",
      "page": "Immunogenicity"
    },
    {
      "text": "genetic engineering",
      "page": "Genetic_engineering"
    },
    {
      "text": "viral",
      "page": "Viral"
    },
    {
      "text": "smallpox vaccine",
      "page": "Smallpox_vaccine"
    },
    {
      "text": "1950s",
      "page": "1950s"
    },
    {
      "text": "varicella (chickenpox) vaccine",
      "page": "Varicella_vaccine"
    },
    {
      "text": "rotavirus vaccine",
      "page": "Rotavirus_vaccine"
    },
    {
      "text": "yellow fever vaccine",
      "page": "Yellow_fever_vaccine"
    },
    {
      "text": "mumps",
      "page": "Mumps"
    },
    {
      "text": "formaldehyde",
      "page": "Formaldehyde"
    },
    {
      "text": "radiation",
      "page": "Radiation"
    },
    {
      "text": "cell",
      "page": "Cell"
    },
    {
      "text": "media",
      "page": "Media"
    },
    {
      "text": "poliovirus",
      "page": "Poliovirus"
    },
    {
      "text": "hepatitis A",
      "page": "Hepatitis_A"
    },
    {
      "text": "Jonas Salk",
      "page": "Jonas_Salk"
    },
    {
      "text": "rabies vaccine",
      "page": "Rabies_vaccine"
    },
    {
      "text": "post-exposure prophylaxis",
      "page": "Post-exposure_prophylaxis"
    },
    {
      "text": "hepatitis A vaccine",
      "page": "Hepatitis_A_vaccine"
    },
    {
      "text": "Japanese encephalitis",
      "page": "Japanese_encephalitis"
    },
    {
      "text": "tick-borne encephalitis",
      "page": "Tick-borne_encephalitis"
    },
    {
      "text": "adolescence",
      "page": "Adolescence"
    },
    {
      "text": "effectiveness",
      "page": "Effectiveness"
    },
    {
      "text": "influenza-like illness",
      "page": "Influenza-like_illness"
    },
    {
      "text": "polysaccharides",
      "page": "Polysaccharide"
    },
    {
      "text": "organism",
      "page": "Organism"
    },
    {
      "text": "recombinant DNA",
      "page": "Recombinant_DNA"
    },
    {
      "text": "yeast",
      "page": "Yeast"
    },
    {
      "text": "insect",
      "page": "Insect"
    },
    {
      "text": "mechanism",
      "page": "Mechanism"
    },
    {
      "text": "processing",
      "page": "Processing"
    },
    {
      "text": "hepatitis B vaccine",
      "page": "Hepatitis_B_vaccine"
    },
    {
      "text": "HPV) vaccine",
      "page": "HPV_vaccine"
    },
    {
      "text": "capsid",
      "page": "Capsid"
    },
    {
      "text": "pertussis toxin",
      "page": "Pertussis_toxin"
    },
    {
      "text": "thermostability",
      "page": "Thermostability"
    },
    {
      "text": "military",
      "page": "Military"
    },
    {
      "text": "toxoid",
      "page": "Toxoid"
    },
    {
      "text": "Haemophilus influenzae",
      "page": "Haemophilus_influenzae"
    },
    {
      "text": "Hepatitis B",
      "page": "Hepatitis_B"
    },
    {
      "text": "carrier",
      "page": "Carrier"
    },
    {
      "text": "Johnson \\u0026 Johnson",
      "page": "Johnson_\\u0026_Johnson"
    },
    {
      "text": "SARS-CoV-2",
      "page": "SARS-CoV-2"
    },
    {
      "text": "nucleic acid",
      "page": "Nucleic_acid"
    },
    {
      "text": "heterologous",
      "page": "Heterologous"
    },
    {
      "text": "COVID-19",
      "page": "COVID-19"
    },
    {
      "text": "mRNA",
      "page": "RNA"
    },
    {
      "text": "COVID-19 vaccine",
      "page": "COVID-19_vaccine"
    },
    {
      "text": "Japan",
      "page": "Japan"
    },
    {
      "text": "respiratory syncytial virus",
      "page": "Respiratory_syncytial_virus"
    },
    {
      "text": "RSV",
      "page": "RSV"
    },
    {
      "text": "human",
      "page": "Human"
    },
    {
      "text": "lipid",
      "page": "Lipid"
    },
    {
      "text": "nanoparticle",
      "page": "Nanoparticle"
    },
    {
      "text": "translation",
      "page": "Translation"
    },
    {
      "text": "manufacturing",
      "page": "Manufacturing"
    },
    {
      "text": "epitope",
      "page": "Epitope"
    },
    {
      "text": "hemagglutinin",
      "page": "Hemagglutinin"
    },
    {
      "text": "immunotherapy",
      "page": "Immunotherapy"
    },
    {
      "text": "electroporation",
      "page": "Electroporation"
    },
    {
      "text": "breast",
      "page": "Breast"
    },
    {
      "text": "induction",
      "page": "Induction"
    },
    {
      "text": "toxicity",
      "page": "Toxicity"
    },
    {
      "text": "HIV",
      "page": "HIV"
    },
    {
      "text": "transfection",
      "page": "Transfection"
    },
    {
      "text": "relative risk reduction",
      "page": "Relative_risk_reduction"
    },
    {
      "text": "risk difference",
      "page": "Risk_difference"
    },
    {
      "text": "RRR",
      "page": "RRR"
    },
    {
      "text": "risk",
      "page": "Risk"
    },
    {
      "text": "population",
      "page": "Population"
    },
    {
      "text": "cohort",
      "page": "Cohort"
    },
    {
      "text": "inverse probability weighting",
      "page": "Inverse_probability_weighting"
    },
    {
      "text": "relative risk",
      "page": "Relative_risk"
    },
    {
      "text": "Omicron",
      "page": "Omicron"
    },
    {
      "text": "selection bias",
      "page": "Selection_bias"
    },
    {
      "text": "transmission",
      "page": "Transmission"
    },
    {
      "text": "R",
      "page": "R"
    },
    {
      "text": "disease burden",
      "page": "Disease_burden"
    },
    {
      "text": "rubella",
      "page": "Rubella"
    },
    {
      "text": "breakthrough infection",
      "page": "Breakthrough_infection"
    },
    {
      "text": "measles vaccine",
      "page": "Measles_vaccine"
    },
    {
      "text": "proteome",
      "page": "Proteome"
    },
    {
      "text": "natural",
      "page": "The_Natural"
    },
    {
      "text": "vaccines",
      "page": "The_Vaccines"
    },
    {
      "text": "hybrid",
      "page": "Hybrid"
    },
    {
      "text": "data",
      "page": "Data"
    },
    {
      "text": "evolution",
      "page": "Evolution"
    },
    {
      "text": "immunosenescence",
      "page": "Immunosenescence"
    },
    {
      "text": "obesity",
      "page": "Obesity"
    },
    {
      "text": "diabetes",
      "page": "Diabetes"
    },
    {
      "text": "immunosuppression",
      "page": "Immunosuppression"
    },
    {
      "text": "seroconversion",
      "page": "Seroconversion"
    },
    {
      "text": "memory",
      "page": "Memory"
    },
    {
      "text": "original antigenic sin",
      "page": "Original_antigenic_sin"
    },
    {
      "text": "variants",
      "page": "Mahindra_KUV100"
    },
    {
      "text": "erythema",
      "page": "Erythema"
    },
    {
      "text": "age",
      "page": "Age"
    },
    {
      "text": "clinical trial",
      "page": "Clinical_trial"
    },
    {
      "text": "U.S. Food and Drug Administration (FDA)",
      "page": "U.S._Food_and_Drug_Administration"
    },
    {
      "text": "Vaccine Adverse Event Reporting System (VAERS)",
      "page": "Vaccine_Adverse_Event_Reporting_System"
    },
    {
      "text": "Yellow Card scheme",
      "page": "Yellow_Card_scheme"
    },
    {
      "text": "World Health Organization (WHO)",
      "page": "World_Health_Organization"
    },
    {
      "text": "Pfizer-BioNTech",
      "page": "Pfizer-BioNTech"
    },
    {
      "text": "Moderna",
      "page": "Moderna"
    },
    {
      "text": "Guillain-Barré syndrome",
      "page": "Guillain-Barré_syndrome"
    },
    {
      "text": "AstraZeneca",
      "page": "AstraZeneca"
    },
    {
      "text": "Janssen",
      "page": "Janssen"
    },
    {
      "text": "mRNA-based formulations",
      "page": "mRNA-based_formulations"
    },
    {
      "text": "COVID-19 pandemic",
      "page": "COVID-19_pandemic"
    },
    {
      "text": "multisystem inflammatory conditions",
      "page": "multisystem_inflammatory_conditions"
    },
    {
      "text": "causal inference",
      "page": "Causal_inference"
    },
    {
      "text": "exploratory research",
      "page": "Exploratory_research"
    },
    {
      "text": "Scientists",
      "page": "The_Scientists"
    },
    {
      "text": "discovery",
      "page": "Discovery"
    },
    {
      "text": "in vitro",
      "page": "In_vitro"
    },
    {
      "text": "primates",
      "page": "List_of_primates"
    },
    {
      "text": "safety",
      "page": "Safety"
    },
    {
      "text": "challenge",
      "page": "Challenge"
    },
    {
      "text": "Investigational New Drug",
      "page": "Investigational_New_Drug"
    },
    {
      "text": "placebo",
      "page": "Placebo"
    },
    {
      "text": "pharmacokinetics",
      "page": "Pharmacokinetics"
    },
    {
      "text": "duration",
      "page": "Duration"
    },
    {
      "text": "European Medicines Agency",
      "page": "European_Medicines_Agency"
    },
    {
      "text": "EMA",
      "page": "EMA"
    },
    {
      "text": "plasmids",
      "page": "Plasmid"
    },
    {
      "text": "2021",
      "page": "2021"
    },
    {
      "text": "pre-approval",
      "page": "Pre-approval"
    },
    {
      "text": "process validation",
      "page": "Process_validation"
    },
    {
      "text": "stress testing",
      "page": "Stress_testing"
    },
    {
      "text": "technology transfer",
      "page": "Technology_transfer"
    },
    {
      "text": "avian influenza",
      "page": "Avian_influenza"
    },
    {
      "text": "contamination",
      "page": "Contamination"
    },
    {
      "text": "environmental monitoring",
      "page": "Environmental_monitoring"
    },
    {
      "text": "ELISA",
      "page": "ELISA"
    },
    {
      "text": "informed consent",
      "page": "Informed_consent"
    },
    {
      "text": "medical research",
      "page": "Medical_research"
    },
    {
      "text": "intellectual property",
      "page": "Intellectual_property"
    },
    {
      "text": "global health",
      "page": "Global_health"
    },
    {
      "text": "Nuremberg",
      "page": "Nuremberg"
    },
    {
      "text": "epidemic",
      "page": "Epidemic"
    },
    {
      "text": "equipoise",
      "page": "Equipoise"
    },
    {
      "text": "Animal testing",
      "page": "Animal_testing"
    },
    {
      "text": "in silico",
      "page": "In_silico"
    },
    {
      "text": "Food and Drug Administration",
      "page": "Food_and_Drug_Administration"
    },
    {
      "text": "priority review",
      "page": "Priority_review"
    },
    {
      "text": "Emergency Use Authorization",
      "page": "Emergency_Use_Authorization"
    },
    {
      "text": "European Union",
      "page": "European_Union"
    },
    {
      "text": "real-time",
      "page": "Real-time"
    },
    {
      "text": "median",
      "page": "Median"
    },
    {
      "text": "risk management",
      "page": "Risk_management"
    },
    {
      "text": "development",
      "page": "Development"
    },
    {
      "text": "expert",
      "page": "Expert"
    },
    {
      "text": "Therapeutic Goods Administration",
      "page": "Therapeutic_Goods_Administration"
    },
    {
      "text": "TGA",
      "page": "TGA"
    },
    {
      "text": "procurement",
      "page": "Procurement"
    },
    {
      "text": "stringent regulatory authorities",
      "page": "List_of_stringent_regulatory_authorities"
    },
    {
      "text": "public",
      "page": "Public"
    },
    {
      "text": "pharmacovigilance",
      "page": "Pharmacovigilance"
    },
    {
      "text": "international",
      "page": "International"
    },
    {
      "text": "bowel obstruction",
      "page": "Bowel_obstruction"
    },
    {
      "text": "myocarditis",
      "page": "Myocarditis"
    },
    {
      "text": "causality",
      "page": "Causality"
    },
    {
      "text": "investigation",
      "page": "Investigation"
    },
    {
      "text": "confounding",
      "page": "Confounding"
    },
    {
      "text": "Rotavirus",
      "page": "Rotavirus"
    },
    {
      "text": "school",
      "page": "School"
    },
    {
      "text": "pregnancy",
      "page": "Pregnancy"
    },
    {
      "text": "shingles",
      "page": "Shingles"
    },
    {
      "text": "decision-making",
      "page": "Decision-making"
    },
    {
      "text": "passive immunity",
      "page": "Passive_immunity"
    },
    {
      "text": "surveillance",
      "page": "Surveillance"
    },
    {
      "text": "Asia",
      "page": "Asia"
    },
    {
      "text": "the skin",
      "page": "The_Skin"
    },
    {
      "text": "insufflation",
      "page": "Insufflation"
    },
    {
      "text": "scarification",
      "page": "Scarification"
    },
    {
      "text": "Middle East",
      "page": "Middle_East"
    },
    {
      "text": "Ottoman Empire",
      "page": "Ottoman_Empire"
    },
    {
      "text": "Constantinople",
      "page": "Constantinople"
    },
    {
      "text": "England",
      "page": "England"
    },
    {
      "text": "Cotton Mather",
      "page": "Cotton_Mather"
    },
    {
      "text": "Onesimus",
      "page": "Onesimus"
    },
    {
      "text": "Boston",
      "page": "Boston"
    },
    {
      "text": "Britain",
      "page": "Britain"
    },
    {
      "text": "1801",
      "page": "1801"
    },
    {
      "text": "tissue culture",
      "page": "Tissue_culture"
    },
    {
      "text": "Max Theiler",
      "page": "Max_Theiler"
    },
    {
      "text": "World War II",
      "page": "World_War_II"
    },
    {
      "text": "influenza vaccine",
      "page": "Influenza_vaccine"
    },
    {
      "text": "rubella vaccine",
      "page": "Rubella_vaccine"
    },
    {
      "text": "liver cancer",
      "page": "Liver_cancer"
    },
    {
      "text": "cirrhosis",
      "page": "Cirrhosis"
    },
    {
      "text": "vaccine-preventable disease",
      "page": "Vaccine-preventable_disease"
    },
    {
      "text": "21st century",
      "page": "21st_century"
    },
    {
      "text": "2010s",
      "page": "2010s"
    },
    {
      "text": "diarrhea",
      "page": "Diarrhea"
    },
    {
      "text": "strain",
      "page": "Strain"
    },
    {
      "text": "thrombosis with thrombocytopenia syndrome",
      "page": "Thrombocytopenia"
    },
    {
      "text": "adverse event",
      "page": "Adverse_event"
    },
    {
      "text": "polio vaccine",
      "page": "Polio_vaccine"
    },
    {
      "text": "Cutter Laboratories",
      "page": "Cutter_Laboratories"
    },
    {
      "text": "DPT) vaccine",
      "page": "DPT_vaccine"
    },
    {
      "text": "encephalopathy",
      "page": "Encephalopathy"
    },
    {
      "text": "skepticism",
      "page": "Vaccine_skepticism"
    },
    {
      "text": "hygiene",
      "page": "Hygiene"
    },
    {
      "text": "pharmaceutical industry",
      "page": "Pharmaceutical_industry"
    },
    {
      "text": "civil liberties",
      "page": "Civil_liberties"
    },
    {
      "text": "autism",
      "page": "Autism_spectrum"
    },
    {
      "text": "regression",
      "page": "Regression"
    },
    {
      "text": "paralysis",
      "page": "Paralysis"
    },
    {
      "text": "Cutter",
      "page": "Cutter"
    },
    {
      "text": "quality control",
      "page": "Quality_control"
    },
    {
      "text": "pandemic",
      "page": "Pandemic"
    },
    {
      "text": "Philippines",
      "page": "Philippines"
    },
    {
      "text": "Sanofi",
      "page": "Sanofi"
    },
    {
      "text": "antibody-dependent enhancement",
      "page": "Antibody-dependent_enhancement"
    },
    {
      "text": "immunology",
      "page": "Immunology"
    },
    {
      "text": "Supreme Court",
      "page": "Supreme_court"
    },
    {
      "text": "Cambridge, Massachusetts",
      "page": "Cambridge,_Massachusetts"
    },
    {
      "text": "contagious disease",
      "page": "Contagious_disease"
    },
    {
      "text": "American Revolutionary War",
      "page": "American_Revolutionary_War"
    },
    {
      "text": "George Washington",
      "page": "George_Washington"
    },
    {
      "text": "inoculation",
      "page": "Inoculation"
    },
    {
      "text": "Continental Army",
      "page": "Continental_Army"
    },
    {
      "text": "history",
      "page": "History"
    },
    {
      "text": "19th century",
      "page": "19th_century"
    },
    {
      "text": "Massachusetts",
      "page": "Massachusetts"
    },
    {
      "text": "Centers for Medicare \\u0026 Medicaid Services (CMS)",
      "page": "Centers_for_Medicare_\\u0026_Medicaid_Services"
    },
    {
      "text": "Occupational Safety and Health Administration (OSHA)",
      "page": "Occupational_Safety_and_Health_Administration"
    },
    {
      "text": "Occupational Safety and Health Act",
      "page": "Occupational_safety_and_health"
    },
    {
      "text": "hazard",
      "page": "Hazard"
    },
    {
      "text": "patient safety",
      "page": "Patient_safety"
    },
    {
      "text": "percentage point",
      "page": "Percentage_point"
    },
    {
      "text": "Nuremberg Code",
      "page": "Nuremberg_Code"
    },
    {
      "text": "policy analysis",
      "page": "Policy_analysis"
    },
    {
      "text": "substantive due process",
      "page": "Substantive_due_process"
    },
    {
      "text": "coercion",
      "page": "Coercion"
    },
    {
      "text": "individual",
      "page": "Individual"
    },
    {
      "text": "rights",
      "page": "Rights"
    },
    {
      "text": "self-ownership",
      "page": "Self-ownership"
    },
    {
      "text": "collective",
      "page": "Collective"
    },
    {
      "text": "resentment",
      "page": "Resentment"
    },
    {
      "text": "compliance",
      "page": "Compliance"
    },
    {
      "text": "Scotland",
      "page": "Scotland"
    },
    {
      "text": "trial",
      "page": "Trial"
    },
    {
      "text": "research and development",
      "page": "Research_and_development"
    },
    {
      "text": "regulatory compliance",
      "page": "Regulatory_compliance"
    },
    {
      "text": "private sector",
      "page": "Private_sector"
    },
    {
      "text": "quality assurance",
      "page": "Quality_assurance"
    },
    {
      "text": "economies of scale",
      "page": "Economies_of_scale"
    },
    {
      "text": "biosafety",
      "page": "Biosafety"
    },
    {
      "text": "automation",
      "page": "Automation"
    },
    {
      "text": "waste management",
      "page": "Waste_management"
    },
    {
      "text": "infrastructure",
      "page": "Infrastructure"
    },
    {
      "text": "outreach",
      "page": "Outreach"
    },
    {
      "text": "competition",
      "page": "Competition"
    },
    {
      "text": "barriers to entry",
      "page": "Barriers_to_entry"
    },
    {
      "text": "Operation Warp Speed",
      "page": "Operation_Warp_Speed"
    },
    {
      "text": "Pfizer",
      "page": "Pfizer"
    },
    {
      "text": "BioNTech",
      "page": "BioNTech"
    },
    {
      "text": "patents",
      "page": "Patent"
    },
    {
      "text": "UK",
      "page": "United_Kingdom"
    },
    {
      "text": "IP",
      "page": "IP"
    },
    {
      "text": "blockbuster",
      "page": "Blockbuster"
    },
    {
      "text": "GAVI Alliance",
      "page": "GAVI_Alliance"
    },
    {
      "text": "COVAX",
      "page": "COVAX"
    },
    {
      "text": "market",
      "page": "Market"
    },
    {
      "text": "equity",
      "page": "Equity"
    },
    {
      "text": "governance",
      "page": "Governance"
    },
    {
      "text": "aid",
      "page": "Aid"
    },
    {
      "text": "animals",
      "page": "Mole"
    },
    {
      "text": "welfare",
      "page": "Welfare"
    },
    {
      "text": "livestock",
      "page": "Livestock"
    },
    {
      "text": "Louis Pasteur",
      "page": "Louis_Pasteur"
    },
    {
      "text": "anthrax",
      "page": "Anthrax"
    },
    {
      "text": "Rabies",
      "page": "Rabies"
    },
    {
      "text": "foot-and-mouth disease",
      "page": "Foot-and-mouth_disease"
    },
    {
      "text": "bovine viral diarrhea",
      "page": "Bovine_viral_diarrhea"
    },
    {
      "text": "canine distemper",
      "page": "Canine_distemper"
    },
    {
      "text": "Lyme disease",
      "page": "Lyme_disease"
    },
    {
      "text": "agriculture",
      "page": "Agriculture"
    },
    {
      "text": "control",
      "page": "Control"
    },
    {
      "text": "adoption",
      "page": "Adoption"
    },
    {
      "text": "food security",
      "page": "Food_security"
    },
    {
      "text": "productivity",
      "page": "Productivity"
    },
    {
      "text": "risk assessment",
      "page": "Risk_assessment"
    },
    {
      "text": "morphology",
      "page": "Morphology"
    },
    {
      "text": "drug delivery",
      "page": "Drug_delivery"
    },
    {
      "text": "nm",
      "page": "Nm"
    },
    {
      "text": "diameter",
      "page": "Diameter"
    },
    {
      "text": "gene delivery",
      "page": "Gene_delivery"
    },
    {
      "text": "synthetic biology",
      "page": "Synthetic_biology"
    },
    {
      "text": "gene therapy",
      "page": "Gene_therapy"
    },
    {
      "text": "biotechnology",
      "page": "Biotechnology"
    },
    {
      "text": "Adeno-associated virus",
      "page": "Adeno-associated_virus"
    },
    {
      "text": "transient expression",
      "page": "Transient_expression"
    },
    {
      "text": "biomanufacturing",
      "page": "Biomanufacturing"
    },
    {
      "text": "bioreactor",
      "page": "Bioreactor"
    },
    {
      "text": "transduction",
      "page": "Transduction"
    },
    {
      "text": "in vivo",
      "page": "In_vivo"
    },
    {
      "text": "Nucleoside",
      "page": "Nucleoside"
    },
    {
      "text": "kb",
      "page": "KB"
    },
    {
      "text": "cystic fibrosis transmembrane conductance regulator",
      "page": "Cystic_fibrosis_transmembrane_conductance_regulator"
    },
    {
      "text": "gene",
      "page": "Gene"
    },
    {
      "text": "CRISPR",
      "page": "CRISPR"
    },
    {
      "text": "half-life",
      "page": "Half-life"
    },
    {
      "text": "mRNA",
      "page": "Messenger_RNA"
    },
    {
      "text": "1960s",
      "page": "1960s"
    },
    {
      "text": "Ebola vaccine",
      "page": "Ebola_vaccine"
    },
    {
      "text": "malaria",
      "page": "Malaria"
    },
    {
      "text": "Adjuvant",
      "page": "Adjuvant"
    },
    {
      "text": "antigenic shift",
      "page": "Antigenic_shift"
    },
    {
      "text": "Northern Hemisphere",
      "page": "Northern_Hemisphere"
    },
    {
      "text": "Victoria",
      "page": "Victoria"
    },
    {
      "text": "Streptococcus pneumoniae",
      "page": "Streptococcus_pneumoniae"
    },
    {
      "text": "antimicrobial resistance",
      "page": "Antimicrobial_resistance"
    },
    {
      "text": "AMR",
      "page": "AMR"
    },
    {
      "text": "antibiotics",
      "page": "Antibiotic"
    },
    {
      "text": "Salmonella",
      "page": "Salmonella"
    },
    {
      "text": "employment",
      "page": "Employment"
    },
    {
      "text": "travel",
      "page": "Travel"
    },
    {
      "text": "polarization",
      "page": "Polarization"
    },
    {
      "text": "distrust",
      "page": "Distrust"
    },
    {
      "text": "health",
      "page": "Health"
    },
    {
      "text": "California",
      "page": "California"
    },
    {
      "text": "misinformation",
      "page": "Misinformation"
    },
    {
      "text": "skepticism",
      "page": "Skepticism"
    }
  ],
  "fetched_at": "2025-12-07T07:23:26.867043",
  "elapsed_ms": 559805
}